{"text": "Intelligence professionals from D Company, 326th Brigade Engineer Battalion, 1st Brigade Combat Team, 101st Airborne Division (Air Assault), began conducting 24-hour operations for military intelligence training strategy, or MITS, April 12 at Johnson Field.\n\nSoldiers from across the spectrum of intelligence specialties train in a tactical operations center environment and within training areas to hone their analytical skills in preparation for future operations.\n\nThe Stalkers have been in the field for nearly two weeks perfecting their systems, reports, intelligence equipment and even briefing skills at the junior level to provide the best analysis on the operational environment as possible ensuring the brigades success during tactical operations.\n\nFirst Lieutenant Austin Koontz, intelligence collection platoon leader assigned to D. Co., 326th BEB, has been preparing the site and training with all 38 of his analysts during the exercise that ended April 22.\n\nWere mainly here to validate individual cells between collection and other intelligence specialties, Koontz said. We are validating our MOS [military occupational specialties] across the board and training to achieve a COP [common operating picture] for the commander.\n\nTo validate their specific specialties, junior Soldiers are required to brief their supervisors and the commander on their analysis. It is common for the subject matter expert to be a junior Soldier within the intelligence warfighting function. The analysts take pride in explaining the so what to the commander and their respective units with clarity and shared understanding.\n\nTheyre performing really well, Koontz said. Im most proud of their briefing capability. These junior Soldiers have done a lot of briefs on the spot and are really briefing at a senior level which is very important in our field.\n\nThe same progress was happening within the tactical sensitive compartmented information facility, or TSCIF, as Soldiers from the signal intelligence MOS are tracking operations within the TSCIF and the field. The signals intelligence, or SIGINT, operators were at Johnson Field and conducting mounted and dismounted operations in the greater training areas at Fort Campbell.\n\nWarrant Officer 1 Jason Thompson, SIGINT technician, D. Co., 326th BEB, had five Soldiers in the TSCIF as part of the cryptological support team. He monitored and trained them, as well as the teams out in the field. His team has the unique ability to find enemy equipment, positions and potentially their next move through communication equipment.\n\nWe augment in the BISE [brigade intelligence support element] through enemy emissions, Thompson said. We use those emissions to find where enemy weapons are, their radars and through voice transmissions to find out what they are talking about  thats the whole goal. We have a dismounted team that can assist maneuver elements and a mounted element utilizing the Prophet platform. Theyre all definitely performing in the upper range and doing quite well.\n\nWith the training exercise coming to a close the objectives for the military intelligence company to master the fundamentals meets the new commanders intent.\n\nCaptain Azura Lewis, commander, D. Co., 326th BEB, not only wanted to master the fundamentals the company already set, but she wanted to find ways to make their concepts better.\n\nFor us being the only military intelligence company in the brigade, it puts the onus on us to be proficient at all tasks associated with the support we give, Lewis said. MITS is the verification that we meet the high standard we put our name behind. What I want most out of this exercise is that we continue to build on previous success with the MCAS [mission capability assessment system] concept and make it better. We want to be able to provide the best and most accurate intelligence to the brigade, and this training helps us get there.\n\n"}