{"text": "MIHAIL KOGALNICEANU, Romania  U.S. Army Soldiers assigned to Alpha Company, 526th Brigade Support Battalion, 2nd Brigade Combat Team, 101st Airborne Division (Air Assault), conducted a Forward Arming Refueling Point, or FARP, operation with American and Romanian aviation assets to increase knowledge for future real world operations Jan. 24, 2023.\n\nAn NCO of the BSB shared the importance of this training especially for future use.\n\nA FARP is basically having four fuel line elements set up to fill up helicopters in a faster and more lethal way, said Sgt. Brendan French.\n\nConducting a FARP operation allows aviation units to refuel without the need of stopping their engines. This enables American and Romanian aviation units to quickly return to their mission.\n\nThis is more efficient than regular fueling because it is more productive and less time consuming, said French. It is very reliable when it comes to aviators filling up and taking off and returning to their mission as quickly as possible.\n\nAircraft flown in during the FARP mission to refuel included the Boeing CH47 Chinook, the Boeing AH64 Apache, the Sikorsky HH60 Pave Hawk, and the Sikorsky UH60 Black Hawk. This enabled Soldiers to train how to refuel all different types of aviation assets.\n\nThis training also helps our Army cross train other Soldiers, said French. We have a lot of different Soldiers out here. We have 89A (Ammunition Stock Control and Accounting Specialist), 89B (Army Ammunition Specialist), and 92W (Army Water Treatment Specialist). They all crossed trained as a 92F (Army Petroleum Supply Specialist) for this operation to do different tasks and maneuvers.\n\nThis FARP training enables Soldiers of different military occupations to perform the job as a 92F and increases the knowledge of fueling aviation assets for future use.\n\nThis mission is important to the Army because it helps sustain the Army in the fight, said Sgt. 1st Class Nyenwe Nmegbu, the non-commissioned officer in charge of the FARP operation. Especially when it comes to the use of aviation and aviation assets.\n\nThe 101st Airborne Division (Air Assault) currently has deployed a portion of the Division to Europe in order to support the United States unrelenting commitment to our European and NATO allies.\n\nLearn more about the 101st Airborne Division (Air Assault)\n\nFollow the 101st Airborne Division (Air Assault) on Facebook\n\n"}