{"text": "KAISERSLATURN, Germany Although the world took a pause due to COVID-19, the air defense mission in Europe never stopped. The 10th Army Air and Missile Defense Command remained ready to act at a moment notice. The leadership and soldiers had to find unique ways to stay integrated with our foreign allies and partners and maintain unit readiness, while taking appropriate measures to protect the force.\n\nBrig. Gen. Gregory Brady, 10th Army Air and Missile Commanding General, was able to remain connected with our foreign allied and partner AMD leaders throughout the continent by virtual key leader engagements. These ongoing engagements ensure we maintained and continued to develop our strong air defense alliances throughout the pandemic, demonstrating our commitment to our NATO allies and partners and the deterrence of the European theatre.\n\nThe 10th AAMDC Patriot and Short-Range Air Defense (SHORAD) battalions were able to sustain readiness by adapting to their training with by implementation of virtual measures, physical distancing, handwashing and wearing facemasks.\n\nThe level of readiness for air and missile defense proved critical; we actually had soldiers and leaders finding unique ways to mitigate risk to our formation, Brady said. Whether it was 5th Battalion, 7th Air Defense Artillery Regiment executing their Patriot combined arms training strategy or 5th Battalion, 4th Air Defense Artillery Regiment, the Armys newest short-range air defense battalion, executing a level of gunnery physical and digital to sustain their most critical air and missile defense roles.\n\nCapt. Michael Morgan, battery commander, assigned to Alpha Battery, 5-7 ADA explains that sustaining readiness while training up new soldiers is difficult enough without COVID-19 restrictions.\n\nWe have to be more deliberate and calculated when it comes to training and planning, Morgan said. We are learning how to lead at the battery level without always being physically present or hands on. Its a challenge, but our leaders and soldiers are adapting and finding ways to succeed.\n\nIt wasnt just the air defenders training on their Patriot and SHORAD weapons systems; the maintainers also had their own set of distinctive challenges they overcame.\n\nDuring COVID-19, while conducting services on equipment you have to have people pass tools without touching or getting to close and it gets really hot when you are carrying heavy parts while wearing all your PPE, said Pvt. Nicholas Pruitt, a mechanic assigned to Delta Company, 5-4 ADA. Also, with less people available at all times to help with services so it takes longer, but we have kept up.\n\nOnce travel restrictions were loosened, Brady seized the opportunity to conduct leadership engagements in Baumholder, Germany, with the 5-7 ADA, and in Ansbach, Germany with 5-4 ADA.\n\nKey Leader Engagements are important because they allow key leaders to get direct feedback from their formations and emphasize their priorities, said Capt. Andrew Defabio, Charlie Battery Commander, 5-7 ADA. KLEs offer junior leaders and soldiers opportunities to brief senior leaders and gain perspective from an operational or strategic level.\n\nDuring the leadership engagement to Ansbach, 5-4 ADA its ability to conduct a drive thru COVID-19 testing of all soldiers that departed to Latvia for the joint short-range air defense live fire exercise  Tobruq Arrows.\n\nIt was a privilege to be able to showcase 5-4s readiness capabilities with the COVID Surveillance testing for BG Brady, said Sgt. Benjamin Kroeger, HHB, 5-4 ADA. We have been working hard to adapt and overcome the constant changes during this pandemic. I am proud to be a part of one of the only units in USAREUR continuing to actively train with the upcoming Tobruq Arrows.\n\nIt was our Soldiers and our junior leaders that proved critical in getting us through this, Brady said. We are also going to take it to the next level as we move to the summer months as we go back to executing our most critical joint and combined air and missile defense exercises in support of US Army Europe, European Command and NATO.\n\nThe 10th AAMDC will be ramping up operations to prepare for and execute several joint and combined air and missile defense missions in the coming months including; Tobruq Arrows, Tobruq Legacy and Astral Knight."}