{"text": "PORT OF SHUAIBA, Kuwait  The Aberdeen Proving Ground, Maryland, based 1100th Theater Aviation Sustainment Maintenance Group oversaw the preparations for the retrograde of more than 30 aircraft here, Nov. 7-12, 2021.\n\nThe AH-64E Apache, UH-60M Black Hawk, and CH-47F Chinook helicopters are assigned to the Fort Bragg, North Carolina, based 82nd Combat Aviation Brigade, 82nd Airborne Division. The Soldiers were deployed to Afghanistan to support base closures and the U.S. militarys exit from the Hamid Karzai International Airport in Kabul.\n\nSgt. Maj. Ray J. Arpin, operations sergeant major for the 1100th TASMG, said preparing the aircraft for shipment by vessel back to the United States is a detailed process that starts with completing engine rinses and washes to remove saltwater or other potential corrosives and ends with folding the rotor blades.\n\nIts a slightly different procedure for the three air framesthe Chinooks, the Black Hawks, and the Apachesbut depending on the preparation levelwhich the 82nd came highly prepared, theyre very efficientit should take about two hours [per helicopter], he said.\n\nThe 1100th TASMG is responsible for providing logistical support to aviation units and managing the civilian contractor maintenance workforce throughout the U.S. Central Command area of responsibility. The unit helped provide and stage theater equipment needed for preparing the aircraft for vessel movement, such as cranes, work stands and other aviation ground support equipment.\n\nThese are the airframes and the personnel that were serving in Afghanistan during that event, Arpin said. To see them get back and get the airframes ready to go, its exciting.\n\nSpc. Nicholas J. Chavez, an attack helicopter repairer assigned to the 82nd CAB, helped prepare the helicopters for shipment. The Albuquerque, New Mexico, native worked on the tail end of an AH-64E Apache helicopter near braces that secured the rotor blades once they were folded toward the rear of the helicopter.\n\nMy time here in Kuwait and Afghanistan has been for the most part worthwhile, Chavez said. I learned a lot of stuff, more than I would have learned back in garrison.\n\nIm ready to go homeIm ready to see my mother, my dad, my brother, my family, he concluded.\n\n"}