{"text": "Soldiers from the West Virginia National Guards 115th Engineer Company, 1092nd Engineer Battalion, recently arrived in Flores, Guatemala to provide support to Operation Resolute Sentinel 22.\n\nOperation Resolute Sentinel is a multi-national training opportunity that offers real-world benefits to the United States and partner nations, to include Guatemala, by promoting well-being and readiness in addition to long-term partnerships. Resolute Sentinel is a 12th Air Force (U.S. Air Force Southern) led Southern Command exercise that has evolved over the past four decades, dating back to the 1980s when it began as New Horizons.\n\nHaving the opportunity to deploy to Guatemala and provide support to Operation Resolute Sentinel is a great chance for our Soldiers to utilize their job skills and complete real-world construction project, said Capt. Paul Cooley, commander of the 115th. These Soldiers have worked hard for over a year preparing for this mission so I think we are all excited to be here and get to work.\n\nWhile deployed to Guatemala, the 115th is tasked with continuing the construction of a grade school that will be used by Guatemalan students as early as this fall.\n\nThe 115th will continue the work on this project until they rotate out of country in two weeks and another engineer company rotates in.\n\nThe engineers in the company that worked on this project before us did a great job getting the construction started, said 1st Sgt. Jennifer Roderick, the first sergeant of the 115th. We hope to continue the progress they made and set the next group of engineers up for success as they come in to replace us in a few weeks.\n\nThe climate in Guatemala is quite different from West Virginia, and that presents an opportunity to operate in a unique work environment for the unit. Day one and two of work for the 115th brought scattered thunderstorms and temperatures in the high 80s with a heat index of over 100 degrees. Roderick says that although the weather will create challenges for the engineers, she is confident in their ability to overcome the obstacles and complete the mission.\n\nOur Soldiers have worked and trained in different climates and weather situations around the globe and have always exceeded expectations, said Roderick. From flood duty to blizzard responses to overseas mission in the desert, our Soldiers have done it all. The weather we are facing here will be just another environment for them to work and succeed in.\n\nThe 115th Engineer Company values the strong relationships forged between our countries as a part of Resolute Sentinel and are excited to continue to work with the partner nations of the United States in order to make an impact around the world.\n\n"}