{"text": "COLORADO SPRINGS, Colo.  Effective Oct. 1, two of the more unique Army National Guard units aligned, as the 100th Missile Defense Brigade was assigned administrative and operational command and control of the 117th Space Battalion from the 89th Troop Command within the framework of a larger Colorado Army National Guard structure shift.\n\nThis change is part of Colorado Army National Guard commanding general Brig. Gen. Doug Pauls One Command headquarters operational philosophy intended to better align Colorado Army Guard units with resources and establish new major subordinate commands.\n\nWhen I looked at the Colorado Army National Force structure, I asked why we arent utilizing our brigades to house some of our other units to make better use of a parent unit for command and control, said Paul. When we brought it up, I sensed an appetite for it. The 100th Missile Defense Brigade staff clearly has the capacity to add another area to focus on because there is so much bandwidth and talent there.\n\nPaul said that moving the battalion to the 100th Missile Defense Brigade is a logical fit because both units are already operational elements of the U.S. Army Space and Missile Defense Command.\n\nWhile they are not immediately linked at the hip as far as missions, they do fall under the greater umbrella of USASMDC, which I believe will make this transition advantageous to all parties, Paul said.\n\nWhile the 100th Missile Defense Brigade will have administrative and operational control of the 117th Space Battalions day-to-day activities, USASMDCs 1st Space Brigade fulfills this function for the battalions mobilized Army Space Support Teams, a relationship that will not change.\n\nThe 117th Space Battalion provides space support to the warfighter through space planning expertise, capabilities, products, and space domain awareness through units such as the ARSSTs, and they also provide capabilities useful in domestic operations, such as wildfire and flooding response. Its Soldiers will be assigned to the Colorado National Guards Joint Task Force Centennial during state active-duty operations.\n\nThe 100th Missile Defense Brigade commander, Col. Mike Hatfield, said the 117th Space Battalion will integrate well into the organizational structure of the 100th Brigade.\n\nThere are similarities in our training and our Soldiers share similar skill sets, said Hatfield. We will leverage our staff to provide the critical care and support to the 117th Space Battalion.\n\nThe 100th Missile Defense Brigade, which operates the Ground-based Midcourse Defense System to defend the U.S. and designated areas from intercontinental ballistic missile attack, also manages the 49th Missile Defense Battalion at Fort Greely, Alaska; Detachment 1 at Vandenberg Air Force Base, California; and the Fort Drum, New York, Security Detachment. Hatfield said the brigade is well-positioned to support the 117th Space Battalion due to its close geographic proximity and full-time staff.\n\nAs a multicomponent unit strictly comprising full-time, active-duty Army and Active Guard Reserve Army National Guard Soldiers, we have significantly more full-time personnel than other Colorado Guard units, said Hatfield. Also, because both the brigade are battalion are headquartered in Colorado Springs, we have more capacity to support their needs. We will work closely with the Colorado Guard to tailor our support to optimize their mission.\n\nHatfield believes the Soldiers will be the main benefactors of this command relationship change.\n\nThis will be valuable in shaping the future leaders of the 100th Missile Defense Brigade, 117th Space Battalion and the Colorado Army National Guard, said Hatfield. This gives us at the brigade a direct interface into traditional National Guard operations that includes training, planning, and resourcing for a unit that mobilizes in support of the war fight.\n\nPaul acknowledged that there may be challenges at first, but he believes this realignment will pay dividends for not only the 100th Missile Defense Brigade and 117th Space Battalion, but for Colorado.\n\nIt will better align two of our unique units and I dont think we fully know the goodness that will come out of it right yet, Paul said.\n\n"}