{"text": "It was just over one year ago that leaders of PEO EISs General Fund Enterprise Business System (GFEBS) program finalized an accelerated deployment schedule for migrating the Armys enterprise financial system to the cloud.\n\nUnder the accelerated plan  designed to ensure that the Armys fiscal year-end transactions could take place in the cloud instead of on premise at Redstone Arsenal  the GFEBS migration team agreed to target go-live of the cloud-based production environment in early July 2020 instead of the originally planned mid-February 2021. Despite the compressed migration timeline, the team performed sufficient testing to minimize risk and successfully transitioned GFEBS to the cloud in five months  a full seven months ahead of schedule.\n\nToday, the cloud-based GFEBS system has 35,000 users across 71 countries, processes one million real-time transactions per day and $164 billion in transactions per year. Among the improvements noted by users are a better cybersecurity posture and better system performance, including faster end-user response times.\n\nAt a recent organizational Cloud Summit held by PEO EIS, representatives from GFEBS and EISs Army Enterprise Systems Integration Program (AESIP) Hub program  whose business intelligence component went live in the cloud in January  discussed some lessons learned about cloud migrations with other EIS team members and Army officials.\n\nFollowing are a dozen lessons learned from GFEBS and AESIP Hub:\n\n1.Documenting existing systems, environments, integrations and processes enables quicker mapping to cloud environments.\n\n2.Cybersecurity requirements should continually be revisited throughout the project. GFEBS team members recommend clarifying the cybersecurity approach early on in the project and using existing authority to operate until after go-live.\n\n3.When partnering with a cloud services provider, its important to define roles and responsibilities in advance, and have dedicated engineering support on the migration team.\n\n4.Integrating with cArmy  the Armys authorized and accredited general purpose cloud environment  and third parties like interface and technical partners is critical to success. This includes negotiating intellectual property agreements, terms and conditions, as well as service level agreements.\n\n5.Smoothly transitioning cloud services to sustainment is an important aspect of the Army mission. New processes and procedures are needed for operations to transition smoothly.\n\n6.During sustainment, its helpful to have a consolidated ticketing system rather than multiple ticketing systems with varying numbers.\n\n7.Load-related testing is critical. Take time to test, because at the end of the day, that will best manage risk and identify what needs to be adjusted before go-live, said a member of the GFEBS cloud migration team.\n\n8.Systems wont have the same performance on cloud infrastructure as they do on premise. Some modifications are needed to fine-tune performance on cloud infrastructure, and tuning is a continuous improvement activity.\n\n9.Cutover timelines are dependent on tools used and network available. Virtual collaboration platforms (e.g., Microsoft Teams) can be particularly helpful during the cutover process. PEO EISs collaboration tool was an enabler that made a tremendous difference, said an AESIP Hub cloud migration team member.\n\n10.It isnt possible to collaborate or communicate too much during the migration process. AESIP Hub recommends over-communicating and involving senior leadership in migration and cutover decisions.\n\n11.Incentivizing teammate training is important when moving to newer cloud technologies. AESIP Hub proposes developing a cloud center of excellence and encouraging staff to obtain cloud practitioner certifications.\n\n12.Continually engaging key stakeholders across all teams helps promote a healthy culture, minimize turnover and maximize collaboration, ensuring project success. AESIP Hub officials cited the data centers security team and the systems administration network for helping meet deliverables through occasional network-related challenges.\n\nPEO EIS is working to migrate its remainingenterprise resource planningsystems to the cloud bythe end of fiscal year 2021.\n\n"}