{"text": "VAZIANI TRAINING AREA, Georgia  Jumping into action, U.S. paratroopers, assigned to the 173rd Airborne Brigade, successfully completed their airborne assault at the Vaziani Drop Zone during the Noble Partner 20 exercise in Vaziani Training Area, Georgia, Sept. 1, 2020.\n\nExercise Noble Partner is designed to enhance regional partnerships and increase U.S. force readiness and interoperability in a realistic, multinational training environment. The exercise allows participants to conduct situational training exercises, live-fire exercises and combined mechanized maneuvers.\n\nU.S. Army Capt. David Linder, infantry officer with the unit, described the feeling of opening Noble Partner 20 with an airborne operation.\n\nIts a great feeling to watch parachutes come out over the sky, jumping out of C-130s [four-engine turboprop military transport aircraft], said Linder. Thinking about how we were in Germany 48 hours ago, we had 200 paratroopers hit the ground ready to execute. It just lets you know we can get anywhere in the world very quickly.\n\nChief Warrant Officer 2 Michael Sumner, the mission drop zone safety officer, detailed how the unit prepares for an airborne operation.\n\nWe go through multiple rehearsals; we do pre-jump training, said Sumner. We practice parachute landing falls prior to the execution.\n\nLinder, who also serves as the unit operations officer, provided further details on this preparation, describing how the paratroopers participated in both Saber Junction 20 and Noble Partner 20.\n\nA lot of the guys as soon as we were done with Saber Junction 20 this year, they then shifted their focus to making sure they identified any deficiencies in their airborne equipment [and] made sure they had everything, said Linder.\n\nWe executed a basic airborne refresher, and then when it came to 24 hours out, everyone executed the standard airborne training to rehearse jumping out of the aircraft.\n\nLinder added that the paratroopers success stems from the additional capabilities with the units medical providers and the Georgian medical professionals, highlighting the ongoing partnership and interoperability.\n\nWe wouldnt have been able to execute without Georgian support, specifically their medical coverage, said Linder who also noted how this support ensured they had the air space, diplomatic clearance and other necessities to execute the drop safely and efficiently. Without them, yesterday wouldnt have been able to happen.\n\nRehearsals with 101st Combat Aviation Brigade in Germany and North Macedonia also contributed to a successful airborne operation.\n\nThe jumpers go through the initial manifest, said Linder. They line up, they identify where they are going to be on the bird, they do their final manifest call, [and] they execute their standard airborne training.\n\nSumner, who also serves as the units field artillery technician and battalion targeting officer, led a communication exercise, identifying correct positions for each paratrooper and ensuring communication was operational.\n\nSumner described why an airborne assault is used in combat.\n\nAn airborne assault realistically provides a geographic combatant commander the capability to conduct joint forceful entry into an adversarys access area of denial bubble, said Sumner.\n\nCOVID-19 added a unique challenge to the operation with leaderships continued efforts in using mitigation measures to include face masks, hand washing stations and social distancing.\n\nWeve continued to practice over the last six to nine months of COVID proper social distancing in the formations, even when were going over our airborne timeline, said Sumner. We keep the Soldiers as separated as possible up until they get the 20-minute warning inside of the aircraft.\n\nWith the 4th Squadron, 2d Cavalry Regiment leading the exercise, Linder expressed thanks to the participating units.\n\nThe last thing Id like to say is thank you to 2CR for supporting once we got on the ground [and] 101 CAB for getting on the ground in less than 48 hours, said Linder.\n\n"}