{"text": "WASHINGTON  It happens to many people around the world: that moment when theyre going out on their own to pursue their own path in life. That choice is sometimes a difficult one to make. The first years of life are, in many ways, predestined for many people. Waking up, going to school, doing homework and playing are the routine for children until encroaching upon adulthood.\n\nFor some people, that choice is difficult. For Lt. Gen. Telita Crosland, that choice was clear. She wanted to become a doctor.\n\nI always wanted to be a physician, since I was five, Crosland said, who recently became the director of the Defense Health Agency in Virginia. I was very much about becoming a doctor.\n\nI am thrilled to be where I&#39;m at, she said. I&#39;ve gotten way more [from the Army] than I&#39;ve given. The scales are way tilted in my favor.\n\nGrowing up, Crosland was what she called a blessed kid.\n\nMy parents, they had, I called it a secret ingredient, she said. My parents gave unconditional love. I didnt understand what I had until I got older, like most of us. Unconditional love, that gives you all kinds of security to want to be a doctor.\n\nNo upbringing is without its lessons, and for Crosland and her siblings, there was an expectation to contribute to life and the family, she said. They were raised to give back, to contribute and bring value to whatever it was they were doing in life, but her and her siblings got to choose how they did that.\n\nEach of Croslands siblings went on to serve in their own way. Her two brothers went on to be police officers and her sister pursued a career in education. Crosland was focused on medicine.\n\nI was fortunate; [my parents] supported me through my dreams in high school.\n\nCroslands parents supported her passion for medicine when she was growing up and allowed her to attend a high school that was focused on pre-med. As she approached her graduation date, she knew what she wanted. She didnt have a plan yet, but knew she needed one to become a doctor.\n\nI took my preliminary SATs in high school. she said. I was looking at pre-med programs within colleges. My scores were released, and then the postcards came.\n\nCrosland said she knew there would be many college information packets, and the one from West Point was of the first one she received.\n\nI didn&#39;t even know what [West Point] was, she said. I was replying to everybody initially because I didn&#39;t have a strategy. And West Point reached out and said, Hey, we think you&#39;d be a good fit. Are you interested? And at that point, I started to develop a strategy.\n\nThe message from West Point was clear, she could be trained as a leader and become a doctor, to bring those two professions together. But this was new territory for her.\n\nNo one in Croslands immediate family was in the military. When she decided to go to West Point, the recruiter took the time to talk to her parents.\n\nMy interview was in my living room with my mom, my dad and my siblings, she said. Looking back, the recruiter did a good job. And when he left, they were like, youre going! There are a lot of good decisions you make in life and at 17, my parents had to sign for me to join the Army. Yeah, it was a good decision.\n\nCrosland graduated from West Point in 1989 and then entered as an Army Medical Corps officer in 1993.\n\nOpportunities come; different doors open up. And I could not pretend I [saw] a pathway to being in the Army had I not gone to West Point, she said. It was not on my radar. It really, really was not. If I had not gone to West Point, I would have had a different life.\n\nBefore and after West Point, Crosland said she had many opportunities to choose a different path, but is grateful she stuck to the path she chose.\n\nShe contemplated getting out when she got married at near 19 years in the Army. Her husband had no experience with the military and didnt know if hed like it. But, fortunately, she said, he did like it.\n\nI dont believe the military makes you sacrifice your family to serve, she said. I think that its a challenging lifestyle. Its a unique lifestyle, with multiple moves and starting over, like all things in life, there are ups and downs. But its a good life. Its a life of purpose, with teammates, with experiences.\n\nOne of her major experiences with the Army has been the ability to seize opportunities to continue her education. She has earned a Master of Public Health and a Master of Science.\n\nI love education, and thats the nice thing about medicine, because it changes, she said. When I learned biology, we didn&#39;t have the human genome, meaning we didn&#39;t have the complete sequences for humans. So, learning biology now means getting down to molecular level, change is constant in medicine. And its one of the things that I absolutely loved about the Army  we are always evolving.\n\nThroughout her career, Crosland has sought new possibilities to progress, shared her passion for medicine and found new ways to give back. Her new position as Director of the Defense Health Agency is one more new peak she reached.\n\nIm extremely excited, joining a team that is committed, that is passionate and has an incredible mission, she said. I get to continue to serve within the Department of Defense, and Im grateful for this opportunity to continue to serve.\n\nAs the director of DHA, she leads a joint, integrated medical system of more than 700 hospitals and clinics and a combined workforce of over 145,000 joint force and civilians.\n\nThe DHA supports the military departments and the combatant commands by leading within the Military Health System enterprise support activities to provide medical capabilities across the entirety of the U.S. military.\n\nOne of the things I absolutely love about the Army, it&#39;s all the opportunities to grow and learn and continue to grow and learn, and to find new passions that you didnt even know you had like running health care systems, she said. It&#39;s not happenstance that we are who we are as an Army. [The] Armys success is largely due to its investment in people.\n\nFor Crosland, joining the Army as a career path wasnt at the forefront of her mind after high school, but it was the path she chose and continues to choose today.\n\nI chose to contribute to the military, and getting that experience, having that opportunity, no one can take that away from you, she said. So, if youre unsure, be unsure with us for three or four years. You will have purpose. You will learn. You will grow. And if at the end of those four years, you&#39;re ready to do something different, you have served. You have brought value, and you will get more than you give, hands down every time.\n\n"}