{"text": "FORT BRAGG, N.C.  Residents near Fayetteville, North Carolina may have woken to additional sounds of rapid-fire June 8-15, 2021 as crews from the 1-130th Attack Battalion (1-130th AB), North Carolina Army National Guard, conducted live-fire aerial gunnery qualifications with their AH-64D Longbow Apache helicopters.\n\nTheres no denying the lethality of the AH-64D Longbow Apache. Armed with three weapons systems: Air Ground Missile (AGM) 114 Hellfire Missiles, 2.75-inch rockets and a 30 mm Area Weapons System, the Apache provides security to ground forces, aerial escorts and armed reconnaissance, with deep precision strikes in adverse weather and battlefield conditions.\n\nAccording to Charlie Company pilot, Chief Warrant Officer Two, Tom Koestering, aerial gunnery is the most complex training event each year and provides M-Day Soldiers the opportunity to strengthen their skillsets.\n\nAircraft operations in training mode are different than operations using live ammunition, Koestering said. Its important our fuelers, maintainers and pilots re-familiarize themselves with the risks involved  risks you dont encounter with training missiles and inert ammunition.\n\nTwenty-two crews were validated on day gunnery tables to show their level of proficiency, before qualifying on the more difficult night gunnery tables. There are many safety precautions aviators must think about when piloting at night, such as target fixation.\n\nWhen you have effects on a target, aviators may want to focus on the objective to ensure the rounds are engaging appropriately, but its one of our biggest risks as pilots, Koestering said. Apache crews must divide the duties so one is focused on flying while the other is focused on weapons engagement. Acknowledging the risks involved in flight operations helps us mitigate them.\n\nBefore each validation and qualification flight, aviators conducted risk assessments, coordinated with range control to deconflict airspace and were provided detailed weather reports from the Air Force Staff Weather Officer on duty. The elongated process expressed that safety remained their biggest priority.\n\nThis years aerial gunnery comes approximately six years after the Aviation Restructuring Initiative proposed all eight Army National Guard Apache helicopter battalions move to the active Army force. However, in January 2018, the U.S. Army and National Guard Bureau announced that 1-130th AB would be 1 of 4 Apache helicopter battalions that would remain in the Army National Guard.\n\nThe 1-130th AB is located in Morrisville, North Carolina and a part of the 449th Combat Aviation Brigade, North Carolina Army National Guard. The attack battalion returned from Afghanistan in support of Operation Freedoms Sentinel in May 2019.\n\nThe units expected field date for the AH-64E Apache model is expected in 2023.\n\nFor more National Guard news\n\nNational Guard Facebook\n\nNational Guard Twitter\n\n"}