{"text": "After weeks of comprehensive gunnery training on the wide expanses of the Fort Bliss Training Complex, Bandit Soldiers from 1st Battalion, 37th Armor Regiment, 2nd Armored Brigade Combat Team, 1st Armored Division were ready for guests on ranges near Alamogordo, N.M., March 18, 2023.\n\nIn the gritty March cold, they didnt get a chance to go home, but home got a chance to come to them when friends and family of the Bandit Battalion joined their Soldiers for 1-37 AR Family Day on their ranges, which included a live-fire demonstration of all the weapons systems on the Abrams Main Battle Tank and a cookout.\n\nSgt. 1st Class William Vernon, a 1-37 AR master gunner, helped organize fires from the tower, March 18, and said family day is about more than just about good barbecue.\n\nWe want to show them how their Soldiers train and the environment we train in, said Vernon. It helps them understand that when their Soldiers go to the field, theyre not just going out and sitting in the desert. Theyre going out and training in realistic combat conditions  high winds and weather  we learn how to fight through it. We use those experiences to bring the crews together during regular training, and on a day like today were bringing the families out so that we can all be together.\n\nArmy Master Gunners like Vernon are certified on advanced universal gunnery methodologies, gunnery training with a focus on vehicle mounted machine gun weapons systems, and the planning and implementation of gunnery training programs.\n\nThe Bandits fired the Abrams MBTs M240 coaxial machine gun, which fires approximately 14 per second, as well as two types of ammunition from the main gun.\n\nDuring their extended time on the training complex in March, with coordination from staff from the Bataan Battalion at New Mexico State University, in nearby Las Cruces, N.M., and local recruiting battalion help, 1-37 AR has also found time to invite regional Reserve Officer Training Corps cadets and Army enlistees for immersion days in the field to share their Army mission with tomorrows Soldiers.\n\nAs the last buses departed the range March 18, the grills were put away for another time, and before the business of qualifying Bradley and Abrams tank teams resumed, Lt. Col. Dick Mendenhall, the 1-37 AR battalion commander, spoke about the battalions culture that considers families and supporters to be valued teammates with the Soldiers and staff.\n\nAs the responsibilities for the Bandit Battalion mount in 2023, more, not less will be asked of the Soldiers and their families in the months ahead.\n\nI was glad they got a chance to see gunnery and learn about why its important, said Mendenhall. We cant be successful without the support of our loved ones  service extends to them. They  make sacrifices and we can&#39;t be successful without them.\n\n"}