{"text": "FORT KNOX, Ky.  The 1st Theater Sustainment Commands Sexual Harassment/Assault Response and Prevention Program kicked off a month-long awareness campaign with a Dedicate Your Run/Walk event here Sept. 10.\n\nThe event is part of a series of events the 1st TSC program coordinators developed as way to raise awareness for and show support to sexual assault survivors in addition to the Fort Knox Virtual SHARP Walk/Run taking place this month.\n\nThese events are so important because they bring awareness to people who have survived sexual assault, said Capt. Nicole McCoy, SHARP program manager, 1st TSC. All of the events were created to dedicate in some way to those survivors.  It is important that we show everyone support, so they know we are here for them, we see them, and we want to help prevent [sexual assault] in every way we can.\n\nIn fiscal year 2019, approximately 7,825 survivors from across the Department of Defense reported a sexual assault. Acknowledging these individuals and raising awareness of the issue is important for preventing sexual harassment and assault.\n\nDuring the Dedicate Your Run/Walk event, Sgt. 1st Class Warren Beasley, victim advocate, 1st TSC, walked to remember a survivor that touched his life.\n\nWe do this as a way to say we are here to support you. There is no place for sexual assault in the Army, Beasley said. As a victim advocate, I reach out to those that need help and ensure they have the resources and information they need to file a report.\n\nEvery mile tread during these events represents a survivor of sexual assault.\n\nIt gives a purpose to why you are running or walking. It was a perfect way to run/walk for someone that has personally survived sexual assault and made an impact on your life and show an individual or unit support and let them know they are a strong survivor, McCoy said.\n\nThree more events are scheduled to take place this month and include a 1st TSC Section Workout of the Day event, which will take place Sept. 14-18; a Perimeter Walk Sept. 22; and a ruck march Sept. 29.\n\nThe Workout of the Day is a way to bring sections together in the unit to complete a workout with a total of 7,825 reps, seconds, and steps, McCoy said. It shows that we always need to work together, look out for each other and help each other out.\n\n1st TSC civilians and family members are encouraged to participate, but must read, understand and sign a registration form that includes a liability release prior to the events.\n\nIn addition to the events, miles can be completed wherever and as often as each individual would like on their own during the month of September.\n\nThe general public may participate in the Fort Knox Virtual SHARP Walk/Run, but all participants must register and log miles at https://www.eventbrite.com/e/virtual-walking-for-7825-tickets-111338131348.\n\nWalkers and runners are encouraged to post a proof-of-mileage picture, such as on a treadmill screen, bike screen, fitness tracker watch or phone app, to the SHARP Walk Facebook page.\n\nThese events show that someone is there to help, that you can survive, and you have support, McCoy said.\n\n"}