{"text": "FORT KNOX, Ky.  Soldiers and Department of the Army Civilians from the 1st Theater Sustainment Command completed the Joint Logistics Over-the-Shore Planners Course here, April 18  20, 2023.\n\nThey received classroom instruction in the planning and execution of JLOTS operations. There were instructor-led discussions on theory; task organization; prepositioning; anchorage and discharge; lighterage operations; beach and port operations; transportation, marshalling and distribution; the offshore petroleum discharge system; communications; and force protection.\n\nEach day of instruction culminated with a practical exercise where students demonstrated their knowledge and ability to develop task organization for theater opening/port opening and the concept of the operation for JLOTS.\n\nThe course concluded with a final exam and a closing group exercise which included all trained concepts in accordance with JLOTS doctrine.\n\nChief Warrant Officer 2 Kelly Bresley, marine deck technician, 1st TSC, completed the course, and shared her technical expertise throughout the training.\n\nThis course teaches Army personnel what it takes to utilize our surface movement or our big ship movements to bring combat power to any location and that we dont always have to have a fixed pier, she explained. We can bring it in anywhere and use that equipment where it needs to be used the most to ensure that we remain a lethal fighting force.\n\nParticipants also received a certificate of completion which goes into their military education records in their permanent file.\n\nBresley added, For our movement control Soldiers in the 88 series Military Occupational Series, it allows them to be on the planning side of things, and it also helps them to understand and plan how theyre going to move equipment based on the exercise or the mission at hand.\n\nCompleting this course also helps our fueling operations Soldiers understand how that fueling operation is happening in conjunction with the rest of the mission bringing items ashore, moving equipment around, and how we work that jointly with other services.\n\nSeveral Army Reserve Soldiers also attended the course. Bresley described how they play an enormous role in our JLOTS operations.\n\nMany of our harbor master units are moving into the Army Reserve or into a combined watercraft company, she said. Having the Reserve Soldiers understand how that process works, and how we use those units in the JLOTS process helps ensure their troops are trained and ready.\n\nThis course is usually open to officers and Soldiers, staff sergeant and above, but this time it was open to all ranks. Soldiers who recently completed their Advance Individual Training, brought their ideas to the discussions.\n\nSpc. Kristopher Bufkin, movement specialist, 1st TSC, completed the course. His job at 1st TSC involves container management.\n\nAnything thats not a vehicle, we put into a container, he explained. We number the containers, then we certify them to be deployable.\n\nBresley said that Bufkin added a different perspective to discussions where they were presented a lot of different information and scenarios.\n\nWe are a theater opening unit and JLOTS is directly responsible for opening, Bresley explained.\n\nJunior Soldiers who complete the course are now going to understand the greater picture, because theyre not usually given all the information.\n\nBresley hopes that Soldiers who complete the course go back to their units and share what they learned with their peers to provide a better understanding of JLOTS.\n\n"}