{"text": "Vicenza, Italy  A small team of contractors south of the Alps is providing assistance in answering U.S. Army Southern European Task Force, Africa (SETAF-AF), U.S. Army Europe and Africa, and U.S Africa Commands intelligence requirements with the power of data science. Since 2018 the Africa Data Science Center, organized under the 207th Military Intelligence Brigade-Theater, enables intelligence warfighters through innovation, collaboration and data-first thinking.\n\nTheir efforts were recently highlighted at this years Association of the United States Armys Annual Meeting and Exposition, held in Washington D.C.\n\nThe Africa Data Science Center, or the ADSC, is a U.S Army Intelligence and Security Command (INSCOM) pilot program and a part of the Armys data modernization plan. Staffed by only two data scientists, one data engineer, and an officer-in-charge (OIC), this small office makes a an outsized impact by combating information overload and bridging intelligence gaps.\n\nThe team automates and improves existing analytical and business workflows, integrating data science into the intelligence process. This automation streamlines the ability of military intelligence analysts to process and exploit more data, in turn providing decision makers with answers at a much quicker pace.\n\nMany intelligence analysts are faced with an overload of information - without the time to process it all manually. Lt. Col. Christian Gregoire, commander of the 522nd Military Intelligence Battalion, the 207th Military Intelligence Brigade-Theaters Operations Battalion, knows first hand the information overload that his analysts experience.\n\nThey receive information from a variety of different sources, as well as what is publicly available, this can be overwhelming. This is the point where the ADSC provides an advantage. The team assists the analysts by focusing them on the relevant data which will facilitate research and analysis.\n\nThese faster products are possible with the working partnership of the data scientists and the intelligence analysts. In certain situations, an analyst may have an overwhelming amount of information, which does not allow them to detect a pattern or trend, but the partnership with the data scientist alleviates that. The scientist, with the use of machine-enabled insights, is able to narrow the grid search which permits analysts to be more efficient and effective.\n\nThe committee recognizes and commends the work of the Africa Data Science Center within the U.S. Army Intelligence and Security Command&#39;s 207th Military Intelligence Brigade-Theater. With support from U.S. Army Africa [now U.S. Army Southern European Task Force, Africa (SETAF-AF)] and U.S. Africa Command (USAFRICOM), this pilot program serves as a model for the innovation needed to meet Department of Defense modernization priorities.  -House Report 117-118 - National Defense Authorization Act for FY22, 117th Cong. (2022)\n\nWarrant Officer Christopher Poles, ADSC&#39;s OIC, who manages the small team of contractors, has noted that this partnership also allows for an exchange of knowledge between the data scientist and the analysts.\n\nWith them sitting side by side you can see constant learning on both sides. As the scientist learns more of what the analyst does and vice versa, the support to help the analyst increases, to include the improvement in production and analysis, said Poles.\n\nThe scientists teach analysts the best methodologies, capabilities, and tools of data science, optimizing the intelligence process.\n\nIn the years to come, the ADSC seeks to create products and workflows that support intelligence warfighting and continue to build data science solutions to modernize the Army intelligence and security enterprise.\n\nWith a small staff and limited funds, the team has been able to leverage best practices from across the intelligence community, applying leading-edge data science tradecraft to fulfill operational intelligence requirements. Their work has been invaluable in helping USAFRICOM better understand near-peer adversary activities across Africa. The committee believes the Africa Data Science Center is an exemplar of operationalizing innovative technological solutions in an Area of Responsibility with limited resources aligned against it.  - House Report 117-118 - National Defense Authorization Act for FY22, 117th Cong. (2022)\n\nData science is the future when it comes to an additional support system not only for intelligence but for the Army as a whole. Being in the information age, data science has already made a mark in big business, and now you will begin to see it in all branches of the military. This is the answer to information overload, said Poles.\n\n"}