{"text": "ABERDEEN PROVING GROUND, Md.  The low hum buzzing quietly in the background of a conference call with a group of 20th Chemical, Biological, Radiological, Nuclear, Explosives (CBRNE) Soldiers isnt your typical household appliance, but the sound of personal protective equipment in the making, readying itself for healthcare workers and emergency responders in need.\n\nSoldiers of the 20th CBRNE Command have joined other volunteers in the Aberdeen Proving Ground, Maryland area to volunteer their free time and personal 3D printing capabilities to print and create face shields for donation to hospitals and health care workers across the Nation combating COVID-19.\n\nMajor John James Arteche, a 20th CBRNE Command operations officer, is one of 10 Soldiers from the 20th CBRNE Command along with other APG personnel, retired DoD employees and local law enforcement volunteering their free time and personal 3D printers to create this personal protective equipment for healthcare providers working the front lines of COVID-19 care.\n\nIt just seemed like such a simple piece of plastic to help protect medical personnel, said Arteche. But this simple piece of plastic can potentially save a life or mitigate risk.\n\nThe group at large came together through an Explosive Ordnance Disposal (EOD) Facebook group, where Staff Sergeant James Ahn saw a critical need and an interested and capable group of people that could help him.\n\nBecause our group is filled with first responders and people who support first responders at a national level, it was an easy transition of our current skill sets to be able to work such a strong grassroots effort, said Ahn, an Army Logistics University EOD Small Group Leader.\n\nWhile Arteche is working in a subset of this larger group with those local to the APG area, Ahn has gathered volunteers from across the country from various disciplines including military EOD, law enforcement EOD, Department of Homeland Security, and other STEM communities to work in an unofficial capacity to create this personal protective equipment.\n\nThe concept for the group is simple. 3D print a National Institute of Health (NIH) accepted design for a visor headband and punch holes onto a transparency sheet as an improvised face shield to add to the visor. Two unassuming pieces of plastic are able to create potentially life-saving personal protective equipment.\n\nOnce volunteers in the APG area have completed the face shields, which can take up to one hour to print a single visor, they take the face shield to local coordinator Gary Ledder.  Ledder, an Electronic Technician with U.S. Army Combat Capabilities Development Command (CCDC), coordinates the operational movements such as shipping, placement and other logistics.\n\nWe do this one because we can, and two because we should, said Ledder. A lot of these volunteers were trying to help and it helps a lot of people mentally to help others. This gives me a purpose right now.\n\nThe main goal of the over 50 volunteers from around the country is to provide this PPE to those who need it most at zero cost to the recipient.\n\nIn total, the volunteers expect to create over 13,500 face shields, sent to 28 states and one U.S. territory. Over 160 facilities nationwide have benefited from these volunteer efforts, including urgent care centers, hospitals, assisted living facilities, and COVID-19 screening stations.\n\nIt just feels like the right thing to do, said Arteche. I have the time and capability so why wouldnt I?\n\nThe group of volunteers will continue to send out face shields and are seeking additional centers and locations that are in need of face shields to provide to.\n\nIts just first responders helping first responders, said Ledder. Weve fought on the battle field but now our new frontlines are the medics.\n\nThose looking to participate in these efforts or are in need of face shields can visit https://www.facebook.com/donate/499173687444956/ for more information.\n\n"}