{"text": "Fort Carson, Colo.  Military commanders need reliable communication networks to operate. Soldiers of the 217th Brigade Signal Company can provide that capability anytime, anywhere.\n\nTwenty members of the company traveled to Fort Carson to participate in a Warfighter Exercise with the 204th Maneuver Enhancement Brigade, the 217ths higher headquarters.\n\nOur mission is to provide network communications and tactical radio capabilities to the brigade, said Sgt. 1St Class Steve Burt, who is the acting first sergeant of the company.\n\nThose capabilities are diverse.\n\nWe provide them all different types of communication capabilities, said Spc. Mattingly Floyd, an information technology specialist. We also can set up Wi-Fi and a local area network.\n\nSoldiers bring in a satellite truck, generators, servers, and hundreds of yards of network cable. They set up the mobile command with secret and non-secret communication networks. Then, brigade staff is able to communicate effectively with tactical units, which allows the commander to make better decisions. The capability lets the brigade, and the division, move forward on the battlefield.\n\nBurt describes his guys as total experts.\n\nWarfighter is an opportunity for Soldiers of the 217th to practice their craft out in the field, away from home station. During this exercise, the brigade staff operates in support of the 4th Infantry Division.\n\nSetting everything up in the field gives us experience, said Burt. We are prepared to set up anywhere. The only thing that gives us an issue is if any of our equipment goes down because we don&#39;t have immediate access to our stock of spare parts.\n\nThis mission will help us continue to learn to adapt to evolving situations, said Spc. Kevin Jones, a satellite operator and maintainer.\n\nThe satellite communications terminal is one of the 217ths showpieces. It is about seven feet in diameter and mounted to a heavy trailer. Jones can position it to establish a connection with one of many satellites orbiting earth. With that connection, the 217th can provide high-speed internet for the brigade.\n\nThis exercise helps the 217th be ready for just about anything.\n\nJones is mindful of a potential natural disaster in Utah, like an earthquake that might disable cell networks.\n\nWe can provide communications to first responders, or anybody who needs it, said Jones. If called on, we could help with the effort to rebuilding infrastructure that might be damaged.\n\nHe added, Its been pretty fun. We havent been able to get out of the state much lately to train, so this is a good experience.\n\n"}