{"text": "KAISERSLAUTERN  Brig. Gen. James M. Smith, commanding general, 21st Theater Sustainment Command is promoted to the rank of Major General during a ceremony held on Panzer Field on Sept. 16.\n\nSmith, a native of Hampton, Virginia and most recently serving as the 31st Chief of Transportation at the U.S. Army Transportation School, took command of the 21st TSC on June 8 and will continue to serve as the commanding general.\n\nGeneral Christopher Cavoli, commanding general, United States Army Europe and Africa, has a rich history with Smith from his tenure in Hawaii. Smith served as the commander of the 599th Transportation Brigade and played an integral role in ensuring Cavoli&#39;s troops were properly transported to training on the Big Island within Hawaii. Not only was he impressed with Smith&#39;s professionalism and logistical mastery, but the climate and atmosphere his family brought to the team.\n\nFor Cavoli, it was personally a wonderful day to be in the Army and continue his service with Smith.\n\n&#34;This is a great day because I get to continue to work with you,&#34; said Cavoli. &#34;That fills me with personal gratification, professional admiration and personal admiration that I have for you and your family.&#34;\n\nShortly after Cavoli&#39;s remarks Smith&#39;s wife and son pinned the new rank on their loved one&#39;s Army Green Service Uniform in the center of the parade field.\n\nThe newly promoted Maj. Gen. Smith took the officer&#39;s oath of office and took to the podium to give his remarks. He first thanked his Lord and Savior for allowing him to achieve the success that he claims did not belong to him, but the investment others have established within him over the years.\n\nSmith also returned the kind words and gratitude to Cavoli, as he reflected upon the magnitude of being in command of the 21st TSC.\n\n&#34;On behalf of my entire family we sincerely appreciate your trust and your confidence as we serve Team 21 and the greater part of Europe and Africa,&#34; said Smith. &#34;It&#39;s an absolute humbling experience to serve in this theater and under your command. Catrina and I are absolutely pleased to be side by side with you as we continue to learn and grow as an Army family.&#34;\n\nYet, learning and growing as an Army family comes naturally to the Smith family. The newly-promoted leader of Team 21 belongs to a rich history of military leaders stemming from his older sister, who, retired as an Army Lieutenant Colonel, to his grandfather that fought during WWII and served on the legendary Red Ball Express.\n\n&#34;The true patriarch of my family is my grandfather James E. Smith, Sr.,&#34; said Smith. &#34;Spc. Smith served in WWII 77 years ago across the English Channel in the sixth wave of Patton&#39;s 3rd Army on the actual Red Ball Express. Two generations later to serve as the TSC CG providing those same critical supplies that my grandfather did on the Red Ball Express warms my heart and humbles me as a Soldier to know that I&#39;m paying honor and homage to him and his peers back in 1944.&#34;\n\nSmith will continue to walk in his grandfather&#39;s footsteps as the 21st TSC will remain the First in Support across the European theater.\n\n"}