{"text": "KAISERSLAUTERN, Germany  Soldiers from the 21st Theater Sustainment Commands 266th Financial Management Support Center returned home Feb. 22 from a nine-month deployment to Camp Arifjan, Kuwait.\n\n&#34;The 266th FMSC mission was instrumental to the success of operations within the CENTCOM area of operations,&#34; said Lt. Col. Eugene Irby the deputy director of 266th FMSC. &#34;These soldiers conducted counter-threat finance operations, established Theater Finance policy, and even conducted negotiations with host nation banks. This was just the tip of the iceberg of what our soldiers can do, and were responsible for during this deployment. I am proud of their exemplary performance contributing to mission success.&#34;\n\n266th FMSC served as the finance and comptroller force that enabled operational forces to deny and disrupt illicit financial activity designed to negatively affect U.S. operations. They also provided direct military pay support to U.S. service members, processing over 30,000 transactions for deployed soldiers in nine separate countries.\n\n&#34;I am especially proud of this team,&#34; said Col. Douglas LeVien, the deputy commander of the 21st Theater Sustainment Command. &#34;Not only did they conduct their job with the utmost professionalism, but their dedication and exemplary performance earned them the Meritorious Unit Citation for their excellence during this rotation. This really speaks to the leadership and caliber of soldiers within the 266th FMSC.&#34;\n\nSince 9-11 the 21st TSC has deployed thousands of soldiers to the Middle East. The 266th FMSC&#39;s redeployment is significant since its likely to be the last in the foreseeable future to the U.S. Central Command area of operations as a result of the drawdowns in Afghanistan and Iraq.\n\nFor more information on the 21st Theater Sustainment Command please visit our Facebook page at https://www.facebook.com/21stTSC or our website at https://www.eur.army.mil/21TSC/.\n\nThe 21st Theater Sustainment Command executes assigned missions, plans contingency operations in the European theater; while also serving as a Joint Security Area Operations. In doing so, the 21st TSC not only ensures a theater capable of supporting routine operations, but also deterrence and contingency operations.  The 21st TSC also enables and facilitates the rapid receiving and deploying of military forces to maintain a strong Europe and execute joint security area operations.\n\n###\n\n"}