{"text": "JOINT BASE LEWIS-MCCHORD, Wash.  On Nov. 2, 2006, an American Provincial Reconstruction Team and soldiers from the Afghan National Army were traveling thirty kilometers back to their base.They were checking on construction projects when they were set upon by Taliban forces in the Mehtar Lam region.Chief Warrant Officer 2 L. Shane Brasher, now assigned to Bravo Company, 2-158 Assault Helicopter Battalion as an instructor pilot for the UH-60 Blackhawk helicopter, was present as then Private First Class Brasher, Human Intelligence Collector, 321st Military Intelligence Battalion.\n\nThe first half of my deployment I was just at Bagram as part of an intelligence team, but then I was assigned to the Air Force PRT at FOB Mehtar Lam.It was pretty calm in the area at first, our job as the intelligence asset was just to talk to the locals to help the PRT get them the things that they need.It wasnt just intelligence on the enemy, Brasher said.\n\nThe PRT was tasked with a mission to travel approximately thirty kilometers to the north to check on a construction projecta mission that had to be carried out via ground convoy over unforgiving terrain.\n\nThey had done this mission before, and warned me that we would have some pot-shots taken at us, but nothing that they were worried about.There was an imaginary line in the province that once we crossed, we would be engaged, and thats just how it was, Brasher said.\n\nThis convoy was going to be a mix of American and Afghan vehicles that numbered seventeen; Brasher would be the driver of an American HMMWV.\n\nWe had a big group, but because the terrain was so bad it took us six hours to get there.Just like they predicted, someone shot a rocket propelled grenade at us, and nobody was phased by it, Brasher said.\n\nA familiar scene to many veteran soldiers of the Afghanistan campaign then played outthe town was eerily silent and the locals were acting unusual.\n\nWe got out to talk to some of the locals, and this was the first time that they acted like they wanted nothing to do with us.They were acting scared, so the PRT checked on the projects and we started to head back, Brasher said.\n\nWhile they were checking on the projects, Taliban forces were setting an ambush on the return route, and the PRT would end up driving right into it.\n\nThey just started firing at us, RPGs and rifle fire, and at one point they split our convoy with indirect fire.We were stuck in this dry river bed that we used as a road because one of the Afghan National Army trucks became a road block.They were just driving a Hilux, which offers no protection, so they bailed for cover, Brasher said.\n\nThe convoy was blocked in and taking heavy fire, but until the Hilux was moved they couldnt go anywhere.\n\nAt that moment I just blurted out a phrase I kept hearing an NCO say over and over, hey man we need to pop smoke and get out of here and thats when it donned on me to actually use a smoke grenade so we could make a screen to move the truck.What it actually did was make the Taliban stop firing; at the time I thought they mustve thought we were trying to signal air support or something, Brasher said.\n\nThe ANA forces got back into their truck during the break in fire and the convoy was able to move again.Brashers gunner told him to pull off so they could provide suppressing fire for the unarmed vehicles in the convoy that passed by, but then the convoy was blocked again.\n\nRight as we got moving, the ANA truck in front broke down and one of the Air Force trucks that had passed us was unable to stop in time and hit an embankment that totally disabled the vehicleboth front tires flew off of it.So now we were trapped in the riverbed again, but at this point night was falling and the fire slowed to a stop, Brasher said.\n\nThe interpreters with the PRT told the convoy that the Taliban knew the dire situation, and were making a plan to move in on them.\n\nI got out and started winching one of the stuck vehicles, but once the interpreters told us that the enemy was moving in I grabbed a [squad automatic weapon] and started pulling security for a vehicle that didnt have a gunner, and told the ANA guys to spread out and start making a perimeter, Brasher said.\n\nBrasher did exactly what soldiers are told not to do at basic training; he had silhouetted himself against the truck.Three different enemy weapons fired at where he was just standing and he began returning fire.Fortunately, that was the last engagement of the evening.\n\nWe finally got a chance to winch out the vehicle, and we coiled up in an old vehicle patrol base nearby and an Apache came on station to provide air cover.He shot some rockets into the enemy mortar position, and thats when the MEDEVAC bird came in to get the wounded ANA, Brasher said.\n\nUnfortunately, by morning, the vehicle patrol base was no longer a tenable position.\n\nAbout five soldiers crammed into my vehicle and we went to go pick up an ammo resupply drop, but after we went a mortar had landed right where we were parked - a bunch of guys were wounded.We finally got some more close air and MEDEVAC support, but everyone had flat tires so we were going vehicle to vehicle trying to swap tires.We ran out of tires and had to end up dragging a truck back, fortunately by then the Apaches were able to escort us back to the camp, Brasher said.\n\nThe display of courage he saw in his fellow team members set the expectations for him. His gunner, Private First Class Hollis Darby, was directly targeted with small arms fire as it turned out by an after-action inspection of bullet indentions on either side of his turret.\n\nHollis Darby credited me for saving his life for making him go down the hill with us for the ammo resupply, but I know that he would have\n\nbeen off that cot and engaged in the action before that mortar hit just feet from where he was previously laying down. He was all about the action, and having a guy like that made it easier to perform that day.My truck commander, Sergeant Josh Deases ran to the broken ANA truck blocking our passage and got the ANA to help push it out of the way we fed off of each others confidence over those two days.\n\nHis team sergeant received a Bronze Star with Valor for the engagement, CW2 Brasher and his gunner were awarded the Army Commendation with Valor device.His citation reads, PFC Brashers dedication to duty and personal performance in combat was instrumental in the units success.\n\nI had to think about it for a while, but I cant credit what we did that day to courage-- Id credit it to training.Our unit was committed to giving us training, which made the difference.I think thats why my job now, instructor pilot, appeals to me so much.I think training is what kept me alive that day, and gave me the confidence to do what I had to do.I want to pass along that lesson to as many people as possible, Brasher said.\n\nThe Army Commendation Medal is awarded while serving in any capacity with theU.S. Armyafter December 6, 1941, for service members distinguishing themselves by heroism, meritorious achievement or meritorious service.The V device is for valorous actions in direct contact with an enemy\n\n-16-\n\n"}