{"text": "SCHOFIELD BARRACKS, Hawaii -- A 12-mile ruck march, an obstacle course, and a combat water survival test: these are just a few of the events that the competitors of the Best Chemical, Biological, Radiological and Nuclear Warrior Competition endured on Schofield Barracks, Hawaii.\n\nThe week-long competition, March 2 through 6, kicked off early Monday morning at Watts Field with the Army Combat Fitness Test. The competitors muscled through the test, getting the first taste of what the week had in store.\n\nShortly after completion of the ACFT, the Soldiers had to put on their tactical vest and run more than 2 miles to the Engagement Skills Trainer for an M4 qualification. In between firing iterations the competitors did 25 burpees, 25 mountain climbers and 25 flutter kicks in order to honor the 25th Infantry Division, all while wearing their M50 protective mask.\n\n&#34;I try to stay out in front so my soldiers will see me until they get out in front, and get after tasks without me even being out front,&#34; said Sgt. 1st Class Vincent Howard, a CBRN specialist with the mounted reconnaissance platoon, 71st Chemical Company, 303rd Ordnance Battalion, 8th Military Police Brigade, 8th Theater Sustainment Command.\n\nBefore daylight on Tuesday morning, the competitors were already breaking a sweat as they ran almost two miles to their first event of the day. As the sun began to beam through the leaves of the trees on the trail behind Lightning Academy, the competitors were getting ready to have their physical and mental toughness tested again with an obstacle course.\n\nThe course required competitors to navigate obstacles using full body strength, balance, hand-eye coordination, endurance and mental toughness, all while being timed. As if that wasn&#39;t enough, they also had to complete the same nearly 2 mile run again after completing the course.\n\nThe next thing on the agenda for the competitors was a CBRN round robin event. During this event, they were given a plethora of CBRN related tasks while under stress.\n\nDuring the round robin, they were tested on site decontamination, tactical combat casualty care and reacting to a chemical attack.\n\n&#34;This competition is all about understanding warrior tasks and battle drills,&#34; said Master Sgt. Jeffery Howard, the 25th Infantry Division CBRN senior enlisted advisor. &#34;It&#39;s all about preparing a soldier for what we call the total soldier concept.&#34;\n\nFollowing the round robin, the tough competitors loaded and donned their rucksacks, and set out for a grueling 12.5 mile ruck march in the dark with an extra 55 pounds on their backs.\n\n&#34;I pushed myself every moment that I was on the road,&#34; said Spc. Dongdong Liu, a CBRN specialist with Headquarters and Headquarters Company, 65th Brigade Engineer Battalion, 2nd Infantry Brigade Combat Team, 25th Infantry Division. &#34;I kept telling myself, you can do it, you can do it.&#34;\n\nOn the morning of day three of the completion, the Soldiers met at Richardson Pool. While there, they all took the Combat Water Survival Test. They had to jump into the pool wearing the Army Combat Uniform, and swim with a dummy weapon.\n\nOnly a few hours later the competitors took to the mats for a combatives tournament. They divided into weight classes and grappled their way through the brackets within their weight category.\n\nThe final event of the competition was a comprehensive CBRN board with 5 senior noncommissioned officers. They received rapid fire questions as they simultaneously completed CBRN related trivia on the dry erase board to simulate combat stress.\n\nThis competition is going to take them out of their comfort zone, said Master Sgt. Howard. It&#39;s made to stress them out. It&#39;s made to push them to their limits. It&#39;s going to test their endurance. At the end of the day we&#39;re trying to find out who the best CBRN warrior is on this island.\n\nLiu and Sgt. 1st Class Howard are the first place winners for their respective units with Liu being the competition&#39;s overall winner. They will both advance to Fort Leonard Wood, Missouri to represent their units in the Army level Best CBRN Warrior Competition this April.\n\n"}