{"text": "CAMP AS SALIYAH, Qatar  The 25th Strategic Signal Battalions Technical Control Facility (TCF) was recently named the 2020 Defense Information Systems Network (DISA) Central Facility of the Year for Category I Small Transmission facility.\n\nThe purpose of the awards is to identify and formally recognize outstanding Defense Information Systems Network (DISN) facilities for exemplary accomplishments, performance, and contributions made to enhance the effectiveness in which the Department of Defense information network (DODIN) is operated, secured, and managed.\n\nThe facility is operated by a platoon supporting Operation Spartan Shield, Camp As Saliyah(CAS) Local Network Enterprise Center, and Vectrus contractors. The purpose of the facility is to provide data and voice communication services to all users on Camp As Saliyah.\n\nThe TCF is the primary means of communications for CAS, said 2nd Lt. Jequon Everitt, assistant operations officer for the 25th SSB. It enables all tenant units the ability to communicate with flawless voice and data services.\n\nThe TCF went up against other DISN facilities in the region to include the Air Force, Navy and Marines. The DISA Central Field Command Quality Assurance comprised a board to select the winners.\n\nThe judging was based on the number of DISN links, trunks, circuits, mission accomplishments, facility/equipment improvements, training, and customer support, said James D. Christensen, Quality Assurance Team Chief for DISA Central.\n\nThe facility supported numerous high visibility operations and exercises by providing gateway access to 7 different missions in support of Operations Spartan Shield and Inherent Resolve, said Christensen.\n\nWhen I heard the news, I was super excited, said Everitt. I immediately relayed the great news to the entire team.\n\nEveritt says that the long hours his team put in daily attributed to this award significantly and that he is proud of what they accomplished.\n\nAs the 25th SSB transitions to Al Udeid Air Base in Qatar, they will continue to provide the exemplary services that enabled them to achieve such a high honor and ensure that communications continue to run smoothly throughout their area of operations."}