{"text": "CAMP ARIFJAN, Kuwait  On a particularly hazy mid-September day in Kuwait, Maj. Gen. John Rhodes, commanding general of Task Force Spartan and the National Guards Virginia-based 29th Infantry Division, stood near a camp on a military base in Kuwait. Empty tents lined the desert in front of him. This was his Soldiers doing.\n\nDays earlier, this patch of land was bustling with travel-weary Afghans who arrived from Kabul. Curious children  not fully aware of their circumstances  darted to and fro and played soccer with American Soldiers. Buses rumbled, hissed and kicked up dust as they traveled the unpaved roads, carrying approximately 5,000 evacuees. Yet, because of his Soldiers who collectively poured in thousands of work hours, the base was quiet again. In just two weeks, Task Force Spartan (TFS) Soldiers turned the worlds most vulnerable people into those who could see a glimmer of hope.\n\nFIRST NOTICE\n\nBy late July, as the world awaited word on the fate of Afghan interpreters and their families, TFS Soldiers quietly planned. Although they did not know how many  if any  would come through their area of operation, eight TFS Soldiers based in Jordan flew to Kuwait to conduct a site survey for what would be called Freedom Village, the sprawling compound designed to welcome and house evacuees as they awaited processing.\n\nOfficers and senior noncommissioned officers were in the delegation. Although most of them had spent their entire careers planning for war, they took on their new task of building a miniature city with gusto.\n\nWe hit the ground within 24 hours of getting the warning order, said Sgt. 1st Class Gavin McClung, the Protection Cell noncommissioned officer and one of the original eight who arrived from Jordan. From that time on, we sprinted.\n\nThe team also benefited from the National Guards West Virginia-based 111th Engineer Brigade, which worked on moving the dirt and flattening the ground for Freedom Village. The miniature city included bed spaces, showers, bathrooms, a cultural center, and medical screening and supply tents.\n\nStill facing uncertainties and without knowing how many evacuees would need temporary housing, the team went on with its plans. Then, there came a change. Rather than housing evacuees, the area would instead be used for American servicemembers redeploying from Afghanistan. Just as quickly as they had planned to house Afghans, the team scrapped that plan and instead began building for thousands of battle-wearied servicemembers.\n\nWe went from building 10-person rooms to building open bays because the needs of civilians and Soldiers are different, McClung said. We had to pull back on a lot of what we would have considered amenities that families needed, to building something for Soldiers instead.\n\nON-THE-FLY ADJUSTMENTS\n\nAs the landscape of Freedom Village began to change, so did the situation in Afghanistan. As the Taliban closed on Kabul, tens of thousands of at-risk Afghans flooded the airport, looking for a way out of the country and to a safer, more secure future. When the Department of State announced the official evacuations of Special Immigrant Visa Afghans, the team had to change plans again. This time, they knew who they were planning for and the approximate number of civilians Freedom Village needed to accommodate.\n\nWe had operated under a particular course of action for about 10 days, and in 24 hours, we shifted course again because we were told the Kuwaiti government had agreed to help us  that this was a humanitarian mission, McClung said.\n\nWith concrete numbers to work from, the team  now officially known as Task Force Freedom  worked with subunits under TFS to anticipate every logistical need in the movement of some 5,000 people.\n\nIt took a lot of planning because displaced civilians have different access and needs than Department of Defense personnel, McClung said. They couldnt go everywhere on base, so there were logistics of transportation and meal services to consider.\n\nWhile the Armys systems of checks-and-balances are best for producing optimal results, those same systems may not necessarily be the best when speed is key. Displaced evacuees on Air Force flights were coming by the hundreds and the team needed to act right away.\n\nLogistically, we faced a lot of hurdles because people were coming and they needed to be housed and fed, McClung said. To our leaderships credit, they understood that. They didnt quibble on whether we were authorized to do something by finding where it was written. They just told us to do it.\n\nAs evacuees poured in, the team realized it quickly needed more space. Although it had planned to house about 5,000 people, many of the spaces still needed to be cleared by engineer Soldiers and tents needed to be set up.\n\nThe team shifted again to meet mission requirements by using an already-built facility on another part of the base originally used to quarantine Soldiers during the COVID-19 epidemic.\n\nAgain, we had to do it in 24 hours because the evacuees were either coming or already on the ground, said 1st Lt. John Rivera, Task Force Freedom tactical operations center officer-in-charge. Even though we were adjusting as the situation changed, we knew it was going to work because we started with a solid plan.\n\nBy the end of the operation, more than 800 Soldiers had worked under Task Force Freedom to assist about 5,000 at-risk evacuees.\n\nREFLECTIONS\n\nWhen situations are constantly changing, when they dont have the time even to sleep or stop the mission to eat, when the lives of thousands of innocent people depend on them, Soldiers dont have the luxury to stop to think about the impact of their work.\n\nAs their mission wound down, McClung and Rivera sat together in a dusty room at the units tactical operations center to reflect on what the mission meant to them.\n\nYou see these children  these innocent, displaced children. They are hungry, they had been sitting out on the tarmac in Kabul for a week. To see them come in, you just want to help them as much as you can, McClung said. Soldiers immediately went to the bases Post Exchange and spent thousands of dollars buying necessities for the evacuees.\n\nRivera, on his first deployment, also recalled that he just wanted to help. He said he would most remember this mission because of the people he met.\n\nOn the last day Freedom Village was open, as the last displaced Afghans boarded the bus to the airport for flights to America, Soldiers lined up on both sides to say goodbye with a round of applause. Although it was the end of a short, intense two weeks, it was also a beginning for many.\n\nFor two mothers, it was the beginning because they gave birth during their stay at Freedom Village. For about 5,000 evacuees, it was a new beginning because during a sweltering summer in 2021  with the entire world watching and as they were called to lend a hand  Soldiers from the 29th Infantry Division said, Lets Go!\n\nFor more National Guard news\n\nNational Guard Facebook\n\nNational Guard Twitter\n\n"}