{"text": "JOINT BASE LANGLEY-EUSTIS, Va.  The U.S. Armys 393rd Transportation Harbormaster Operations Detachment and the 11th Transportation Battalion at Joint Base Langley-Eustis, Virginia, continually practice efficiency as a mobile Harbormaster Command and Control Center, to provide operational security and safe maritime sea lanes.\n\nThe detachment is one of three active duty units, with two at Fort Eustis and one in Hawaii. Each detachment operates modified Humvees, which provide Coalition, Command, Control, Communications, Computing, Intelligence, Surveillance and Reconnaissance capabilities through a suite of sensors, radars, and consoles to operate them with.\n\nIt works by sending out sonar waves up to 30 miles and reflect back to us what watercrafts we have in the water, whats incoming, said Spc. Joseph Pritchett, an HCCC operator assigned to the 11th TB. It also has programs set up where it can communicate with other systems like it to give us a broader picture of the surrounding area.\n\nHCCCs utilize Global Command and Control Systems, a Movement Tracking System, a SIPR/NIPR access point, a Battle Ground Sustainment Support System, and Remote and Main Control Systems to make it all work.\n\nGoing into the Army, a lot of people think its mostly guns, and fighting, but seeing the communications side like what we have set up with cameras, radar, and mapping that relays information of ships and boats, their destinations, [and] cargo; its all so cool the type of information you get back from just a small unit, said Pvt. John Pennycuff, an HCCC operator with the 11th Transportation Battalion.\n\nHCCC also uses three primary forms of electronic communications: marine-band very high frequency Single Channel Ground and Airborne Radio System, and Harris tactical radio gear. These communications provide the HCCC with the information needed to make decisions and relay information.\n\nEach HCCC consists of 22 Soldiers, who regularly train on HCCC equipment to ensure mission success.\n\nWe constantly have new people entering or leaving the unit, so its important to ensure everyone is trained up and [all the] bugs are worked out with the equipment. Once we get to the field were not dealing with any deficiencies, said Pennycuff. Were constantly breaking out our equipment, training on it for proficiency, and ensuring its all working properly.\n\nThis mobile system provides real-time tracking and communication with incoming and outgoing watercraft to ensure secure routes and the logistics of transitioning Army cargo from sea-to-shore. Much like air traffic control managing aircraft, the Harbormaster Detachment utilizes the HCCC system to direct sea vessels with cargo.\n\nThis allows us to maintain security when we have to rapidly set up ports without having to do lengthy construction with hard stands or concrete pillars, and we can be in and out within a week with safely transferring thousands of pounds of equipment, said Pritchett.\n\nThe next stop for the 11th TB HCCC will be traveling to the west coast, where they will conduct more training, and perform increased levels of their tasks, in addition to a new operational environment.\n\n"}