{"text": "CAMP ARIFJAN, Kuwait  The commander and command sergeant major for the 401st Army Field Support Brigade traveled to the brigade&#39;s installations in Iraq to meet with their military and civilian personnel deployed there.\n\nThe 401st Army Field Support Brigade supports U.S. Forces and Coalition Partners in Iraq, as directed, with commercially contracted base life support and field-level sustainment, theater provided equipment property management and redistribution, and Army Materiel Command Life Cycle Management Command support through the Logistics Assistance Program with forward and over-the-horizon presence to increase the readiness of vehicles and equipment, said Col. Patrick J. McClelland, the brigade commander, who was accompanied by his senior enlisted advisor, Command Sgt. Maj. David O. Nelson.\n\nMcClelland said that the 401st AFSB command team toured its facilities at Al Asad Air Base, in Anbar Province, and Erbil Air Base, in Iraq&#39;s Kurdistan Autonomous Region.\n\nHe said his personnel at the two locations are deployed with elements from the brigade&#39;s Army Field Support Battalion-Southwest Asia.\n\nMcClelland and Nelson&#39;s tour was part of a significant effort directed by Maj. Gen. Michel M. Russell Sr., the 1st Theater Sustainment Command commanding general, so that his command teams have a fresh understanding of the theater post-Afghanistan. 1st TSC handles all logistics for the U.S. Central Command area of responsibility.\n\n1st TSC Deputy Commanding Officer Col. Sean P. Davis said the exit from Afghanistan was a significant undertaking, drawing resources and personnel from other parts of the theater.\n\nNow, Davis said that the priority is to reset the theater to support Combined Joint Task Force-Operation Inherent Resolve. CJTF-OIR is the coalition force working with the Government of Iraq and Syrian partners to defeat Daesh.\n\nMcClelland, whose brigade includes Army Field Support Battalion-Kuwait, which manages the Army Prepositioned Stock here, said he is also seeking opportunities to improve the quality of the vehicles and equipment from the APS.\n\nWe continue to improve support to provide CJTF-OIR with more operationally ready vehicles and equipment, he said.\n\nWe will do this by leveraging theater excess materiel, facilitate the turn-in of excess or obsolete equipment and continue to improve base life support and field-level sustainment contracted services to meet their current and emerging requirements, he said.\n\nCommand Sgt. Maj. David O. Nelson said wherever he goes to meet with his Soldiers, he is constantly checking on the same things.\n\nYou find somebody that&#39;s working there, and you ask them what their MOS is and how they got there and where they&#39;re from, and I had good interactions when I was up there, he said.\n\nOne of the Soldiers Nelson met in Erbil was Pfc. Colt T. Beers, who is assigned to the Redistribution Property Accountability Team yard. The RPATs sort through excess equipment and vehicles and determine whether they are shipped to another unit or a depot or repair site in the United States.\n\nThe private impressed the command sergeant major with his work ethic and what he has already given up in his short Army career.\n\nHe actually didn&#39;t get to go to his high school graduation because he came into the Army before he got a chance to go to graduation, so it was neat just seeing somebody like that, that&#39;s just so passionate about serving, Nelson said.\n\nSgt. 1st Class Domingo G. Hernandez III, the Erbil RPAT noncommissioned officer in charge, said both Beers and his supervisor, Sgt. Jonathan Dasopatis, are working outside their military occupational specialty, or MOS.\n\nBeers is an equipment operator, or 91 Mike, and Dasopatis is a small arms and artillery repairer, or 91 Foxtrot, he said.\n\nThe Erbil RPAT yards function is to relieve units of accountability of TPE as far forward as possible by retrograding equipment within the theater of operations,&#34; he said. TPE is shorthand for theater-provided equipment passed on through succeeding units, rather than coming in and out of the theater with the units.\n\nBeers and Dasopatis play a vital role in the accountability of the equipment received, the sergeant first class said. They assist in allocating and tracking appropriate storage locations, labeling and maintaining documents, which eventually become a Transportation Movement Request to deliver the equipment to Kuwait for disposition or redistribution, he said.\n\nDuring their time, they received items, prepped, labeled and loaded four convoys which transported 2,831 items valued at $24,833,386.54 to the Camp Arifjan RPAT yard.\n\nNelson said it is essential to remember that Iraq still has security challenges. One of his biggest concerns for his Soldiers is their safety. The Littleton, New Hampshire, native and his commander walked the grounds of the installations to gauge the readiness of the personnel and their facilities.\n\nThey had drills, he said. We would check out the perimeter. We would see what their battle plans were, what their actions were in the event. How do they report it up? How do they report accountability? Where&#39;s the nearest hospital? What level of care is provided in those areas? Did they know the routes, phone numbers, who to get in contact with?\n\nNelson said another benefit of battlefield circulation is getting an idea about how Soldiers are doing, in a way you cannot from a storyboard slide or an after-action report. As the command sergeant major, he focuses on Soldier care and unit morale.\n\nYou&#39;re worried about pay. Youre worried about chow. You&#39;re worried about building, mail, stuff like that, just the basics, the command sergeant major said.\n\nHe also looks at the opportunities for resiliency and the activities that Soldiers can actively participate in when they are not working.\n\nEvery interaction is an opportunity to either learn something from a Soldier or sometimes give them some information based on my experience that I&#39;ve had in the military, Nelson said.\n\n"}