{"text": "Mr. Yi, The Subsistence Supply Manager, has taken on the additional duties as the acting Food Service Specialist at Logistics Readiness Center-North. His dedication is highly respectable. He leads by example and promotes a safe and healthy work environment. He encourages his folks beyond his expected level of leadership to ensure that they perform as best as they possibly can.His ability in meeting daily, weekly and monthly deadlines is evidence of his superior leadership skills.He is a valuable asset to the LRC-North, 403rd AFSB.\n\nHometown:\n\nSeoul, South Korea\n\nHow long have you been working for the U.S. Army: \n\n22 years\n\nWhat other positions have you held with the U.S. Military: \n\nPest controller, interpreter driver, supply technician, and general supply specialist\n\nHow long have you been in this position?\n\n9 years\n\nTell us about your job and what you do: \n\nI support operations at six Warrior Restaurants and maintain approximately 160 accounts for all subsistence for field trainings events through the AFMIS (Army Food Management Information System) and STORES (Subsistence Total Order and Receipt Electronic System). I rotate Unit Basic Loads of Meals Ready to Eat - 4,732 boxes with 53 units per box  250,796 units total. I also support the Korean Augmentation to the United States Army Program with KATUSA Comfort Kits totaling 12,416 units.\n\nWhat other duties are you responsible for?\n\nI maintain a safe and healthy work environment for the Food Service and Subsistence Supply Management Office (SSMO) and monitor Mutual Logistic Support Agreement (MLSA) reimbursement for Republic of Korea Ministry of Defense/Combined Forces Command exercises.\n\nWhat are some of your accomplishments while at LRC-North?\n\nI took on additional duties as the acting Food Service Specialist during absence of two Department of the Army Civilians, while serving as Food Program Manager and Food Service Specialist.\n\nWhat is the best thing about working at LRC-North?\n\nMy office is located at Camp Casey in Dongduchon, 40 miles north of Seoul, where we are surrounded by beautiful trees and mountains. I am proud of working as a part of the LRC-North Team.\n\nWhat do you like to do in your free time? \n\nI love watching Netflix in my down time.\n\nDo you have a special skill or talent you would like to share (what is something people might not know about you)? \n\nI love growing plants, there is a pot in SSMO office with a Spathiphyllum that has been growing for about 10 years. It&#39;s not tall but looks lovely. It was my sons homework project to grow a plant in a bottle when he was in first grade in elementary school about 10 years ago. It&#39;s precious for me as a pet plant now.\n\n"}