{"text": "LEGHORN ARMY DEPOT, Italy  The 405th Army Field Support Brigades Africa battalion maintains a robust stock of some of the most modernized and lethal vehicles and equipment pieces in the Armys inventory.\n\nRecently, Army Field Support Battalion-Africa was called upon to shift over 1,300 Mine Resistant Ambush Protected All Terrain Vehicles from its Army Prepositioned Stock-2 site at Leghorn Army Depot to other locations for other missions.\n\nThe battalion immediately went to work to get the M-ATVs to their new destinations.\n\nWorking with the 839th Transportation Battalion, installation customs office, Italian base commander, Carabinieri, multiple port activity agencies, and installation security, AFSBn-Africa prepped, prepared and delivered the M-ATVs to be loaded unto cargo vessels at the Port of Livorno in Italy.\n\nWe started shipping M-ATVs in April for this particular mission. The Ocean Giant (cargo vessel) was the second shipment on May 19 carrying over 240 M-ATVs, and we are doing a third shipment with the USNS Bob Hope starting in a couple of days, said Lt. Col. Miguel Floresrivera, the commander of AFSBn-Africa.\n\nThe Bob Hope is a U.S. Navy Military Sealift Command vehicle cargo ship that is stopping in Livorno on its way from Durrs, Albania, carrying equipment used by U.S. forces during DEFENDER-Europe 21, said Jeffrey Jurgensen, the public affairs officer for the 598th Transportation Brigade.\n\nIt will be stopping in Livorno to pick up another couple hundred M-ATVs, said Floresrivera.\n\nWe havent had U.S. military vessels here in Livorno for a long time so we are very excited about the arrival of the USNS Bob Hope, said Floresrivera.\n\nRecently, the Army made the decision to divest its fleet of MIII7 Armored Security Vehicles used by Army Military Police units, said Floresrivera. The Army is replacing these ASVs with M-ATVs, and that triggered this mission.\n\nMany of these new, highly advanced M-ATVs will be issued to Reserve and National Guard MP units throughout the United States. Some will be redistributed to other APS sites, and some will be sent to other locations and MP units, such as the 18th Military Police Brigade in Germany.\n\nFloresrivera said preparing and moving over a thousand vehicles in a short time span takes a lot of coordination and a lot of work, but according to him hes got the right workforce for the job.\n\nI can tell you that my local national workforce is the most experienced in Europe because they are not contractors and they dont rotate, said Floresrivera. The average age of my local national workforce is about 53 years old, and average time in the battalion is 23 years.\n\nThey love their jobs, Floresrivera said. When I talk to them, they are always very thankful for the opportunities they have working with the U.S.  with our Army and our government.\n\nFloresrivera said his workforce consists of about 10 Soldiers and about a dozen Army civilian employees, but the vast majority  over 200  are Italian local national employees.\n\nTheyre not contractors like the other APS-2 sites, Floresrivera said. We have examples  such as a grandpa working for us, and then his son comes onboard. The grandpa retires and now the grandson or granddaughter is here  three generations.\n\nIts been like this since the 1950s when we started here at Leghorn Army Depot. This is an institution, and all the locals know the depot and the battalion here in Livorno, he said.\n\nThe 405th AFSB is assigned to U.S. Army Sustainment Command and under the operational control of the 21st Theater Sustainment Command, U.S. Army Europe and Africa. The brigade is headquartered in Kaiserslautern, Germany, and provides materiel enterprise support to U.S. Forces throughout Europe and Africa  providing theater sustainment logistics; synchronizing acquisition, logistics and technology; and leveraging the U.S. Army Materiel Command materiel enterprise to support joint forces. For more information on the 405th AFSB, visit the official website at www.afsbeurope.army.mil and the official Facebook site at www.facebook.com/405thAFSB.\n\n"}