{"text": "GHANA, Africa  U.S. Africa Commands largest annual special operations exercise wrapped up March 15 after more than two weeks, but the work to support the exercise isnt over. As the program management office for the Logistics Civil Augmentation Program on the African continent, the 405th Army Field Support Brigade was tasked with supporting about 1,300 exercise participants from 29 nations in Ghana and Cte dIvoire during Flintlock 2023, March 1-15.\n\nJames Wilkerson, a LOGCAP support contractor and senior logistics management specialist based in Africa, said AFRICOM has been using LOGCAP to support the last six iterations of the Flintlock exercise.\n\nLOGCAP provided contracted base life support services for exercise Flintlock 2023 at multiple sites this year, Wilkerson said. There were a total of six sites. Four were in Ghana  from central Ghana to the north  and two were in Cte dIvoire or the Ivory Coast.\n\nLOGCAP services at each site ranged from setting up multipurpose tents with electricity, air conditioning, cots and mosquito nets to providing hot meals for breakfast and dinner and meals, ready to eat for lunch. In addition to this, LOGCAP services provided all the ancillary requirements like power generation, fuel, cleaning services, showers, latrines, and full service laundry facilities.\n\nOne of the sites at Cte dIvoire was an administrative office facility, and the LOGCAP contract only entailed cleaning the offices and providing portable latrines. The other site in Cte dIvoire and all four sites in Ghana received a full complement of LOGCAP base life support services.\n\nLOGCAP helps reduce the logistical requirements for exercise participants, said Wilkerson. It allows them the ability to fully focus on the exercise as opposed to any ancillary logistical support requirements.\n\nAlthough the use of LOGCAP is highly recognized as the preferred sourcing solution for base life support services at fixed locations throughout Southwest Asia, Central Asia and Africa, the program also has the flexibility through proper planning to scale down operations and provide limited base life support services in support of exercises like Flintlock 2023, Wilkerson added.\n\nIts important to incorporate LOGCAP early in the exercise planning process in order to properly identify requirements and save time, effort and money, said Wilkerson. LOGCAP is the most robust sourcing solution for contractor provided base life support services under a single umbrella.\n\nFlintlock  AFRICOMs premier and largest annual special operations exercise  has taken place annually since 2005 across the Sahel region of Africa among nations participating in the Trans-Sahara Counter-Terrorism Partnership and is planned by African-partner nation special operations forces, U.S. Special Operations Command-Africa, and the U.S. Department of State.\n\nFlintlock strengthens the ability of key partner nations in the region to counter violent extremist organizations, collaborate across borders, and provide security for their people, while respecting human rights and building trust with civilian populations. The robust participation of African and international partners reflects a mutual commitment to countering malign activity and violent extremism throughout the Sahel and West Africa region.\n\nU.S. forces have historically partnered with Ghana and Cte dIvoire through multiple military and civil affairs exchanges. Last year, Cte dIvoire hosted Flintlock 2022, with more than 400 participants from ten nations. This years iteration aimed to continue reinforcing the collective ability of allied and partner nations to address key security challenges.\n\nDuring a LOGCAP executive summit last year, U.S. Army Materiel Commands commanding general, Gen. Ed Daly, emphasized that LOGCAP remains the contracted capability of choice for the Army and multiple joint partners for emergent and contingency operations. Currently, 405th AFSB LOGCAP supports thousands of deployed U.S. forces in Europe and Africa with base life support and more.\n\nThe 405th AFSB is assigned to U.S. Army Sustainment Command and under the operational control of the 21st Theater Sustainment Command, U.S. Army Europe and Africa. The brigade is headquartered in Kaiserslautern, Germany, and provides materiel enterprise support to U.S. Forces throughout Europe and Africa  providing theater sustainment logistics; synchronizing acquisition, logistics and technology; and leveraging AMCs materiel enterprise to support joint forces. For more information on the 405th AFSB, visit the official website and the official Facebook site.\n\n"}