{"text": "POWIDZ, Poland  The commander of the 405th Army Field Support Brigade, Col. Crystal Hills, provided a group of distinguished visitors and leaders at the Long Term Equipment Storage and Maintenance Complex with a tour of the facility following the LTESM-Cs official opening ceremony in Powidz, Poland, April 5. In attendance were U.S. Ambassador to Poland Mark Brzenzinski, Deputy Prime Minister of Poland Mariusz Blaszczak, U.S. European Command Deputy Commander Air Force Lt. Gen. Steven Basham, and several other general officers and senior civilians.\n\nNATOs biggest single infrastructure investment in more than three decades, the LTESM-C will soon host a U.S. Army modernized armored brigade combat teams worth of Army Prepositioned Stocks-2 combat equipment and vehicles when the 405th AFSB assumes mission command of the LTESM-C later this year.\n\nComprised of 650,000 square feet of humidity-controlled warehouse space, a vehicle maintenance facility and supporting facilities, and a 58,000 square foot munitions storage area  the state-of-the-art LTESM-C demonstrates the commitment and investment of the U.S. with Poland and NATO through enduring agreements to posture resources for rapid deployment and deter potential adversaries.\n\nOnce activated, Army Field Support Battalion-Poland, 405th AFSB, will be responsible for the command and control of all APS-2 operations and equipment at the LTESM-C. The 405th AFSBs APS-2 program in the U.S. European Command area of operations enhances the U.S. militarys ability to rapidly and dynamically employ forces within theater, vastly improving NATOs deterrence capabilities and readiness posture, reducing deployment timelines, and providing additional combat power for contingency operations. APS-2 equipment may also be drawn for use in training and exercises like DEFENDER-Europe. The 405th AFSBs APS-2 program and the LTESM-C help to assure allies and partners that the U.S. is committed to the collective defense of Europe.\n\nIn the weeks ahead, Army Field Support Battalion-Germany will assume mission command of the Coleman APS-2 worksite in Mannheim, Germany, while Army Field Support Battalion-Mannheim re-designates to Army Field Support Battalion-Poland and assumes mission command of the LTESM-C in Powidz.\n\nThe 405th AFSB is assigned to U.S. Army Sustainment Command and under the operational control of the 21st Theater Sustainment Command, U.S. Army Europe and Africa. The brigade is headquartered in Kaiserslautern, Germany, and provides materiel enterprise support to U.S. Forces throughout Europe and Africa  providing theater sustainment logistics; synchronizing acquisition, logistics and technology; and leveraging U.S. Army Materiel Commands materiel enterprise to support joint forces. For more information on the 405th AFSB, visit the official website and the official Facebook site.\n\n"}