{"text": "MANDA BAY, Kenya  When the 475th Expeditionary Air Base Squadron at Camp Simba in Kenya identified a potential power distribution issue on the east side of its camp, representatives from the 405th Army Field Support Brigades Logistics Civil Augmentation Program stepped in to assist.\n\nArmy Cpt. Branson Monico, a 405th AFSB LOGCAP planner for the U.S. Africa Command area of responsibility, said theres four generators supporting the east side of the camp with European spec power, 220-240 volts. The west side of the camp is powered by U.S. spec 110-120 volt power.\n\nThe Air force is close to maxing out their power distribution bus bar on the east side of the camp. They have four generators, and power is close to maxing out, Monico said.  If anything happens, like a generator goes down or they over-calibrate the power, that could kill it and theyll have to start shutting down facilities.\n\nOver 600 U.S. military personnel work at Camp Simba. Most of them are Air Force and from the 475th EABS, but there are also U.S. Marines based there as well as Army Soldiers. Its important that the power requirements supporting all these personnel is resolved before it becomes an issue, and LOGCAP has been tasked to help.\n\nLOGCAP is working a letter of technical direction in order to conduct a project to access the feeder pillars and the distribution lines and cables that run throughout the east side of the life support area, Monico said. They need to conduct the assessment, redistribute the power and possibly bump up the power output.\n\nI got with the contractors, and we did a joint site assessment, Monico said. We walked the site and went to each feeder pillar, which is basically the distribution panel with all the power cables, in order to pinpoint the work that needs to be completed.\n\nAs the requiring activity, the 475th EABS will get all their requirements laid out  what is needed to support this project and what they want the contractor to do. From there, theyll send their letter of justification to LOGCAP, and LOGCAP will submit a letter of technical direction to direct the contractor to do the work on this site, said Monico.\n\nWere basically the middle man between the requiring activity and the contractor, he added.\n\nWith LOGCAP, we can revise the contract at a moments notice and get a generator replaced immediately, if need be  48 hours by air, for example, or a couple of weeks by ground, said James Wilkerson, a 405th AFSB LOGCAP support contractor and senior logistics management specialist based in Africa.\n\nBeing able to provide immediate flexibility based on changing requirements supporting the requiring activity is what LOGCAP brings to the table  quality services, more flexibility and quicker response times, he said.\n\nBy having that flexibility, it helps to reduce logistical burdens, said Wilkerson.\n\nThe Logistics Civil Augmentation Program, or LOGCAP, is an Army strategic sourcing preferred source for base operations support and sustainment services. LOGCAP services can include everything from laundry and food service to recreation, maintenance, power generation, information technology, medical services, physical security, and more.\n\nDuring a LOGCAP executive summit last year, U.S. Army Materiel Commands commanding general emphasized that LOGCAP remains the contracted capability of choice for the Army and multiple joint partners for emergent and contingency operations. Currently, 405th AFSB LOGCAP supports thousands of deployed U.S. forces in Europe and Africa with base life support and more.\n\nThe 475th EABS provides base operations and communications support for 13 mission partners enabling Special Operations Command Africa missions in Kenya and Somalia. Together, with African and international partners, they help provide a secure, stable and prosperous Africa.\n\nThe 405th AFSB is assigned to U.S. Army Sustainment Command and under the operational control of the 21st Theater Sustainment Command, U.S. Army Europe and Africa. The brigade is headquartered in Kaiserslautern, Germany, and provides materiel enterprise support to U.S. Forces throughout Europe and Africa  providing theater sustainment logistics; synchronizing acquisition, logistics and technology; and leveraging AMCs materiel enterprise to support joint forces. For more information on the 405th AFSB, visit the official website and the official Facebook site.\n\n"}