{"text": "DARIEN, Illinois  The 416th Theater Engineer Command continued its winning streak, with two companies adding top-tier logistic excellence awards to its fall lineup.\n\nThe 409th Engineer Company (Engineer Vertical Construction Company), out of Windsor, Colorado, and the 397th Engineer Battalions Forward Support Company, out of Marina, California, earned awards in both the Chief of Staff, Army, Supply Excellence Award (SEA) and the Army Award for Maintenance Excellence (AAME) at the U.S. Army Reserve level and Department of the Army level.\n\nIn the supply arena, the 409th EVCC gained the overall title of Best of the Best out of 21 other competing active duty, National Guard, and other U.S. Army Reserve units for 2021 and 2022. They won this top slot in the SEA competition after clinching first place at the DA level during Phase II of the competition.\n\nWinning the Best of the Best is truly an honor and humbling, said Sgt. 1st Class Frederick Hillabrand, 409th EVCC supply sergeant. This feat was arduous, requiring long hours, exceptional attention to detail and command emphasis and involvement; no singular person won this recognition alone.\n\nIn the maintenance realm, the 397ths FSC continued the winning streak for the TEC by receiving first place in the small unit category at the USARC and the DA level of the competition.\n\nFurthermore, the 409th EVCC also excelled in the maintenance competition, receiving first place in the medium unit category at the USARC and DA level for of the AAME competition.\n\nDuring an awards ceremony Sept. 15 in Windsor, the 416th TEC Commanding General Maj. Gen. Brian E. Miller was joined by additional leadership to praise the units accomplishments.\n\nThe commanding general came out and was joined by other leadership, including the USARC G4 (logistics officer), the sergeant major, and the battalion commanders. They each had a moment at the podium and explained how constructive the SEA and AAME programs are and what it means to not only be selected during the Phase I and Phase II of the competitions, but to also be named the Best of the Best across all compos, said Warrant Officer Timothy Andress, who recently left the 409th EVCC for the 863rd Engineer Battalion that is co-located with the 416th TEC Headquarters in Darien, Illinois. We have a healthy competition between maintenance and supply that pushes each other to excel. You cant have one without the other. Without each other its rough, but with each other we win awards.\n\nHe said he hopes this win helps sustain that strong rivalry and continues to drive both sections.\n\nThese logistic victories come on the coattails of another big feat this past summer with the 416th TEC winning top-tier safety awards from USARC, the U.S. Army Forces Command and the DA levels in its respective category for fiscal year 2021.\n\nWere on fire right now, said Andress, acknowledging the landslide awards for the TEC in safety, maintenance, and supply.\n\nThe 416th TEC downtrace units continue to showcase their tenacity and hope to continue to sweep the competition, as this now marks the second year of wins for these logistic excellence awards."}