{"text": "Joint Base Lewis-McChord, Wash.-- On Aug. 17 with just over 48-hour notice, Tech. Sgt. Jodi Signer, a loadmaster assigned to the 313th Airlift Squadron here, was in the air headed to help with evacuation efforts in Afghanistan.\n\nNot only would this be Signers first mission into Afghanistan, Operation Allies Refuge would be her first combat mission as a loadmaster.\n\nTech. Sgt. Signer joined the Air Force Reserve in 2012.\n\nShe joined the 446th Aeromedical Evacuation Squadron as an Aeromedical Evacuation Technician. Signer crossed-trained as a loadmaster in 2020 and finished her training at the beginning of 2021.\n\nIn her first mission, her worlds overlapped, signaling the transition from her time as a flight nurse to a loadmaster.\n\nKabul was my first combat mission as a loadmaster, Signer said. Our first flight was a medical evacuation mission which was the job I had previously.\n\nIn the time the aircrew spent flying in and out of Hamid Karzai International Airport (HKIA) in Kabul, they moved troops, vulnerable Afghans, and cargo out of the country to secondary locations.\n\nWe flew six transport evacuation missions, three of which were into Kabul at the end of August, said Signer. We evacuated just under 300 passengers and approximately 320,000 pounds of cargo over the span of the mission.\n\nOperation Allies Refuge has become the biggest airlift mission in United States history. Throughout the entirety of operation, a record total of 778 missions were flown, 387 of which were done by U.S. military C-17s or C-130s. That mobility airpower saw the evacuation of 124,334 American citizens, civilian allies, Afghan special immigrant visa applicants and other vulnerable Afghans between Aug. 15 and Aug. 31.\n\nThe uncertainty on the ground and increased mission tempo paired with a hard deadline, led to long days  and increased stress. The crews didnt have to look far for motivation to keep going.\n\nWorking 20+ hour days and flying with minimal crew rest is exhausting; however, we knew we only had one week to get as much out of country as we possibly could, said Signer. So knowing people could get left behind was all the motivation we needed.\n\nSigner reflected on working with those leaving Afghanistan and the profound impact it had.\n\nHaving this opportunity to evacuate people from their own country gives you a different outlook on life. So many broken homes and families is heartbreaking, said Signer. Hearing stories of what was going on from both refugees and troops makes you appreciate what we often take for granted. I am glad we were able to get people out safely.\n\nAir Force Reserve Command Airmen made up 73 crews and hundreds of maintenance, security, medical and support personnel. Each activated to ensure safe passages of Americans and Afghan allies out of Afghanistan. Many of these Airmen were blended into Total Force crews, mixing active duty, Guard, and Reserve components.\n\nEach of these Reserve Citizen Airmen played a crucial role in the mission. Their determination, readiness, and dedication to the mission carried it forward, through the long hours, the uncertain days, and high tempo requirements.\n\nThe biggest takeaway that I have from this mission is an appreciation for how quickly we can respond. We had just over 48 hours notice before we were in the air, said Signer. And by no means was the daily operation perfectly planned or run flawlessly, but for such a short notice and large scale airlift, I am proud at how well we all pulled together to get the job done. This is why it is important to train and stay proficient in your job and skills."}