{"text": "SZCZECIN, Poland  Task Force Ivy, which consists of the 4th Infantry Division and its subordinate brigades in northern Poland, conducted a mobile command post demonstration from March 25- 29, 2023, at the Multinational Corps Northeast, or MNC-NE, Headquarters with NATO partners and Allies.\n\nThe presentation of the 4th Infantry Divisions mobile command post, or MCP, at the Baltic Commanders Conference was an opportunity to increase human, technical and procedural interoperability between the U.S. and its European allies.\n\nThe big benefit to activities like the commanders conference is enriched by the fact that we can look at one example, a great example, of how to commit to command and control of divisions and corps, explained German Army Lt. Gen. Jrgen-Joachim von Sandrart, commander of MNC-NE. We exchange experiences, and we exchange perceptions and expectations. We grow closer together and we gain an environment of trust and credibility.\n\nThe Madrid Summit Declaration, issued by NATO heads of state and government last July, was a pivotal moment in the strengthening of alliances in Europe and a growth in shared military cooperation.\n\nThis command post demonstration and commanders conference is a lasting effect of the summit, and events and activities like this allow us to realize the objectives from Madrid, said Maj. Gen. David Hodne, the 4th Infantry Division commanding general. We will demonstrate that the multinational division northeast is prepared to defend its Baltic neighbors in the future.&#34;\n\nThe 4th Infantry Division has a long-standing history of partnerships and training with NATO countries in the Baltics. The Ivy Division was one of the first U.S. divisions to establish a presence in Poland.\n\n&#34;I&#39;m grateful to have our American brothers-in-arms and sisters-in-arms, shoulder-to-shoulder being present here but also being present all across the northeastern flank,&#34; von Sandrart said.\n\nOver this past week, the 4th Infantry Division Headquarters conducted a 250 km multi-vehicle convoy of its mobile command post from southern Poland to the MNC-NE headquarters to build readiness and validate the division&#39;s ability to enhance interoperability with NATO partners and Allies.\n\n&#34;It is critical that we can fight alongside our NATO partners and Allies, said Maj. David Zelaya, a division planner. The MCP provides a mobile, adaptable, and integrated system that allows us not only to communicate, but to integrate and collaborate with our partners here at MNC-NE.&#34;\n\nThe Ivy Division&#39;s unique physical layout plan of the MCP is built around functional cells that aid digital collaboration tools such as teleconference software. This encourages synchronized and fast communication between peer and subordinate units. These command-and-control structures help leverage newfound advantages in mobility and bottom-up refinement for enemy targeting and mission planning purposes.\n\n&#34;The 4th Infantry Division is the only U.S. division fielded with a mobile command post that allows the exchange of emails and information with our international partners,&#34; said Lt. Col. Kenneth Roedl, the division&#39;s communications chief.\n\nIn a near-peer fight, a division needs to operate within periods of maritime and air superiority to ensure survivability when seizing key terrain. The highly versatile and agile containerized command post segments allow for a division to quickly adapt to conditions on the battlefield.\n\nU.S. Army Brig. Gen. Monte Rone, the MNC-NE deputy chief of staff for operations stated that MNC-NE is going to be a warfighting corps, and he hopes this demonstration by the Ivy Division helps to continue to educate and train the NATO partners here in Szczecin.\n\nGerman Army Brig. Gen. Kay Brinkman, the MNC-NE deputy chief of staff for planning, said this demonstration helps to build a collective defense environment within NATO and puts the pieces together to operate on the same lines of effort.\n\nThe goal of this command post demonstration was to validate the Ivy Division&#39;s ability to rapidly deploy to another location and establish communication with various NATO military organizations using the systems contained in the MCP; a task that is essential when fighting in a near-peer fight.\n\nThe military commanders at NATO&#39;s MNC-NE HQ were able to see how the Ivy Division fights and will win future conflicts through the integration of the command post nodes and processes the MCP provides to an organization.\n\nThe future of the NATO battle groups and the development of MNC-NE headquarters is based around the collective teamwork of each of the divisions located on the eastern flank.\n\n&#34;We have to come together to get to know each other and overcome our difference, said von Sandrart. Then, we are ready for the fight, and if we have to fight, we will win.&#34;\n\nThe 4th Infantry Division Headquarters will continue to train and validate the effectiveness of its command post system throughout its rotation in northeastern Europe, and is prepared to support any mission, anytime, anywhere and under any conditions.\n\n"}