{"text": "USAG HUMPHREYS, South Korea  Intelligence professionals from across the Republic of Korea and U.S. Army Intelligence and Security Command came together for a night to celebrate the alliance at the Morning Calm Center on Camp Humphreys, Feb. 2, 2023.\n\nThe 2023 ROK/U.S. Intelligence Community Reception, hosted by the 501st Military Intelligence Brigade on behalf of INSCOM, provided an opportunity for U.S. Intelligence professionals to meet and develop rapport with key ROK national-level intelligence, security, and law enforcement officials who support the combined intelligence missions of United States Forces Korea, INSCOM, and the 501st MI Brigade.\n\nThe night began with a social hour and food service, followed by the receiving line where the INSCOM and 501st MI Brigade command teams formally greeted guests. Attendees included senior leaders from across the Korean peninsula including Maj. Gen. Joseph Dcosta, deputy commanding general, sustainment, Eighth Army; Brig. Gen. Richard Appelhans, J-2, USFK;Brig. Gen. Ju, Jung Woon, intelligence director in G-2/3, ROK Army headquarters; Maj. Gen. Son, Sug Rag, C-2, Combined Forces Command; Maj. Gen. Kim, Dong Ho, director of Doctrine Development, ROK Army Training Doctrine and Command; and Mr. Kim, Yong Ho, intelligence director, Korea Defense Intelligence Agency.\n\nCol. Lisa Winegar, commander, 501st MI Brigade, welcomed guests and remarked that maintaining friendship and strengthening the bond between the ROK and U.S. is the key to the two countries collective success.\n\nYour attendance at our combined New Years celebration demonstrates the commitment we both share to an iron clad ROK/U.S. alliance, Winegar said. I am hopeful our continued collaboration and friendship will further strengthen the alliance. The hospitality of our ROK partners to their U.S. counterparts is unlike anything I have experienced anywhere else in my career.\n\nWinegar continued, Our combined training and operations are important, but the real secret to our strong ROK/U.S. alliance is through our deep and unwavering friendship. Whether sharing the love of Korean food through a monthly dinner or competing with one another through a friendly game of soccer, this friendship allows us to recognize our shared values and interests.\n\nMaj. Gen. Michele Bredenkamp, INSCOM commanding general, also expressed her gratitude, remarking that the event is very special for her and the INSCOM members.\n\nTonight is an exciting night for many of us, especially for INSCOM. Due to the COVID-19 pandemic, we were unable to celebrate our intelligence partnership through an in-person annual reception since 2019, Bredenkamp said. She noted how grateful she was to have the opportunity to attend in-person and begin the New Year with a great start after the long struggle of COVID-19.\n\nBredenkamp went on to say that it takes the combined team to promote security and strengthen stability in the region and around the world. She then stated, we must continue to foster the strength of our relationships, which takes time and effort to maintain and grow. We truly value our partnership and continue to invest in strengthening our alliance.\n\nBredenkamp, Winegar, and the two ROK guests of honor, Kim and Son, cut a ceremonial cake to end the formal portion of the reception. The reception featured Eighth Army Band musical performances throughout the event.\n\n"}