{"text": "AVIANO, Italy  In the wake of the COVID-19 epidemic in Northern Italy, U.S. Army parachute riggers assigned to the 601st Quartermaster Company, 173rd Brigade Support Battalion, 173rd Airborne Brigade began sewing face mask prototypes made from fabric found in the standard Army parachute system in Aviano Air Base, Italy, April 28, 2020. The prototypes are meant to prepare the paratroopers for the mass production of the masks when proper materials arrive.\n\nResponsible for maintaining, repairing, and packing parachutes, riggers are uniquely equipped to produce face masks. In particular, riggers who work in the maintenance section are proficient in the use of the sewing machine.\n\nWe can produce and make anything you give us a diagram of, said Staff Sgt. Brandon Gilmore, the shop foreman of the maintenance section. If it can be sewn or repaired, that is what we are capable of doing.\n\nGilmore, who is overseeing the production of the prototypes, will be cordoning off a portion of the maintenance shed and allowing only the necessary personnel and equipment in or out, ensuring a sterile environment for the production of the masks.\n\nThe 173rd Airborne Brigade is the U.S. Army&#39;s Contingency Response Force in Europe, providing rapidly deployable forces to the United States Europe, Africa and Central Command areas of responsibility. Forward deployed across Italy and Germany, the brigade routinely trains alongside NATO allies and partners to build partnerships and strengthen the alliance.\n\nWhen the Aerial Delivery Field Services Department implemented Operation Provide Masks, the 601st immediately began preparing for the task and drawing up the diagrams. They provided guidance on how to develop the masks, said Warrant Officer Analyn Batican, the airdrop systems technician in the company. There were a few ways we could do it.\n\nFor one hour per day, the riggers in the maintenance section sew prototypes based on the diagrams drawn up by Batican. Waiting for the medical materials, they are perfecting the design and becoming increasingly proficient. After the arrival of the material, a legal and medical review of the masks will be conducted. At that time, we will begin mass production, said Batican.\n\nThe masks will be distributed among personnel in the Aviano and Vicenza Military Communities, likely beginning with medical professionals in the clinic on Aviano Air Base. At this point, the priority is to produce enough masks to support the brigades needs, whatever they become as the situation unfolds.\n\nSpc. Savannah Hyder, a rigger in the maintenance section, is proud to be working on the effort to combat COVID-19. We have all the tools and supplies we need to accomplish the mission, she said. Im going to get these masks out so people can get their jobs done too.\n\n"}