{"text": "JOINT BASE LEWIS-MCCHORD, Wash. -- I have answered my Nations call.\n\nThat is a line from the Airmans Creed that all U.S. Airmen have memorized, repeated countless times and been dedicated to honoring. When the orders came down to evacuate thousands of military personnel, civilians and millions of pounds of cargo from Afghanistan in August 2021, a call was made.\n\nU.S. Air Force Capt. Steven Pizzi, C-17 Globemaster III instructor pilot with the 7th Airlift Squadron, was one of those Airmen who answered that call.\n\nPizzi was an aircraft commander for one of the crews the 62nd Airlift Wing sent to Afghanistan and spent about three weeks working the mission, Operation Allies Refuge. On Aug. 14, Pizzi and his aircrew members were notified they would be leaving at 8 a.m. the following day.\n\nIt was very quick and we didnt really know what to expect so we were immediately checking the news to try and get a grasp on what was going on and what we were going into, said Pizzi. A lot of information wasnt known or was shrouded, so we [aircrew] were just patient and prepared to be over there for at least 30 days.\n\nThe next three weeks were uncertain and at times turbulent. Due to the urgency and severity of the situation at hand, many alerts for a mission were short-notice, the information on the specific mission was sparse and the duty days lasted upwards of 20 hours.\n\nI dont think anyone really knew what it meant when we arrived, but once everyone flew their first mission and we were able to bring some folks [Afghan evacuees] back; we all understood we were doing something important, Pizzi said. It didnt set in until after we all got back and had time to settle, but I think ultimately everyone felt very happy to be part of it and make the airlift happen. I feel very special to have been part of it.\n\nOn the missions Pizzi and his crew flew that transported passengers from the Kabul International Airport, Afghanistan, to a secondary location, many passengers approached them and expressed their appreciation for what they were doing.\n\nA lot of the passengers came up and thanked us for taking them out of there, Pizzi said. The intimate contact with the effects we were creating like taking people out of that situation that was the most rewarding part for me.\n\nIn total, more than 124,000 people were airlifted from Afghanistan. An airlift mission of this magnitude does not happen without a bit of hardship, however. At one of the secondary locations where evacuees were being taken, some wait times on the flightline to have the passengers offloaded and checked in took upwards of seven hours.\n\nThere were times when the support structures and services werent able to immediately come out because they were so overwhelmed with the amount of people coming in and so our crew and passengers would be in the aircraft for much longer than usual, Pizzi said.\n\nBecause of the scale and time constraints of the airlift mission, many crews made decisions on their own that they wouldnt have necessarily had to make under other circumstances.\n\nI think this whole operation was a successful example of when things fall apart, the crews made the right decisions, even in a life or death situation like the evacuation was, said Pizzi. When it came to the heat and some of the passengers being overwhelmed, that was the hardest part for us. Watching my loadmasters bear the brunt of the situation was very hard.\n\nThough much of the three weeks spent transporting passengers and cargo was turbulent, Pizzi understood the importance of this airlift mission and held the work of not only his crew, but of all who were involved, in high regards.\n\nId like to shout out not just the C-17 crews that were working downrange but also the support structures who were working just as hard, Pizzi said. The loadmasters and security forces Ravens that flew with us felt most of the heat from the situation and they got the job done. Id also like to shout out the medical personnel downrange, I cant imagine how they did their job. Id like to thank the command post at the secondary location we were at and our maintainers were phenomenal as well.\n\nFor more JBLM News, click here.\n\n"}