{"text": "JOINT BASE LEWIS-MCCHORD, Wash. -- The idea of the American Dream, a term first coined by writer and historian James Truslow Adams in 1931, is the belief that anyone, regardless of where they were born or what class they were born into, can attain their own version of success in a society in which upward mobility is possible for everyone. Airman 1st Class Zhe Yang, a fleet service technician with the 62nd Aerial Port Squadron, at Joint Base Lewis-McChord, took the idea of the American Dream and made it his reality.\n\nI came to the United States from China when I was 23 years old to finish my masters degree, Yang said. After I finished with my degree, I decided to stay in the United States and see what it had to offer because I had never been here before.\n\nAfter obtaining his degree in business administration from Thomas College, in Waterville, Maine, Yang moved to Los Angeles with his wife, Mengyu Chen, and worked for several years in the area before deciding to dedicate his life and service to the Air Force.\n\nWhen I was a little boy, I always felt that it would be so cool to wear the (military) uniform, Yang said. Joining the military felt like a dream that I always wanted to achieve, so I seized the opportunity when it came to me and enlisted last year.\n\nThroughout his initial enlistment process, Yang was a permanent resident card holder but had not yet obtained his U.S. citizenship; something that was on the forefront of his mind.\n\nWhen I said the words I am an American Airman during the Airmans Creed in basic training, I was not an American Airman, Yang said. I was an Airman, but I didnt have my citizenship yet. That was strange for me and I felt a little out of place because there werent many people around me who were in the same position.\n\nLess than a year after his graduation from basic training, Yang was able to proudly declare that he was an American Airman when he received his U.S. citizenship on April 8.\n\nThat was a huge moment for me because I had worked so hard to earn my citizenship and was around hundreds of other American Airmen who were just as proud as I was to say those words during our graduation, Yang said. And now (since obtaining citizenship) it was really true for me, I have more confidence and a new home.\n\nThis new home Yang spoke of is not only within a country where people try to make their dreams come true every day, but a new home with the Air Force. Yang said his new status and ability to serve has made him feel peaceful and has given so much to him and his wife.\n\nWhen I first learned he wanted to join the military, I was worried he would get into something dangerous, Chen said. But the more he talked about it, I saw his heart. I saw that this was something that was important to him and I supported him in every way I could.\n\nWith the support from his wife and his wingmen  and confidence in himself  Yang hopes commissioning as an officer is in the near future, and he will be able to help those around him on a different level. Yangs leadership within the 62nd APS believe he would be a great fit for the future of Air Force officers.\n\nAirman Yang is the Airman that you can go to who says yes every time with zero hesitation and always puts others wants and needs over his own, said Staff Sgt. Nikki Dunsmore, 62nd APS fleet services supervisor. He offers a different outlook on what it means to serve this nation and appreciate the opportunities given to you, which a lot of homegrown Americans dont see sometimes. His path to becoming an American Airman and U.S. citizen is one many future Airmen can learn a lot from.\n\nNow with a year of active-duty service under his belt, a new home and a newfound family within the Air Force, Yang looks back on his journey from China to the United States with pride, fondness and a bit of advice for those who may be in the same position he was.\n\nI believe everyone is born with a hand of cards; some people are born with a very good hand and some arent, Yang said. I wasnt born with a very good hand but I try my best to play well. I think the most important thing to remember for those who may be in the same position that I was is to always make the most of what you have and do your best to make your dreams come true.\n\n"}