{"text": "Army Reserve Lt. Col. Patrick L. Pollak relinquished command of 6th Battalion, 52nd Aviation Regiment (Theatre Fixed Wing Battalion), 11th Expeditionary Combat Aviation Brigade, to Lt. Col. Bryan P. Klatt in a telephonic change of command ceremony, June 8.\n\nDue to COVID-19 restrictions, the battalion adopted this alternative method of communication to allow immediate family, ceremony staff, and key personnel to attend the transfer of authority and responsibility from the outgoing battalion commander, Pollak, to the incoming battalion commander, Klatt.\n\n&#34;This is a unique battalion change of command and not one that I image either of you ever envisioned,&#34; said Col. Roger F. Deon, Jr., commander of the 11th ECAB and host of the ceremony.  &#34;But then again, nothing about the Lt. Col. Pollak career or the Lt. Col. Klatt career is necessarily typical.&#34;\n\nUnder Pollak&#39;s command, the 6-52 TFWB, based out of Los Alamitos, California, provided fixed-wing aircraft support to the Joint Operational Support Airlift Center, the airlift branch of the U.S. Transportation Command.  Missions in support of JOSAC included high-priority air transportation requests that could not be met by regularly scheduled military or commercial flights.  Over the last four years, the battalion was also fully engaged in Defender Pacific, a major U.S. Army exercise that focuses on partner-building throughout the Pacific Region.  And more recently, the 6-52 TFWB provided fixed-wing aircraft to transport much-needed medical and building supplies and personnel during the nation&#39;s fight against the coronavirus.\n\n&#34;Commanding 6-52 has been the most rewarding time in my 26 years of service,&#34; said Pollack. &#34;Thank you, Flying Dragons, for making that happen.&#34;\n\n&#34;The best of the best is right here,&#34; he added.  &#34;Your accomplishments are unbelievable.  From Sinai to Kuwait to our operations in the Pacific - we have achieved so much success together.  The 6-52 truly has some of the most gifted officers and [noncommissioned officers] I have ever seen.&#34;\n\nIn his remarks, Deon praised Pollak&#39;s leadership and his efforts in improving operations within the battalion.\n\n&#34;Lt. Col. Pollak, you truly are a person who establishes standards and does not compromise,&#34; said Deon.  &#34;You mentored, you coached, you trained, you led, and you have left 6-52 a strong and ready battalion. It goes without saying, and I say it on behalf of the entire U.S. Army Reserve aviation enterprise, we thank you for your service.&#34;\n\nDeon also congratulated Pollak on his selection for promotion to colonel and resident senior service college, and the Harvard Kennedy School fellowship.\n\n&#34;What an exclusive opportunity that rarely is afforded to a [troop program unit] senior leader,&#34; said Deon.  &#34;We look forward to your many successes and quick return.&#34;\n\nPollak&#39;s next assignment will be as the chief of staff for the Army Reserve Aviation Command before attending the Harvard fellowship for a year.  In his civilian capacity, he is a commercial airline pilot for United Airlines.\n\nIn his remarks to the incoming commander, Deon said he was positive Klatt would carry on the legacy of the Flying Dragons.\n\n&#34;It is a great honor to serve with the 6-52nd Theatre Fixed Wing Battalion,&#34; said Klatt.  &#34;I could not have asked for a greater blessing than to return to an aviation unit as unique as this one.&#34;\n\n&#34;I&#39;m eager to build on the success that the Soldiers and Lt. Col. Pollak have left me,&#34; he added.  &#34;The people here reflect the positive climate that has been set, and I am ready to embark on this new adventure with you all.&#34;\n\nBefore assuming command of the battalion, Klatt was a recruiting officer with the ARAC at Fort Knox, Kentucky.  Before that, he was the deputy commander for all U.S. Army Reserve Soldiers in the Marianas.  In his civilian capacity, Klatt operates his business, Maroon Analytics, as a financial portfolio manager.\n\nThis unique change of command is the most recent within the subordinate battalions in the 11th ECAB.  On April 27, 1st Battalion, 158th Aviation Regiment (Assault Helicopter Battalion), conducted the brigade&#39;s first telephonic change of command ceremony to bid farewell to Lt. Col. Derrick T. Hart and welcome Lt. Col. David. F. Kendall."}