{"text": "When most people think of a U.S. Army route clearance company, they likely think of large explosions and heavy-duty trucks clearing a dangerous area. But, what many do not think of is the immense amount of talent the Soldiers in these companies have outside of conducting route and area clearance operations.\n\nThese skills include completing horizontal construction projects.\n\nFor a team of Soldiers of the 806th Route Clearance Company, 111th Theater Engineer Brigade, the past three months have been spent in Iraq working on construction projects. Most recently, these troops have been tasked with repairing gravel yards on Erbil Air Base.\n\nThe current project that these Soldiers are working on consists of removing river rock from the lot and replacing it with limestone that allows better traction for both Soldiers walking and vehicles driving on the yard.\n\nThe limestone is a softer stone that will break up easier and in return lock in to itself when packed down, said Sgt. 1st Class Stephen Jones, the Noncommissioned Officer in Charge of the project. This creates a solid surface that can still be packed down and have a smooth top layer that vehicles will not sink into and get stuck. At the same time, it allows for drainage through the limestone that does not create a muddy surface.\n\nOne of the challenges that was faced often prior to the limestone being installed was heavy trucks would tend to get stuck in the river rock, forcing another heavy vehicle to come and attempt to recover the stuck truck.\n\nBy installing the new limestone, the Soldiers know that they are making a difference and that their work will be appreciated for years to come.\n\nThe Soldiers are motivated and morale is high most of the time, said Jones.  We all have those days where nothing seems to go right, but we have a good crew that works well together and the bad days dont tend to last long.\n\nEven when the bad days do come, the Soldiers remember how far they have come since the beginning of the deployment and what these types of projects offer them professionally and personally.\n\nThese projects have allowed our newer Soldiers an opportunity to gain experience on different pieces of equipment, as well as become more proficient on the equipment they prefer, said Jones. We truly do enjoy operating the variety of equipment it requires to complete these projects.\n\n"}