{"text": "FORT DEVENS, Massachusetts  The 505th Signal Brigade currently has two of their Tactical Installation Networking- Enhanced (TIN-E) units providing network infrastructure support to the Fort Devens Garrison Command.\n\nDuring this fiscal year, the Fort Devens Garrison Command received an estimate to complete the installation of the internet technology structure of building 644, which was approximately $1 million dollars.\n\nCommand Sgt. Major Jamie M. Rogers, Garrison Command Sergeant Major, said the garrison commander reached out to the 505th Signal Brigade after receiving information about a similar type of project that was being\n\ncompleted by the 505th Signal Brigade at the Mission Training Complex (MTC) Fort Leavenworth, Kansas, ultimately igniting the troop labor assistance.\n\nThe troop labor provided from the 505th Signal Brigade will save Fort Devens, an Army Reserve installation, approximately $600,000 in labor alone, she said.\n\nThis is a major savings and will enable other projects to be completed during this fiscal year, Rogers said. Upon completion, the building will add over 62 office spaces, five classrooms, and several additional work areas to support the Army Reserve.\n\nThe project to install, test and provide remediation and maintenance to circuits and wiring was broken down in three different iterations of proficient and qualified Soldiers from 812th and 820th TIN-E companies.\n\nLed by Staff Sgt. Manuel Hernandez IV, 820th TIN platoon sergeant, a team from the 812th and two teams from the 820th were sent to execute and complete different portions of the project to ensure its overall completion.\n\nPlanning for this mission began back in April with a site-visit of Fort Devens, Hernandez said.\n\nHernandez explained how a team was sent out to determine mission requirements and capabilities to allow the TIN-E to engineer and identify the necessary work requirements, specific core competencies, an estimated bill of materials, and personnel requirements.\n\nBy utilizing Army Reserve Soldiers on annual training, the only added cost to the Army is the acquisition of Layer 1 and Layer 2 networking hardware and equipment, he said.\n\nHernandez further explained how utilizing TIN-E units reduces the cost down to roughly less than one-hundred thousand dollars and can provide a crew of 50-plus personnel and a timeline of six weeks.\n\nThe mission, in addition to the cost savings, ultimately provides the most valuable, real-world training possible for Soldiers to prepare them for real world theater operations while deployed.\n\nThe mission highlights the interoperability of the modular signal force structure as it relates to the TIN mission and deployability, said Staff Sgt. Aerik B. Santillan, Cable Systems Installer and section chief for the 812th TIN-E Company.\n\nFor the 812th TIN-E, this mission serves as a validation exercise for their upcoming deployment to the U.S Central Command area of operations.\n\n1st Sgt. Enrique De Reza, 812th TIN-E, shares that the best part of conducting a mission like this is the ability to work with one of their sister TIN-E units.\n\nThe overall wealth of experience that we can share and learn from one another helps to bridge that gap and maintain off-line communications so that we can continue to better ourselves and share training and real-world experiences, he said."}