{"text": "FORT BRAGG, N.C.  Paratroopers from 3rd Brigade Combat Team, 82nd Airborne Division conducted a joint air assault operation using MV-22B Osprey tilt rotor aircraft during Panther Storm, a 4-day Mission Readiness Exercise conducted November 3-6.\n\nThis was the first known time the Division has employed the Marine Aircraft for Joint Forcible Entry operations during a training exercise.\n\nThe unique aircraft offers the ground force commander increased range and air speed over traditional rotary-wing platforms, allowing for more long-range assault, support, and troop insertion options.\n\nWe are looking into vertical lift capability for JFE operations in order to get forces in the deep fight much faster, said Col. Eugene Ferris, commander of the 3rd Brigade Combat Team. As we look to penetrate and get forces into the deep fight, it is important to hone our skills as a joint force and utilize all assets available.\n\nThe operation involved three Ospreys, flown by the VMM-261 Raging Bulls, a Marine Corps Squadron based at Marine Corps Air Station-New River in Jacksonville, N.C. The aircraft air assaulted one dismounted troop from 5th Squadron, 73rd Cavalry Regiment as a part of the exercise.\n\nMarine Capt. Victor Bowen, an MV-22B pilot, spoke about the planning process and the great learning opportunity.\n\nAs a junior aircraft commander, this was invaluable training to plan and execute a joint mission with the Army.\n\nCapt. Katrina Herrera, also an MV-22B pilot agreed, adding that it was great integrating with the ground force commander to support the scheme of maneuver.\n\nThe soldiers were a pleasure to work with and I am glad I got to learn more about how a brigade combat team operates and the unique capabilities they also bring to the fight.\n\nAs the nations Immediate Response Force, joint training like this it is vital for the Division to plan, integrate, and train in joint environments as often as possible.\n\nIt will take detailed planning and interoperability across all the branches of service to add the most lethal means to the fight. Ferris said.\n\nThe Osprey is an American tiltrotor military aircraft with both vertical takeoff and landing capability. With its rotors in vertical position, it can take off, land, and hover like a helicopter. Once airborne, it can convert to a turboprop airplane.\n\nThe United States Marine Corps is the lead service in the Ospreys development. The Marine Corps variant is an assault transport for troops and equipment that can operate from land and sea.\n\nThe MV-22B can transport up to 24 passengers and can travel up to 280 knots per hour. It has a nautical mile range of 900 kilometers and its reach capability provides the ground forces an opportunity to seize key objectives in a timely manner.\n\nArticle written by Capt. Alyssa Timms.\n\nFor more information about the 3rd Brigade Combat Team, contact Maj. Deirdra Johnson at deirdra.d.johnson.mil@mail.mil\n\n\n\n"}