{"text": "FORT KNOX, Ky.  Brig. Gen. Miguel Castellanos, a native of Fresno, California, was promoted to the rank of major general as he assumed command of 84th Training Command during a ceremony held at Fort Knox Oct. 31.\n\nMajor Gen. A.C. Roper, deputy commanding general of U.S. Army Reserve Command, served as the reviewing officer and hosted the ceremony, which was attended in person and virtually by friends and associates of Castellanos.\n\nWith his wife of 32 years, Stacy, also in attendance and long-time Army spouse, Castellanos has supported family readiness groups over the years and also served as a federal employee, assisting Army Reserve organizations through mobilizations and reintegration programs. They have three adult children, all who were able to experience Army life moving numerous times across the United States and overseas. All three reside in Fresno.\n\nCastellanos received a regular Army commission as an infantry officer in 1987 from California State University of Fresno. He served as commander at each level from company to brigade as a civil affairs officer. His service includes a deployment in support of Operations Desert Shield/Storm, Operation Restore Hope and United Nations Operation in Somalia II (UNOSOM II).\n\nMost recently, Castellanos served as deputy director for operations with U.S. Africa Command in Stuttgart, Germany and previously as deputy commanding general for Combined Joint Task Force Horn of Africa (CJTF-HOA) serving in Mogadishu, Somalia. As the senior U.S. military officer, he advised on all DOD efforts related to defeating al-Shabaab, training the Somali National Army and implementing Security Force Assistance.\n\nAs commanding general, he leads 84th Training Command in executing combat support training exercises through six subordinate divisions and owns five mission training complexes, ensuring units from across the Army Reserve are trained and ready for deployment.\n\nCastellanos said he considers himself honored and blessed to still be serving.\n\nTo view the entire ceremony, visit the 84th Training Command&#39;s official Facebook page HERE.\n\n"}