{"text": "FORT SHAFTER  The 8th Human Resources Sustainment Center, 8th Theater Sustainment Commands casualty operations division conducted its first ever training exercise to assess their casualty reporting capabilities within the Indo-Pacific Command area of operations, from Jan. 17-21. The training exercise simulated wartime conditions for the 8th HRSC for Soldiers and leadership to rehearse casualty reports to brigade and division level echelons.\n\nThe 3-day exercise consisted of battle drills designed to increase the human resources Soldiers proficiency using the Defense Casualty Information Processing System, the single authorized system for casualty reporting in the Department of Defense. The unit also utilized excel spreadsheets to report casualties within a 12-hour window via email.\n\nSgt. Jonathan Sonnier, a human resources specialist from the casualty operations division, 8th HRSC, played a key role in helping the team achieve success by processing casualty packets in DCIPS, which helped him learn more about his job.\n\nI came from an infantry unit where I was working in a lower echelon creating packets and field trainings, but didnt know where they were going, said Sonnier. So to be here in this unit with my team, I get to actually see the full scope on where these packets are going and understand the process that goes behind it.\n\nThe casualty operations division simulated a full Theater Casualty Assistance Center using two floors of their office building on Fort Shafter to complete the training throughout the week. Brigade level operations personnel worked on the first floor with division level troops situated on the top floor. The exercise provided a learning experience for the human resources professionals to hone the skills needed in a deployed environment.\n\nChief Warrant Officer 3 Alimameh Fatty, casualty operations division chief, supervised the teams progress as they collaborated with one another to successfully conduct operations normally applied in a theater of war.\n\nTheres not too many times that we get a deployment opportunity as a HRSC to do our job now a day, so the next best thing for us is to hone our proficiency in our battle drills while in garrison, said Fatty. Whenever the balloon goes up we will be ready to execute.\n\nHRSC trained their human resource professionals to remain technically and tactically proficient in all aspects of casualty reporting. The unit conducted drills that are crucial in a combat theater for the accountability of Soldiers, Department of the Army Civilians, and contractors. The Soldiers of the HRSC displayed their commitment to remain always ready when called upon and showed how the 8th TSC leads teams at every echelon.\n\n"}