{"text": "JOINT BASE SAN ANTONIO-FORT SAM HOUSTON, Texas (April 7, 2023) -- Members from the 923rd Contracting Battalion and Mission and Installation Contracting Command at Fort Riley, Kansas, gathered for the ceremonial uncasing of the battalions colors April 6 following its redeployment in support of Operation Assure, Deter and Reinforce.\n\nThe battalion headquarters element deployed in August 2022 to Mihail Kogalniceanu, Romania, and Jasionka, Poland, to provide theater contracting support as part of the U.S. Secretary of States responseto the invasion of Ukraine.\n\nRelated video: 923rd CBN uncasing ceremony\n\nLt. Col. Randy Garcia, the 923rd CBN commander, and Sgt. Maj. Keita Lyles, the battalion sergeant major,uncased the colors during the ceremony before members of the unit and installation contracting office as well as leaders from the Army Contracting Command, Mission and Installation Contracting Command and 418th Contracting Support Brigade viewing virtually.\n\nWe hastily deployed and established a regional contracting center in MK and three new forward operating sites. Each site supporting the (U.S. European Command) commander&#39;s first priority - deter Russian aggression, Garcia said. Your actions exceeded mission requirements, increased morale and fostered an environment for superb training, relationship building and improved quality of life. Outstanding performance.\n\nAmong the deployed accomplishments cited by the battalion commander were the closeout of contract relocating 1,000 Soldiers and $25 million in equipment; simultaneous support of the 1st Infantry Division and 101st Airborne Division; and providing base life support services to more than 2,500 Soldiers. In addition to providing contracting oversight and acquisition advice to all U.S. and NATO allies, battalion Soldiers were also responsible for managing a contract portfolio valued at more than $300 million with over 3,000 activated services throughout Bulgaria, Lithuania, Poland, Romania and Turkey through the Logistics Civil Augmentation Program.\n\nGarcia went on to thank the family members remaining behind for maintaining the readiness in their homes allowing Soldiers to focus on mission execution. He also recognized leaders making up the rear battalion who continued to prove contract support at Fort Riley while the unit was deployed.\n\nAbout the MICC\n\nHeadquartered at Joint Base San Antonio-Fort Sam Houston, Texas, the Mission and Installation Contracting Command consists of about 1,300 military and civilian members who are responsible for contracting goods and services in support of Soldiers as well as readying trained contracting units for the operating force and contingency environment when called upon. As part of its mission, MICC contracts are vital in feeding more than 200,000 Soldiers every day, providing many daily base operations support services at installations, facilitate training in the preparation of more than 100,000 conventional force members annually, training more than 500,000 students each year, and maintaining more than 14.4 million acres of land and 170,000 structures.\n\n"}