{"text": "JOINT BASE SAN ANTONIO-FORT SAM HOUSTON, Texas (Aug. 3, 2021) -- Leaders from the 923rd Contracting Battalion uncased their organizational colors July 30 at Fort Riley, Kansas, signaling their units return from deployment to Iraq in support of Operation Inherent Resolve.\n\nLt. Col. Randy Garcia and Sgt. Maj. Jason Martinez uncased the colors during a ceremony following the units nine-month deployment providing operational contract support to Combined Joint Task Force-OIR and Special Operations Joint Task Force-OIR.\n\nRelated: 923rd CBN leaders case colors for deployment\n\nSoldiers managed four regional contracting offices comprised of Army, Air Force and Defense Contract Management Agency personnel in Jordan, Iraq, Kuwait and Syria. They executed 384 contract requirements valued at more than $100 million and administered a $3.4 billion contract portfolio.\n\nGarcia, the 923rd CBN commander, applauded the support of families back home and those who stepped up to lead the rear detachment for the success of their mission.\n\nThats what makes our Army strong, makes our Army different - our people. Thats what enables us to do everything that we do. We are most grateful for our family and friends, MICC-Fort Riley and the community for your love and support through this nine-month deployment, he said before next addressing his fellow deployed Soldiers. Welcome home team. You performed on point for our nation, wearing the jerseys of the greatest team on earth. Representing with dignity, respect and honor, youve done everything your nation has asked of you.\n\nThe 923rd CBN is aligned to support the 1st Infantry Division, the Fort Riley Garrison and tenant activities. The deployment marked the battalions second since its activation in 2014.\n\nAbout the MICC\n\nHeadquartered at Joint Base San Antonio-Fort Sam Houston, Texas, the Mission and Installation Contracting Command consists of about 1,500 military and civilian members who are responsible for contracting goods and services in support of Soldiers as well as readying trained contracting units for the operating force and contingency environment when called upon. As part of its mission, MICC contracts are vital in feeding more than 200,000 Soldiers every day, providing many daily base operations support services at installations, facilitate training in the preparation of more than 100,000 conventional force members annually, training more than 500,000 students each year, and maintaining more than 14.4 million acres of land and 170,000 structures.\n\n"}