{"text": "WASHINGTON -- On a clear September morning in 2001, Manal Ezzat walked into a busy hallway at the Armys Pentagon headquarters when she heard what sounded like a helicopter crashing into the building.\n\nA plume of smoke and dust then unfurled from the other end of the hall as she felt the floor kick.\n\nMen in suits and women in heels pushed toward the exits. Uniformed Soldiers moved briskly while trying to remain calm. As she descended down the steps, nervous chatter echoed in the stairwell.\n\nEzzat, then an Army Corps of Engineers project manager, had been heading toward the storage room 200 feet away to gather office supplies before she felt the ground shake.\n\nIf she had left two minutes earlier, Ezzat would have been enveloped by the smoke and dust.\n\nTwo minutes earlier, she could have joined the 75 Soldiers and Army civilians who disappeared into the fire.\n\nBut she didnt stop to ponder her own mortality after American Airlines Flight 77 careened into the west side of the Pentagon that day, killing a total of 184 people, after terrorists hijacked the aircraft.\n\nShe hustled back to her office and grabbed her purse. She hurried by the desk of her friend, administrative assistant Evelyn Bush. Come on we have to go -- now! Ezzat recalled saying, remembering she had seen the aftermath of the World Trade Center attacks on a TV monitor just minutes earlier.\n\nIn the days following the tragedy, much of the Pentagon resumed operations. But Ezzat remained shaken by the attack.\n\nShe shuddered when she heard loud noises. She could still smell the smoke and the terrible burning smell. But most of all she remained haunted by the uncertainty of not knowing whether another attack could strike.\n\nPentagon officials deliberated over what to do next. Should the west end be rebuilt? Should they construct a caf or replace the office space? Could the men and women in the Pentagon heal after such a devastating blow to their security?\n\nEzzat, following meetings with a team of architects and planners, had her own ideas to help the renovation efforts. She decided that she would not be overwhelmed by the attack that took away her feelings of security and peace of mind.\n\nShe held the advice of her friend and former supervisor, George Lea, close to her heart. Lea, a former Navy pilot, taught his aviation students at Naval Station Norfolk, Virginia to face their fears head on when they encounter a mishap. He told Ezzat to do the same.\n\nYou can&#39;t let an evil act like this overcome you or overwhelm you, she said. You have to carry on. You just can&#39;t let one evil act destroy all the good that thats in humanity.\n\nShe and the Corps of Engineers would erect a pillar of faith in the place of terror.\n\nThey would build a chapel 100 feet from the point of impact.\n\nThe human heart\n\nIn the midst of the panic during the evacuation, Ezzat had lost her hijab, the sacred veil Islamic women wear upon their head to maintain their privacy and modesty. A uniformed servicemember abruptly stopped when he saw the hijab laying on the tile. Although he looked visibly rattled by the days events, the man lifted the hijab off the floor and carefully placed it on Ezzats head tying it neatly over her dark hair.\n\nI don&#39;t know who that person was, Ezzat said. But he cared enough to help me keep my posture, my composure. And  that meant the world to me.\n\nAfter 15 minutes, Ezzat and Bush made their way to the exits. They quickly climbed into Ezzats vehicle parked in front of the helicopter pad facing the damaged side of the building. With much of the roads on lockdown, the women stopped at a bank in Arlington to phone their families. Their cell phones had no signal.\n\nAs Ezzat scrambled over what to do, she gazed upon the Pentagon, which sat in full view.\n\nThe cement walls finally succumbed to the impact, crashing onto the helicopter landing pad below. Smoke funneled into the clear blue sky.\n\nDebris spilled onto the section of parking lot where her car had earlier been parked. Once again she realized that may have escaped harm.\n\nSo shaken by the attack, Ezzat had forgotten to recite the final four of five prayers for the day. She considered herself a moderate practitioner of the Islamic faith, but she read the Koran every day. She celebrated Islamic holidays and fasted.\n\nEzzat returned to her house in Fairfax, Virginia, by noon. But she had not yet heard from her husband, Hashem. He had been frantically trying to reach his wife, but could not as cell phone service and landlines had shut down.\n\nAn insurance salesman in the Maryland suburbs of Washington, D.C., Hashem had fainted from the stress of the moment. Co-workers had to drive him back to Fairfax.\n\nHusband and wife finally embraced. But they could not relax until 8 p.m. that evening, when their 8-year-old son, Mostafa, returned from his school in Virginia that had been in lockdown.\n\nCenter of solitude \n\nIn the corner of the Army headquarters at the Pentagon, past the encased rows of photographs, plaques and tributes of past Army heroes, lies a chapel.\n\nEach day Catholics, Hindus, Protestants, Buddhists or worshippers of other faiths gather inside the space, adorned with stained glass and pentagon-shaped windows behind a wooden altar.\n\nEzzat, who led the architectural design team of the Pentagon Memorial Chapel, positioned the seating in a way that it would be flexible and easy to bring followers of all religions to position the chapel to suit their needs.\n\nIn this way, Ezzat could stand against the terror that spewed into the Pentagon 20 years ago.\n\nEmbers of the collision still burn within her. She admits the memory likely will never leave. But through faith, she believes, it has brought healing to many of the 30,000 that commute and work at the Pentagon every day.\n\nWhere does anybody go when they are scared; when they are grieving? she said. They go to a place of faith, right?\n\nWe just thought, OK let&#39;s bring everybody of different faiths in that location to continuously give prayers and give psalms to the fallen heroes at the Pentagon, and always remember them in good spirits. It was the perfect fit.\n\nAs part of the Pentagons larger effort to restore and rebuild the damaged western end known as Project Phoenix, contractors worked day and night in the ruins for one year.\n\nBefore joining the Corps in 1995, working at the Pentagon had been a fascinating dream of Ezzat since she first gazed upon the sprawling structure as a wide-eyed 8-year-old child in 1969. She had pursued becoming an architectural designer since she played with Lego sets in her familys house in Cairo.\n\nShe later earned a masters degree and PhD in civil and structural engineering before landing a position with the Corps of Engineers. In the Army and in the company of U.S. Soldiers, she found comfort and acceptance. They didnt see my hijab or that I was different, she said. She said she couldnt have imagined what would happen six years later.\n\nEzzat, an Egyptian woman with dark, inquisitive eyes, recalled the moment that she surveyed the point of impact for the first time, about two months after the tragedy.\n\nShe could still smell the smoke of fire and human decay.\n\nIt was such an eerie feeling, she said. I&#39;d rather not remember, it was so bad.\n\nShe admits she does not know how she could block out the terror or the feelings of panic. She didnt know how she could work in the shadow of the place where so many of her colleagues had fallen. Rather, she focused on the work and through collaborating with her team of architects she drew strength.\n\nDespite her fear she continued to work on the planning and the design process so that Muslims, Christians and another religions could freely worship alongside one another. She feared the perception of Islam may be tarnished because of the tragic events, which claimed the lives of nearly 3,000 people in New York City.\n\nIslam was hijacked that day, she said. Just like the airplanes were hijacked. So I was just determined to stand where I was to serve the servicemen of my country. And to  change or clarify the image of Islam in the eyes of the world.\n\nThe chapel officially opened after a dedication ceremony held one year after 9/11. Shortly after that ceremony, Ezzat left the Pentagon with the memory of her fallen friends still fresh in her mind.\n\nThe Army had become her second family, Ezzat said on a summer morning in July. She officially retired from the Corps in August after more than 26 years, most recently as a program manager for Defense Department schools.\n\nShe had packed the photos and mementos of the officemates she had grown close with, including the group photo of her office at Army headquarters two decades ago.\n\nShe returned to the Pentagon one final time in June to talk about her six joyous years working there, and the difficult 12 months that followed 9/11.\n\nI knew them all, Ezzat said of the 75 Army Soldiers and civilians who died that day. Every single one of them was my family.\n\nAs a Corps liaison overseeing the renovation of the Pentagon prior to 9/11, Ezzat met with each new tenant at the Army headquarters. She got to know many of them through meetings and later interactions. One such meeting on the morning of Sept. 11 with a female Army civilian had been postponed. The meeting would have been inside a room sitting within the point of impact.\n\nMany of the people she met could be counted among the fallen.\n\nLt. Col. Jerry Dickerson greeted everyone he met with a spirited hello and smile. The 41 year old had been sitting at his desk at the moment of impact on 9/11. Friends said his concern for others made him stand out among his peers. Dickerson left behind a wife and two children.\n\nIt just killed my heart, Ezzat said of Dickersons passing.\n\nLea grew close with Ezzat during his three years as the director of engineering and construction from 1998-2001. Lea, who later retired from the Corps in 2020, contributed to the massive 20-year renovation effort which included the reinforcement of the outer perimeter of the Pentagon. The Corps placed steel so the structure could withstand an adversarial attack on the homeland.\n\nLea oversaw the replacement of more than 1,000 windows with 2,000-pound, blast resistant ones, which Ezzat also helped coordinate.\n\nIn a fortunate twist of fate, Flight 77s path would diverge on the only reinforced section of the Pentagon on that morning in 2001.\n\nThe reinforcements likely saved hundreds, if not thousands of lives, Lea said. Lea shudders to think what could have happened had another section of the building been struck.\n\nLea left the position to serve in the Corps Baltimore District about a month before the tragedy. Lea had just crossed the Key Bridge to take his wife to a medical appointment, when he saw the smoke billowing into the sky.\n\nLater that evening, he called Ezzat, giving her the advice that would help her carry on.\n\nShe has a strong inner strength, Lea said. She&#39;s confident in her abilities. Anybody I guess can have their confidence shaken.\n\nBut she did get back into [work]. She was concerned about the people in the building. She knew most of them that didn&#39;t make it that day. But  she has a resilience.\n\nRelated links:\n\nPentagon quilts, Army memorial continue to pay homage to 9/11 victims\n\n20 years later: Search and rescue Soldiers reflect on 9/11\n\nThe Army remembers 9/11\n\n2021 Pentagon 9/11 Observance Ceremony\n\nArmy News Service\n\nARNEWS archives\n\n"}