{"text": "FORT STEWART, Ga.  He loved 3rd ID; he loved Kelley Hill; he loved the organization, remembers Lt. Col. Leon Matthias of Sgt. 1st Class Alwyn Cashe. He bled it through and through.\n\nWith the upcoming ceremony to present the Medal of Honor to Cashes family, former and current 3rd Infantry Division Soldiers remember him as a true Dogface Soldier who embodied the divisions values.\n\nWhile serving as a platoon sergeant in the 1st Battalion, 15th Infantry Regiment, Cashes vehicle was struck by a roadside bomb near Samarra, Iraq, on Oct. 17, 2005. Dazed and wounded, Cashe retrieved seven Soldiers and an Iraqi interpreter one-by-one from the burning vehicle, receiving burns himself on nearly 72% of his body. Three of those rescued ultimately perished days later at Brooke Army Medical Center in San Antonio, Texas. Alwyn Cashe was the last, succumbing to his wounds on Nov. 8. He posthumously received the Silver Star Medal for his heroic actions.\n\nAlthough it has been 16 years since his death, stories of Cashe and his legacy live on with those who knew him.\n\nWhile most stories about Cashe focus on his heroism in the face of danger, Matthias, his former platoon leader and witness to the events of that day, fondly recalls a funny and telling moment he had with his then-platoon sergeant.\n\nThe 1st Bn. 15th Inf. Rgmt., 3rd Brigade, 3rd ID, was stationed at Kelley Hill on Fort Benning, Georgia, while the rest of the division was headquartered four hours away on Fort Stewart. While deployed, the brigade was assigned to support Task Force Liberty and received a different combat patch than the familiar blue and white-striped 3rd ID insignia.\n\nMatthias, then a young lieutenant, was excited to sew a combat patch on his uniform after months in Iraq. He chose to wear the Task Force Liberty patch instead of that of 3rd ID. The decision to wear the patch of another organization did not sit well with Cashe.\n\nWell, I think I earned this combat patch, and they said we could wear it, Matthias retorted to his platoon sergeant.\n\nHes like sir, youre not coming on patrol wearing that patch; we are wearing a 3rd ID patch, Matthias remembers.  Matthias continued to protest, but it fell on deaf ears.\n\nThe next thing he knew, Matthias heard Cashe say get him and suddenly the Soldiers of the platoon piled on Matthias and ripped off the Task Force Liberty patch.\n\nThis is the unit you deployed with, this is the patch youre going to wear for your deployment, and he was truly adamant about it, said Matthias of Cashe.\n\nCommand Sgt. Maj. Quentin Fenderson, the 3rd ID senior enlisted advisor, said Cashes pride in his unit was well earned.\n\nThird Brigade was different, said Fenderson, who served in the brigade alongside Cashe. We felt like we were the underdogs. Every other year we were deploying.\n\nSo, everybody on Kelley Hill knew each other, and I think that was one of the things that separated us, Fenderson continued. It was a family. We shared failures. We shared success.\n\nOne memory of Cashe still resonates and guides Fenderson to this day.\n\nFenderson said the brigade went to the Joint Readiness Training Center together prior to their deployment to Iraq. He recalls Cashes company forgot to bring antennas for their vehicles.\n\nHere is Sgt. 1st Class Casheat the time the platoon sergeanthes walking around because hes got all these relationships throughout the brigade, said Fenderson. Hes walking around borrowing antennas from people to make sure that his entire company got these antennas.\n\nSome leaders today would have sent somebody else to do that, said Fenderson. But he took it upon himself.\n\nFenderson remembers laughing at him at the time and asking, What are you doing out here?\n\nHes just like, hey, gotta make it happen, said Fenderson. Thats the type of person he was.\n\nFor Fenderson, this story highlights how much Cashe cared about ensuring that his Soldiers could accomplish their mission.\n\nWhen 3rd Brigade deployed to Iraq, parts of the unit were separated out across the country, so news of the attack on Cashes vehicle took some time to reach everyone.\n\nI just remember that when the information came out, they didnt talk about who it was, Fenderson continued.\n\nAfter the family was notified, an information blackout was lifted and Soldiers throughout the brigade found out it was Cashes team, said Fenderson.\n\nEverybody, I think, just felt it, he said. When Cashe passed away, it hit us hard because that really was a brother.\n\nFenderson said that no one was surprised when they found out Cashe performed heroically in combat.\n\nNobody expected anything different, said Fenderson. Thats just how he was.\n\nThis well-deserved level of recognition for his courage and sacrifice has been highly anticipated by Soldiers of the 3rd Infantry Division-both past and present, said Maj. Gen. Charles D. Costanza, the commanding general of the 3rd ID.\n\nCostanza previously commanded the 3rd Brigade, 3rd ID in which Cashe served and worked alongside many Army officials and the Cashe family to make this event a reality.\n\nSgt 1st Class Cashe is an example of what being a Dogface Soldier is all about  selfless service.  The special relationship we developed with the Cashe family while preserving his memory and telling his story is truly remarkable. I am incredibly proud that this time has finally arrived; for him, our Army and his family,&#34; he said.\n\nFor the Soldiers who were with Cashe when his vehicle was struck, his legacy as a consummate professional and caring leader was established long before that day.\n\nDouglas Dodge, who has since retired from the Army, served as a squad leader under Cashe and was rescued by him during the attack that lead to Cashes death.\n\nDodge said that prior to the attack, their platoon worked long hours and had few days off. The team was worn out and on edge with each other.\n\nDodge remembers having a strong disagreement with Cashe while in Iraq, although the specific details are fuzzy years later.\n\nFollowing the argument, Dodge went to see their first sergeant, who sat him and another squad leader down and explained how much Cashe protected his Soldiers from unnecessary work, even if they didnt know it.\n\nYou guys dont understand what he does every day to try to give you guys time just to even have an hour for yourselves, Dodge remembers his first sergeant saying.  Hearing this from someone above their platoon resonated with Dodge.\n\nIt showed me how much he really did do for us and took care of us without us even knowing, Dodge said. It wasnt in our faces. It wasnt like look what I did for you guys. It was just unspoken. He just did it because he cared.\n\nI wish I had known that sooner. I think I would have matured faster if I had really realized and understood the responsibilities he had been undertaking and the things he did for us, Dodge continued.\n\nDodge carried this lesson from Cashe forward with him throughout his career as a noncommissioned officer.\n\nI took care of my Soldiers before, but I dont think that I had the level of compassion at that point in my career that Sergeant Cashe did, Dodge said. Afterwards, I really gave my Soldiers every little bit of what I had.\n\nDodge said the effectiveness of his leadership style was apparent as many of his Soldiers later reached out to thank him for his mentorship and guidance.\n\nThat was only because I started investing myself into my Soldiers as much as [Cashe] did, he said.\n\nThese memories, and so many others, live on with the Soldiers who knew Cashe. A crape myrtle tree grows in memorial of Cashe amidst 468 others at the Warriors Walk on Fort Stewart. The trees mark the exceptional valor and honor of each of the units fallen Dogface Soldiers.\n\nOn my run days I walk through those trees, said Fenderson. I go to see those who died that day and make sure their trees arent overgrown.\n\nThe pain of the loss of his brothers-in-arms remain with him to this day.\n\nWhen I walk by those trees, its personal because me and the ones who are left from 3rd Brigade are the ones who knew them, said Fenderson.\n\nThe memory of Cashe continues as a beacon for the Soldiers of 3rd ID, who honored him last year by dedicating the units most prominent memorial garden and event space in his name. Previously known as Marne Garden, a ceremony involving numerous Cashe family members, Army leaders and veterans took place May 20, 2021, and the garden officially became known as Sgt. 1st Class Alwyn C. Cashe Garden.\n\nIt has been five years since 3rd Brigade deactivated during an Army drawdown of personnel, but the units motto still faithfully represents Soldiers like Cashe, said Fenderson. Not Too Fancy, Just Tough.\n\n"}