{"text": "FORT KNOX, Ky.-- As he readies for his picture to be taken, a smile stretches from ear to ear.\n\nThe commissioned officer stands tall with his shoulders drawn back, chest slightly puffed, uniform coat displaying his ribbons and medals. In his hands he grasps a prestigious award unknown to most.\n\nU.S. Army Maj. Adam Kama, deputy judge advocate for the 1st Theater Sustainment Command, stands in front of Fowler Hall at Ft. Knox, Kentucky as the recipient of the Keithe E. Nelson Distinguished Service Award.\n\nAccording to the American Bar Associations website, the award is presented for authorship of exceptional, published, literary efforts which advance and serve interests and understanding of military law or enhance status of lawyers in the Armed Forces.\n\nKama was selected for his publication of Fair Play and Justice: The Court-Martial of Jackie Robinson.\n\nAccording to Kamas publication, Jackie Robinson is most notably known as the first African American to play in a major league baseball game. During his 10-year career, Robinson would go on to win Rookie of the Year, become a six-time All-Star, and a World Series Champion. This illustrious career would lead him to becoming the first African American to be inducted into the MLB Hall of Fame and have his jersey number retired amongst the league.\n\nBefore he went on to break color barriers in the MLB, Robinson broke color barriers in the U.S. Army by commissioning as a second lieutenant, at a time when many African Americans were denied admission into Officer Candidate School. In August 1944, Robinson found himself in a courtroom for a court-martial that accused him of insubordination and disrespect under the Articles of War, which he was later acquitted.\n\nIt wasnt the acquittal that captured the attention of Kama, but rather the lack of information surrounding the case that would lead him on a decade long journey to bring clarity and accuracy to the case.\n\nDuring his time as a junior captain, while leading a class, Kama made the decision to fully commit to finding the history behind the court-martial.\n\nI did a Leaders Professional Development class for my JAG office and I did that on Jackie Robinson, Kama said. I did that because I found whats called, the record of trial, which is the transcript of the court-martial, Kama said.\n\nHe was one of the first judge advocates to find this transcript because of the complexity of historical filing. Fascination over the case grew as Kama collected information from a myriad of sources surrounding this case. During his meticulous search, Kama discovered an aspect which he believed would bring closure to a family involved in the case.\n\nRobinson had two defense attorneys, 2nd Lt. William A. Cline and 1st Lt. Robert H. Johnson, during his court-martial. The majority of the articles written had accredited Cline as the driving force of Robinsons acquittal, but in 1997, it was determined that Johnson was proven to be instrumental to the case going in favor of Robinson. This historical inaccuracy only intensified Kamas obsession with the case.\n\nAfter reviewing his research material, Kama said he often questioned why there wasnt any information on Johnson.\n\nIve got interviews from Cline over the last 20-30 years, but what about Johnson, he said.\n\nKama spent his lunch breaks and downtime to resolve that missing link. While compiling information he believed hed found the answer.\n\nI knew about Cline, Kama said. He lived to be 101 years old and died in 2012. Cline allowed for the legend of Robinson to grow around him with age and portrayals in movies. This is in contrast to Johnson who died in 1951 at the age of 36 years old.\n\nJohnson left behind two children who Kama said he sincerely wanted to contact in hopes to gather more information. It was during this interaction Kama found a new purpose in providing accuracy and integrity into the case.\n\nI asked them if they knew their father represented Jackie Robinson at his famous 1944 court-martial, they had no idea, Kama said.\n\nWith over 10 years of research ranging from biographies, autobiographies, articles, and interviews, Kama was able to present all of his data to Johnsons children who didnt have a chance to know their father since he died when they were young children.\n\nThat was important for me to do, to kind of share that family legacy, Kama said.\n\nLater that year, Kama would be a part in bringing that familys legacy together once again.\n\nI was able to travel to the University of Michigan Law School, where Johnson attended undergrad and law school, to present the findings of my research to his family members who flew in from across the country, Kama said.\n\nThe presentation was held in front of students, JAG Corps members, and Johnsons family on Jackie Robinsons Day, April 15. A day when people wear his number, 42, to honor his memory.\n\nAs perceptions of societal racism dominate many headlines in America today, Kama reflected on the militarys conscious efforts to integrate people of different ethnic backgrounds in the military. Kama said he is the first person to discover and document that two out of the nine jurors were African American and played an equal part to Robinsons attorneys.\n\nThere was absolute racism in that period. That is unquestionable, and to charge Jackie Robinson in that manner is unthinkable today, Kama said. But at least the military justice as a concept had the wherewithal to say, when we try an African American officer or Soldier, were going to bring in two African American officers to sit in judgment.\n\nKama said it was integrity that drove him to write the article, not an award, his personal courage to tell a story that many would not. It not only brought a positive light to an African American baseball hero, but restored a familys legacy that would have otherwise been forgotten.\n\n"}