{"text": "A formation of one hundred sixty-six Georgia Army National Guard Soldiers officially joined their units during a consolidated battle handoff ceremony at Donovan Field in Fort Stewart, Ga., April 15, 2023\n\nSenior leaders from each of the Ga. ARNGs five brigades were on hand to welcome their new Soldiers along with the command team of the Ga. ARNG, Major General Dwayne Wilson and Command Sergeant Major Jeff Logan.  The Adjutant General of Gerogia, Maj. Gen. Tom Carden observed the ceremony as well, highlighting the importance of this event to the organization.\n\nColonel Barry Simmons, commander of the Marietta-based 78th Aviation Troop Command served as the guest speaker for the event, addressing the new Soldiers.\n\nYou are actually beginning a journey, said Simmons.  You are entering the front gates of a leadership factory.\n\nThe ceremony marked the completion of initial active duty training and a series of administrative readiness activities and briefings.  These activities included medical and dental checkups, classroom drivers training, and initial issue of tactical gear.  By consolidating all of these events, the Ga. ARNG has equipped and prepared new Soldiers to meet readiness requirements to go to the field with their units immediately.\n\nThe Georgia Army National Guard&#39;s Macon-based 48th Infantry Brigade Combat team welcomed the most Soldiers during the battle hand off, with a total of 84 new faces joining the Volunteer brigade.\n\nMost Soldiers joining the 48th IBCT will be back at Fort Stewart next month, refining their recently learned military occupational specialties in the training ranges and forests that stand just a few miles from the parade field they graduated on.\n\nFor 20 Soldiers joining the 1st Battalion, 121st Infantry Regiment, their first drill will be a one-month rotation at the Joint Readiness Training Center in Fort Polk, La., to certify their battalion for future worldwide mobilization.\n\nSpecialist Emmanuel Blount, an infantryman joining Bravo Company, 1-121 Infantry, welcomes the challenge.\n\nIm looking forward to the high-level training and the teamwork, said Blount.  I feel like its going to hone my skills being around new people and different experiences.\n\nBlount graduated from Elizabeth City State University in North Carolina with an undergraduate degree in psychology.  His story is an example of the wide-ranging spectrum of age and experience within the formation.\n\nSpecialist Bening Hellriegel, an incoming 1st Squadron, 108th Cavalry Regiment medic from Kennesaw, said she wasnt very happy with her civilian career choice, which led her down the path to joining the Ga. Guard for new career training.\n\nI wanted to learn a lot more about combat medicine, said Hellriegel. Im now qualified to work as an EMT as a civilian.\n\nHellriegel was previously employed as a microbiologist after working as a vet tech in college at Kennesaw State University.  She said she looks forward to serving in a line unit during field training.\n\nAfter the ceremony, the 166 new Soldiers broke off into groups to meet their brigade leaders, battalion leaders, and then finally introduced themselves to commanders and senior enlisted leaders of company sized elements.\n\nEleven of the new Soldiers were recognized with the Army Achievement Medal for exceptionally meritorious service during basic combat training. While seven of the Soldiers received the medal at the BCT graduation four were recognized during the battle handoff ceremony."}