{"text": "FORT BLISS, Texas  As duty and heroics fade to memory and become legend, its crucial to reflect upon the stories of the Soldiers of the past and the legacy theyve built for today.\n\nFor Sal Rauseo, the son of Michael Rauseo, a 1st Armored Division Soldier and heavy truck driver who served during World War II and whose hometown was Everett, Massachusetts, this legacy is an enduring testament to his fathers character and service.\n\nMikes experiences growing up in the 1920s and 1930s as the son of Italian immigrants in New England shaped his character and pride in serving with the Army and 1AD during World War II.\n\nHe grew up during the Depression and like a lot of teenage boys, he went off to work at these camps where the money would be sent back to the family to help support them,&#34; said Sal. When they got out of those is when they joined the Army; being 21 or 22, thats what they felt was their obligation.\n\nAlthough Mike was the son of two Italian immigrants, his pride in his American heritage always came first throughout his life.\n\nFor him and his generation, they were Americans, said Sal. Even when he had to go to Italy to fight, where we had a lot of relatives which he visited after the campaign, he was very proud. He thought of it as part of his American heritage.\n\nFurther serving as part of 1AD operations in Tunisia as well as Italy and the battle of Monte Cassino, although he rarely spoke about the details of combat, Mikes experiences as a Soldier went far beyond the battleground. He was also a highly decorated boxer during the war, coaching the 1AD boxing team as well as competing and winning numerous championships.\n\nAn article says that his entrance into the spotlight was in 1943 when he won the African middleweight campaign, Sal recounted. He took to the ring again and duplicated his previous feat for the Italian middleweight campaign.\n\nMikes boxing prowess transcended Army athletics, as his skill and prowess were noted by the top boxers of the era.\n\nThere was a light heavyweight champion at the time named Billy Conn who stepped up to face Joe Louis for the World Heavyweight Championship in the early 1940s, said Sal. In between then and 1946, Billy Conn threw a tour of the battlegrounds where he met my father and asked him to join him on the tour after the war as a sparring partner.  My father turned him down.\n\nOn top of winning multiple boxing championships during the war, Rauseo excelled across 1AD sports and athletics, earning recognition and even participating as the quarterback in the Army all-star football game at Olympic Stadium, Berlin, Nov. 16, 1945. The stadium is notable as being the same in which Jesse Owens, an African-American, dominated track and field events during the 1936 Olympics, held during solidification of the Nazi regime in Germany.\n\nThere&#39;s one article that says that during the previous gridiron season, he entered the limelight with a consistent 60-minute performance, said Sal. he also starred on the 1st Armored Division baseball and softball team.\n\nMike briefly pursued athletics following his honorable discharge from the Army in 1946, before injuries caught up with him.\n\nHe played football for a year, but he had some injuries, so he stopped doing that, said Sal. He sparred a couple of boxing exhibitions, but after that he didnt really go back into sports.\n\nMike would focus his energy and dedication on becoming a firefighter in 1956 and continuing to raise his family and being an integral part of his community.\n\nHe was very, very proud of being a firefighter, said Sal. But he never really got back into sports, he was too busy working and raising a family.\n\nWhen Mike passed away in 1980, he left a significant 1AD heirloom to Sal, an engraved signet ring emblazoned with American eagles and displaying the divisions distinctive unit insignia flanked by commemorations of the divisions Africa and Italy campaigns during World War II on its face.\n\nHe kept the ring his whole life, it meant a whole lot to him, said Sal. The ring was always kept in a box and always taken care of, and thats why Ive kept it and why I hope that my kids will keep it.\n\nHeirlooms such as the signet ring are a physical reminder of the heroics, struggles and successes of Iron Soldiers during World War II, ensuring that their sacrifices and unquestionable bravery will not be lost over time.\n\nAs 1AD continues to evolve and press forward to tackle new threats and dangers, it remains imperative to remember the legacy and stories of Iron Soldiers of the past. Their stories become legends which define the character of the division, reinforcing a history that inspires awe and pride across 1AD.\n\n"}