{"text": "ABERDEEN PROVING GROUND, Md. (Sept. 8, 2020)  The Armys modernization and sustainment communities collaboratively took the next step in enabling enterprise-level health monitoring and maintenance capabilities for the Services vehicles and weapon systems during a demonstration at Aberdeen Test Center.\n\nThe Command, Control, Communications, Computers, Cyber, Intelligence, Surveillance and Reconnaissance (C5ISR) Center  a component of Army Futures Commands Combat Capabilities Development Command  supported Program Executive Office Ground Combat Systems demonstration of Condition Based Maintenance Plus (CBM+) capabilities integrated into the Abrams M1A2 SEPv3, an enhanced version of the Armys main battle tank.\n\nCBM+ tools provide self-diagnosis and alerts regarding the operational status and maintenance needs of Army vehicles and weapons systems. The Army has previously lacked a comprehensive system that provides end-to-end data regarding a systems health.\n\nThe demonstration proved the concept that tactical vehicles can send CBM+ data over Army networks to the Global Combat Support System-Army  which is the Army enterprise resource planning system for inventory, purchase and financial and logistics management  and back to the CBM data warehouse, noted Adrienne Hughes, chief of the C5ISR Centers Systems Maintenance Concepts Engineering Branch.\n\nThe Abrams is the first ground platform to demonstrate this end-to-end capability, and it is serving as the blueprint for Army logistics decision makers implementing the CBM+ enterprise model, said Hughes. The C5ISR Center will continuously look for opportunities to leverage this blueprint for the prognostic and predictive maintenance of C5ISR systems.\n\nThe work is contributing to the development of new Army policies for the implementation of CBM+ operations into Army-wide practices, which is in accordance with the Department of Defenses directive that all Acquisition Category I programs include CBM+ in the development of mandatory sustainment key performance parameters and supporting key system attributes.\n\nOur goal is to help the Army modernize this capability by shifting from reactive to proactive maintenance. That next step is evolving CBM+ into Prognostic and Predictive Maintenance (PPMx), which will enable enhanced analysis. But a key to PPMx is sending the platform usage, health and maintenance data back over the network from the platform to the enterprise, and that is why this demonstration is so important, said Hughes.\n\nPPMx will provide advanced situational awareness to reduce downtime and help the Army identify trends, such as a piece of equipment failing in certain regions or climatic condition, thus improving fleet management and tactical planning.\n\nIn the long run, this will enable the Army to use data in ways weve yet to imagine. It will truly improve readiness while increasing combat power, said Hughes.\n\nThe C5ISR Center is supporting Abrams as part of its greater science and technology mission, as well as providing life cycle engineering support to C5ISR acquisition programs of record and the U.S. Army Communications-Electronics Command for sustainment of those systems.\n\nLife cycle engineering is a key component to modernization and readiness because it helps to enable the rapid development, transition, integration, and sustainment of capabilities across the life cycle, said Al Visconti, C5ISR Center director for Product Realization Systems Engineering and Quality.\n\nWe have personnel who have been involved with the development of the CBM+ concept since its inception. Were using this experience plus our subject matter expertise in C5ISR systems and platforms to support PPMx principles in a resource-informed way to maximize the value for the Army, Visconti said.\n\nThe C5SIR Centers Systems Engineering, Architecture Modeling and Simulation Division assisted in the set-up and monitoring of the Combat Service Support Automated Systems Interface and Combat Service Support Very Small Aperture Terminal network which were used to move the data.\n\nThe Center also worked with numerous stakeholders to understand the different platforms and capabilities of those systems. From there, they helped develop data-reduction tools and data format and exchange standards to enable different systems and networks to exchange data in a common way. This, in turn, helped to identify standards that the Center is using to architect an end-to-end implementation blueprint.\n\nThis is a complex challenge. There are many platforms, and many ways a platform could send the system data back to the enterprise. Everybody has to be thinking the same so there is no duplicate development and so data can be used and analyzed in a common way, said Hughes.\n\nThe C5ISR Center is working with stakeholders to evolve capabilities that will support PPMx for C5ISR systems, said Hughes, who noted that the Center is doing an analysis to recommend an optimal implementation strategy for C5ISR Systems.\n\nThere has not been a lot of CBM+ done for communications platforms, and that is where we are breaking new ground. Electronics have been traditionally thought of as something you cant really predict failure based on the number of hours or cycles, but this ability to get the data from the platform to the enterprise is going to unlock PPMx capability for the C5ISR community, said Hughes.\n\nNow that the end-to-end CBM+ capability has been demonstrated in the Abrams tank, the next step will be to demonstrate the capability in an operational environment.\n\nAbrams stands ready willing and able. We have a fully enabled capability on the Abrams SEPV3 with four successful CBM+ network demonstrations, noted Larry Marino, Project Director Main Battle Tank integrated project support manager and Vehicle Health Management System/CBM+ program lead.\n\nMarino thanked the other stakeholders and demonstration participants, including the Tank-automotive and Armaments Command; the Army Materiel Commands Logistics Data Analysis Center; the Combat Capabilities Development Command&#39;s  Ground Vehicle Systems Center and Data and Analysis Center; Joint Technical Data Integration; Project Manager Army Enterprise Systems Integration Program; Program Executive Office for Command, Control, Communications-Tactical; and the Training and Doctrine Command.\n\nThe C5ISR Center will continue to work with these stakeholders to evolve the network communications in support of the PPMx goal. This will include exploring how best to integrate emerging capabilities such as artificial intelligence and machine learning so they can be applied to data processing and the overarching blueprint, noted Gary Salomon, chief for the C5ISR Centers Systems and Sustainment Engineering Division.\n\nI started working on CBM+ more than 10 years ago. At that time, this type of capability was just a concept. Now we are here, seeing it demonstrated live on the world&#39;s greatest battle platform. Considering the technology that had to be developed and integrated onto the platform, the architecture work and the security considerations that had to be addressed, we have made amazing progress. This is going to be a game-changer, Salomon said.\n\nFor more information, contact the C5ISR Center Public Affairs Office: usarmy.apg.ccdc-c5isr.mbx.pao@mail.mil.\n\n---------\n\nThe C5ISR Center is the Armys applied research and advanced technology development center for C5ISR capabilities. As the Armys primary integrator of C5ISR technologies and systems, the center develops and matures capabilities that support all six Army modernization priorities, enabling information dominance and tactical overmatch for the joint warfighter.\n\nThe C5ISR Center is an element of the U.S. Army Combat Capabilities Development Command. Through collaboration across the commands core technical competencies, CCDC leads in the discovery, development and delivery of the technology-based capabilities required to make Soldiers more lethal to win our nations wars and come home safely. CCDC is a major subordinate command of the U.S. Army Futures Command.\n\n"}