{"text": "FORT LEAVENWORTH, Kan.  The Georgia-based 3rd Infantry Division and California-based National Guard 40th Infantry Division conducted warfighter exercises at Fort Stewart, Georgia, and Camp Atterbury, Indiana, supported by the Mission Command Training Program, Nov. 5-14.\n\nIt was a part of an ongoing series of division-level exercises with Regular Army and Reserve Component elements training side-by-side to build proficiency and readiness to conduct multidomain operations in large-scale combat operations.\n\nThe Chief of Staff of the Army, Gen. James McConville&#39;s recent comments at a National Guard conference suggested the importance of the two components training together.\n\n&#34;We [the Regular Army] don&#39;t go anywhere or do anything without the National Guard, he said. We cannot do what we do as an Army without the National Guard.\n\nThe 3rd and 40th Inf. Div. elements simulated operating as adjacent divisions, tasked with expelling an invasion force from an occupied allied country.\n\nThe scenario allowed them to practice pacing their offensive operations as adjacent units within their respective sectors to limit creating potential vulnerabilities on their flanks. They also worked on coordinating cross-boundary and deep area support and sharing information to round out each elements understanding of their current situation.\n\nThe exercise proved timely and operationally relevant.\n\nIt occurred amid the official announcement of the 3rd Inf. Div.s Combat Aviation Brigade deployment to Europe as part of the U.S. Atlantic Resolve mission.\n\nAtlantic Resolve began in 2014 with the U.S. providing rotational deployments of combat-credible forces to Europe to show its commitment to NATO and strengthen their interoperability, according to U.S. Army Europe and Africa sources.\n\nThe 3rd CAB honed its ability to support division-level operations in the exercise ahead of their deployment.\n\nMCTPs warfighter exercises are emerging as the Armys go-to combat training center rotations for readying echelons above brigade and functional and multifunctional brigades ahead of deployments.\n\nThe Colorado-based 4th Inf. Div. headquarters and its sustainment brigade also completed warfighter exercises in October. Theyre set to deploy to Europe in 2023, with the 3rd CAB aligned under their command and support in Europe.\n\nThe 40th Inf. Div. brought a unique perspective to the exercise. It has significant expertise in urban operations, having conducted real-world support missions within its state in highly urbanized cities such as Los Angeles. It also leads an urban planners course and recently partnered with the National Training Center in Fort Irwin, California, to enhance the urban terrain it replicates in its training areas.\n\nTheir perspective gave them a keen sense of civilian considerations respective to their operations. It led to detailed focus on judicious and precision targeting in their area of operations.\n\nHowever, the exercise allowed them to train on complementary skills of facing a near-pear threat in less densely populated areas, akin to some of the operations seen in Ukraine.\n\nIncidentally, the California National Guard from which the 40th hails, has a state partnership with Ukraine. The Chief of the National Guard Bureau, U.S. Army Gen. Daniel Hokanson, recently told congressional elements that Ukraine contacted California National Guard leaders when Russia invaded the country.\n\nWhen Russia began its unprovoked invasion of Ukraine, Ukraines military leaders reached out to people they trusted  people they had known for years. And those were members of the California National Guard, said Hokanson. Ukrainians first text messages were, Were being invaded. Their second messages said, Heres what we need.\n\nThe 3rd Inf. Div. also had a real-world connection to the conflict in Ukraine. One of its brigade combat teams deployed to Europe on short notice as soon as the invasion began. It was tasked to support Joint Task Force Dragon to assure NATO allies and partners in the region.\n\nSoldiers of the 3rd Inf. Div. regularly deploy to support combatant commands all over the world, assisting our allies and partners in a wide range of environments and missions, said Col. Pete Moon, 1st ABCT, 3rd Inf. Div. commander, in a statement following designation of the mission.\n\nThe brigade had only recently returned from its deployment before the exercise began. Its leaders and Soldiers undoubtedly returned with lessons and insight that helped enable the broader division better to understand its operational environment and execute its operations so successfully in the warfighter exercise.\n\n"}