{"text": "FORT HOOD, Texas  Administrator Isabella Casillas Guzman, U.S. Small Business Administration, and Rep. Roger Williams (TX-25), chairman of the House Committee on Small Business, met with current students and service members of the Boots to Business program March 31 here.\n\nThe SBA thats focused on the American dream of business ownership wants to make sure that thats accessible to all, especially our military service members, Guzman said during a press conference at Fort Hood. Our Boots to Business program is one of the great examples of how we can transition these great service men and women to a life of entrepreneurship.\n\nB2B is an entrepreneurial education and training program, offered by SBA and Fort Hoods Transition Assistance Program. Participants, including transitioning service members, veterans and their spouses, are afforded the opportunity to learn an overview of business ownership.\n\nThis program began in 2013 and was created to provide basic knowledge for those interested in exploring business ownership or other self-employment opportunities, including receiving the technical assistance they need to figure out how to launch their business.\n\nThe Army in particular has a strong representation within our Boots to Business program, Guzman said. So, were glad to be here to make sure that we emphasize how important it is that many of them take this next step and jump into entrepreneurship if thats their dream and in their pathway. And that there are tools and resources to help them get there, either immediately or along the way as they build toward developing their business plan and financing it.\n\nThe administrator emphasized that this program is available to any servicemember or veteran who is willing to take the risk to gain the reward of owning their own business.\n\nIts really important that we continue across the country to support our veterans, she said. And (Fort Hood) is just one of the shining examples of a military installation thats committed to making sure that there are pathways in transition that are meaningful to the military service members.\n\nCongressman Williams agreed.\n\nFort Hood has a reputation of supplying the workforce as weve got it, Williams pointed out during the same press conference. Because thats the Great Place, right? You got to come to the Great Place. So, were glad (the SBA team) chose to come here and showcase the great things that we have going at Fort Hood and the manpower we have (here).\n\nGuzman and Williams had the opportunity to participate in the B2B foundational course.\n\nThe course, Introduction to Entrepreneurship, is a two-day in-person program and is facilitated by subject-matter experts from the SBA and a network of business advisors. Participants are introduced to the skills, knowledge and available resources they need to launch a business. This includes steps for developing business concepts, how to develop a business plan and information on SBA resources available to help.\n\nFort Hoods TAP division chief said he aims to offer as many opportunities as possible for transitioning Soldiers and their families.\n\nThe biggest thing is that this program gives the servicemembers the opportunity to be their own vehicles, expressed Mark Phillips, Fort Hoods TAP division chief.\n\nPhillips explained that Soldiers in this program receive instruction from start to finish on whatever area they want.\n\nHe said no matter if they already have a market plan or business, or even if they havent decided if they want to manage a business, it is a great opportunity for service members to explore the concept of owning their own business.\n\nHaving a visitation from the SBA committee chairman here shows what Washington D.C. is actually doing to promote, advance and educate the service member, the TAP division chief explained.\n\nDuring the question-and-answer portion of the press conference, Guzman explained just how large the group of armed services business owners is.\n\nNationwide, over 180,000 members of the armed service have gone through this incredible program, Guzman said. Our veterans are large contributors to our economy, creating jobs as so many of our entrepreneurs out there, over two million veteran businesses around the country in all industries. We want to make sure, obviously we continue to serve them and level up and adapt to the marketplace just like theyve had to in the last few years and continuously provide these programs and the capital that they need to launch, survive and thrive into the future.\n\nWilliams pointed out that more than half the nations revenue comes from small business.\n\nHalf payroll, half the workforce is generated by small business in this country, Williams shared. Thats why its so important we keep filling the supply so we dont run out.  These people are willing to take risk if they can get reward. And thats what America is about. Thats the greatness of our country.\n\n"}