{"text": "What is the U.S. Army doing in Africa?\n\nTraining Djiboutians to secure their borders, building U.N. peace-keeping academies in Ghana, planning and facilitating joint-multinational combined-arms maneuvers in Tunisia -- Army leaders discussed these and many other examples of 2nd Security Force Assistance Brigade efforts across Africa during the annual convention of the Association of the United States Army, October 10th, 2022.\n\nThe commanders of the U.S. Army Southern European Task Force, Africa (SETAF-AF), Security Force Assistance Command, and 2nd Security Force Assistance Brigade provided AUSA attendees an update on how SFABs are used in crisis and conflict and how theyre currently used building relationships with African partners.\n\nChina and Russia understand Africas strategic significance, said Maj. Gen. Todd Wasmund, the SETAF-AF commander and U.S. Army Europe and Africa deputy commanding general for Africa. They are seeking to influence events on the continent in their favor using political influence, disinformation, economic leverage, and malign military activity,\n\nSince 2020, when the U.S. Department of Defense aligned the 2nd SFAB with U.S. Africa Commands area of responsibility, Army advisers have built relationships and expanded influence through security force assistance in 15 African countries.\n\nEmerging opportunities exist through North Africa, the Sahel, and Sub-Saharan Africa, said Col. Grant Fawcett, the 2nd SFAB commander. The momentum continues to build as our reputation grows.\n\nFawcett pointed to the effect a small team of 2nd SFAB advisors had on AFRICOMs premier annual exercise, Exercise African Lion. Last summer, Tunisias participation in the exercise increased from hosting associated field training exercises and a battalion command post exercise, to serving as the multinational joint headquarters in Tunisia, Fawcett said. Advisers from 2nd SFAB worked side-by-side the Tunisians to assist their efforts.\n\nAccording to Fawcett, 2nd SFAB Soldiers advised the Tunisians in establishing a multinational joint operations center, vetted and built the live fire exercise location with support from 7th Army Training Command, and developed the plan for the exercise observer controllers. They also assisted the reception and onboarding of the other U.S. military participants.\n\nTunisia is just one example of the work the 2nd SFAB teams provide to U.S. AFRICOM and SETAF-AF, Fawcett said.\n\nIncluding the SFAB teams in Africa, there are 94 advisor teams in 34 countries across the globe. Maj. Gen. Donn H. Hill, the SFAC commander spoke about SFABs in crisis and competition.\n\nAdvisor teams can provide the informational, decisional, and positional overmatch during crisis and conflict needed to successfully execute multi-domain operations against a peer enemy, Hill said. We are already in 34 countries today... bolstering and defending our unparalleled network of allies and partners.\n\nOperating alongside foreign forces, SFABs improve partner capability and capacity. At the same time, they can be the conduit to bring the support of the U.S. joint force.\n\nThe U.S. Army established the first security force assistance brigades in 2017 with two deployments to Afghanistan and one to Africa. Today, the five SFABs are regionally aligned with a sixth SFAB in the U.S. National Guard.\n\nAdvisors in the 2nd SFAB generally spend six months in Africa two times during a three-year stint in the unit. The SFABs are volunteer-only units. Units expect applicants to be experts in their specialty and be willing to learn skills from other warfighting functions.\n\nAfter three-years, Advisors return to Army units as experts in their specialties with broadened interpersonal and training skills. They also provide their units with unique experiences in a variety of deployed overseas locations and exercises.\n\n"}