{"text": "WHEELER ARMY AIRFIELD, Hawaii  The Army Emergency Relief fund provides financial assistance during times of crisis, or whenever Soldiers and their families face financial challenges. Since March 2020, it has also provided special programs to support the coronavirus pandemic currently impacting the United States.\n\nPresently, AER leaders are holding virtual tours at Army installations in the U.S. to discuss with leadership and Soldiers the various ways AER may meet their needs today. They are also discussing whether anything needs to be adjusted and giving updates about new initiatives within AER, particularly during natural disasters like coronavirus, wildfires and hurricanes.\n\nDuring COVID, said retired Lt. Gen. Raymond Mason, director, AER, in Washington, the most common need were seeing is loss of spouse pay. The family has become used to two incomes. With COVID, many spouses have been laid off or experienced reductions in pay; families then have to rework their monthly budget from two incomes to one.\n\nWhether help is needed with rent or utilities, medical or dental care, or funeral expenses, the reasons personnel will seek an AER loan can be extensive.\n\nThe top three reasons why people come to AER are car repair; PCS (permanent change of station) moves, for deposits or rent; and house repairs, for things that happen at home, Mason explained. For example, maybe theyve had some water damage, a fire or something like that.\n\nAnother popular program, especially during the COVID pandemic, is homeschooling supplies, said Mason. Digital items and equipment, such as Wi-Fi connections, laptops, iPads, and more are frequently needed.\n\nLana Edwards, manager of the AER program in Hawaii, agrees. She says that Soldiers stationed here generally need assistance with rent, privately owned vehicle (POV) repairs and emergency travel. She handles more than 30 separate categories.\n\nAER provided Hawaii about $2.3 million in assistance in 2019. Also, spouses and children received about $230 thousand in scholarships for undergraduate degrees.\n\nIf they are registered in DEERS (the Defense Enrollment Eligibility Reporting System), most in the U.S. Army Hawaii community are eligible to apply for an AER loan, said Edwards, specifically, active duty Soldiers, retirees, survivors, active Guard and Reserve, and family members. Many provisions also allow aid to Reserve and National Guard, under Title 10.\n\nThe COVID pandemic, however, has impacted contributions to AER; they have fallen in Hawaii. Reasons may be shut down bases, stay at home orders, local government policies regarding some retailers being open or closed, and uncertainties with schooling.\n\nIn 2019, Hawaii donations totaled more than $127 thousand. This year, they have fallen to just under $90 thousand.\n\nIm not all that concerned about the amount of money, said Mason. What Im concerned about is that active duty Soldiers donate, that they reach into their back pockets and that they help their buddy on the left and the right.\n\nLeave no comrade behind on the battlefield is also applicable at home station, he continued, just like AERs motto, Soldiers Helping Soldiers.\n\nMason added, The mere act of donating is a commitment to your team, your squad, to the Army. We want to have that bond.\n\nHe said AER normally gives out twice as much in grants and scholarships as it gets in with donations. Nevertheless, AER is always available. He reminded that said Soldiers should know that asking for help is a sign of strength.\n\nRelated Links\n\nArmy Emergency Relief\n\nAER expands assistance eligibility for Guard, Reserve\n\nArmy.mil: Worldwide News\n\n"}