{"text": "ABERDEEN PROVING GROUND, Md.  From owning multiple IT patents to earning advanced degrees in computer science, African Americans have long since been an integral part of the progress and development of modern technology.\n\nAs we continue to honor and celebrate Black History Month, two technology professionals discuss how past contributions have shaped their present, talk about their professions, and share why they like working for Program Executive Office Intelligence, Electronic Warfare and Sensors (PEO IEW&S), a U.S. Army entity dedicated to designing, delivering and sustaining advanced technologies that give Soldiers the decisive edge downrange.\n\nFor PEO IEW&S Cybersecurity Engineer Taryn Foye, the accomplishments and achievements of two noted African American scholars in the field of computer technology serves as a key source of inspiration for her.\n\nThere are many African Americans to note but the ones that stand out for me are Dr. Marsha Rhea Williams and Dr. Mark Dean, she said. Dr. Williams was the first African American woman to earn a Ph. D. in computer science in 1982, and Dr. Dean holds more than 40 IT related patents (plug-and-play technology, the color monitor, etc.) that have made significant contributions to just about everyones industry and profession.\n\nThose successes have had a major impact on Foye, and she strives to draw on that high standard of excellence in supporting PEO IEW&S.\n\nTheir accomplishments set a goal of high expectations and, in my work, and I try to mimic that high standard in addressing needs by giving proper guidance and support to ensure mission requirements are met, she said. It is because of their accomplishments and other Black Americans that I can pursue my goals and ambitions. Without their successes, my opportunities would be limited today.So, I thank these forbears for being the beacon of light in these spaces where no Black Americans existed before.\n\nIn her position, Foye manages several tasks including supporting the PEOs authorizing official and the Program Information System Security Manager by keeping up with cyber requirements and ensuring the smooth back-and-forth flow of communication. She also ensures the PEO portfolio achieves the highest standard of excellence and assists project managers in developing and reviewing cybersecurity strategies and conducting compliance reviews.\n\nFor me, the biggest contribution African Americans have made comes down to struggles and triumphs, said Moses Mingle, a lead systems engineer at PEO IEW&S.  African Americans that came before have had to navigate terrible injustices and with each passing generation, no matter how big or small, progress was made and for that I say thank you to all those who have come before, sacrificed and paved the way.I hope I am doing my part to further pave the way for those who will come after me.\n\nMingle works within the System of Systems Engineering section, an arm of PEO IEW&S that provides holistic engineering support to various project and product managers. Prior to coming to here, he spent more than two decades working within DoD.\n\nI have worked for the DoD 20-plus years working with and for PEO IEW&S in various capacities including lead engineer, assistant product manager, chief engineer and deputy product manager, he said. The best thing about working at PEO IEW&S is the people.Over my career, I have come across some incredible people with varying backgrounds, which makes coming to work enjoyable.\n\nMingle said working at PEO IEW&S has had a positive impact on his career over the years where he has had the privilege of working on programs at the beginning, middle and ending of their life cycles. He pointed out that each stage of the acquisition life cycle requires different skill sets, which brings about different situations to learn, adapt and overcome to achieve mission success.\n\nI have had the honor of working at different levels within PEO IEW&S, from being a new team member who barely knows what the acronyms mean to a supervisor responsible for not only the success of the program but more importantly the people you work with daily, he said.\n\nFor both Mingle and Foye, working at PEO IEW&S is a rewarding experience with an abundance of opportunities to develop and grow professionally, and network with what seems to be an endless number of knowledgeable professionals from a variety of disciplines and diverse backgrounds.\n\nThe best thing about working here at PEO IEW&S is that its ever changing  never a dull moment, Foye said.New cyber threats are continuously being introduced, new programs and capabilities are being planned and/or developed to support the warfighter.\n\nMingle applauded the organization for its pleasant and highly professional work environment.\n\nI have had the honor of working at different levels within PEO IEW&S, from being a new team member who barely knows what the acronyms mean to a supervisor responsible for not only the success of the program but, more importantly, the people you work with daily, he said.\n\n"}