{"text": "CAMP HUMPHREYS, South Korea  The Army Field Support BattalionKorea, received the Fiscal Year 2022 Army Award for Maintenance Excellence during a ceremony here Dec. 8, 2022.\n\nThe battalion was recognized in the Active Army Table of Distributions and Allowances Unit Category.\n\nToday we have the opportunity to formally recognized AFSBn-Korea for winning the FY22 Army Award for Maintenance Excellence in the TDA category. This is a monumental achievement and special occasion as many units compete for this honor across the Army, said Col. Lisa Rennard, commander, 403rd Army Field Support Brigade. So AFSBn-Korea&#39;s Installation Maintenance Division has been named the best of the best. We are so proud of you all and this achievement that you have accomplished.\n\nThe battalion was also recognized with AAME Awards in 2008 and 2010.\n\nThe Army Award for Maintenance Excellence was established in 1982 by the Department of the Army to recognize exceptional accomplishment in Maintenance and provide added incentive to the competitive programs of Major Army Commands. Active Table of Organization and Equipment, Army National Guard TOE, Army Reserve TOE, Directorates of Logistics, and Table of Distribution and Allowances units compete separately, and the competition in each component is divided into three categories: Small, Medium and Large, based on number of authorized personnel. Aligns with the Department of Defense Awards Program and Category Winners are considered for DOD.\n\nThe Chief of Staff, Army Award for Maintenance Excellence Program is conducted each year to recognize Army units and/or activities that have demonstrated excellence in maintenance operations. Each unit is evaluated on their effectiveness ensuring that Soldier competency is maintained. Assessments of each unit in the categories of attitude and effective leadership are rated with a benchmark based on those of past winners, and the tenets of exceptional maintenance processes that were exhibited are validated and ranked.\n\nThe award, recognizing the best in Army maintenance operations, was presented by Maj. Gen. Joseph Dcosta, deputy commanding general  sustainment, Eighth Army.\n\nI constantly go out to units and I want to see how they&#39;re performing maintenance. Because if vehicles don&#39;t move, and that first round lands in Korea from the enemy, we are going to lose this war, even before it actually begins. So when we say fight tonight, fight tonight does not necessarily mean when it&#39;s dark. Fight Tonight means now immediately, Dcosta said. Maintenance is to ensure that we are successful during combat operations. Everything we do is for combat operations. For those in uniform the test for us is combat itself. We can&#39;t do that job without people like these that we&#39;re about to award.\n\nIn addition to the unit award, Dcosta presented his coin of excellence to members of the AFSBn-Korea Maintenance Division including: Carlos Hill; So, Sung Min; Chong, Hak Song; Cho, Yong Hun; Choe, Chin Yong; Kim, Nam Su; Yi, Pyong Chik; Na, Yong Pu; Sim, Wan Sop; Kim, Tae Hun; Yi, Sung Won; Chong, Song Hun; and Kim, Chang Kun.\n\nThe Battalions history dates back to the early 1980s with the formal establishment of the Logistics Assistance Office for 2nd Infantry Division at Camp Casey. The battalion provided support to 2ID in all areas of logistics, maintenance, readiness, and warfighter support.\n\nIn 1995, the battalion was renamed the Logistics Support Element-2nd Infantry Division, and placed under the control of Army Field Support Brigade-Far East. While the mission of providing support to 2ID did not change, reporting channels were streamlined under a single forward command.\n\nAs the army reorganized to a modular concept in the 2000s, the battalion was assigned responsibility for all Lifecycle Management Command Logistics Assistance Representatives within the 2ID footprint across Korea. This marked the initial partnering of all AMC enterprise partners in a forward area.\n\nIn June 2009, the unit was re-designated as AFSBn-2ID, to ensure compliance with ASCs most current force structure and to streamline the support provided to the 2ID.\n\nChanges again occurred in May 2011, when the unit was re-designated as Army Field Support Battalion-Korea based on the units geographical location.\n\nMarch 2015 brought a merger between AFSBn-Korea and Logistics Readiness Center-Red Cloud, thus establishing a single face to the field with a combined support operations center. But this merger was short-lived and in 2016 both the Battalion and LRC-Casey were reestablished as separate reporting elements of the 403rd AFSB.\n\nThe most recent change occurred in the fall of 2018, when the battalion underwent transformation again in support of the Army Sustainment Command futures concept and merged the battalion with LRCHumphreys.  The battalion relocated its headquarters from Camp Casey in Area I to its current location at Camp Humphreys. As part of the changing Army doctrine in support of large-scale combat operations, AFSBn-Korea created a Support Operations Division to increase readiness support at the division level. The battalion also absorbed the former LRC-Humphreys garrison support mission of transportation, maintenance, and supply support to the installation.\n\nAs the battalion forges ahead, it is prepared to support the 2ID by providing readiness support at points of need throughout the Korean Theater of Operations and providing USAG-Humphreys with baseline services and logistics support.\n\nAFSBn-Korea, the Anvil Battalion continues its support for Army units in Korea with its motto, Forging Readiness!\n\nFor more photos of the ceremony (and other brigade events), go to the 403rd AFSB Flickr page at: https://www.flickr.com/photos/afsb403d/albums/72157717233650603\n\n"}