{"text": "VICENZA, Italy (May 7, 2021)  For Pietro Luigi Colombos 91st birthday, his three daughters planned a special surprise  a visit to Caserma Ederle where he worked in the early 1950s.\n\nFor Colombo, who last saw the post in 1952, the visit brought back fond memories of his military service and his time in Vicenza.\n\nI feel like Ive stepped back 70 years, said Colombo, who now lives near Bergamo. Too bad time cant rewind, he expressed, after receiving a welcome back from the leadership on post.\n\nCol. Daniel Vogel, commander, U.S. Army Garrison Italy, greeted Colombo, thanked him for his service and support to the mission.\n\nIt is great to welcome you back and see that the Italian and American partnership is just as strong as it was when you served here 70 years ago, Vogel said.\n\nBorn May 3, 1920, Colombo arrived at Caserma Ederle in 1951. That November, Colombos battalion supported local people at Polesine, near Rovigo, during floods there.\n\nCol. Michele Biasiutti, the Senior Italian Officer and Deputy Chief of Staff of Southern European Task Force, also greeted Colombo. Biasiutti was glad Colombo had the chance to visit the installation where he once served.\n\nFor those who have been in the military, the base is always their home, Biasutti said.\n\nThe second child of twelve siblings, Colombo worked hard to help his family through times of poverty and hunger after World War II. While enlisted, instead of spending his pay for himself, he bought a doll for his younger sister who had never owned one.\n\nHe is a special dad, and with his example he raised us and also helped raise his grandchildren, said Carmela Colombo, one of his three daughters.\n\nColombo was also dedicated to his wife, who became ill a few years ago, his daughter said.\n\nHe would assist her, never complained and, despite his age, he was always there for her, she said. She passed away a few months ago, after being married for 63 years.\n\nColombos family members said they were grateful for the chance to make this surprise visit come true.\n\nWe told him that we would come to Vicenza, but without saying we would visit Caserma Ederle, because we wanted to surprise him with a special experience, Colombos daughter said.\n\nHe will remember today as one of the most beautiful.\n\n"}