{"text": "As the Coronavirus pandemic approaches a half-year duration, public fatigue is on the rise.\n\nWith complacency creeping into our new normal, we are reminded by public health authorities to take the danger of virus transmissibility seriously.\n\nThe virus doesnt care if you are maxed out from wearing a mask, or disbelieving that social distancing works, said Captain Celeste Singletary, an Army Public Health Nurse who works at the MEDDAC Department of Preventive Medicine on Fort Knox, Ky. Singletary spends much of her day in a whiteboard-lined room, using different-colored dry erase markers to track the virus spread among the local population. The names and connecting lines she draws on the walls essentially diagram an invisible enemys troop movements.\n\nWhile Captain Singletary and her team strategically battle the pandemic using information and contact tracing from a war room office, another group of Soldiers battle COVID-19 tactically on the front lines.\n\nFort Knox Medical Department Activitys Environmental Services sanitation crew could be considered troops in contact. As such, they are armed and serious about sanitation.\n\nWe use a Disinfectant 256 which we get from our distributor, said Jason Wilson, Project Manager, Environmental Services, PCSI. When the Coronavirus first started happening, we met with them 1-on-1. We asked them if the chemicals we have combat COVID-19  and we were assured they do. Weve also put in some extra chemicals, so if we have any disruption in our distribution we have backup chemicals that we can also still get. Its how we make sure we are prepared for this COVID outbreak.\n\nFrom markers on whiteboards to green bottles of disinfectant, the way MEDDAC fights the virus spread varies. But what stays the same is the commitment to victory.\n\nEveryone in our workforce is an integral part of the plan to contain and defeat COVID on Fort Knox, said MEDDAC Commander Colonel Hugh McLean Jr. Their response has been  and continues to be  stellar. Were in the fight to win. Our patient and staff health and safety is being fought for - with every weapon we have.\n\nPatrolling the clinic after business hours, while inspecting the quality of Environmental Services crew sanitation work, Jason Wilson notes, Its been a blessing for us to have staff thats willing to step up to the challenge we have been faced with.\n\nTeam MEDDAC is stepping up: aiming and firing for effect.\n\n"}