{"text": "Following Russias unprovoked invasion of Ukraine NATO substantially bolstered air defenses along its eastern flank. Patriot air defense Soldiers from 5th Battalion, 7th Air Defense Artillery Regiment, deployed to reinforce key Allied infrastructure in Poland and Slovakia in early 2022. Three deployed batteries returned home in mid March 2023.\n\nU.S Army air defenders from the 5th Battalion, 7th Air Defense Artillery Regiment, 10th Army Air Missile Defense Command, reunited with family and friends after their year-long deployment in joyous homecoming ceremonies at their home base in Baumholder Germany.\n\nCharlie and Delta Batteries deployed to southeast Poland with initial capabilities within 72 hours of notification in early March of 2022 where they remained under authority of 10th Army Air & Missile Defense Command for their year-long deployment.\n\nBravo Battery deployed to Slovakia in early April of 2023 at the invitation of the Slovak government after Slovakia generously donated its older S300 missile defense system to Ukraine. In July 2022 authority of Bravo Battery was officially transferred to NATO, joining the German and Dutch Patriot units also arrayed in Slovakia as part of NATOs air shielding mission.\n\nIt was very clearly understood by all the Soldiers and leaders that this was the real deal, the entire world was watching and we were getting to be a part of history as it was unfolding, said Capt. Robert Knabel, commander of Delta Battery when they deployed. It was in the back of everyone&#39;s minds that we didnt know when we would return, but everyone understood the significance of why we were going.\n\nShortly after Charlie and Deltas deployment to Poland the U.S. Secretary of Defense, Loyd Austin, directed another Patriot battery and headquarters element to deploy to Slovakia.\n\nBravo battery set the standard for the Alliances air and missile defenses across the European theater, said Lt. Col. Steven Rachamim, commander of 5th Battalion, 7th Air Defense Artillery Regiment. There is no question, the U.S. Army air defense force is ready to defend freedom anytime, anywhere.\n\nBravo Battery is the first ever U.S. Patriot unit to have completed a successful transfer of authority to NATO.\n\nOur Soldiers went to send a clear message to those that would threaten freedom in Europe, said Rachamim. The United States is determined to support our Allies, and work together to defend every inch of NATO territory.\n\nThe 365 day deployment of Patriot systems was a defensive measure which highlights the U.S. support to NATO and deters any potential acts of aggression against NATO territory.\n\nWe were not at war, however we were acting as a deterrent, we were doing a war time function, said Capt. Nathan LeBaron, commander of Delta Battery when they returned.\n\n"}