{"text": "Panama took possession of a U.S. made Beechraft King Air 250 turboprop aircraft Sept. 22, 2022. The transfer of the aircraft was part of a foreign military sales case executed by the U.S. Army Security Assistance Command (USASAC).\n\nUSASACs country program manager for Panama, Camille Hodge, said the FMS case is expected to bolster regional security objectives shared by both Panama and the United States.\n\nU.S. assistance helps strengthen our partners and allies. This case is no different. The United States and Panama cooperate on a number of initiatives, including combating illegal drug trafficking and other criminal activity, as well as promoting economic, democratic, and social development, said Hodge.\n\nThe United States established diplomatic relations with Panama in 1903 following its declaration of independence from Colombia. Today, FMS cases and other types of security assistance to Panama ensures it remains a secure, prosperous, and democratic country that is able to work with the United States as its principal partner in the region.\n\nHodge said the Beechcraft FMS case was delayed for over a year due to COVID and supply chain issues, but regained traction when the commander of U.S. Southern Command, Gen. Laura Richardson, conducted her first visit to the Central American nation in June.\n\nRichardson met with Panamanian leaders to reaffirm the longstanding security partnership between the United States and Panama and discuss current and future opportunities. Her visit followed other U.S. high-level visits to Panama, including First Lady Dr. Jill Bidens visit in May and Secretary of State Anthony Blinkens visit in April.\n\nPanamanian President Laurentino Cortizo Cohen, who met with Richardson during her June visit, thanked her for her support with the Beechcraft case.\n\nWe were fortunate that despite delays, we were able to successfully complete this case for an important ally in the region, said Hodge, an Army veteran with a logistics background. It took extensive coordination between multiple people and agencies, including the Army Aviation and Missile Command, the Fixed Wing Project Office for the Program Executive Office for Army Aviation, and the Security Cooperation Officer in country.\n\n"}