{"text": "GAMBELL, Alaska  On June 22, 1955, two Russian MiG-15s from Siberia shot down a U.S. Navy P2V-5 Neptune plane flying a routine maritime patrol from Kodiak out over the Bering Sea. After it crashed in flames on St. Lawrence Island, 16 Alaska National Guardsmen from the First Scout Battalion mounted an immediate rescue mission, ultimately saving everyone on board.\n\nOn March 28, 2023, more than 67 years later, the Alaska National Guard and Alaska Office of Veterans Affairs presented the Alaska Heroism Medal, the states highest award for valor during peacetime, to one veteran and 15 family representatives of the Alaska Army National Guards First Scouts.\n\nThe ceremony occurred in a packed gymnasium of more than 250 community members at the John Apangalook Memorial High School in Gambell, a St. Lawrence Island town south of the Bering Strait approximately eight miles from where the Navy plane crashed.\n\nAn Alaska Air National Guard HC-130J Combat King II and crew assigned to the 211th Rescue Squadron, 176th Wing, flew a delegation of 32 Soldiers, Airmen and civilians with the Alaska National Guard and Department of Military and Veterans Affairs from Joint Base Elmendorf-Richardson to Gambell for the ceremony.\n\nCpl. Bruce Boolowon, the only surviving member of the rescue team, attended the ceremony and received his medal from Maj. Gen. Torrence Saxe, adjutant general of the Alaska National Guard and commissioner of the DMVA.\n\nFollowing the ceremony, Boolowon said he appreciated the recognition and was proud of the First Scouts service. He retired from the Alaska Army National Guard as a sergeant first class, having served as a motorman and infantryman, he said.\n\nDuring the ceremony, Saxe recounted how the Alaska Scouts heard the crash, witnessed the Russian planes in the air and responded in their umiaks, open boats with wooden frames and covered by bearded seal or walrus hides. He said they had to make an immediate decision to cover miles of open water to get to the crash site to render aid while the Russian MiGs circled overhead.\n\nNobody in the chain of command, no higher-up, no general told them to go out and save those sailors, said Saxe. They saw it happen, they took charge and they moved out.\n\nOnce the Scouts moved the sailors to the beach, members of the community joined in to help stabilize them, eventually transferring them to the town church, where they continued medical treatment for two days until a plane arrived to evacuate them to Elmendorf Air Force Base in Anchorage.\n\nBecause of the expertise of the people of Gambell and the Alaska Scouts, they were able to stabilize the 11 sailors, and not one man of the 11 died, said Saxe. This is a long time coming and absolutely deserved. And truly it is an honor to be here today. We are eternally grateful.\n\nSaxe approved the awards after the director of the Office of Veterans Affairs, Verdie Bowen, learned about the event and realized the Alaska Scouts had never been fully recognized for their heroic actions. Bowen dug deeper into the history of the event and ultimately submitted the 16 Alaska Scouts for the Alaska Heroism Medal, which didnt exist at the time of the rescue.\n\nIn 1955, each member received a letter of appreciation for their actions, said Bowen, who explained that at the time there were no peacetime medals in the U.S. or National Guard inventory that could be awarded for First Scouts heroic actions.\n\nThe award citation states the First Scouts mobilized and rescued the 11-member crew, who received critical burns and gunshot and shrapnel wounds. The two MiG 15s that shot down the Navy patrol plane remained overhead during the extraction, approximately 40 miles from Siberia and 200 miles west of Nome.\n\nThe community reached out requesting commendation that more accurately recognized the valor of these brave men, said Bowen. No matter how long it takes, we are dedicated to honoring those that served with valor.\n\nDuring the Cold War, the 297th Infantry Scout Battalions operated from small villages in Northern and Western Alaska, constantly observing the Bering Sea coastline and often providing significant intelligence information.\n\nFor more National Guard news\n\nNational Guard Facebook\n\nNational Guard Twitter\n\n"}