{"text": "JOINT BASE LEWIS-MCCHORD, Wash.  It was standing room only at the Armed Forces Communications & Electronics Associations first-ever Enabling Distributed Command and Control symposium, where DOD, government and civilian attendees learned about new technology through a variety of workshops, keynote speakers and on-site vendors.\n\nNetworking was huge at this conference, said Sgt. Maj. Jason Melton, senior enlisted advisor for the information technology section (G-6) at Americas First Corps. We had active-duty service members from multiple branches, reservists, Guardsmen, civilians, retirees and even international attendees; all of whom were here to discuss the importance of how new and emerging technology can positively impact communication capabilities amongst all service branches in the Indo-Pacific.\n\nThe purpose of the two-day event was to further educate cyber, information technology and communications warfighters on Joint All-Domain Command and Control  known as JADC2  in the Pacific Theater. JADC2 is the DODs concept to connect sensors from all military services into a single network.\n\nMaj. Gen. Christopher L. Eubank, commander of U.S. Army Network Enterprise Technology Command, or NETCOM, elaborated on the importance of streamlining this endeavor.\n\nWe are in competition, crisis and conflict every day, said Eubank. Its not about the device on your desk, but rather about the data and accessing it. NETCOMs job is to ensure data is usable, accessible and transportable to enable your commander to make well-informed decisions.\n\nSgt. 1st Class William Rosebrock, a signal systems oversight non-commissioned officer for Americas First Corps, spent the entire second day of the conference learning from vendors about how new technology could benefit Soldiers in his organization.\n\nThese vendors brought us to the forefront of technology, said Rosebrock. Were talking about the ability for Soldiers to hand-carry lighter packages of equipment from point A to point B with the same level of access as before.\n\nLt. Gen. Xavier Brunson, commanding general of Americas First Corps, addressed conference attendees by highlighting the grim reality of the vast distances in a largely maritime theater of operations, where future conflicts may require decisions to be made within hours, minutes, or potentially seconds.\n\nNodal distribution requires thinking very differently given the Indo-Pacifics geography and geometry, said Brunson. Take Indonesia, for example, which includes over 17,000 islands that if you were to overlay them onto a map of the United States would stretch from Los Angeles out to 500 miles off the eastern seaboard.\n\nSenior military leaders have stated that access to data and information will be critical in the future operating environment. In addition, these leaders have stated that to challenge potential peer adversaries, a multidomain approach is required.\n\nThe traditional corps structure simply doesnt work in the Indo-Pacific region, said Maj. Christopher Bartok, G-6 operations chief for Americas First Corps. We have to be inherently joint and able to work with DOD, multinational and civilian partners by accessing the services we need to effectively command and control an operation over a vast area.\n\nJADC2 intends to enable commanders to make better decisions by collecting data from numerous sensors, processing the data using artificial intelligence algorithms to identify targets, then recommending the optimal weapon to engage the target.\n\nThe technology that supports JADC2 will increase data speed for commanders decision-making, said Melton. Well be able to distribute ourselves throughout different areas of the Indo-Pacific and operate in the same capacity as if we were together.\n\n"}