{"text": "PEO EIS Acquisition, Logistics and Technology Enterprise Systems and Services (ALTESS) product office, part of the Enterprise Services portfolio, teamed with several other Army organizations and successfully completed the migration of 45 Army Materiel Command (AMC) applications from the Defense Information System Agencys (DISA) milCloud 2.0 to the Enterprise Cloud Management Agencys (ECMA) cARMY cloud in May 2022.\n\nAMC had approached ALTESS, a full life cycle management service provider, earlier this year about migrating its applications in a compressed time frame due to DISAs decision to shut down milCloud on May 20. ALTESS, which previously had helped migrate more than 40 Headquarters, Department of the Army (HQDA) applications to the cloud, was a natural choice for the application migration project and began working closely with four AMC subcommands and ECMA in mid-February 2022 to get the job done.\n\nThroughout the rest of February and into March, ALTESS chief technology officer Andrew Parr and chief engineer Jordan Clark held assessment meetings with application owners from U.S. Army Tank-automotive and Armaments Command, Army Sustainment Command, Joint Munitions Command, and U.S. Army Aviation and Missile Command. In March, the migration team completed the project plan and schedule, and started provisioning and configuring cloud resources. In April, AMC began configuring its applications within cARMY and conducting application cybersecurity scanning, which ALTESS closely monitored with AMC and ECMA to ensure that the aggressive go-live schedule would still be met. The migration team also performed and tested backups on all AMC environments.\n\nDuring the final weeks of the migration, ALTESS and its partners prepared the final steps for go-live, which took place right on time and was completed by the May 20 deadline. The time-sensitive and highly visible project involved the teaming of multiple organizations, including AMC, ECMA, Army Analytics Group, Army Network Enterprise Technology Command, Army Cyber Command and ALTESS.\n\n&#34;Im extremely proud of how the joint team worked within a must-make timeline to drive nearly 50 applications supporting the mission of AMC out of milCloud and into cARMY, said Paul Puckett, director of ECMA. We are excited to continue this partnership for future customers moving to the cloud and leveraging lessons learned as we continuously enhance our offerings and processes to deliver cloud services that our customers love using.&#34;\n\nThis was a tremendous effort that in most cases would have taken more than 12 months to accomplish, said Sadhna Edwards, enterprise cloud lead at AMC. Everyones ability to work collectively, quickly adapt to new processes and overcome unforeseen events was integral to the success of the project.\n\nDescribing the successful migration as a big win for AMC, ECMA, ALTESS and the Army as a whole, ALTESS product director Boyd Williams said the project proves that applications can be moved at scale to the cloud and that ALTESS is a viable choice as an application service provider that can help the Army meet its cloud goals.\n\nThe ALTESS organization has grown so much as a managed service provider and is much more than just a data center, said Williams, referencing the organizations Radford, Virginia-based Army Enterprise Data Center, which hosts 115 applications and systems, and provides IT infrastructure, cybersecurity and application management services to system and application owners. With a workforce of 199 people strong, ALTESS is a group of seasoned IT professionals who are genuine in their efforts to provide the best IT services to the Army and DOD, he added.\n\nNow that AMCs cloud migration project is complete, ALTESS expects to provide sustainment work for the commands applications and conduct additional cloud migrations.\n\n"}