{"text": "U.S. Army Aviation and Missile Command has a new weapon in its training arsenal after introducing a course designed for logistics assistance representatives who support the MIM-104 Phased Array Tracking to Intercept of Target surface-to-air missile system.\n\nThe first iteration of Patriot 200, one of three Patriot-specific training courses now available to AMCOM LARs, was held Aug. 9-26, at Fort Sill, Oklahoma. Participants refreshed their troubleshooting skills and learned about the latest Patriot equipment modifications and software used by supported Patriot units.\n\nThe goal of the course is to enhance the capabilities of AMCOMs Patriot LARs workforce and is being offered as part of the AMCOM commanding generals Logistics Assistance Program, which advises, mentors and assists Soldiers on their particular weapons system.\n\nThe two-week course was developed by AMCOMs G-33 Training Branch  specifically Rodney Glaspie, Training Branch chief; Robert Sanchez, missile training coordinator; and Thomas McLain, instructor  in conjunction with input from LARs in the field. The G-33 Training Branch supports both missile and aviation weapons systems and also offers training to aviation LARs on various weapons systems as well.\n\nCurrently, AMCOM has Patriot LARs working around the world, and Glaspies goal is to ensure all representatives complete the initial training and offer refresher training every five years.\n\nOur intent is to provide more hands-on training to Patriot Soldiers at the point of need, said Glaspie. When we hire someone [to work as a LAR] for a particular weapons system, they generally have a deep background in that system and come to us with in-depth knowledge. The training we offer is reinforcement training.\n\nDue to the applied and technical nature of the course material, the initial class size was limited to three LARs who received training on the radar set, engagement control station and launching station with focus on troubleshooting techniques.\n\nStudents used the Patriot Interactive Electronic Technical Manual coupled with Patriot system diagnostics to identify, locate and repair faults and understand the data that is used by system maintainers and Soldiers working in the 94S military occupational specialty (Patriot system repairer).\n\nParticipants gained a better understanding of the Radar Digital Processor upgrades that have been installed on the majority of all U.S. Patriot systems, as well as changes that affect the radar antenna support group and the radar receiver group.\n\nAdditionally, the students learned how to manually control the radar set transmitter, which is required to trouble faults, and complete the radar set synchronization alignment procedure.\n\nGlaspie said there are many benefits to the training, including that it is a force-multiplier to the warfighter.\n\nThere is a scheduled reduction in field support representatives and someone has to be able to step up and support the warfighter, said Glaspie. Our LARs train, mentor and advise  and in order for us to do that well, we have to be trained, mentored and advised. Thats a part of this training process that our department is putting it together.\n\nSanchez agreed and talked about the importance of the relationship between Soldiers and the LARs who assist them.\n\nIf I could add on to what Rodney said about the biggest gain from this training being a force-multiplier on the tactical side, the personal side is that mutual trust between the green suiter and the LAR  knowing who we are and what we can do for them, said Sanchez.\n\nFuture offerings of Patriot 200 will accommodate up to five students and prepare them for the next higher level of training, which is offered at Letterkenny Army Depot, Pennsylvania.\n\nPatriot 200 solidifies the foundational tool [the LARs] had before and gets them ready for the future Patriot 300 course at Letterkenny, said Sanchez. This is the bachelors-level course with Letterkenny being the masters level.\n\nAMCOM plans to offer two Patriot 200 classes per fiscal year and the dates for next years courses are March 2022 and September 2022. For more information, contact Rodney Glaspie at rodney.w.glaspie.civ@mail.mil.\n\n"}