{"text": "FORT DETRICK, Md. -- Even though April, known as Sexual Assault Awareness and Prevention Month, or SAAPM, has come to a close, the fight against sexual harassment and assault continues, leaders of U.S. Army Medical Logistics Command said.\n\nIts not just this month; its each and every day, said Staff Sgt. Ella Greene, AMLC victim advocate. We want to see this momentum continue throughout the year.\n\nIn observance of SAAPM, AMLC hosted and participated in a number of events at Fort Detrick, underscoring the need to eradicate sexual harassment and assault from the Armys ranks and educating the workforce about how to react to and prevent such instances from occurring in the first place.\n\nThis years SAAPM theme was Intervene. We are a Team. That was a central message of AMLC leadership during a closeout ceremony April 26.\n\nCommander Col. Gary Cooper and Sgt. Maj. Akram Shaheed tested attendees on their knowledge of the Armys Sexual Harassment/Assault Response and Prevention, or SHARP, program and recognized participants in various events throughout the month.\n\nThe ceremony also served to recognize Denim Day, a day of action and awareness where people are encouraged to wear denim to combat victim blaming and educate others about sexual violence.\n\nAs a military member, I was part of the SHARP program and saw the effects and what it could do, and now being a civilian, I feel its a duty to support that through training and events like this, said Vanessa Kennedy, a program analyst for AMLC.\n\nIn addition to Teal Thursdays all month, members of AMLC and the U.S. Army Medical Materiel Agency, one of three AMLC direct reporting units, took part in different SAAPM events, including team physical training and SHARP Jeopardy. They also competed in the installations SHARP Challenge and SHARP Step Challenge.\n\nEach event incorporated the principles of the Armys SHARP program to provide refresher training for the workforce, while working as a team to accomplish a common goal.\n\nThe SHARP Challenge, held on Fort Detricks Blue and Gray Field, featured teams from across the installation competing in a timed obstacle course, which included different events, such as the football throw, bean bag toss and navigating through a track while wearing drunk goggles.\n\nHowever, before a team could begin each task, they first had to answer two SHARP questions.\n\nThis was an outstanding, well-run event, said Maj. Chris Wright, a member of the AMLC/USAMMA team that took first place and the coveted championship belt.\n\nWe had a lot of fun as a team, and I learned more about SHARP, he said. They were all really good questions as we went around here. Overall, it was just fun doing something with a team of people that was based on us coming together in a bunch of different ways.\n\nAMLC also narrowly missed out on top honors in the step challenge, coming in third place overall by about 3,000 total steps. Over a dozen team members participated in the event, including Kennedy, who totaled the most individual steps for the team overall.\n\nWhile it was a fun event and great way to get some exercise on a beautiful sunny day, participants stressed the importance of continuing to support SAAPM and the reason behind the months activities.\n\nI will walk to the end of the road for all my battles if that was required, Staff Sgt. Earnest Woodard said. These are events that I take really, really seriously. There were times when I wanted to stop (walking), but I didnt because I know this is bigger than me, bigger than our organization as a whole.\n\nElsewhere around AMLCs global footprint, the workforces of the U.S. Army Materiel Center-Europe and U.S. Army Medical Materiel Center-Korea both hosted SAAPM events in April, including USAMMC-E creating a Wall of Remembrance to survivors, offering words of encouragement. USAMMC-K organized a team hike up Hill 303 to recognize the effort.\n\nUSAMMAs Medical Maintenance Management Divisions, or MMODs, also organized events, such as a SAAPM breakfast and participating in Denim Day.\n\nKennedy said SAAPM and SHARP continue to be a priority because incidents still happen.\n\nThats why Im out here and why its important for SAAPM to continue to thrive, Kennedy said. Somebodys out there who doesnt have a voice and they need somebody in their corner to advocate for them.\n\nOne such service member spoke at the commands closing ceremony and shared her recovery from sexual assault earlier in her life. She said she is grateful to know that the military culture is changing.\n\nThis is part of my therapy, the service member said as she hugged team members.\n\nCooper said these types of personal stories drive home the need for organizations, such as AMLC, to operate as a team and take care of each other.\n\nYou never know what that person might be going through, he said.\n\nFollowing the ceremony, AMLC victim advocate Candace Harriday again thanked the workforce for their participation throughout April, as well as recognized her fellow organizers for their work over the past month.\n\nI think I have the best SHARP team in the Army, she said. We have a group of people who are passionate about their job, the work they do and the people.\n\nWhile its hard, you feel that youre making a difference in someones life.\n\n"}