{"text": "REDSTONE ARSENAL, Alabama  Members of the U.S. Army Aviation and Missile Command Logistics Center were recently recognized for completing a mission to relocate an Apache helicopter from Fort Drum, New York, to the Logistics Services International, Inc. facility in Jacksonville, Florida.\n\nThe purpose of the relocation was in support of current and future maintenance training device production and Program Executive Office Aviation and Project Management Apache.\n\nThe ALC transportation team members for this effort were George Heeschen, Tiffany Scharf, Alice William and Brian Johnson.\n\nThe requirement was to have the aircraft picked up from Fort Drum the week of Oct. 19 with delivery to LSI by Oct. 26, said Janice Hopkins, a traffic management specialist. The transportation office at Fort Drum was unable meet the timeline so the Apache project management office reached out to the AMCOM Packaging, Handling, Storage and Transportation Division, Movement Support Branch, for assistance. The movement support branch began coordination Oct. 20; pick up at Fort Drum occurred Oct. 23 and delivery was made in Jacksonville Oct. 26.\n\nWith a short timeline, the team coordinated with commercial carriers and loading of the aircraft for movement, prepared all documentation required, coordinated destination acceptance, certified all hazardous material and communicated with the destination for receiving the assets to meet the delivery schedule.\n\nMovement of the Apache helicopter via truck does not occur often as it is not a recommended mode of transport due to potential damage to the helicopter if executed incorrectly, said Hopkins. As a result, adherence to the guidance and instructions provided in the Apache shipping manual is critical, and significantly more planning and coordination is involved with a movement of this nature due to the size of the aircraft.\n\nHopkins went on to state that a specialized type of trailer is required, which limits the number of potential movement resources that are available. Pre-coordination is necessary to develop transportation cost estimates which assist the PMO in securing required transportation funds needed to execute.\n\nOnce all requirements were loaded into the transportation system and a carrier with the available equipment was selected, state permits had to be obtained in order to move the oversized load at night and over the weekend, said Hopkins. Loading and unloading was accomplished using cranes so constant communication with points of contact at the loading and unloading locations was necessary to ensure that material handling equipment was available for use at the necessary time. Coordination between the AMCOM Movement Support Branch, the carrier, the PMO, the unit at Fort Drum and LSI personnel was imperative for successful completion of this mission.\n\nAccording to Hopkins, the AMCOM PHS&T Movement Support Branch frequently supports similar missions for sustainment, foreign military sales and PMO requirements.\n\nWe evaluate every request that comes in to determine the level of support needed, said Hopkins. Some missions can be accomplished in a matter of days; others may take months of planning before execution.\n\nSheryl Floyd, ALC Materiel Management Directorate associate director, stated that the success of this team creates a collaborative environment of learning and knowledge sharing throughout the organization among their peers to ensure future mission successes.\n\nThe team demonstrates the utmost professionalism and logistics expertise in resolving complex distribution and transportation issues, said Floyd. They work together on consistent bases executing mission requirements to meet customer transportation needs. The weekly reports continue to reflect their support to the many missions they execute for Army readiness in support to AMCOM.\n\n"}