{"text": "There have been sightings in halls of the Task Force Spartan Shield headquarters of late of a rare Soldier, a Space Soldier.\n\nHowever, these are not the Space Soldiers you are used to seeing in popular sci-fi television shows or even military personnel depicted in the new Netflix comedy series, &#34;Space Force,&#34; starring Steve Carell and John Malkovich. These are real men and women who provide a unique capability to combatant commanders worldwide.\n\nWithin Task Force Spartan, there is a small section of Soldiers who provide capabilities that go beyond our atmosphere. This section is comprised of Soldiers from the Colorado National Guard&#39;s 117th Space Support Battalion, 1st Space Brigade,U.S. Army Space and Missile Defense Command,operating out of CENTCOM&#39;s area of responsibility.\n\nIn 2010, Secretary of Defense Robert Gates directed each military branch to develop a &#34;cadre of space-qualified professionals comprised of Military and Civilian personnel to represent their Military Service and agency&#39;s interests in space requirements, acquisition and operations.&#34;\n\nThese Soldiers use space enabled devices to perform unique and vital missions for the task force.\n\nAccording to Lt. Col. Adam Brink the Space Operations Chief, the Army uses space capabilities to shoot, move, communicate, gather intelligence and to protect the force.\n\n&#34;A simple example is GPS, which comes from a constellation of satellites,&#34; said Brink.&#34; Most people recognize that GPS is used for navigation and precision targeting, but GPS also provides timing data which is used in many civilian and military applications, from bank transactions to secure communications.&#34;\n\nTask Force Spartan Space Operations Deputy Maj. Clay Bibb emphasized the scope of the everyday Soldier&#39;s usage of space-based technology.\n\n&#34;If you look at today&#39;s battlefield, it&#39;s riddled with technology,&#34; said Bibb. &#34;Nearly 70 percent of those pieces of equipment in the Army are Space enabled in some shape or form. Whether you&#39;re talking about big explosions or little movements, those are all made possible through Space enabled equipment.&#34;\n\nSoldiers of the Space Operations Section work for years to earn the coveted Space Badge.\n\n&#34;To be a Space Operations Officer, you have to complete a ten-week course,&#34; said Brink. &#34;Then, for National Guard Soldiers, you need two years of experience to earn the Basic Space Badge, five years for the Senior Space Badge, and eight for the Master Space Badge.&#34;\n\nSpc. Kyle Mclaughlin, a Satellite Communications  Specialist, recently received his Space Badge. He came into the career field because of his passion for learning more about the final frontier.\n\n&#34;Space is a frontier that is never going to end; I&#39;m very passionate about Space. I&#39;m an engineering student, and I think that a lot of the skills I learn out here will go toward my aerospace engineering degree. I think it will help me think constructively toward the uses of the things I will be creating when I get that degree.&#34;\n\nAfter receiving the badge, McLaughlin stated that the process toward earning it has been fulfilling.\n\n&#34;The Space Badge required a lot of work,&#34; said Mclaughlin. &#34;Having achieved all that, and coming out here on this deployment, getting the badge is fulfilling. It&#39;s nice to know that hard work is rewarded in some way.&#34;\n\n"}