{"text": "FORT KNOX, Ky.  Walkers and runners have been clocking miles virtually everywhere this month.\n\nIn an effort to raise greater awareness to the issue of sexual assault within the Defense Department while working within the confines of COVID-19 restrictions, Fort Knox Sexual Harassment/Assault Response and Prevention program officials have created Virtual Walking for 7825+.\n\nBecause of COVID, I didnt want to have all these people together on this track, and coming into the gym with all these tables set up like we have in past years, said Sgt. 1st Class Shannon Ewing-Sudds, sexual assault response coordinator for 1st Brigade, U.S. Army Cadet Command, and coordinator for the event. I was like, Well, lets do it virtually because I have done virtual walks before.\n\nThe SHARP Walk event has occurred throughout September each year for the past four years to bring awareness to what leaders consider a frequently unreported crime. The walk number corresponds to the number of sexual assault cases reported within the Department of Defense in the previous year. The + sign indicates those incidents that were not reported.\n\nIn previous years, officials kept SHARP Walk events confined to Fort Knox as they counted laps on the track at Natcher Physical Fitness Center. They then tallied total laps weekly for each participating unit, organization or individual to get a sense of how close they were getting to the final goal.\n\nThis year, they are focusing on counting miles rather than laps on a track.\n\nLast year, Fort Knox walked a total of 46,982 laps, or 11,745  miles. This year, as of Sept. 15 the number of miles has exceeded 23,297 miles.\n\nThey have also extended an invitation to all units affiliated with each of the headquarters units at Fort Knox, even those not based at Fort Knox. Ewing-Sudds said the interest has exploded in unexpected ways.\n\nWord has already gotten out to a unit at Fort Campbell, who is currently deployed to Kuwait, said Sgt. 1st Class Shannon Ewing-Sudds, SHARP Walk 7825+ coordinator for Fort Knox. Now, theyre getting involved.\n\nOther organizations are also getting involved in the Fort Knox walk for the first time, including Knox Hills and Silverleaf Sexual Assault Trauma Recovery Services.\n\nWe have had a partnership with SHARP for years, and at the core of what SHARP and Silverleaf stand for is a shared mission: that individuals impacted by sexual violence get the best care and resources possible, said Dr. Jillian Carden, executive director of Silverleaf. Opening this event up was a great. Bringing awareness to sexual violence is really important to us, so were glad to be able to clock our miles with them.\n\nEwing-Sudds said her ultimate desire is to be a catalyst for removing the fear of reprisal and stopping the 7,825+ trend once and for all.\n\nIm a SARC. I dont stand for sexual assault, so even if victims are at another location and want to reach out to me, Im here to support them, said Ewing-Sudds. We need all the community to come together and let survivors of sexual assault know, You dont walk alone.\n\n_______________________________________________\n\nEditors Note: To keep track of Fort Knoxs progress or get involved, go to https://www.facebook.com/SHARPWalkFor7825.\n\nRelated Links\n\nArmy.mil: Worldwide News\n\nArmy.mil: Soldiers\n\nMilitary Crisis Line\n\nArmy Resilience Directorate\n\n"}