{"text": "ABERDEEN PROVING GROUND, Maryland -- Aberdeen Proving Ground children and families enjoyed an evening of literature and fun with lessons in STEM, word collecting and socializing during a Tell Me A Story (TMAS)  event at the APG Youth Center March 30.\n\nThe Military Child Education Coalition launched TMAS on September 11, 2005, with the mission of empowering Military Children by using literature and their own stories in a way that fosters skills for resilience, strong peer and parent connections, a sense of pride and accomplishment, and a caring community, according to their site.\n\nThe APG Family Morale, Welfare and Recreation directorate hosted the event featuring APG Garrison Commander, Col. Johnny Casiano, reading this years book The Word Collector by author Peter H. Reynolds to APG children.\n\nThe Word Collector is about celebrating words and their power to change the world, according to Reynolds.\n\nReynolds also sent a prerecorded message of thanks to the military families for their service and encouragement for the children to learn new words and share them with others.\n\nMay (the book) inspire you to find your own words, said Reynolds in the message.\n\nVarious APG organizations were also on hand for the event providing childrens activities, including words, science and technology, spiritual and educational resources, engineering, military family life and more.\n\nCommand Sgt. Maj. Michael Conaty, CECOM CSM, provide opening remarks sharing the significance of the event, families, military children, and the community.\n\nIts the community at large that can be supportive, have a shared mission, shared purpose and common values that help our military children thrive, said Conaty.\n\nJust as words help build commonality and build communities, Conaty said when children thrive, our communities thrive and events like TMAS make connections stronger.\n\nFor many, waiting each year for the event is worth it.\n\nThis is our favorite APG event, said Thereasa Alvarez, an Army Test and Evaluation Command employee, speaking about her and her son. The booths and reading each year are great.\n\nParents and children of all ages enjoyed the event.\n\nEven though he is only two years old, he is very interested in whats going on. We even read to him every night before bed, said Nicole Martinez, about her son, Lorenzo.\n\nReading is very important in their family and events like help reinforce that to their children, said Nicole, spouse of Sgt. Antonio Martinez with the Defense Centers for Public Health  Aberdeen (DCPH-A).\n\nThe Martinez family said they would love to see similar events in the future.\n\nTMAS is scheduled to take place next year.\n\n"}