{"text": "ABERDEEN PROVING GROUND, Md-Thirty-five members of APG Senior Leadership Cohort 14 celebrated completing the rigorous 10-month program during a graduation ceremony at the Mallette Auditorium here Feb. 16, 2023.\n\nThe APG Senior Leadership Cohort program was established in 2009 to develop and sustain a cohesive team of high-impact leaders within the APG community. The program includes learning periods, executive coaching and a community-based team project.\n\nAs of today, more than 450 Army civilians have graduated from the Cohort program and 11 Cohort graduates are members of the Senior Executive Service.\n\nHighlights of the ceremony included remarks from Cohort graduates, alums and guest speaker Dr. Eric Moore, executive deputy to the commanding general of U.S. Army Combat Capabilities Development Command, SES.\n\nCohort 13 graduate Elizabeth Groover, with DEVCOM Headquarters, served as the master of ceremonies.\n\nYou cannot build trust without authenticity, logic and empathy, Groover explained. And I believe that Cohort helps leaders develop in each of these necessary competencies. Because without trust, we cannot influence, which is really the bottom line of leadership.\n\nDeputy to the Commanding General U.S. Army Communications-Electronics Command Liz Miranda, SES, delivered opening remarks. Miranda said she attended the Cohort program 10 years prior. The program teaches leaders to be visionaries, she said. Leadership trends have changed in the last 10 years, and more leaders have adopted an open door policy, inviting employee feedback.\n\nThe speed of change, which by the way, shows no signs of slowing down, means that we need to be increasingly flexible and adaptable, she said.\n\nMiranda applauded the graduates for their focus and ability to multitask. During the 10-month program, she said, Cohort students completed the program while leading teams, completing complex projects and facing personal changes.\n\nDuring Moores remarks, he shared leadership lessons and challenged graduates to continue to nourish the professional connections they made while in the program.\n\nDown the road, you never know who is going to reach out and help you in different circumstances, he said.\n\nAccording to Moore, influential leaders serve as coaches and foster organizational growth. They ask questions instead of providing answers.\n\nLeaders as storytellers\n\nSix graduates shared some of the challenges they faced while attending Cohort 14.\n\nJoseph Deroba, chief of Radar Intelligence, Surveillance and Reconnaissance within the DEVCOMCommand, Control, Communication, Computers, Cyber, Intelligence, Surveillance and Reconnaissance Center, said at work and home, he adopted a chief fixer role. His immediate feedback during Cohort was that he needed to be a better coach.\n\nOne problem with being a chief fixer is that you are constantly trying to better yourself and you often forget that you need to better others around you, he said.\n\nAccording to Deroba, the Cohort program helped him see the value in developing the talents of his team and helped him become a better dad.Debora, a father of three, said he learned how to lead with empathy at work and home.\n\nI committed myself during this Cohort to fixing me, he said with emotion. I put in a lot of time with the coaches.\n\nJenn OBrien, chief of Plans under the Science and Technology Integration Directorate for DEVCOM, talked about going through a divorce while in the program. The Cohort program helped identify her strengths and weaknesses.\n\nOBrien described herself as passionate, confident and direct and said it is essential to know who you are and own who you are. We all add value to our organizations and to the Army, she stated.\n\nI am real; I am authentic and I will continue to lead that way, she said.\n\nPerseverance and gratefulness\n\nCohort Program Director Claire Meany, a contractor supporting CECOM, shared her thoughts on Cohort 14. She called Cohort 14 the back-on-track Cohort because it was the first Cohort that could meet in person since the COVID-19 pandemic.\n\nThis Cohort just got back in the saddle and rode until the end, she said.\n\nMeany also described Cohort 14 as thankful. They often expressed appreciation to APG senior leaders for sharing their time and expertise.\n\nCohort 7 graduate Joseph Welch, the Director of DEVCOM C5ISR Center and SES, provided closing remarks.\n\nThe leadership lessons that I experienced with Cohort have only continued to grow with time, he said.\n\nHe thanked APG senior leaders and family members for supporting the program. The program will pay dividends in every aspect of their lives, he said.\n\nCohort 14 graduates reaffirmed their commitment to supporting and defending the U.S. constitution by taking the oath of office administered by Dr. Patrick Baker, the director of DEVCOM Army Research Laboratory, SES.\n\nAll graduates received a certificate and a coin presented by Welch and Miranda.\n\n\n\n"}