{"text": "ABERDEEN PROVING GROUND, Maryland  The quote An ounce of prevention is worth a pound of cure, coined by Benjamin Franklin, exemplifies a foundational principal represented during National Fire Prevention Week (NFPW).\n\nThe National Fire Prevention Association (NFPA) has sponsored the public observance of NFPW since 1922, and it is the longest-running public health observance in our country, according the NFPA site. This years theme  Learn the Sounds of Fire Safety!  was aimed towards educating people about different sounds smoke and carbon monoxide alarms make.\n\nThis year, Aberdeen Proving Ground Firefighters lined up a full week of activities, including fire marshal training, static displays, extinguisher training, and a safety day, to educate APG employees and families on all things fire prevention, said Ernie Little, captain of the APG fire inspection team.\n\nEach event was based around this years NFPA theme, but more importantly, the entire concept of fire prevention, which is a topic that impacts everyone year-round, said the 36-year firefighter veteran.\n\nUnderstanding fire safety is a yearlong process and should be taken serious every day, said Little. Fire doesnt take a break and can happen anytime.\n\nStarting off the week, APG conducted fire marshal training  an annual class designed to train individuals in areas of fire prevention, including emergency lighting, fire extinguisher checks, smoke and carbon monoxide detector maintenance, and exit door maintenance, said Doug Benton, APG fire inspector and class instructor.\n\nBenton said fire marshals play a critical role in identifying incidents and violations, which helps the busy APG eight-man inspection team who has an annual requirement to inspect approximately 1850 square feet of space throughout APG, Adelphi Laboratory Center, and Blossom Point Research Field.\n\nFire marshals are the eyes and ears of our fire department within their specific location, said Benton. They help maintain safety in the workplace and educate employees on fire prevention.\n\nAnother event that week was a safety day filled with fire extinguisher training, smoke detector maintenance, a tour of an APG historic fire house, and the use of the APG fire safety trailer  an interactive fire prevention training aid designed to simulate bedroom, kitchen and industrial fire emergencies, said Roger Lyons, APG fire inspector.\n\nThe safety day reinforces topics that may seem like common practice and related equipment easy to use, but that isnt always the case, said Lyons.\n\nI have met people who believe they understand fire extinguisher use and other prevention equipment, but freeze up when they try to use them, added Lyons.\n\nThere are multiple types of fire extinguishers from Class A  K, all used for multiple types of scenarios, whether it in bedroom, kitchen, on the patio or in office, and our training simulates all those conditions, said Lyons.\n\nEach simulation also included fire alarms and smoke detectors making multiple types of sounds and chirps to alert someone to danger.\n\nWe want people to understand those [detector] sounds mean possible danger, said Little.\n\nParticipating in events and performing fire prevention drills is beneficial, but there is also a need for individuals to take what they learn and pass it on to family and friends, said Little.\n\nFamilies need to establish evacuation plans, communicate fire safety to their children, designate evacuation meeting places, and regularly check their smoke and carbon monoxide detectors, said Little.\n\nLittle said NFPW is a great way to amplify fire prevention knowledge annually, but asks everyone to practice fire safety and prevention daily."}