{"text": "Huntsville, Ala. - The Assured Positioning, Navigation and Timing/Space (APNT/Space) Cross-Functional Team (CFT) has concluded a 64-day stratospheric flight demonstration utilizing Airbuss Zephyr 8 ultra-long endurance solar-powered unmanned air system (UAS).\n\nLaunched from Yuma Proving Ground (YPG) on June 15, the Zephyr 8 UAS ascended to over 60,000 feet into the stratosphere before executing its flight plan over the southern portion of the United States, into the Gulf of Mexico, and over South America. Once returning to airspace over YPG, the team conducted multiple assessments.\n\nOn August 18 around 2100 hours PDT, the prototype aircrafts flight campaign ended when the Zephyr 8 UAS encountered events that led to its unexpected termination over YPG. These events are under investigation. No injuries or risk to personnel or other aircraft resulted from this incident. Further information will be released following the investigation.\n\n&#34;Our team is working hard to gather and analyze important data following the unexpected termination of this flight, said Michael Monteleone, Director of the APNT/Space CFT. Despite this event, the Army and its partners have gleaned invaluable data and increased knowledge on the endurance, efficiency, and station keeping abilities of high-altitude UAS platforms. That knowledge will allow us to continue to advance requirements for reliable, modernized stratospheric capabilities to our Soldiers.\n\nThis flight marked a number of firsts for Zephyr 8, including its departure from U.S. airspace, flight over water, flight in international airspace, data collection and direct downlink while outside of U.S. airspace, the longest continuous duration (7 days) utilizing satellite communications, and the demonstration of resilient satellite command and control from three different locations - Huntsville, AL; Yuma, AZ; and Farnborough, UK.\n\nDuring this flight, Zephyr 8 more than doubled the previous UAS endurance record, just under 26 days, and flew in excess of 30,000 nautical miles  more than one lap around the Earth. The 1,500 flight hours beat all known unmanned aircraft endurance records, marking significant capability and informing future mission requirements.\n\nThis experimentation successfully demonstrated Zephyrs energy storage capacity, flight endurance, station-keeping and agile positioning abilities. Given the amount of data that was generated during the 64-day flight and the time required to analyze it, as well as the need to investigate the events that led to the termination, further flight demonstrations have been postponed until 2023.\n\nThis 64-day test flight was performed in conjunction with government and industry partners who support experimentation that continues to inform Army requirements.\n\n"}