{"text": "AUSTIN, Texas  The Assured Positioning, Navigation and Timing/Space Cross-Functional Team, or APNT/Space CFT, takes a multi-dimensional approach to understanding and preparing for future warfare.\n\nThe team, based at Redstone Arsenal, Alabama, is dedicated to advancing the Armys tactical and navigational capabilities and ensuring tomorrows Soldiers have the modern situational tools they need to maneuver with utmost accuracy, safety and skill.\n\nThe CFT is making significant progress toward this goal by leveraging iterative developments, remaining open to new technologies and committing to continuously evolving PNT equipment and systems to meet changing threats and needs.\n\nOur cross-functional team will continue to assess and strengthen the future of our operational environments, emerging threats and technologies to ensure our Army is prepared for 2030 and beyond. We will continue to support the requirement development and delivery of trusted solutions to the Soldier, said Michael C. Monteleone III, director of the APNT/Space CFT, reiterating the teams focus on nimbly and steadfastly enabling the success of future warfighters.\n\nAccording to Army planners, the likelihood of future operations spanning diverse domains  air, land, sea, space, cyberspace and the electromagnetic spectrum  means Soldiers will need more flexible and far-ranging resources to inform their movements and operations.\n\nTo facilitate this, the APNT/Space CFT conducts rigorous field experimentation and prototype assessment and drafts detailed requirements for state-of-the-art materiel solutions, which the Army can then further develop and employ to improve information gathering and data precision without disrupting or adding extra burden to Soldier operations.\n\nExperimentation for APNT/Space happens on the ground and in the air, including along the electromagnetic spectrum  sometimes referred to as the invisible battlefield  and in the low Earth orbit of space.\n\nWithin these frequently interwoven domains, the APNT/Space CFT investigates alternative global positioning system capabilities and other navigation resources already in use while also evaluating how to best integrate new anti-jamming functions, electronic support, inertial navigation systems and vision-based navigation platforms.\n\nThe CFT coordinates regularly with industry, joint partners and other government agencies to identify and explore solutions that are modular, scalable and an excellent fit for multiple platforms, as well as the upgrades and adjustments that occur to equipment and systems over time.\n\nModern PNT tools currently being developed and fielded include mounted, dismounted and alternative navigation systems, situational awareness devices, and next-generation sensors designed to allow for optimum flexibility and performance against threats.\n\nWithin the realm of space, the CFT is shaping a strategy to provide survivable, responsive and resilient intelligence, surveillance and reconnaissance and communications capabilities in low Earth orbit, complete with the ability to share information rapidly and securely with tactical commanders on the ground.\n\nThe teams experts are also focused on understanding and preparing for the future of navigation warfare, or NAVWAR, which will require sophisticated offensive and defensive systems to produce tactical advantages and enable overmatch. To encourage synchronization of efforts on this front, the CFT is working closely with Army partners to draft an overarching NAVWAR strategy that aligns with U.S. Department of Defense NAVWAR plans but is also tailored to unique Army needs.\n\nBy studying and preparing for multi-domain operations and experimenting with the newest technologies available, the APNT/Space CFT is playing an integral role in helping the Army to equip Soldiers with more mobile, scalable and interoperable navigation devices, in turn strengthening the agility of the future force.\n\n"}