{"text": "More than 150 Soldiers from the Arkansas Army National Guards 39th Infantry Brigade Combat Team took charge of the Joint Multinational Training Group  Ukraine during a transfer of authority ceremony on April 28.\n\nThe 39th IBCT Soldiers, collectively known as Task Force Bowie, will ensure the combat effectiveness of Armed Forces of Ukraine soldiers training on systems and equipment issued under the U.S. Presidential Drawdown Authority, and training in combined arms and joint maneuver.\n\nJMTG-U is a rotational mobilization under the operational command authority of U.S. European Command, U.S. Army Europe and Africa, and 7th Army Training Command.\n\nThe mission was relocated from Combat Training Center  Yavoriv in western Ukraine to the Grafenwoehr Training Area in February 2022, in response to Russias unprovoked and illegal invasion of Ukraine. Task forces assigned to the mission since that time have worked with numerous U.S. military units, as well as Allied and partner nations to ensure the success of U.S.-led Ukrainian training in Germany.\n\nThe one common thread that has run through all of this, that has united all of those organizations and linked them together with our Ukrainian counterparts, has been JMTG-U, said Col. Stephen C. Marr, chief of staff of 7th Army Training Command.\n\nTask Force Bowie assumed the JMTG-U mission from Task Force Orion, a unit established from the New York Army National Guards 27th IBCT. Task Force Orion deployed to Grafenwoehr in July 2022. It was the second time the 27th IBCT assumed the JMTG-U mission.\n\nOver the course of nine months, Task Force Orion oversaw the U.S.-led training of AFU soldiers on more than 15 different systems and equipment, and the training of more than eight AFU battalion tactical groups in combined arms and joint maneuver. Through Task Force Orions efforts, the total number of AFU soldiers trained in Germany rose to more than 9,600.\n\nThe proof and the results are in the bravery and the actions of our Ukrainian brothers and sisters who are accomplishing them on the battlefield, said Col. William B. Murphy, Task Force Orion commander.\n\nWith the arrival of Task Force Bowie, JMTG-U remains postured to support the needs of the AFU, and help prepare them with the skills needed to push back against Russian aggression.\n\nWe are excitedto increase the [Armed Forces of Ukraines] lethality and capability, said Col. Olen C. Bridges, Task Force Bowie and 39th IBCT commander. Were eager to continue the legacy of the Joint Multinational Training Group  Ukraine mission. We know that there is a lot to do, and were here to do it.\n\nLearn more about U.S. Army Europe and Africa\n\nLearn more about 7th Army Training Command\n\nLearn more about the Arkansas National Guard\n\n"}