{"text": "WASHINGTON -- When Chinese military leaders visited a U.S. military post in 2012, Maj. Gen. Ross Coffman recalled that they were shocked to see what the Army could do.\n\nI saw it in their eyes, said Coffman, now the director of the Next Generation Combat Vehicle Cross-Functional Team. They didnt believe our capability. I think deep down that put a fear in them that they had to modernize.\n\nAs the U.S. Army continued to fight in the Middle East, the Chinese caught up with their own capabilities, he said Wednesday during a virtual discussion with the Center for Strategic and International Studies.\n\nToday, China is the top pacing threat for the American military, he said, and that may force the U.S. Armys fleet of armored vehicles to play a larger role in the Indo-Pacific region.\n\nWhile Russia announced it will field the T-14 Armata tank in fiscal year 2022, which it has described as the best killing system on the planet, China is still a bigger global threat, Coffman said.\n\nChina uses a whole-of-government approach, including its diplomatic, information, military and economic arms, to project power across the world. While it was once a regional threat, China now competes with the U.S. globally, he said.\n\nAny belief that China would self-limit [to their region] in conflict, to me, is short sided, Coffman said. In conflict, they will fight globally. Theyre going to use every arrow in their quiver.\n\nThe chairman of Chinas Central Military Commission recently said that war with the U.S. was inevitable, Coffman said, adding that was the first time the country has publicly made that statement.\n\nWhat does that mean? I think that means that youre willing to strike first, Coffman said. Because if its inevitable, why would you wait for your adversary to strike first?\n\nIn the deterrence business \n\nThe general said that there are two options for the U.S. military in the competition stage: deter or incite conflict.\n\nThe United States is in the deterrence business, he said. We dont want to go to war.\n\nThe Army also does not wait for a conflict, but rather is modernizing its units with over 30 signature systems, including new fighting vehicles, to create overmatch so nobody wants to fight you, he said.\n\nIf a conflict were to occur, he said it would not only be focused on air or maritime operations. The Indo-Pacific region has roughly 27 million square kilometers of land and half of the worlds population. A ground force would be required to take, hold and clear that land, he said.\n\nIn World War II, for instance, the U.S. military dropped around 6,800 tons of bombs and 22,000 naval shells during the Battle of Iwo Jima. Yet, it still took more than 70,000 Marines to defeat the Japanese ground force.\n\nEven after all that ordnance was expended, you still had to send the ground force in to be decisive, Coffman said. If we want to take, hold and clear land you need the ground element.\n\nThe Army now controls land using combined arms maneuver -- infantry, armor, field artillery and aviation assets -- that provide units the speed, range and convergence to enable decision dominance, he said.\n\nArmored vehicles give infantrymen mobile, protected, accurate and lethal fires for them to accomplish their mission. China currently has 10,000 fighting vehicles, including 7,000 tanks.\n\nIn order to be decisive, we have to be there with armor to prevent the Chinese to getting into position of relative advantage, he said.\n\nIn December, the generals team helped publish a new solicitation to industry for the Optionally Manned Fighting Vehicle, an advanced technology armored vehicle that could support mechanized infantry operations.\n\nThe Army has also recently received at least 20 Armored Multi-Purpose Vehicles, a program that will eventually replace the M113 armored personnel carrier.\n\nThese things are absolutely paramount to our success, he said, adding they are the workhorse of armored brigade combat teams.\n\nWhile both the Chinese and U.S. militaries will have modernized combat vehicles, Coffman said the latter will still have the edge.\n\nWhat they dont have, and they will never have, is the professional women and men of our armed forces and our ability to fight as a joint force in a combined arms team for maneuver, he said. Thats what our advantage is. That combined with our modernize efforts is what makes us the best military in the world.\n\nRelated links:\n\nArmy News Service\n\nARNEWS archives\n\n"}