{"text": "FORT CAMPBELL, Ky.  The Screaming Eagles are experimenting with the latest iteration of modernized Army communications capabilities, both at home and abroad, to help guide development of technologies, doctrine, and policy.\n\nSupporting the Armys process of using Soldier feedback and lessons-learned to enhance the network, the 3rd Brigade Combat Team, 101st Airborne Division (Air Assault), or 3-101, recently completed an Integrated Tactical Network validation exercise at their home station, while elements of the Division are using additional capabilities while deployed to Romania.\n\nSince its introduction to Soldiers in 2019, the Integrated Tactical Network, or ITN, has been providing secure but unclassified and encrypted mobile network communications that increase communications mobility, flexibility and resiliency. As part of division-centric network design efforts, the Army will simplify the network at brigade and below levels to support the Armys Division as Unit of Action plan, which will elevate network-related complexity to the division echelon, freeing up maneuver units to focus on the fight.\n\nWe are asking ourselves, what does that division commander need in order to command his division and all his forces, so we are designing the next capabilities to be centered around the division as unit of action, said Col. Shermoan Daiyaan, Project Manager for Tactical Radios, under Program Executive Office for Command, Control, Communications-Tactical.\n\nThe key to refining ITN capabilities at all echelons is through continued fielding, Soldier feedback and iterative improvements, providing more units across the globe with hands-on, real-world experiences using the capability. The Army will use this feedback to inform Army of 2030 network designs, centered on large-scale combat operations.\n\nSo far, the ITN has been fielded to multiple infantry brigade combat teams across the 82nd Airborne Division, 25th Infantry Division, 11th Airborne Division and one Stryker unit, the 2nd Cavalry Regiment, with additional BCT and division enabler fieldings underway or planned for the remainder of FY23 and FY24.\n\nThe 82nd Airborne Division, as an early ITN adopter, will be the first full division equipped with ITN, followed by the 101st and 1st Cavalry Division.\n\nThe ITN is going to give our commander better situational awareness of whats going on across the battlefield, said Chief Warrant Officer 2 Craig Alhouse, brigade network operations officer with the 3-101. Whether were doing a forcible entry or an airfield seizure, whats different is whats displayed and how the commander reaches out to the subordinate and tells them what he needs them to accomplish.\n\nThat also would give the commander more informed decision abilities in the long run, he said.\n\nThe thrust of the validation exercise featured individual Soldiers using the full ITN suite, including leader radios connected to their end-user devices to send text messages up to the brigade level, which then compiled operational graphics to send up to the nationalized higher headquarters over the Secret network.\n\nWith options for assured voice, text and graphics communications over several channels, the ITN provides multiple paths for communications, even in network-degraded environments.\n\nI think one of the things we noticed with ITN is that it removes the ability to say you didn&#39;t get that message, said Capt. John Dacier, 3-101 Brigade Assistant S3. You have a plethora of ways to communicate all the way down to the granular level.\n\nThe pathway providing seamless two-way communications is the Secure But Unclassified-Encrypted, or SBU-E, enclave. Since the ITNs initial fielding, SBU-E has been used at the battalion and below level, with division headquarters and enablers communication at the mostly Secret level.Because communications are encrypted, SBU-E provides appropriate levels of security for safe mission partner collaboration without the complexity of setting up a secret environment.\n\nAs part of assessments that will inform division-centric design, the 82nd Airborne Division is nearly exclusively employing SBU-E at its Joint Readiness Training Command rotation this spring. The 25th Infantry Division is also incorporating SBU-E during this spring and summers multi-national Pacific Pathways exercises across Hawaii, the Philippines, Indonesia and Australia, providing the Army with even more critical feedback.\n\nIsland hopping experimentation using SBU-E in the Pacific, and in the European theater, is critical for the Army to prepare for future conflicts because we will never fight alone, said Daiyaan. That&#39;s real combat power at the tactical edge.\n\nTechnology enhancements aside, Army leaders may consider policy changes to implement the proliferation of SBU-E network communications at battalion and below, which is a consideration for the next round of capabilities in 2025.\n\nWe are looking at different courses of action to reduce that complexity at brigade and below levels, so if policy allows mission partner environment data exchange in SBU-E we could certainly reduce complexity because there&#39;s fewer domains and enclaves, said Matt Maier, Project Manager for Interoperability, Integration and Services, under Program Executive Office for Command, Control, Communications-Tactical.\n\nIn addition to exchanging operational graphics and position location information with Romanians inside of the mission partner environment, the 101st Airborne Division (Air Assault) is employing a simplified data plan focused on data security and credential management identification while deployed in Europe.\n\nOnce you secure data, then you don&#39;t necessarily have to secure the network all the time, [which adds] a layer of complexity, said Lt. Col. (P) Randy Linnemann, 101st Airborne Division G6. While weve been here, we made progress replicating a lot of our Army mission command information systems into a cloud environment.\n\nThe 101st Airborne, along with the 4th Infantry Division and on a larger scale I Corps, has piloted data and cloud capabilities as part of the Armys overarching data-centric networked environment experimentation.\n\nITN brings [the ability] to pull that data from the edge up to the headquarters, process it at the headquarters and then deliver refined data back down to the edge, Linneman said. So we&#39;ve become much more effective, pushing our data exchanges down to the lowest level so that we get the best data going through the chain of command, enabling more rapid and better decision making at every echelon.\n\nLeveraging the cloud to leave behind cumbersome network equipment, which can be vulnerable to damage due to the elements, also been a game changer, according to Linneman.\n\nNot having to run that equipment there with us has led us to actually have a higher reliability rate then we would have had running it on premise, Linnemann said. Having our data available to us everywhere we go in the world [in the cloud] is really kind of what we&#39;re looking at.\n\nArmy network developers are taking this feedback and incorporating it into cloud-native command post options for Army of 2030 network designs.\n\nOver the next several months, the Army is working plans to simplify and adapt the network foundation for 2030, while enabling design and requirements to support Army of 2040.\n\nAs the Army moves forward with its preliminary design process for FY25 network design, it will also take lessons learned from previous, current and future laboratory and operational exercises to meet Division as Unit of Action requirements.\n\nWorking with the 101st is our first opportunity to identify how we can move the complexity up to Division to meet Army 2030 imperatives, Maier said. Lessons learned and iterative improvements are the only way we get good at this, which is why we talk to units and pull them into the conversation early and often.\n\n\n\nThe U.S. Army Program Executive Office Command, Control and Communications-Tactical develops, acquires, fields and supports the Army&#39;s mission command network to ensure force readiness. This critical Army modernization priority delivers tactical communications so commanders and Soldiers can stay connected and informed at all times, even in the most austere and hostile environments. PEO C3T is delivering the network to regions around the globe, enabling high-speed, high-capacity voice, data and video communications to a user base that includes the Army&#39;s joint, coalition and other mission partners.\n\n"}