{"text": "Some of Army Cyber Commands (ARCYBER) brightest minds are among the world-class experts leading Army modernization while building ties and collective knowledge in the military, industrial and academic communities.\n\nMost recently, Maj. Jaison Desai, Ph.D. and Lt. Col. James Sanders of ARCYBERs Technical Warfare Center joined colleagues from the Army Cyber Institute and the Army Artificial Intelligence Integration Center, along with more than 100 other experts from across the Department of Defense (DoD), national laboratories, Federally Funded Research and Development Centers, academia and industry who attended and made presentations at the 2021 Emerging Techniques Forum (ETF). The event was hosted by the Military Operations Research Society (MORS) in Alexandria, Va., in December 2021.\n\nDesai and Sanders represented the Enterprise Information Technology as a Service (EITaaS) pilot program team, which falls under ARCYBERs Network Enterprise Technology Command (NETCOM). The pair presented work created in collaboration with fellow team members Mark Southwell, Maj. Ezra McCalment and Maj. Tony Abeyta. Their presentation  Process Innovation and Exploration of Army EITaaS Approaches -- highlighted policy, assessment and process challenges with adopting as-a-service models and how the team is navigating those areas. The presentation drew praise from numerous attendees and requests for copies and further discussion from Maj. Gen. Martin Klein, commander of the U.S. Army Reserves 75th Innovation Command, and U.S. Marine Corps Lt. Gen. (Ret.) Loretta Reynolds, former USMC deputy commandant for information.\n\nBeing able to present at the MORS conferences is an amazing professional development opportunity and a great way to build connections with other members of the operations research community throughout DoD, Desai said. This years conference was particularly special because I was able to represent our ARCYBER and NETCOM team and share the progress weve made in areas critical to Army modernization.\n\nDesais contributions to academia have earned accolades before. His December 2020 presentation, Determination of Influential Factors on Roadway Bridge Sufficiency Using Inspection Data and LASSO: A Proof-of-Concept earned MORSs Eugene P. Visco Prize, and &#34;Challenges and Insights from Developing an Analytical Baseline for Installation-Level Enterprise IT&#34; was named a best presentation in June 2021. He has published several articles and papers, most recently a co-authored paper on spatial connectedness for the journal Organization Science. But he called those achievements representative of the support, skill and knowledge of the EITaaS team, and said the success at last months conference was a team success. I was the one who delivered the presentation  the team did the work, he says.\n\nThat team is a Total Army organization that leverages the unique talents of members of the Armys active and reserve components. Sanders, an Army Reserve officer who supports ARCYBER while also working a full-time civilian job running his own company that specializes in cloud and IT infrastructure, is a perfect example of how that mix brings added vital capabilities to ARCYBERs mission.\n\nDr. David Azari, ETF Chair and Operations Research Analyst for Army Futures Command, said ARCYBER and active duty service members presenting during the ETF provided highly valuable insights, augmenting question-and-answer sessions with practical, real-world applications of emerging techniques and approaches that will continue to inform the growth of national security analytics.\n\nIn particular, service members were instrumental in prompting discussion among senior leaders from across national security organizations on the future of professional growth, training and enduring skills development to support emerging and increasing digital transformation and cloud-based capabilities across DoD, he said.\n\nDuring the MORS event Desai and Sanders also attended and represented ARCYBER at 20 presentation sessions on topics including advances in artificial intelligence techniques, clustering algorithms for social-based data, strategic communication and information operations typology development, cybersecurity for critical infrastructure defense, and modeling in R and Python.\n\nLearn more about MORS at https://www.mors.org/\n\n------------\n\nABOUT ARCYBER: U.S. Army Cyber Command integrates and conducts cyberspace operations, electromagnetic warfare, and information operations, ensuring decision dominance and freedom of action for friendly forces in and through the cyber domain and the information dimension, while denying the same to our adversaries.\n\nARCYBER ON THE WEB: https://www.arcyber.army.mil\n\nARCYBER TWITTER: https://twitter.com/ARCYBER\n\nARCYBER LINKEDIN: https://www.linkedin.com/us-army-cyber-command\n\nARMY CYBER ON THE U.S. ARMY WEBSITE: https://www.army.mil/armycyber\n\nInterested in the challenge of joining the Army Cyber team? Check out military and civilian cyber career and employment opportunities by clicking on the &#34;Careers&#34; tab at www.arcyber.army.mil\n\n"}