{"text": "WASHINGTON  Lt. Col. Frank Rubio came from humble beginnings, raised by a single teenage mother in southwest Miami. More than 30 years after he joined the Army, the UH-60 Black Hawk pilot will be making his first venture into space Sept. 21 when he launches from the Baikonur Cosmodrome to the International Space Station as a NASA astronaut.\n\nRubio said his mom, an immigrant from El Salvador, raised him in an environment that encouraged hard work.\n\nOne of the most important things that my mom taught me as we were growing up is that, despite the challenges we faced, it was never an excuse, he said. I had to work at things and move forward, and fortunately, that instilled a really good work ethic.\n\nRubio, who joined the Army in 1998 as a means to pay for college, earned a Doctorate of Medicine and went on to have an extensive military career. He has flown more than 1,100 hours, including about 600 during deployments to Bosnia, Afghanistan and Iraq.\n\nHe also earned his Jumpmaster certification and has conducted more than 650 freefall skydives.\n\nI went into [the Army] thinking Im going to do my five years and get out and have a long civilian career, and I ended up loving it, he said. Every day you come to work and youre facing a new challenge in so many different ways. So, what I thought was going to be five years is now going on 25 years. I acknowledge that Ive had an incredibly blessed career, and its been a lot of fun, but Ive also had a lot of challenges.\n\nIn 2017, Rubio faced a new challenge very few people get to do to do: to become an astronaut.\n\nTo become an astronaut, applicants must overcome several hurdles. More than 18,000 astronaut applications were reviewed in 2017 and only 12 were accepted for NASAs class of 2017.\n\nRubio, who was one of those selected, began his two years of training as an astronaut candidate and also trained on the upcoming mission to the ISS as a flight engineer and crew member of Expedition 68.\n\nThe challenging part for a lot of people is just the breadth of things that we have to study, Rubio said. You&#39;re training for EVAs or extravehicular activities or spacewalks. That&#39;s a pretty rigorous, both physical and academic, item that you have to tackle, and you kind of continuously train for that, throughout your training flow.\n\nRubio had to learn about the life support, water and electrical systems of the ISS. On top of all the training that he got regarding the ISS, he also received training on the Soyuz spacecraft, which shuttles astronauts to and from the ISS.\n\nJust trying to keep all that kind of in the forefront of your mind is a challenge, Rubio said.\n\nHe attributes his ability to overcome challenges in part to the training and operational experiences hes had in the Army.\n\nThe Army has singularly provided unique opportunities for me, but I think  more important than that and more than the experiences themselves  is the adaptability that you build, Rubio said. We have, as Soldiers, just become incredibly resilient and adaptable because you have to  you never know whats coming at you.&#34;\n\nRubio, who is scheduled to launch with Russian cosmonauts Sergey Prokopyev and Dmitry Petelin, is not sure if he will get the opportunity to perform a spacewalk during his stent aboard the ISS but is excited at the chance.\n\nIf I get the privilege of doing a spacewalk, I think one of the hardest challenges for me is going to be twofold: looking down because I want to stare at the Earth the entire time and how beautiful it is, and then also not looking up because I just want to stare at the stars and just the incredible blackness, Rubio said. Nothing gives you that perspective of how tiny we are and also how amazingly privileged we are to have the Earth.\n\n"}