{"text": "FORT GORDON, Ga. -- Senior military and civilian leaders from across the Army, Department of Defense, and multinational and interagency partner forces came together to discuss concepts, initiatives and requirements for enabling Multi-Domain Operations (MDO) in the information dimension (ID) during an Information Advantage (IA) Summit hosted by Army Cyber Command (ARCYBER) here, Sept. 20-21.\n\nThe Summit was conducted live and virtually, in compliance with all applicable COVID-19 health protection and safety guidelines.\n\nSummit participants represented the spectrum of organizations that are working together to develop the evolving doctrine, training and capabilities that will allow commanders to integrate IA into sustained MDO to enable decision dominance and influence adversaries in competition or armed conflict operations. The forum allowed those organizations to cross-level knowledge across the joint force and strategic partners engaged in the transformation and employment of IA, and discuss capabilities and challenges.\n\n&#34;We (Army Cyber) are not the only player in this business, and that&#39;s really important to understand  nobody owns the entire mission, said Lt. Gen. Stephen G. Fogarty, ARCYBER commanding general.\n\nThere are many other functions, disciplines and organizations, such as public affairs, information operations, psychological operations, intelligence, electronic warfare and others, involved in IA across the full spectrum of conflict, the general explained.\n\n&#34;We&#39;ve got to bring together the bigger team,&#34; he said.\n\nDuring the Summit the leaders discussed information dominance, influence and effects and the evolution of information as a vital warfighting capability and an increasingly decisive factor in military operations. Briefings, presentations and discussions during the summit explored the full range of topics affecting the development of IA and Army, DoD, joint and combined MDO. Topics included an overview of threat actors in the ID; doctrinal publications and concepts; joint and partner force initiatives; social media in the ID; integration of IA forces and capabilities; information operations; special operations; civil affairs and psychological operations; misinformation and disinformation; outreach and collaboration programs; commercial data collection; ongoing and proposed training; and military information support operations.\n\nAs part of the Summit, leaders from U.S. Army Training and Doctrine Command shared a draft concept of new doctrine that supports the Armys transformation in the ID.\n\nIn addition, the participants shared plans and lessons learned from exercises and operations such as the Information Warfare Task Force-Afghanistan and Joint Warfighting Assessment 2021, and MDO support to exercises Defender Pacific 2021 and Defender Europe 2022.\n\n&#34;Information Advantage actually is required in the kinetic fight. Its about much more than social media; its the ability to make decisions and direct the action with those decisions by creating understanding faster than the adversary,&#34; Fogarty said.\n\n----------\n\nABOUT US: U.S. Army Cyber Command integrates and conducts cyberspace operations, electromagnetic warfare, and information operations, ensuring decision dominance and freedom of action for friendly forces in and through the cyber domain and the information dimension, while denying the same to our adversaries.\n\nARCYBER ON THE WEB: https://www.arcyber.army.mil\n\nARCYBER TWITTER: https://twitter.com/ARCYBER\n\nARCYBER LINKEDIN: https://www.linkedin.com/us-army-cyber-command\n\nARMY CYBER ON THE U.S. ARMY WEBSITE: https://www.army.mil/armycyber\n\nInterested in the challenge of joining the Army Cyber team? Check out military and civilian cyber career and employment opportunities by clicking on the &#34;Careers&#34; tab at www.arcyber.army.mil\n\n"}