{"text": "Program Executive Office, Aviation has the completed the first unit upgrade in its program to replace the Enhanced Digital Engine Control Units (EDECU) for T700 series engines used across the Army helicopter fleet.\n\nEach of Utahs Army National Guard 1st Battalion, 211th Aviation Regiment helicopters T700-GE-701D engines now have the latest P09 EDECU. Theregiment brought its fleet of Apache helicopters to West Jordan, Utah in February for this phase of the P09 EDECU upgrade fielding effort. The effort was initiated by the Aviation Turbine Engines (ATE) Project Office and overseen by the Apache Project Office. Both project offices are part of PEO Aviation.\n\nMaintenance teams completed installation of the P09 EDECUs onto the 211ths 23 aircraft (46 engines) onsite by the end of March. The next Apache upgrade will take place in Alaska during the summer. In addition to upgrading previously fielded engines, all new T701D engines for both Black Hawk and Apache are now produced with the P09 EDECUs and the AMCOM Logistics Center (ALC) is procuring the P09 EDECU for its spares inventory.\n\nWhy the change? With over 50 million flight hours, the T700 series of engines and its variants have been a reliable power source for multiple premier helicopter platforms for more than 40 years. In 2018, the Army identified a reliability problem with the P07/P08 EDECU where a particular failure mode led to high side event occurrences. The problem required the T700/T55 Product Office to rapidly develop and field an upgraded EDECU for the T701D engine. By early 2019, the team developed and qualified the P09 EDECU. In order to gain confidence in the rapidly developed design, ATE performed a Lead the Fleet effort over the course of 21 weeks with 48 P09 EDECUs that accumulated 5,095 flight hours. Because of the Lead the Fleet effort, ATE was able to identify and fix one design issue prior to fleet wide fielding.\n\nTo ensure the T700 remains mission ready, the Aviation Turbine Engines T700/T55 Product Office relentlessly works to create affordable solutions to enhance the engines durability and reliability. Even as the P09 upgrade continues, the T700/T55 Product Office will continue to provide expertise in engineering, acquisition, and program management to the Warfighter to ensure that the T700 series engine continues to be the Armys premier turbine engine on which Soldiers rely.\n\n"}