{"text": "BOSTON, Mass.  The young noncommissioned officer held up a small, plastic and common soap container. Its a radio in a soapbox, said Staff Sgt. Youngjin Kim, a Psychological Operations Specialist.The crowd of senior commanders and general officers watched quietly as Staff Sgt. Kim gave a demonstration of the idea he was pitching.\n\nKim along with 10 other tactical-level innovators joined the senior leaders of 1st Special Forces Command (Airborne) in a weeklong roundtable discussion in Boston alongside innovation experts in private industry, the Department of Defense, and academia. On the agenda for this day, the innovators, representing the 11 subordinate commands across the organization of 23,000 soldiers and civilians, pitched ideas for innovation at the esteemed Massachusetts Institute of Technologys Lincoln Labs.\n\nKim opened the soapbox and held up a Raspberry Pi, which is a small, popular single-board computer known for its modularity and open design. Using the computer, Kim explained how Psychological Operations could use it as a way to perform live broadcasts. The concept would decrease the need for larger, similar systems and could have applications for evolutionary innovation in how PSYOP Specialists deliver information.\n\nImagine a situation in a country where Soldiers are supporting a humanitarian mission following a devastating natural disaster. Winds and flooding destroyed commercial infrastructure, which includes antennas and broadcast stations. A PSYOP team could deploy a similar broadcast system mounted to an unmanned aerial system to help people receive critical information on where to find water, medicine, and food.\n\nKim demonstrated the broadcast as the room waited in silence. He turned it on and Rick Astleys popular song, Never Gonna Give You Up played over the speaker. The use of the well-known 80s hit song in an unexpectedly bait-and-switch style meme is affectionately known as Rickrolling. The audience laughed at the lighthearted moment.\n\nInnovation, at its core, is passion, said Kim. Being able to explore our passion here is important. When new tech emerges, our adversaries quickly use them. We have to be able to compete with them.\n\nKim, originally from the Republic of Korea and a former Soldier in the Korean Army, represents the first Special Operations Forces Truthpeople are more important than hardware. Although innovation may include new technology, concepts, and organization, at its heart innovation is a mindset and it begins with people.\n\nThe rest of the week focused on a tour with Lincoln Labs as innovators met experts in their fields of interest. Leaders and innovators also attended a lecture with academia and industry leaders at MITs Innovation Headquarters located in the heart of Boston.\n\nAnother key moment from the week was a tour of the USS Constitution, the nations oldest ship still afloat from 1797 and last saw combat in the War of 1812.\n\nYoure probably asking why we are here, said Maj. Gen. Rick Angle, commander 1st Special Forces Command to the crowd. This is original innovation built out of necessity.\n\nThe USS Constitution was one of the six original frigates of the US Navy designed by American shipbuilder John Humphreys. Humphreys realized the United States was no match in size compared to the navies of Europe so he came up with a design that focused on speed and used a hull constructed in superior American oak. Humphreys designed its ribs to be four inches apart meant to take a pounding in battle. The English ships&#39; ribs were ten inches apart. It was a small change but one that would prove to be invaluable. During a battle in the War of 1812, an 18-pound English cannonball bounced off the side of the Constitution. A sailor yelled out, her sides are made of iron and thats how she became known as Old Ironsides.\n\nThe USS Constitution demonstrated that innovation is nothing new. Its challenging and arguably more so in todays age of big data, high tech, AI and machine learning. Innovation occurs out of necessity, and it takes being able to see whats coming not just in a few years but in decades to come. The ship serves as a reminder to innovate today for the unknown of tomorrow.\n\nBy the weeks end, the command left Boston with new concepts and ideas to help build Army Special Operations of 2030 and beyond while remaining the nations premier partnered irregular warfare force.\n\n"}