{"text": "FORT KNOX, Ky.  U.S. Army dining facilities, also known as warrior restaurants or DFACs, provide an average of over 222,000 meals per day, worldwide. DFACs serve to supply the Armys warfighters with nutritious food in a safe and sanitary manner so that Soldiers can train and fight to the best of their ability.\n\nU.S. Army Sustainment Command oversees and operates 185 DFACs across the ASC food service enterprise. It is important that quality assurance evaluators are trained and informed on the performance readiness standards  or PRS  put in place to maintain safe and sanitary operations at all DFACs.\n\nIt doesnt matter how big the installation is or how small the installation is, the Soldier gets the same quality, said Craig Schwartz, a Food Program analyst located at ASC Headquarters at Rock Island Arsenal, Ill. Whether theyre at Fort Knox, Kentucky, or at Fort Bragg (North Carolina) or at Natick (Soldier Systems Center, Massachusetts), we have the same standard, the same food, and it&#39;s as safe as it is anywhere across the Army.\n\nA group of 11 ASC food service employees met at Fort Knox April 10-14 to update these standards and record training videos, which will serve to train incoming QAEs, contracting officer representatives, and food program managers on how to inspect DFACs properly.\n\nBy bringing food service employees together from a variety of installations including RIA; Fort Bragg; Fort McCoy, Wisconsin; Fort Benning, Georgia; Fort Novosel (formerly Rucker), Alabama; Fort Knox; Fort Hood, Texas; and Camp Parks, California, they were able to use a variety of experience and knowledge to create the most versatile PRSs that can apply to all of ASCs DFACs across the Army.\n\nIts important to standardize DFAC evaluations so that no matter where a QAE goes, if they transfer to a different place, it&#39;s the same standards for the DFAC no matter what, said Wade Froehlich, ASC HQ food service analyst. Now, were setting a standard to show them that we inspect the same no matter what area of the U.S. or across our enterprise.\n\nAfter the 12 standards were established, training videos were recorded.\n\nThese training videos cover many topics including cleaning and sanitizing food service equipment and surfaces; washing, rinsing and sanitizing pots and pans in three-compartment sinks; operating and maintaining mechanical dishwasher machines; cleaning and maintaining dining facility interior and exterior areas; maintaining and preparing dining room service areas; furnishing and maintaining expendable cleaning and sanitary supplies; establishing and maintaining administration operations; maintaining automated and manual headcount procedures; managing, maintaining and accounting for government subsistence; food preparation; and safeguarding and serving food.\n\nBoth non-operational and operational DFACs were used to record these training videos.\n\nThe videos serve to explain the standards, as well as the subcategories of critical standards and other standards involved in each PRS, and how to properly conduct the inspection and determine whether a PRS is satisfactory or defective.\n\nI think these training videos show that were a learning organization. Were trying to teach the QAEs and CORs and FPMs what the standard is so that they can build and improve upon that, Schwartz said of the benefit of the training videos. If they dont have a firm foundation of what our contract is saying and how we have to inspect them and what our outcomes are, were never going to get better. Im really pleased that were actually doing these training videos and investing in our people.\n\nThese videos will serve as part of a larger project of a complete training program for ASCs food service enterprise personnel.\n\n"}