{"text": "HUNTSVILLE, Ala.  U.S. Army Space and Missile Defense Command and other Team Redstone members were recognized and honored for their commitment to national defense.\n\nThe Air, Space and Missile Defense Association presented achievement and service excellence awards to local government and contractor employees in recognition of their achievements in the development, test, and deployment of air, space, and missile defense systems during the ASMDA annual membership luncheon, Feb. 16.\n\nI want to thank the ASMDA board for everything you do for our community, said Lt. Gen. Daniel L. Karbler, USASMDC commanding general. When you look at the awards that were presented, its just a microcosm of the integration and coordination between ASMDA, SMDC and all the other players in the Huntsville community that have space or missile defense in mission areas and today was an opportunity to recognize that.\n\nASMDA was formed in 1995 in Huntsville as a non-profit, non-political educational and scientific organization.\n\nKathleen Smallwood, ASMDA committee chair, said that for the past 28 years, ASMDA has supported community events for veterans, presenting space and missile defense technical achievement and service excellence awards, providing scholarships for science, technology, engineering and math students, as well as, Space Camp scholarships, and exposing students to opportunities on Redstone Arsenal through Adventures in Engineering, all to enhance the workforce and help foster education for the next generation of youth.\n\nOur board and organization is formed by members of the community we serve, so we have a unique understanding of the hard work and amazing accomplishments happening around us daily, Smallwood said. ASMDA strives to foster communications and relationships between local government and industry activities responsible for air, space and missile defense and provide an organization that both benefit the industry professional and promote community civic interests and goals.\n\nAn integral part of what we do is taking the time to help our community recognize the outstanding achievements of their members that share the same passion, she added.\n\nDuring the luncheon, ASMDA presented 14 awards to Team Redstone members.\n\nTechnical Achievement Awards in the Government Individual Category were presented to NASAs Gregory Jerman; U.S. Army Rapid Capabilities and Critical Technologies Offices Dr. Benjamin Ben J. Schmid; U.S. Army Futures Commands Chief Warrant Officer 5 John Fallin; USASMDCs Dr. Mark Rader; and Missile Defense Agencys Delphine Dal Cengio.\n\nMost of the work I have done is really a reflection of a team effort. I just point the pack in the direction we need to travel, Rader said. Being recognized by ASMDA means other people and organizations, not just in my professional area of expertise, find a value in the work I and my multi-organization team do to help the warfighter both in the areas of missile defense and in the protection of the warfighter from improvised threats.\n\nWhile I am getting the award, the work I have led reflects more on a multi-organization, multi-service team effort building on skills from industrial partners and labs, he added. It takes a multi-disciplinary team with very little ego to build a truly capable weapons technology. We can&#39;t afford white knights in this game. Im a reasonably bright person, but I miss things. By bringing together a team of other bright people they fill in the holes the others miss.\n\nTechnical Achievement Awards in the Government Team Category were presented to MDAs Project Convergence 22 Team; and Nanosat Testbed Initiative Technology Maturation Team.\n\nA Technical Achievement Award in the Contractor Individual Category was presented to RCCTOs Les Daniel.\n\nService Excellence Awards in the Government Individual Category were presented to MDAs Michelle Stallings, Dr. David Denhard and Shane Rose.\n\nA Service Excellence Award in the Contractor Individual Category was presented to RCCTOs Tom Nguyen.\n\nService Excellence Awards in the Team Category were presented to MDAs Flight Test THAAD Weapon System-21 Team; and USASMDC Space and Missile Defense Center of Excellences Missile Defense Training Division Sensor Management and Ground-based Midcourse Defense Training Team.\n\nThis prestigious Air, Space, and Missile Defense Association award recognizes the outstanding work being accomplished by the Space and Missile Defense School each and every day, said Timothy F. Bishop, SMDCoE director. The fine people comprising the missile defense training team are exceptional at their jobs. Nothing of consequence will occur if you do not have great people leading the way. I greatly appreciate both our superb team, as well as ASMDA taking the opportunity to recognize this team&#39;s great work.\n\n"}