{"text": "The U.S. Army Test and Evaluation Commands (ATEC) Executive Technical Director/Deputy to the Commander (ETD/DC), Robert M. Miele, bids farewell to the workforce during his retirement ceremony Sep. 30 at ATEC Headquarters.\n\nLt. Gen. Daniel L. Karbler, commander of the U.S. Army Space and Missile Defense Command and Joint Functional Component Command for Integrated Missile Defense, and former ATEC commanding general, presided over the ceremony where he credited Miele for his lifelong career and accomplishments.\n\nIf you look at the progress of a test, and the systems that have come out during your tenure, you have a lot to be proud of and I just cant give you any higher remarks to let you know how appreciative the Army is for your leadership for the past 31 years, said Karbler.\n\nMiele has served as the ETD/DC of ATEC since May 2016. Born and raised in Philadelphia, Miele graduated from Council Rock High School in 1981.\n\nAfter graduation, Miele began taking automotive mechanic classes at Lincoln Technical Institute and found that engineering was a subject that really sparked his interest. Following technical school, he started taking college prep courses at Bucks County Community College. During the prep courses, he applied to multiple four-year colleges and was accepted to Widener University to join a five-year co-op program.\n\nThroughout his college school years, Miele obtained a vast number of jobs in order to pay for his schooling. He was a mechanic at a Ford dealership, a lifeguard at a pool, a janitor at a preschool, and a landscaper at multiple landscaping companies.\n\nOnce Miele was getting close to college graduation, he knew he needed to start looking for more of a lifelong career.\n\nPrior to graduating from Widener, Miele used a placement program his school offered which displayed job positions that were available at different companies. Miele said, I applied for every position I qualified for in hopes to hear back from one company.\n\nOnce Miele graduated from college with a Bachelor of Science degree in Electrical Engineering, he accepted a paid internship program with the U.S. Army Materiel Command (AMC). For the first 18 months of the program, Miele studied reliability and engineering at the School of Engineering and Logistics, located in Texarkana, Texas. After the 12 months of school, he was sent to Texas A&M for two semesters to work on his masters in Industrial Engineering. He graduated from the program in January 1991 and came to Aberdeen Proving Ground to work as a GS-11 intern in the Reliability Analysis Division at the U.S. Army Materiel Systems Analysis Activity (AMSAA), a subordinate of AMC.\n\nMy plan was after I gave the Army back the 18 months they gave me, I was getting out of the government and joining private industry, said Miele. I had no intentions to stay in the government as a Department of the Army Civilian.\n\nHowever, Miele hit a turning point. I was a GS-11 and I was requested to pre-brief a two-star general on how a test system was doing, on our way to the Pentagon in a blackhawk. At that point I was hooked and I knew I wanted to be an executive someday.\n\nMiele worked in positions of increasing responsibility at AMSAA in multiple assignments from team leader, to chief of the Chemical Demilitarization Office, and chief of the Maneuver Systems Branch.\n\nIn 2008, Miele left AMSAA for a job opportunity to be the associate director of the Test Management Directorate with the U.S. Army Developmental Test Command (DTC). While only being in the position for a short period, he was assigned as the acting technical director (TD) of DTC. He was responsible for planning, executing, and reporting on Army and Department of Defense developmental tests supporting more than 300 weapons programs annually.\n\nMiele went back to AMSAA in 2011 to serve as the chief of the Combat Support Analysis Division, and then transitioned to the acting TD of AMSAA. One year after serving as the TD, he returned to his previous position. At this point, I decided I was no longer going to apply for SES, I was going to be happy being a GS-15 Division Chief at AMSAA, said Miele.\n\nIn February 2014, Miele was selected as the Executive Director of the U.S. Army Operational Test Command (OTC), a subordinate organization of ATEC, located in Fort Hood, Texas.\n\nServing as the ATEC ETD/DC since May 2016, Miele managed the technical execution of all ATEC test plans and reports, and the commands evaluation strategy and analyses. He was responsible for integrating the commands instrumentation, policy, modeling and simulation, and continuous business improvement projects.\n\nIn addition, Miele was responsible for ensuring that Army and Office of the Secretary of Defense senior leaders had the essential information required before weapons and equipment were placed into the hands of Soldiers and throughout the lifecycle of those systems. He directed the test and evaluation for over 400 weapons programs through a 9,000-person workforce and a two billion dollar budget.\n\nMiele noted that one of the most rewarding things he experienced at ATEC was the opportunity to change the narrative of ATEC from an Army senior leader (ASL) perspective.\n\nWhen I first got to this position, I felt like I was always in a defensive posture all the time with ASLs, said Miele. When we were in meetings with ASLs, they would say, why are you testing that, and I thought this is our mission to test and evaluate, to support you to make decisions on weapon systems. Over the course of those four years, ATEC leaders have been able to change that narrative to show our value. Now, one of the things they [ASLs] always ask is, what does ATEC think about that, or I want to hear from the testers before making a decision.\n\nLooking back at Robs history, career and what he accomplished at AMSAA and DTC, it set him up for success at OTC and also set him up for success to close out his career at ATEC, said Karbler. Hes done a phenomenal job.\n\nMiele is married to Laurie, wife of 34 years, and together they have one son, Kyle. I dont have the words to adequately describe my thanks and appreciation, said Miele, when speaking to Laurie. None of my successes would have been possible without your love and support.\n\nAs Miele transitions to retirement, he has planned to work part time, three days a week. Outside of work, he plans to spend more time at the gym, go on hikes and kayaking trips, and hopes to learn how to play the guitar.\n\nKarbler presented Miele with the Distinguished Civilian Service Medal and Department of the Army Award for Outstanding Service as an Army Senior Executive Service member, signed by the Secretary of the Army, Ryan D. McCarthy; and the Governors Citation, signed by the Governor of Maryland, Larry Hogan. Laurie was presented the Military Spouse Medal and the ATEC Certificate of Appreciation.\n\nAfter the awards were presented, Mieles nephew, Master Sgt. Jessie Miele, presented him with the retirement flag, which was flown over DTC, OTC, and ATEC HQ, in honor of the ATEC locations where he has served. Mieles son, Kyle, had the opportunity to assist in casing the Senior Executive Service flag and present it to his father.\n\nThe end of 31 years, Rob Miele, we find you effective, suitable, and survivable for retirement, said Karbler.\n\n"}