{"text": "PARIS The global economy could shed more than 1% of output if international talks to rewrite cross-border tax rules break down and trigger a trade war, the OECD said on Monday, after countries agreed to keep up negotiating to mid-2021.Nearly 140 countries agreed on Friday to extend talks, after the pandemic outbreak and U.S. hesitation before the presidential election squashed hopes of reaching a deal this year.Public pressure is growing on big, profitable multinationals to pay their share under international tax rules after the COVID-19 pandemic strained national budgets, the countries said in an agreed statement.The aim is to update international tax rules for the age of digital commerce, in particular to discourage big Internet companies like Google, Facebook and Amazon from booking profits in low-tax countries like Ireland, regardless where their customers are.In the absence of a new international rulebook, a growing number of governments are planning their own digital services taxes, which has prompted threats of trade retaliation from the Trump administration.The alternative to finding an agreement would be a trade war ... The last thing you want at this time with COVID-19 is to have to deal with further trade tensions, OECD Secretary General Angel Gurria told journalists.In such a worst-case scenario, trade disputes could knock global GDP back by more than 1%, the OECD, which has been steering the global tax talks, estimated in an impact assessment.Conversely, new rules for digital taxation and a proposed global minimum tax would increase global corporate income tax worldwide by 1.9% to 3.2%, or about $50 billion to $80 billion per year.That could reach $100 billion when including an existing U.S. minimum tax on overseas profits, amounting to 4% of global corporate income tax, the OECD said. Meanwhile, any drag on global growth would be no more than 0.1% in the long term.At the same time, new digital taxation rules would shift the right to tax $100 billion in corporate profits to big consumer- market countries, largely at the expense of low-tax investment hubs where such profits currently get booked.While countries agreed on OECD blueprints for a future deal, the key remaining issue to be solved was the scope of businesses to be covered, which would then make it easier to agree the technical parameters, OECD head of tax Pascal Saint-Amans said.The Trump administration had insisted on an opt-in option for U.S. companies, which has been broadly rejected by other countries in the talks.Nonetheless, regardless of the results of the U.S. presidential election next month, there was bipartisan support in Washington to move forward, Gurria said."}