{"text": "DOUMA, Syria Seham Hamu lost her husband, son and grand-daughter on the same night in 2016 when a missile struck their home in Douma, a rebel stronghold near the Syrian capital that saw some of the fiercest fighting of the civil war.Now, aged 74 and confined to a wheelchair because of a heart condition, she looks after her sons four surviving children, a widowed daughter and a second daughter along with her husband and their children.Their plight is not unusual in a country where hundreds of thousands of people have been killed during a decade of violence and millions more forced to flee their homes and settle elsewhere in Syria or abroad.As the 10th anniversary of the start of the conflict in mid-March, 2011, approaches, Hamu just wants to forget.I dont want to remember...it was too cruel, she said of the war, a multi-sided conflict that sucked in Islamist militants, myriad rebel groups, government troops and foreign forces.Hamu, who was born and bred in Douma, has never left the town, which still shows the scars of the violence.It is back under government control after a Russian-backed military campaign helped President Bashar al-Assad force Jaish al-Islam, the rebel group which controlled Douma in 2018, to retreat.The aerial bombing campaign that flushed them out followed a years-long siege of hundreds of thousands of residents, many of whom fled. Some who now want to return from Turkish-held areas in the north are not allowed.Douma is part of the Eastern Ghouta region that touches the outskirts of Damascus.Eastern Ghouta town was where a suspected chemical attack took place in April, 2018 that prompted missile strikes by the United States, France and Britain against several suspected chemical weapons facilities in Syria.The Syrian government and its ally Russia have denied involvement in any such attack.Assad has survived the insurgency, which started as peaceful protests in March, 2011, a part of the Arab Spring uprisings that shook Egypt, Algeria, Tunisia and beyond. But nowhere has the fallout been as devastating as in Syria.From a precarious position, Assad now holds sway over many parts of the country, helped by Russias military and Irans Shiite militias.Hostile Turkey still controls swathes of territory in the northwest and the United States has a presence in the northeast, a major oil and wheat producing area.Prior to the conflict, Hamu lived with her farmer husband who owned a mini-market. Relatively well off, the family were able to secure marriages for the son Subhi and both daughters on the same night.But the war escalated, and, on the fateful night in 2016, her life was shattered.I wish there had been no war and we lived in security. But this is Gods will, she said.The second floor of her traditional home is still charred and damaged by the flames that engulfed it in 2016, a permanent reminder of her loss.TRICKLING BACKPeople are gradually trickling back to Douma and other former rebel-held areas, now that the fighting has subsided.More than half of Syrias pre-war population are either internally displaced inside Syria or refugees, according to new figures released by the U.N.s Office for the Coordination of Humanitarian Affairs (OCHA).Faris al-Barghout, who heads a local charity, says life is gradually returning to Douma, with schools and services back up and running. But the war has left its mark: there are around 3,200 orphans in the town registered with his charity alone.People are safe and have started to resume normal life, he said.Shops and businesses are open and streets are busy with cars, as people go about their daily lives.But Hamus son-in-law, Yassin al-Afa, does not hold out hope that he will get back to where he was before 2011 any time soon.Afa was once a builder making enough income to support his family. Now hes jobless and confined to his bed after major back surgery, making physical labour impossible.He said jobs were few and far between and he had no capital to start a business of his own.We were living like kings. We were working jobs and could provide for our household and there was something to look forward to, Afa said of life before the war.Hamus family tragedy is not unique in Douma.Umm Bashir al-Saour, a 37-year-old widowed by war, lives with her mother-in-law and four children in the same house.She washes and cuts up lettuce to deliver to local restaurants for a weekly wage to make ends meet.She lost her husband and one of her children in shelling during the final days of the conflict.We were hoping things would be better and that I wouldnt lose my husband, but he left us, she said.Its too late for us now but Im just hoping that things will be better for the children."}