{"text": "Abu Dhabi state investor Mubadala invested a record amount in 2020 as it doubled down on growth sectors, and is close to making a decision on the listing of Emirates Global Aluminium, its chief executive said on Monday.\"We've invested more in 2020 than we have ever done in any one year prior to that,\" Khaldoon Khalifa al-Mubarak told a virtual event organised by Bahrain's Investcorp (INVB.BH).Mubarak did not disclose the figure, but his comments signalled Mubadala's investments will exceed the $18.5 billion  in 2019 and $19.1 billion in 2018.He said Emirates Global Aluminium, which is owned by Mubadala and Investment Corp of Dubai, is well placed for an initial public offering.\"This company is now a very mature business, a very well-placed business for growth. It's cost base is in the lowest quartile...it's a great business,\" he said.A plan to list EGA was delayed in 2018.Mubarak said Mubadala paused for 6-8 weeks in March 2020, using the time to understand the ramifications of the pandemic.\"We supercharged our monetisation when it came to the sectors in the headwinds and we kept investing in the sectors in the tailwinds, building new partnerships and really focusing on life sciences, as an example, technology, mobility, digital infrastructure,\" he said.Mubadala, which manages $232 billion, invested $853 million in the retail division of Indias Reliance Industries (RELI.NS) in October after paying $1.2 billion for a 1.85% stake in Reliance's digital unit, Jio Platform in June.\"We have invested more in India in 2020 than the previous 19 years combined, that gives you an indication of how serious we are about investing in India,\" Mubarak said, noting Mudabala had been underweight in terms of its exposure to the country in the past.He confirmed Mubadala's team is looking at the pipelines business of Saudi Aramco (2222.SE) but had yet to decide whether to invest, nor had it taken a view on the listing of Santa Clara-based semi-conductor producer Globalfoundries.  read more Mubarak said future risks include inflation, another pandemic, the trade rift between the United States and China, as well as a global correction and economic slowdown.($1 = 3.6728 UAE dirham)"}