{"text": "JOHANNESBURG Russia and China are racing to plug the COVID-19 vaccine gap in Africa, hoping to cement their influence on a continent where many countries have yet to administer a single shot.But, so far, vaccine donations from Beijing and Moscow have been small, the commercial deals they offer are costly, and some African governments are wary about a lack of data.As rich countries ramp up their inoculation drives, Africa, without the resources to pre-order Pfizer, AstraZeneca, Moderna and Johnson & Johnson vaccines, is being left behind.With Western nations facing criticism for hoarding supplies, flooding Africa with life-saving shots would be a soft-power coup for Russia and China.Moscow has offered 300 million doses with financing to an African Union (AU) purchasing scheme.Beijing has pledged nearly a quarter of all its vaccine donations to Africa, according to data compiled by Bridge Consulting, a Beijing-based health sector advisory.This is a vivid manifestation of China-Africa friendship, Chinas foreign ministry told Reuters.Africa is one of the key markets for Sputnik V, said the Russian Direct Investment Fund (RDIF), the sovereign wealth fund marketing its Sputnik V vaccine abroad.French President Emmanuel Macron says Europe and the United States risk losing influence in Africa over the issue.However, John Nkengasong, head of the Africa Centres for Disease Control and Prevention, cautioned against vaccine diplomacy, saying powers must not use token allocations to curry political influence.Africa will refuse to be that playing ground where we use COVID as a tool to manage relationships, he said on a webinar hosted by the Atlantic Council think tank in late February.It becomes like youre trying to sprinkle water on a very hot day on children ... Then you can tick the box that you did that, he said. Thats not what we are after as a continent.While other developing regions have turned to Russia or China, in Africa their engagement has translated into few shots in arms.Africa has received around 3.15 million shots from China - or less than 4% of its vaccine exports - Bridge Consulting data showed.The numbers of vaccines China is donating are not going to move the needle in any of these countries. But its as much about the optics, said Eric Olander, co-founder of The China-Africa Project.Russia has shipped a total of around 100,000 vaccine doses to Algeria, Tunisia and Guinea.The global vaccine sharing scheme COVAX, meanwhile, delivered nearly 15 million shots to 22 African countries in its first 10 days.The facility co-led by the World Health Organization, GAVI and others aims to ship 35 million doses to Africa by the end of the month and 720 million by the end of 2021.That will still only be enough to inoculate those at greatest risk.DATA DEFICITChinas leading vaccines - from the China National Pharmaceutical Group (Sinopharm) and Sinovac - are not yet approved for emergency use by the WHO. Neither is Russias Sputnik V vaccine.China offered South Africa - the African nation hardest hit by the pandemic - 2 million shots, its health minister said.But a government official involved in procurement told Reuters the lack of trial data meant Chinese vaccines were not being seriously considered for now. Sputnik V was also relegated to a second tier of vaccines South Africa says need more study, according to the health ministry.Even some countries that accepted donations have shied away from purchases.Uganda considered buying Chinese vaccines but is focused on COVAX due to their cost and the availability of data, said Ombeva Malande, director of the East Africa Centre for Vaccines and Immunization, which advised the government. Kenya is taking a similar line, he said.Diana Atwine, permanent secretary in Ugandas health ministry, said authorities would consider affordable vaccines approved by the WHO.The head of Kenyas vaccine task force confirmed it was not in talks to procure Chinese vaccines, and health ministry plans do not include Russian vaccines.DOLLARS AND DOSESWhile COVAX shots are free for most African nations, countries doing commercial deals are paying a premium.Senegal paid $20 a shot for 200,000 doses of Sinopharm, a two-shot vaccine.The worst thing that could happen now is for countries to not start vaccinating, said Tandakha Ndiaye Dieye, a member of Senegals vaccine advisory group, explaining the decision.By comparison, Indias Serum Institute is selling AstraZeneca shots it manufactures for $3. The Indian government has also donated over a half million of those shots to eight African countries, according to a Reuters tally.Beijing has so far not announced financing packages that would make vaccine deals more affordable in Africa.At around $10 per dose, Sputnik V is cheaper, and RDIF told Reuters it would be even more competitive if subsidised via COVAX.RDIF said it was in advanced negotiations with the WHO to be included in COVAX and could offer a one-shot version to reduce the cost. A spokesperson for GAVI, the global vaccine alliance helping lead COVAX, said all vaccines would be considered but they first needed approval from the WHO or another stringent regulatory authority.RDIF said some deliveries of the Sputnik V doses offered via the AU plan could start in May.A senior AU diplomat told Reuters that talks were taking place but no agreement had been reached. No details have been announced about the finance package. RDIF did not respond to Reuters questions about the potential deal.Both China and Russia must increase production if they hope to become major global vaccine suppliers. For Moscow, exporting shots is politically sensitive when its own population still needs vaccinating.Im not worried about whether Russias going to be able to deliver the doses, said W. Gyude Moore of the Center for Global Development, a Washington think tank.Im worried about how African countries are going to pay for them ... COVAX is just not going to be enough."}