{"text": "NEW YORK An interruption to a searing rally gave a jolt to equity investors who had been getting used to weeks of steadily rising U.S. stocks.But long term, even with the rocketing valuations that equities have commanded and the risk of another fall, investors say stocks would still be a winning bet. Underpinning that confidence is the force of unprecedented moves by the Federal Reserve to support the financial system and buy assets, which had propelled some stock indexes to fresh highs.If youre a longer-term investor, you still have to like your equities exposure more than fixed-income exposure, where you basically have no upside at this point and your earnings are your paltry yield, said Troy Gayeski, Co-CIO of SkyBridge, an alternative investments firm.Gayeski said if stocks fall a total of 10-15%, he would consider skewing more to equity-centric managers.Following a sharp rise from March lows, The S&P 500 slumped 5.9% on Thursday, its steepest one-session loss since March 16, after renewed fears of a new wave of coronavirus infections and gloomy economic forecasts from the U.S. Federal Reserve. Prior to the fall, the S&P 500 had traded at 22 times expected earnings, its most expensive level since the dot-com boom.Stocks opened sharply higher on Friday, but then lost those gains by mid-afternoon.Jack Ablin, chief investment officer at Cresset Capital Management said he is not changing his mind on his decision to add riskier assets during the early days of the crisis.We got repositioned in risk assets back in late March, early April so that has helped us, said Ablin. But were content to hold for right now.Past equity market drops of similar size have not necessarily been a precursor of more declines. The S&P 500 has averaged gains of nearly 19% in the year following one-day declines of 5% or more, according to Bespoke Investment Group. Still, for some, caution remains.Guggenheim Partners global chief investment officer Scott Minerd told CNBC on Thursday that stocks could retest their lows and that the S&P, which closed Thursday at just above 3,000, could nearly halve to 1,600. If the market rallies in coming days, he told CNBC that his biggest challenge will be whether to use the opportunity to reduce exposure.David Kotok, chairman and chief investment officer of Cumberland Advisors, said he sold stocks and raised cash into the rally. He has not committed any cash yet despite the sell-off.I dont want to catch a falling knife, he said.Spreads are still far narrower than during March, when they widened to 11-year highs, but are not yet back to pre-coronavirus levels.Monica Erickson, investment grade credit portfolio manager at DoubleLine, said she had lightened up on particularly hard-hit sectors such as travel, energy and real estate investment trusts (REITs) when equities were rallying and spreads tightening. Erickson said she has not changed positioning due to Thursdays market drop.I think there was too much tightening in spreads too quickly and the market is now taking a breather, she said.William Zox, portfolio manager at Diamond Hill Capital Management, said he has been selling fully-valued corporate bonds in favor of higher quality but undervalued bonds such as BBB- and BB-rated regional banks.There is still a massive amount of uncertainty that must be reflected in prices, Zox said."}