{"text": "Chinese telecoms equipment maker Huawei Technologies (HWT.UL) is making business resilience its top priority with a push to develop its software capabilities as it seeks to overcome U.S. restrictions that have devastated its smartphone business.Huawei was put on an export blacklist by former U.S. President Donald Trump in 2019 and barred from accessing critical technology of U.S. origin, affecting its ability to design its own chips and source components from outside vendors.The ban put Huawei's handset business under immense pressure.The company harbours \"no expectation\" of being removed from the Entity List under the administration of U.S. President Joe Biden, and is now looking to develop other lines of business after spending the last year in survival mode, the company's rotating chairman Eric Xu said on Monday.\"We cannot develop our strategy based on either a groundless assumption or on unrealistic hopes, because if we do that, and if we cannot be taken off from the entity list, it's going to be extremely difficult for the company,\" Xu said in a Q&A on the launch of the company's annual summit for analysts.The company will invest more in businesses that are less reliant on advance process techniques, Xu said, highlighting the company's intelligent driving business, in which he said the company would invest more than $1 billion this year.The company's autonomous driving technology allows cars to travel over 1,000 kilometers, overtaking Tesla (TSLA.O) in that area, Xu said.Xu said Huawei was working with three domestic carmarkers on sub-brands that will be designated 'Huawei Inside' models.In February, Reuters reported that Huawei planned to make electric vehicles under its own brand, which Huawei denies. [L1N2KnW0F9]Xu said that U.S. action against Huawei had damaged trust across the semiconductor industry, and contributed to global chip shortages as Chinese companies rushed to stockpile three to six months worth of semiconductors last year, fearing similar action against them.The combined demand from the Chinese market for chip supplies that are not affected by U.S. rules or which could be compliant with U.S. rules would lead companies to invest in chips and also eventually supply Huawei, Xu said.\"If that can be done, and if our inventory level can help Huawei to last to that time, then that will help us to address the problems and challenges we face.\"Xu also said the global rollout of 5G telecoms networks had \"exceeded expectations.\"Last year, the company saw a modest 3.2% rise in its annual profit as overseas revenues declined due to pandemic-related disruption and the impact of the U.S. sanctions, it said last month.  read more "}