{"text": "ATLANTA Atlanta teacher Kim Franklin arrived at State Farm Arena at 7:30 a.m. on Monday, securing a spot near the front of the long line of people that snaked outside the home of the Hawks NBA team on the first day of early voting in Georgia.State Farm Arena, with a seating capacity of 21,000 for National Basketball Association games and 680,000 square feet (63,174 square meters) of open space, is one of three dozen sports arenas and stadiums across the United States doubling as early voting sites before the Nov. 3 election. Nearly all of the venues have been closed to fans since the COVID-19 pandemic began in March.First championed by the Atlanta Hawks owners, management and coaching staff, the initiative caught on nationally thanks in part to support from More than a Vote. The organization was started by the NBA Finals Most Valuable Player Lebron James here and other athletes to inspire African-Americans and everyone to register and vote, after the death of George Floyd in May.Floyd, an unarmed Black man, died after a police officer kneeled on his neck for nearly nine minutes. His death sparked global protests and a renewed push in the United States to address racial inequalities, including from the NBA, where some teams boycotted playoff games before the league agreed to open some arenas to voting.During the recently completed NBA playoffs, many players wore warm-up shirts emblazoned with the word VOTE.By allowing early voting in arenas and stadiums, where social distancing can be better assured, organizers hope to alleviate fears that voters may have about contracting the coronavirus while exercising their constitutional rights.Im here because I did my research. Their booths are spread wide all across the stadium floor. I think its safer, said Franklin, 57, who wore a black Notorious RBG T-shirt in honor of the late Supreme Court Justice Ruth Bader Ginsburg.By 8 a.m., hundreds of Atlanta-area voters - standing six feet (1.83 m) apart - had joined Franklin outside the arena in the heart of Georgias Fulton County, with nearly 800,000 registered voters, more than any other in the state. Election officials expected thousands of them to vote on Monday.MUCH TIGHTER RACEGeorgia has emerged as a \"battleground\" state that could help decide the 2020 presidential election, and voter turnout in counties like Fulton, which is nearly here 45% African-American, are key to the race.Four years ago, Donald Trump handily took the state and its 16 Electoral College votes. This year, polls show a much tighter race between the Republican president and former Vice President Joe Biden, the Democratic nominee.Republican Brian Kemp narrowly won a high-profile race for governor in 2018, amid allegations here by Democratic challenger Stacey Abrams of voting irregularities, including rejected ballots and broken voting machines, that disproportionately disenfranchised Black and minority voters.The idea of turning State Farm Arena into a polling place started with Atlanta Hawks CEO Steve Koonin, majority owner Anthony Ressler and head coach Lloyd Pierce, the outspoken chair of the NBAs racial justice committee.The team next approached Robb Pitts, who oversees local elections as chair of the Fulton County Commission.It took me about a nanosecond to understand what a big deal that would be for us here in Fulton County running this upcoming election, Pitts told a news conference.The team then challenged other professional sports franchises to open up their home venues for early voting.Soon, the NBAs Orlando Magic followed suit at the Amway Center, the National Football Leagues Detroit Lions at Ford Field, NFLs Tampa Bay Buccaneers at Raymond James Stadium, the NBA Houston Rockets at Toyota Stadium and Major League Baseballs Boston Red Sox at Fenway Park, among others.At State Farm Arena, there were some first-day glitches including a software problem in 300 voting machines that delayed voting for almost an hour early on Monday.Rick Carter, 63, a computer contractor in Atlanta, brought a folding chair for his wife Vera Carter while the couple waited.Carter said he and his wife considered voting by absentee ballots but were spooked by allegations that Trumps postmaster general was trying to sabotage mail-in voting to help the president, who has repeatedly said, without evidence, that the practice was ripe for voter fraud.I know its easier than voting in person, but with everything going on with the Post Office, we werent sure our ballots could get there on time, he said. This feels like the safest bet."}