{"text": "Air France-KLM (AIRF.PA) will expand its partnership with China Eastern Airlines (600115.SS), as the Chinese carrier contributes to a 1 billion-euro ($1.2 billion) share issue heavily backed by the French government, the airline group said on Monday.The French state will cover as much as two-thirds of a 988 million-euro capital increase by Air France-KLM, more than doubling its stake to nearly 30%, while 8.8% shareholder China Eastern invests up to 168 million euros to maintain or slightly increase its stake, subject to a 10% agreed cap.The share issue, which may rise to 1.14 billion euros with an increase option, is part of a 4 billion-euro recapitalisation announced last week - the latest move by a major airline group to shore up finances after more than a year of COVID-19 travel shutdowns and deep losses for the sector.  read more The new shares will be priced between 4.84 euros and Monday's closing price of 5.31 euros, which valued the group at 2.27 billion euros.The operation sees France and China Eastern increase their sway over the Franco-Dutch group - while diluting the holdings of the Dutch state and U.S. carrier Delta Air Lines (DAL.N), currently at parity with China Eastern. Delta was barred from investing by conditions on its own U.S. federal aid.In parallel, Air France-KLM said on Monday it will expand code-sharing operations with China Eastern to include flights linking Beijing to Paris and Amsterdam once traffic recovers.The expansion was agreed \"in the context of the participation of China Eastern\" in the capital hike, it said. Until now, their joint venture was limited to Shanghai flights.They also plan to extend cooperation into new areas such as ground services, catering and maintenance, Air France-KLM said.The group gave details of an accompanying 3 billion-euro perpetual bond issue to the French government, replacing the shareholder loan it received last year.The issue will take place in equal 1 billion-euro tranches with four-, five- and six-year redemption options bearing respective interest rates of 7%, 7.25% and 7.5%, subject to additional step-up margins after the redemption dates.($1 = 0.8403 euro)"}