{"text": "Air Canada (AC.TO), struggling with a collapse in traffic due to the COVID-19 pandemic, reached a deal on Monday on a long-awaited aid package with the federal government that would allow it to access up to C$5.9 billion ($4.69 billion) in funds.The agreement - the largest individual coronavirus-related loan that Ottawa has arranged with a company - was announced  after the airline industry criticized Prime Minister Justin Trudeau's Liberal government for dawdling. The United States and France acted much more quickly to help major carriers.Canada's largest carrier, which last year cut over half its workforce, or 20,000 jobs, and other airlines have been negotiating with the government for months on a coronavirus aid package.In February, Air Canada reported a net loss for 2020 of C$4.65 billion, compared with a 2019 profit of C$1.48 billion. As part of the deal, Air Canada agreed to ban share buybacks and dividends, cap annual compensation for senior executives at C$1 million a year and preserve jobs at the current level, which is 14,859.It will also proceed with planned purchases of 33 Airbus SE (AIR.PA) 220 airliners and 40 Boeing Co (BA.N) 737 MAX airliners.Chris Murray, managing director, equity research at ATB Capital Markets, said the deal took into account the \"specific needs of Air Canada in the short and medium term without being overly onerous.\"He added: \"It gives them some flexibility in drawing down additional liquidity as needed.\"Transport Minister Omar Alghabra said the government was still in negotiations with other airlines about possible aid.Canada, the world's second-largest nation by area, depends heavily on civil aviation to keep remote communities connected.Opposition politicians fretted that further delays in announcing aid could result in permanent damage to the country.Air Canada said it would resume services on nearly all of the routes it had suspended because of COVID-19.'SIGNIFICANT LAYER OF INSURANCE'The deal removes a potential political challenge for the Liberals, who insiders say are set to trigger an election later this year.The government has agreed to buy C$500 million worth of shares in the airline, at C$23.1793 each, or a 14.2% discount to Monday's close, a roughly 6% stake.\"Maintaining a competitive airline sector and good jobs is crucially important,\" Finance Minister Chrystia Freeland told reporters, adding the equity stake would allow taxpayers to benefit when the airline's fortunes recovered.The Canadian government previously approved similar loans for four other companies worth up to C$1.billion, including up to C$375 million to low-cost airline Sunwing Vacations Inc. The government has paid out C$73.47 billion under its wage subsidy program and C$46.11 billion in loans to hard-hit small businesses.Michael Rousseau, Air Canada's president and chief executive officer, said the liquidity \"provides a significant layer of insurance for Air Canada.\"Jerry Dias, head of the Unifor private-sector union, described the announcement as \"a good deal for everybody.\"Unifor represents more than 16,000 members working in the air transportation sector.But the Canadian Union of Public Employees, which represents roughly 10,000 Air Canada flight attendants, said the package protected the jobs of current workers rather than the 7,500 members of its union who had been let go by the carrier.($1=1.2567 Canadian dollars)"}