{"text": "WASHINGTON The U.S. Department of the Treasurys internal watchdog said on Wednesday it is including a group of airport contractors in its audit of a coronavirus stimulus program aimed at aiding the aviation sector, after lawmakers pressed the agency to halt their funding.The group of stimulus recipients called out by Democrats in the U.S. House of Representatives last month for laying off workers are being included in the watchdogs audit of the Payroll Support Program though no investigative work is planned at this time, Treasury Department Deputy Inspector General Richard Delmar told Reuters in an emailed statement.Last month, the three key lawmakers asked the Treasury Department to halt government assistance to a dozen contractors that received more than $728 million in federal funds and have laid off more than 9,000 workers.The lawmakers specifically sent letters to executives of Gate Gourmet, Swissport USA, Flying Food and G2 Secure Staff for taking funds through the Payroll Support Program and laying off workers. Those companies will be included in the audit, the Treasury IG said.A spokesperson for Gate Gourmet said the layoffs and furloughs took place well before any of the funds were disbursed and previously, the company has said the cuts were necessary during the unprecedented times.The other companies did not respond immediately to requests for comment.The Payroll Support Program is a pillar of the more than $2-trillion Coronavirus Aid, Relief and Economic Security Act (CARES Act), designed to prop up aviation workers as the coronavirus pandemic prompted a precipitous decline in air travel. But airlines and other firms have faced scrutiny for cutting jobs despite taking government funds.Giving payroll support to companies that engaged in mass layoffs is not only contrary to congressional intent, but also wastes taxpayer dollars by covering the cost of payroll for employees that have already been laid off, Select Subcommittee on the Coronavirus Crisis Chairman James Clyburn and two other lawmakers said in the letters."}