{"text": "AUGUSTA, Ga. Amateur Andy Ogletrees Masters debut was relatively serene on Thursday, played without the fans that rocked Augusta National with roars he witnessed on TV as a kid growing up in Mississippi.I cant imagine what its normally like, with all the big crowds, the 22-year-old told reporters on Thursday. But I definitely had a lot of nerves.You have that feeling in your gut that its finally here. You dream of having moments like that and you look forward as a competitor to having those feelings.Being paired with defending champion Tiger Woods and British Open champion Shane Lowry of Ireland was a thrill.I grew up idolising Tiger. Just to be playing with him is awesome, said Ogletree who won last years U.S. Amateur title at Pinehurst, and became the third Georgia Tech golfer to win the event following Bobby Jones and Matt Kuchar.Ogletree said he already has an indelible memory from his maiden Masters -- his stay in the Crows Nest, Augusta Nationals traditional lodging on the second floor of the clubhouse for amateurs competing in the tournament.The Crows Nest last night was awesome. I was so amped up I didnt want to go to sleep. It was super cool, said Ogletree, who also got a kick out of the morning entertainment.Hearing everyone coming in and out of the champions locker room this morning you can kind of hear a lot from up there. Its just like being a part of history up there.Tiger and I actually talked about it today walking down one of the fairways. He was asking me, how was the Crows Nest? I wish I could stay up there, as the five-times Masters champion reminisced about trips to Augusta after winning his U.S. Amateur titles.He was telling me cool stories about his experience back in the day.Ogletree had a bumpy start on Thursday and stood four over par after his first four holes starting from the 10th before finding his form to finish with a one-over 73.Im just happy with the way I fought, he said. Hopefully, I can carry that into tomorrow and play some good golf."}