{"text": "Amazon.com Inc on Friday sued New Yorks attorney general to stop the state from taking legal action over its early COVID-19 response, including its firing of activist Christian Smalls.The retailer (AMZN.O) drew scrutiny 10 months ago when workers protested conditions at a Staten Island warehouse and it fired Smalls for violating a paid quarantine. Senators questioned Amazon about the incident, the city announced a probe, and State Attorney General Letitia James said the company may have violated the law. In a complaint in Brooklyn federal court, Amazon accused James of overstepping bounds by legally threatening the company and demanding remedies like its surrender of profit. Federal labor and safety laws preempt those of the state, from which Amazon is seeking injunctive relief, its suit said.Reuters was unable to immediately seek James' comment.The atypical lawsuit shows how Amazon believes it was unfairly maligned despite the many COVID-19 precautions it implemented, most recently COVID-19 tests and plans for vaccine administration. It also demonstrates how the company will not back down from criticism of its workplace.According to the lawsuit, Amazon passed with flying colors an unannounced city inspection of its Staten Island facility on March 30, the day of the protest. The warehouse's temperature checks, signage to encourage social distancing, and shift staggering showed safety complaints were \"completely baseless,\" the lawsuit says the inspector found.Amazon said demands by the attorney general's office (OAG) were \"far more stringent than the standard adopted by the OAG when defending, in other litigation, the New York State Courts' reasonable but more limited safety response to COVID-19.\"Amazon said the OAG assessed violations regardless of documentation the company provided, such as photographs of Smalls not social distancing. Smalls has said he would not stop protesting until Amazon protects staff, and in November he filed a class action suit seeking damages for Black and Hispanic workers he alleged Amazon put at risk. More than 19,000 or 1.44% of Amazon's U.S. frontline employees contracted COVID-19 as of September, the company has said. "}