{"text": "Amazon.com Inc (AMZN.O) on Friday sued New York's attorney general to stop the state from filing its own lawsuit over the online retailer's early response to COVID-19, including its firing of activist Christian Smalls.In a complaint in Brooklyn federal court, Amazon accused Attorney General Letitia James of overstepping her bounds by threatening to sue unless it met several demands including surrendering some profit and slowing down operations.Amazon said federal labor and safety laws take precedence over New York's, and is seeking an injunction to block James from suing.The Seattle-based retailer had drawn scrutiny 10 months ago when workers protested conditions at a Staten Island warehouse, and Amazon fired Smalls for violating a paid quarantine.James said at the time that Amazon may have broken the law. New York City announced its own probe, and senators questioned Amazon's actions. In a statement, James said she is still reviewing her legal options.She called Amazon's lawsuit \"a sad attempt to distract from the facts and shirk accountability for its failures to protect hardworking employees from a deadly virus. Let me be clear: We will not be intimidated by anyone, especially corporate bullies that put profits over the health and safety of working people.\"It is rare for companies to file preemptive lawsuits to short-circuit threatened regulatory actions.The lawsuit shows Amazon's belief it was unfairly maligned despite its many COVID-19 precautions, most recently tests and plans for vaccine administration, and how it will not back down from criticism of its workplace conditions.According to the lawsuit, Amazon passed an unannounced city inspection of its Staten Island facility on March 30, 2020, the day of the protest, with the lead inspector concluding that complaints about safety were \"completely baseless.\"Amazon also accused James of ignoring evidence of its safety-related reasons for acting against Smalls, including photos of him not social distancing.Smalls has said he would keep protesting until workers were protected. In November, he filed a class action lawsuit seeking damages for Black and Hispanic workers. "}