{"text": "Amazon (AMZN.O) won its fight against an EU order to pay about 250 million euros ($303 million) in back taxes to Luxembourg in a blow to competition chief Margrethe Vestager's crusade against preferential deals.The setback renewed calls from EU lawmakers for a global corporate tax deal and legal analysts said Vestager was unlikely to give up her pursuit of large companies over the amount of tax they pay.The bloc failed to show that Luxembourg had given the U.S. online retailer special treatment in violation of state aid rules, the EU's General Court ruled on Wednesday. Its ruling follows last year's landmark defeat for Vestager against Apple (AAPL.O), which had contested an order that it pay 13 billion euros ($15 billion) in Irish back taxes.Both Amazon and Apple were targeted by Vestager in a campaign to stamp out tax deals used by EU states, including Luxembourg and the Netherlands, to attract large companies. The Commission views such agreements as unfair.\"The Commission did not prove to the requisite legal standard that there was an undue reduction of the tax burden of a European subsidiary of the Amazon group,\" the Luxembourg-based EU judges said.Amazon in a statement welcomed the ruling, saying it was in line with \"our long-standing position that we followed all applicable laws and that Amazon received no special treatment\".The Luxembourg government said the judgment showed the tax deal was not state aid - or an advantage that could distort competition.Vestager said she would examine the ruling before deciding whether to appeal to Europe's top court. B5N2GD001She is unlikely to stop her crusade, said Ioannis Kokkoris, professor of competition law and economics at London-based Queen Mary University of London.\"The future approach of the Commission in state aid cases may be fine-tuned to adjust to the concerns the court identified, but this hiccup is not going to forestall the drive of Vestager in this area,\" he said.WIN SOME, LOSE SOMEIt wasn't all bad news for Vestager. In a separate case on Wednesday, French utility Engie (ENGIE.PA) lost its appeal against an EU order to pay back taxes of 120 million euros to Luxembourg.But the spotlight was on the Amazon decision, which was criticised by groups campaigning for higher taxes to be levied on multinationals.\"Today's ruling is a blow,\" said Chiara Putaturo, a tax expert with Oxfam EU. \"It shows again that case-by-case investigations do not solve large-scale tax dodging.\"The amount at stake in the Amazon decision is tiny compared to the billions of dollars the online retailer earns each quarter, but it could help other companies in their appeals against the bloc's tax probes.Like Oxfam, EU lawmakers said there was a need for a systematic approach and urged the bloc to back U.S. President Joe Biden's call for a 21% minimum tax rate on multinationals.\"Such a minimum tax rate would allow member states to reclaim lost tax revenues from Amazon in the future. This would put an end to Luxembourg's business model as tax haven,\" EU lawmaker Sven Giegold said in a statement.\"At the same time, public country-by-country reporting must be introduced as soon as possible. Then large corporations will have to disclose their profits and taxes paid per country,\" Giegold said.Vestager's success in making Belgium, Ireland, Luxembourg and the Netherlands change their tax practices has helped to spur efforts for a global deal. The Organisation for Economic Cooperation and Development (OECD) said last week that the chances of achieving one had never been higher.  read more Amazon's Luxembourg-based main European operating subsidiary, Amazon EU Sarl., has not reported a tax charge in any of the last three years, because it reported losses on its 104 billion euros of revenue, corporate filings lodged with the Luxembourg registry show.Over the last two decades, Amazon reduced its European taxable profits by having Amazon EU Sarl pay affiliated, tax-exempt partnership fees in return for the use of intellectual property, corporate filings show.Amazon EU Sarl racked up tax credits of almost 600 mln euros over the 2018-2020 period. https://www.reuters.com/article/us-tax-amazon-idUSBRE8B50AR20121206The European Commission in its 2017 ruling, knocked down on Wednesday, said Luxembourg spared Amazon from paying taxes on almost three-quarters of its profits from EU operations by allowing it to channel profits to a holding company tax-free.In its 2018 decision on Engie, the EU said the arrangement with Luxembourg authorities artificially reduced the company's tax burden, which meant it paid an effective corporate tax rate of 0.3% on certain profits in Luxembourg for about a decade.The court sided with the Commission, saying the French utility had benefited from a tax advantage.The cases are T-816/17 Luxembourg v Commission & T-318/18 Amazon EU v Commission.($1 = 0.8243 euros)"}