{"text": "Johnny Manziel, whose much-hyped NFL career fizzled out after two seasons, may miss some aspects of being around the game but the quarterback said his decision to join a start-up league called Fan Controlled Football is not about staging a comeback.Manziel has had plenty of free time on his hands since he last played competitive football in 2019 and so figured he had little to lose by committing to a six-week season where fans watching online can set rosters and call plays in real-time.Maybe I wanted to put the pads on for a couple days, maybe I wanted to go have a little fun, maybe I wanted to be back around the guys and just feel like I used to in the past, Manziel, 28, told Reuters in a video interview.Its a month and a half of my time where Id otherwise be going out in Scottsdale playing golf and hanging with my boys or travelling around, so why not do something that used to bring me a ton of joy.Manziel, once a dynamic player on the field and outspoken off it, was one of the most electrifying college quarterbacks of all-time with Texas A&M and became the first freshman to win the Heisman Trophy as college footballs most outstanding player.The player known as Johnny Football was selected in the first round of the 2014 NFL Draft by the Cleveland Browns but inconsistent play and a string of off-field issues led to him being cut in 2016.Manziel then had a failed stint in the Canadian Football League and in 2019 signed with the Memphis Express of the now-defunct Alliance of American Football.HAVING FUNBut joining Fan Controlled Football, a four-team league designed for high-scoring action given a 7-v-7 style of game on a 50-yard indoor field in Atlanta, is not Manziels attempt to work his way back to the NFL.Not in the slightest. This is just six weeks of going to play some football and having fun, said Manziel, who will play for the Zappers when the season opens on Saturday. I dont have any plans after this to really go play football any further.While Manziel has experienced countless highs and lows over the last decade, he remains content with his accomplishments and does not feel he has to prove anything to anyone.Ive come to almost complete and absolute peace with my football career and what I did in the past, said Manziel. I had a lot of fun, I had a blast. I got to be around great guys and great coaches.Manziels fitness may not be where it was while he was dominating the college ranks but he said the time off had done him well and that his throwing arm feels good.While Fan Controlled Football may be far from the bright lights of the NFL, Manziel said that did not mean he would approach the season with any less desire to succeed.Im still going to try and make some things happen when I am out there, he added.Theres too much in my DNA deep down to where if you put shoulder pads and a helmet on me and somebody is chasing me I am not not going to try and make something happen."}