{"text": "Regrets, we've had a few. Or when it comes to our money, a whole lot.In fact, more than 80% of Americans have financial regrets, according to a new survey by personal finance site Bankrate.com. And because of the pandemic era, those regrets are a little different than they used to be.\"Normally, the top regret is not saving for retirement early enough,\" says Greg McBride, Bankrates chief financial analyst. \"This year, that flip-flopped: It was not saving enough for an emergency.\"That stands to reason, since this whole year has seemed like one big emergency, with an enduring health crisis and millions of job losses. In the survey conducted this April, 20% of respondents listed a lack of emergency savings as their top regret, compared to 15% two years ago.That was not the only financial remorse: Not saving enough for retirement was a close second at 19%, followed by racking up too much credit-card debt, at 18%. Only 15% said they had no regrets whatsoever.You may have your own missteps to add to the list: Perhaps not investing in Amazon or Apple years ago, or putting too much in some hot stock tip that did not pan out. Perhaps not buying a home, or buying an expensive on a house that you could not afford. Perhaps taking on too much student debt that you just have not been able to shake.START INVESTING SOONEREvery money regret stems from your personal story -- but whichever one you have, a financial planner has probably heard it already.\"The biggest regret I hear over and over is that they didnt start investing sooner,\" says Matt Stephens, an advisor with AdvicePoint in Wilmington, N.C. \"Other financial regrets I hear about are buying a car that was too expensive, selling stocks in a downturn, and buying real estate in 2006. Im always surprised by the consistency of the regrets.\"And they are certainly numerous. When we posed this question recently on social media, the responses were immediate and plentiful:\"Stupid timeshare.\" \"Not buying real estate in San Francisco in the late '90s, or New York City after 9/11.\" \"Not investing in Bitcoin when it was .50.\" \"Loading up credit-card debt as a young single mother.\" \"Not fully funding my 401(k) in my younger years.\"Financial regret may feel like a highly personal issue, but there is a whole field of study about what we regret and why. There are two ways to look at it: Regretting the stuff you did do, and the stuff you did not do. Either way, those regrets tend to shape how you handle financial issues in future.And not necessarily in a productive way, in terms of lessons learned. Regret can actually be a major threat to your financial security, according to the work of Nobel Prize-winning economist Daniel Kahneman. Because of its powerful emotional component, regret  and related issues like loss avoidance -- can lead you into making decisions you probably should not be making.\"Regret theory suggests investors who sell at the wrong time and miss out on gains experience regret that affects their judgment, leading to subsequent market-timing mistakes,\" says Sarah Newcomb, behavioral economist for research firm Morningstar and author of the book \"Loaded: Money, Psychology, and How to Get Ahead Without Leaving Your Values Behind.\"\"The idea that regret over one financial mistake can lead to subsequent mistakes is an important one. Emotions are important to consider when making a decision, but they can easily sway us if we over-weigh their importance in our mental calculus.\"Of course, regrets can look very different at different stages of life. That is why the new Bankrate survey is heavily split along generational lines: It is credit-card debt that looms most ominously over the psyches of younger Millennials, at 30% of respondents, while that regret eventually recedes for older generations.Meanwhile, not saving early enough for retirement is the clear winner for Baby Boomers, at 33%. In that way, considering the financial regrets of older Americans is like getting an advance peek into the future  a glimpse that could spur younger generations to make better money decisions right now.\"Older age cohorts are worried that they have not saved enough, and that was especially evident in the numbers this year,\" says Bankrate's McBride. \"That concern has really rattled them.\""}