{"text": "NEW YORK A growing number of Americans want to get the coronavirus vaccine, and a majority also support workplace, lifestyle and travel restrictions for those not inoculated against COVID-19, according to a Reuters/Ipsos poll released on Friday.The national opinion poll of 1,005 people, conducted on Monday and Tuesday, suggested the pace of vaccinations may pick up as more vaccines become available and more people want them.Altogether, 54% of respondents said they were very interested in getting vaccinated. That was up from a January survey, when 41% expressed the same level of interest, and 38% in a May 2020 poll before a coronavirus vaccine was developed.Interest in the vaccine increased over the past year among whites and racial minorities, with about six in 10 whites and five in 10 members of minority groups now expressing a high level of interest.Twenty-seven percent of Americans said they were not interested in getting vaccinated, which was relatively unchanged from a similar poll that ran in May.But foreshadowing the social challenges that may emerge as the United States begins to pull out of the yearlong pandemic, the latest poll showed a majority of Americans want to limit the ways in which unvaccinated people can mix in public.Seventy-two percent of Americans said it was important to know if the people around me have been vaccinated, according to the poll.A majority - 62% - said unvaccinated people should not be allowed to travel on airplanes. Fifty-five percent agreed that unvaccinated people should not work out at public gyms, enter movie theaters or attend public concerts.When asked about the workplace, 60% of Americans said they wanted to work for an employer who requires everyone to get a coronavirus vaccine before returning to the office and 56% thought unvaccinated workers should stay home.DIFFERENT STATUSCompanies could soon feel increasing pressure to address those concerns. About 18% of the U.S. population has already received at least one dose of the coronavirus vaccine and President Joe Biden said in a televised speech on Thursday night he would direct states to make all adults eligible for the vaccine by May 1.Dr. Amesh Adalja, a senior scholar with the Johns Hopkins Center for Health Security, said the poll responses made sense, given the social restrictions placed on everyone over the past year.People are saying: If Im vaccinated, its going to change my life, Adalja said. And if youre not vaccinated, thats your choice. But youre going to be in a different status because you might be a carrier of this virus, so you could spread it to another unvaccinated person.The poll results were somewhat split along party lines. Republicans, who have been generally less concerned than others over the past year about the coronavirus, were also less supportive than Democrats of workplace and lifestyle restrictions for the unvaccinated, according to the poll.Yet even among Republicans, four out of 10 said they supported keeping people without vaccines from going to gyms or movie theaters. Five in 10 Republicans think vaccines should be required for airline travel.The Reuters/Ipsos poll was conducted online, in English, throughout the United States. It had a credibility interval, a measure of precision, of 4 percentage points.Click here for more details about the poll: tmsnrt.rs/3liaABJ"}