{"text": "CALGARY, Alberta ARC Resources Ltds C$2.7 billion ($2.1 billion) bid to buy Seven Generations Energy Ltd will create the largest oil and gas producer in Canadas Montney region, and may re-energize development in one of North Americas top shale plays.The combined company will have more financial strength to develop its 1.1 million net acres of land in a region that investors and drillers say has so far struggled to meet its full potential.The deal could also spur further acquisitions in a play that boasts attractive drilling economics and huge resource potential as oil and gas prices tentatively recover.ARCs announcement on Wednesday is the latest in a wave of consolidation that has swept the Montney as companies buckled under collapsing oil prices amid the COVID-19 pandemic.Some investors are betting that U.S. President Joe Bidens decision to suspend oil and gas permitting on federal lands and water could add to the Montneys appeal.The Montney, you could argue, has some of the best economics in the whole of North America, said Jeremy McCrea, an analyst with Raymond James.The Montney straddles northeastern British Columbia and north-western Alberta. It is expected to produce 1.4 million barrels of oil equivalent per day (boepd) this year, according to consultancy Wood Mackenzie, making it the fourth-largest shale play in North America.In terms of remaining resources, it ranks only behind the Permian and Marcellus in the United States.But the play has struggled to showcase its full potential because of limited pipelines and low oil and gas prices that left producers highly leveraged and unable to invest in drilling, McCrea added.CROWN JEWELDeals last year included U.S. oil major ConocoPhillips purchasing land from Kelt Exploration, expanding its existing assets, and Canadian Natural Resources Ltd buying Painted Pony Energy, as big producers took advantage of smaller companies vulnerability to bolster their positions.Theres no doubt that the Montney is one of North Americas best shale gas plays, said Jeff Tonken, Birchcliff Energy Chief Executive. (The deal) shows theres a lot of interest in the Montney.ARCs acquisition of Seven Generations will accelerate consolidation in the region among producers carrying too much debt, Tonken said. Some are due for reviews of loans that are based on their oil and gas reserves, and those inventories are depleted after many cut capital spending, he said.Birchcliff does not see itself as a target and has ample inventory of its own to grow without acquisitions, Tonken said.Were just minding our own business, making money for our shareholders.The Montneys fortunes could improve if U.S. gas development declines under Biden, said Stephen Kallir, Vice-President of Calgary-based BlueSky Equities, which manages shares of Seven Generations and Tourmaline.Shares in both ARC and Seven Generations climbed in Toronto on Thursday, signalling investor satisfaction with the deal.More deals are likely as producers get larger to save costs, Kallir said.I think well see another headline-grabber this year.One of the jewels in ARCs crown is its liquids-rich Attachie acreage that it has so far left undeveloped. On a conference call, ARC chief executive Terry Anderson said the combined companys priority would be repaying debt, but by next year it could sanction Attachie development.Attachie has an estimated 8.9 billion barrels of liquids and 32 trillion cubic feet of gas resources in place, according to a company presentation.ARC now has a huge cash flow machine that should give it the confidence and ability to develop Attachie, Raymond James McCrea said."}