{"text": "From cat food to cannabis, it's boom time for quirky ETFs offering the chance to punt on niche themes in fast-growth sectors, but their huge gains are unnerving some who see them as another price-inflated asset that may threaten market stability.While Reddit \"gamestonks\" have grabbed recent headlines, retail investors are also credited with large flows into exchange-traded funds - basically a tradable basket of shares - swelling their assets by more than $1 trillion last year, according to Refinitiv.And growth has been especially notable in ETFs that aim to harness returns from themes that capitalise on societal and economic trends, from space travel to pet care, and marijuana to medical tech.Such ETFs, which are bought and sold like shares, more than doubled their assets under management last year to $140 billion, Citi analyst Scott Chronert says, describing inflows as having gone \"nearly parabolic\". Thematic ETFs in EMEA alone have received $4 billion so far this year, according to the bank, a figure Chronert said would grow \"as investors continue to demand more precise positioning\".The prominent ARK Innovation ETF , containing business disruptors Tesla (TSLA.O), payments firm Square (SQ.N) and genome editor Crispr Therapeutics , is up 350% since last March, while the Procure Space (UFO.O) and ProShares Pet Care  ETFs have also seen scintillating price gains.The iShares Global Clean Energy ETF (ICLN.O) has risen 275% meanwhile, and cannabis-themed ETFs have enjoyed a bumper ride on a view the new U.S. administration will decriminalise the drug.eToro said it had seen an increase of over 400% in the opening of ETF positions globally on its platform last year, part of an overall trend of \"tremendous growth\" in retail investing.\"It is easier to invest in themes than particular stocks or broader indices and so tech disruptors, gaming, biotech, have become very popular with retail investors,\" said Deborah Fuhr, co-founder of consultancy ETFGI.That's despite higher fees -- filings show the Ark Innovation ETF charges 0.75% versus 0.04% at Blackrock's core S&P 500 index ETF .Thematic ETFs are still a tiny part of the $8 trillion Exchange Traded Products industry. So why are some investors warning of stability risks? Some of it is down to what short-seller Carson Block, founder of Muddy Waters Capital, calls the \"autopilot\" model of passive investing - buying more of a stock as its price rises and its index weight grows.But when outflows hit, the ETF provider must sell shares to meet redemptions, potentially setting off a chain reaction as the share price falls. That passive selling could \"quickly overwhelm the market\" Block warned in an FT column this week.The risk may be magnified in thematic ETFs which focus on just a handful of names. ARK Invest, which owns the Ark Innovation ETF, for instance owns more than 10% of outstanding shares in some companies, particularly biotech, Saxo Bank analysts note.Ark Invest was not immediately available to comment.Sebastien Lemaire, head of ETF Research at Societe Generale also says the pace of inflows could be concerning. \"Some of these ETFs which have seen record inflows are quite concentrated on a relatively limited number of constituents.\"Any reversal, caused by ETFs tweaking holdings due to investor outflows or index rebalancing, could hammer the share price of smaller constituents with lower trading volumes.Within the ARK Innovation ETF, daily January trading volumes in streaming platform Roku Inc (ROKU.O) and virtual healthcare provider Teladoc (TDOC.N) averaged roughly three million shares and 500,000 shares respectively, well below the eight million units for the underlying ETF.And holdings also overlap across funds. Tesla (TSLA.O) features in no less than 27 thematic ETFs, Citi notes, while chipmaker Nvidia turns up in 45.Thematic ETFs continue to mushroom, with 17 launched in Europe last year, while U.S. ETF specialist Global X launched six worldwide, focusing on sectors from gaming to telemedicine according to fund research firm Morningstar.The concentration of risk may be even more extreme in \"three times long, three times short\" exchange traded strategies, where gains -- or losses -- can be three times the share performance. UK-based Graniteshares, which offers 3x long, 3x short exposure to 10 U.S. tech stocks and 10 UK blue chips, says $40,000 invested in its Tesla 3x long exchange traded product (3LTS.L) at its July 2020 launch would now be worth $1 million. Morningstar, while acknowledging recent dazzling returns, said its research shows thematic funds \"have historically struggled to survive and outperform global equity benchmarks over longer periods of time\".    "}