{"text": "When McDonald's Corp (MCD.N) rolls out its new crispy chicken sandwich line on Feb. 24, it will swap out a higher-priced premium chicken sandwich from its menu, the company confirmed to Reuters. McDonald's three new sandwiches  all with a larger fillet and new potato bun  will start at $3.49 and top out at roughly $4.69, depending on the region, according to a U.S. franchisee who spoke on the condition of anonymity and a Credit Suisse analyst.Soon to disappear from the menu: the more expensive Buttermilk Crispy Chicken Sandwich, which usually costs around $5.McDonald's menu swap follows several years of declining customer traffic at its U.S. locations. The last year in which guest visits rose was 2017, when they increased by 1%, according to annual financial filings. The pricing strategies illustrate how the world's biggest restaurant brand stands to make more money selling higher quantities of a cheaper product than lower quantities of a more expensive one.That scheme has long helped McDonald's beat competitors and is especially relevant as millions of Americans remain out of work because of the coronavirus pandemic.Amid a consumer frenzy for chicken, McDonald's forthcoming sandwiches represent one of its most significant menu changes since it switched the Quarter Pounder to fresh beef in 2018. The company has said the sandwiches are precursors to even more new chicken items as McDonald's looks to regain customers who flipped to Popeyes, a unit of Restaurant Brands International Inc (QSR.TO), and Chick-fil-A. Both rivals charge about $3.99 for their fried chicken sandwiches. Kentucky Fried Chicken will switch to a new chicken sandwich nationally by the end of February.  read more McDonald's suggested price is a \"very solid defensive play,\" especially for a low-priced brand, said restaurant marketing consultant Chas Hermann.    McDonald's \"can't go out at $3.99 and think they're going to move anybody back\" to their restaurants, he said.If successful, the new sandwiches could help boost sales at an average location by as much as 4.2%, according to Credit Suisse analyst Lauren Silberman.  An average McDonald's location is currently selling about 50 Buttermilk Crispy Chicken Sandwiches per day, she said.  But McDonald's stores are expected to sell between 100 and 150 of the new sandwiches daily, or even more, according to Silberman and the franchisee. The company said pricing will differ by region and location and is influenced by various market conditions. Many McDonald's franchisees turn to consulting firm Deloitte for advice on how to set optimal pricing. For example, the franchisee told Reuters that Deloitte recommended a price of $3.69 for the spicy and crispy versions and $4.29 for the deluxe. But the person, who declined to be named, said they will mark up the menu price because of higher minimum wages in the area, and that they plan to charge $3.99 and $4.69 instead. As prices rise, customer visits sometimes fall. Customer checks at fast-food restaurants rose more than 3% year over year in 2018 and 2019, then shot up 10.5% in 2020, in part because the pandemic prompted people to place larger family-sized orders. The data, from Black Box Intelligence, does not show how much of the increase is from larger order sizes versus higher prices.  "}