{"text": "South Koreas struggle to boost coronavirus vaccine supplies is threatening to overshadow President Moon Jae-ins first summit with U.S. President Joe Biden, with pressure mounting on Moon to secure more and faster deliveries of U.S.-made shots.Moon had hoped to use the Washington meeting next week as a chance to highlight South Korea's relatively successful response to the pandemic, a key legacy in his final year in office.But uncertainties in the country's vaccine rollout amid global shortages and shipment delays are deepening public scepticism over Seoul's goal of reaching herd immunity by November.That has sparked calls for a deal to get faster access to vaccines from the United States and potentially sidelined other important issues for Moon and Biden such as North Korea policy or relations with China and Japan.\"Any first South Korea-U.S. summit would typically be an occasion to reaffirm the alliance, coordinate North Korea policy and build personal rapport, but this time, its success might be judged by what we get to ramp up vaccine supplies, and that's not as simple a deal as others say,\" a South Korean official involved in preparations for Moon's trip told Reuters.VACCINE DEALSouth Korea has quickly and effectively administered the vaccines it has received so far, but it got off to a slower start than the United States and elsewhere.Just over 7% of its 52 million population have received at least one dose as of Tuesday, according to the Korea Disease Control and Prevention Agency (KDCA). A Reuters tally of global vaccination rates shows that's a percentage similar to countries such as Nepal and Colombia.On paper, South Korea has bought enough doses to vaccinate all 52 million residents twice over.But supply issues have raised fears those doses may not arrive fast enough, prompting Seoul to ask Washington to provide some doses as part of a \"swap\" for faster access to U.S.-made shots in return for domestically producing more doses later.Lee Ho-seung, Moon's chief policy secretary, told a local radio station on Wednesday that securing a \"vaccine partnership\" with Washington would be a top priority for the summit.He said the United States has original technology and raw materials, while South Korea has the world's No.2 biotech production capacity and the two combined could turn South Korea into a \"global vaccine production hub\".So far the United States hasn't been keen to play ball, South Korea's foreign minister said last month, with officials in Washington citing a still difficult situation at home and a lack of doses to spare.Samsung BioLogics Co Ltd (207940.KS) said on Wednesday a report it was in talks with Pfizer Inc (PFE.N) to begin production of the U.S. drugmakers COVID-19 vaccine in South Korea as early as in August was not factual. Opposition lawmakers have proposed a range of options for persuading the United States to make a deal, including joining the \"Quad\" partnership of the United States, Japan, India and Australia, which is working collectively to boost vaccine production.Others have raised the idea of pardoning Samsung leader Jay Y. Lee, who is in jail after being indicted on fraud and stock manipulation, and using his leverage in investment in U.S. semiconductor plants amid global chip shortages.Moon had initially dismissed that idea as premature, but said on Monday he would decide after reviewing public opinions.PRESSURE BUILDINGVaccine shortages have not been the biggest political problem for Moon, already under fire over skyrocketing home prices, an insider trading scandal and jobs crisis. But the crunch means Moon is no longer benefiting from earlier boosts to his popularity from his handling of the pandemic.A Gallup Korea poll in late April showed for the first time that negative views outweighing positive views over the government's anti-virus efforts and vaccinations - 43% had positive views versus 85% last May.A survey released on Monday by pollster Realmeter showed nearly 30% Koreans picked securing vaccines as a top priority Moon should pursue during his remaining term. Another poll on Sunday found less than 10% expected the country to attain its goal of herd immunity by November.Moon said on Monday the immunisation drive was going better than initially planned, having exceeded its goal of vaccinating 3 million people by April, and the November herd immunity target was still achievable."}