{"text": "Google's threatened shutdown of its search engine in Australia over a proposed content licensing law would ripple across industries, saddling partners like Apple with a sudden revenue gap and retailers as varied as affordable Kmart to upmarket David Jones with a supply of potentially useless gadgets.The Alphabet Inc-owned (GOOGL.O) company last month said it would likely pull its core search function from Australia if the government pushes ahead with a plan to require it and Facebook Inc (FB.O) to pay media companies an indeterminate fee for news snippets shown on their services.   Google and Facebook are fighting the first-of-its-kind \"News Media Bargaining Code\" as other countries consider similar efforts to aid publishers that have lost ad sales to the tech companies. In a sign of the Australian effort's potential to shake up the industry, Microsoft Corp (MSFT.O) - whose Bing search engine stands to benefit from any Google retreat - on  Thursday called for the United States to adopt a similar law.   read more Australian lawmakers have said the law is needed to help media firms stay afloat and so will press forward despite the threat, which Google formalised in a securities filing last week that stated forced bargaining \"could result in our having to alter or withdraw products and services\". Final passage of the legislation could come as early as next week.Google is pitching its own payment program with terms it can better control, and last month reached a deal with major  publishers in France as well as Reuters.  read more In Australia, Google users, advertisers and business partners have begun to worry about losing Google, which has a 94% share of the country's search market. The interconnected nature of Google's products means that devices including Android phones, Chromebook laptops and Nest smart speakers could be impaired without search.\"If Google's search function no long longer exists in Australia, that will remove a lot of the features I use on Google Nest,\" said Margaret Morgan, a screenwriter from Sydney who keeps a speaker in most rooms of her house and owns a Google Pixel smartphone.Google declined to comment for this story. The company has argued that being able to link to other websites for free is essential to search and many other free services that benefit Australians.REASON TO WORRYThe many companies that get paid in one way or another from Google search revenue have reason to worry, too. Apple Inc (AAPL.O), for one, receives billions of dollars globally to set Google as the default search program on iPhones, the Safari web browser and the Siri voice assistant, U.S. antitrust authorities have said.Browser makers including Mozilla and Opera get revenue share from Google, as do internet carriers in Australia such as TPG Telecom Ltd's (TPG.AX) iinet, Singapore Telecommunications Ltd's (STEL.SI) Optus and Telstra Corp (TLS.AX). The various partners did not respond to requests for comment or declined to comment.Exact terms of such deals could not be learned, but estimates based on publicly available information showed that half-a-billion dollars or more could be at stake. Total search ad revenue in Australia is pegged at about $3 billion for 2021 by researcher eMarketer, with almost all of that going to Google. The company paid out about 22% of its global ad revenue to search and other partners last year, financial statements showed.In the United Kingdom, with about 2-1/2 times the population of Australia, Google spent $1.5 billion to become the default search engine on a variety of devices in 2019. GADGET HITAustralian electronics chains such as JB Hi-Fi Ltd (JBH.AX), Harvey Norman Holdings Ltd (HVN.AX) and Wesfarmers Ltd-owned (WES.AX) Officeworks could also take a hit because they stock gadgets that have Google's search engine built-in. The same goes for department store chains like Wesfarmers' Kmart, Woolworths Group Ltd's (WOW.AX) Big W, and David Jones, which is owned by South Africa's unrelated Woolworths Holdings Ltd (WHLJ.J).Though Pixel phones hold just 2% of Australia's smartphone market, Nest speakers dominate with a 61% share, or 1.6 million households. Nearly a million Australians among a population of 25 million use five or more Google-owned services, technology analysis firm Telsyte said.Search is \"fundamental to Google's business model across all its products,\" said Foad Fadaghi, managing director of Telsyte. Retailers have began seeking reassurance from Google about its products' functionality if search disappears, though none have cancelled or returned orders, two people with knowledge of the communications told Reuters.Google also has smaller search partnerships. Software vendors Hey You and Redcat enable restaurants to solicit orders via buttons that accompany search results, and the Australian Football League has let fans vote on awards through search.Redcat sales and marketing director Lawrence Pelletier said the year-old search integration drives 15,000 orders a month, mostly from new customers.\"Would it be crippling if Google left? No. Would it be frustrating? Yes,\" Pelletier said. Hey You Chief Executive Uzair Moosa said he is exploring alternatives, but Google's largest search rival, Bing, does not offer a comparable tool.    Catherine Rowlands, a nurse from Sydney with a Pixel phone, told Reuters she feared what was to come.\"My phone without Google,\" she said, \"might as well be an old Nokia or something that just makes phone calls.\""}