{"text": "Investors are weighing how much further a rally in value stocks can run, as expectations for greater fiscal spending under a Democrat-controlled Congress add momentum to the surging shares of companies that took a beating for most of 2020.Shares of banks, energy firms and other economically sensitive companies climbed after the Democratic party's recent  victory in the Senate, adding to gains sparked by breakthroughs in vaccines against COVID-19 late last year. The move in these so-called value stocks, which tend to trade at relatively low price-to-book values, has stood out even in a broader rally that has seen most segments of the markets advance and Treasury yields climb on hopes of an economic revival. The Russell 1000 value index (.RLV) has jumped 14.5% since early November, nearly triple the gain of its growth-stock counterpart (.RLG), which is dominated by technology.That kind of outperformance is well outside the norm for value stocks, which badly trailed growth companies in the years since the financial crisis and especially in 2020, when the stay at home trend of 2020 buoyed big tech stocks for most of the year.      Still, as investors bet an economic revival this year, the rally in value shares may have further to go, if history is any guide.      A BofA Global Research indicator that tracks a number of economic factors is approaching the \"mid-cycle\" phase, where value has historically outperformed growth 71% of the time, excluding the tech bubble of 20 years ago. The firms top picks for 2021 feature a bevy of value names, including Chevron (CVX.N) and Hilton Worldwide Holdings (HLT.N).Meanwhile, energy sector funds saw $1.9 billion in inflows last week, their strongest since 2014, according to Deutsche Bank. Tech, by comparison, saw \"muted\" inflows of around $600 million.\"The lockdown mode ... is going to end at some point and I think Wall Street is getting comfortable with that idea,\" said Paul Nolte, portfolio manager at Kingsview Investment Management, which in recent months cut its technology holdings. Economically sensitive stocks can rebound quickly as growth picks up speed after a recession.Value stocks saw a 25% gain while momentum names lost 30% during a three-month stretch in 2009, when the economy was emerging from the financial crisis, according to Solomon Tadesse, head of quantitative equities strategy for North America at Societe Generale. More often, however, rallies in value names have tended to sputter over the last decade, and investors said there are several catalysts that could derail the current move. Among those are delays with the U.S. vaccine rollouts, a potential factor that analysts at Deutsche Bank said was among the top risks to their recently upgraded forecast for U.S. growth. \"Obviously, we all hope that the vaccines ... will get us to a much better place by the second half of the year,\" said Doug Cohen, portfolio manager at Fiduciary Trust International. However, there are \"no guarantees on that.\"At the same time, Democrats will have little margin for error when it comes to enacting fiscal spending measures, given their razor-thin majority in Congress, analysts said. U.S. economic growth could top 5% in 2021, on a fourth- quarter on fourth-quarter basis, if lawmakers pass another $900 billion in fiscal spending over the next few months, analysts at JPMorgan wrote last week, up from their forecast of 3.8%. Investors will also be paying close attention to corporate views of the economy in the upcoming earnings season, which kicks off this week. Earnings for S&P 500 companies overall are expected to jump about 24% in 2021, according to IBES data from Refinitiv, including strong rebounds for economically sensitive groups such as industrials, materials and financials.\"The outlook has to be good,\" said King Lip, chief strategist at Baker Avenue Asset Management. It would really kick the market into higher gear if we are hearing more companies raise guidance.\""}