{"text": "European banks' first-quarter earnings have surpassed all expectations in a turnaround from the COVID-19 doldrums of a year ago, yet after a decade of travails more than one season may be needed to win over sceptics.European bank shares are up 25% already this year, more than double the gains of the underlying STOXX 600 index. Since November, when President Joe Biden won U.S. elections with pledges for big-time spending, the sector has rallied some 66%.Vaccine rollouts, massive government spending and hopes of a resumption of post-pandemic normality have made investors eager to buy into the recovery; many are rotating portfolios to so-called cyclical stocks, which benefit when the economy looks up.European banks have become a proxy of choice though some caution the trading frenzy which boosted investment banking revenues may fade over coming months and that non-performing loans could rise once governments cut back on emergency support.All of Europe's top 10 lenders by market capitalisation beat forecasts for the January-March period thanks to buoyant revenues from securities trading, lower provisions against bad loans and rising bond yields.The majority of other big players such as Deutsche Bank, Societe Generale (SOGN.PA) and Unicredit (CRDI.MI) passed the season with flying colours too.Refinitiv data shows a rough 200% profit jump off the troughs of a year ago after the markets crashed last March as the COVID-19 pandemic hit Europe.\"We have got effectively 95% of all banks beating expectations, and not only that, beating them by an average of 24%,\" said Magdalena Stoklosa, head of European banks research at Morgan Stanley.While European bank shares already are on course for their best performance since 2009, Stoklosa sees potential for another 10% gains from current levels.Jerome Legras, head of research at Axiom Alternative Investments, which invests in bank equity and debt, said earnings could improve further if banks trim provisions to cover for any pandemic-related losses.STILL RISKYIt seems a sea change from last year when the sector lost almost half its market value on fear that lockdowns would send waves of loan losses crashing into balance sheets.The sector was also still nursing wounds from a series of banking scandals, low interest rates, higher capital requirements, and restructurings. All these contributed to a decade of underperformance since 2010.An economic recovery could pump up expectations for bank earnings, raising the bar for positive surprises.\"This was really the peak in terms of results\", Martin Moeller, co-head of Swiss & global equity portfolio management at UBP, said, predicting profit margins to stay under pressure from record-low interest rates.Nor has the sector lost its capacity to upset, Moeller said, adding: \"Remember Archegos?\" -- a reference to a U.S. investment firm whose default wiped out what would have been a stellar quarter for Credit Suisse.\"Banks continue to be quite a risky investment\", said Moeller, who prefers taking exposure to the financial industry via shares in asset managers or payment services."}