{"text": "LONDON The threat of a $1 trillion U.S. sanctions hit on the Chinese internet giants that have led emerging market stocks to their first record high since 2007 is overshadowing the rally, just as increased scrutiny from Beijing itself squeezes valuations.U.S.-Sino tensions ratcheted up in recent days as outgoing President Donald Trumps administration pushed through a ban on Americans investing in 35 firms it considers to be linked to Chinas military.Sources in Washington last week said Trump was considering adding Alibaba and Tencent, worth a combined $1.3 trillion, the second and third biggest EM stocks in the world and held by almost every major U.S. investment fund, to the list of banned firms.Targeting Chinas two most valuable companies would be the most dramatic step yet against the countrys firms as Trump seeks to cement his hardline policy against Beijing during his final days in office.Goldman Sachs estimates that U.S. investors hold roughly $1 trillion of Chinese internet and tech stocks, or have U.S. listings known as American Depositary Receipts (ADRs) that Washington has also been clamping down on.To unwind 1 trillion of investment (if Alibaba and Tencent were removed) is a lot! said Vivian Lin Thurston, a portfolio manager and Chinese equity analyst at William Blair Investment Management.It would be unprecedented, she added. It hasnt happened before in any global market.Swiss bank UBS calculates that just over a third of Alibabas $616 billion market cap is held by U.S. investors, while 12% of Tencents $35 billion value is.The two firms also account for almost 11% of MSCIs $7 trillion Emerging Market index which they respectively joined in 2015 and 2008. Chinese firms now make up 40% of the index, up from just 17% a decade ago.Graphic: China's growing dominance of MSCI's emerging market indexhttps://graphics.reuters.com/EMERGING-MARKETS/jznvnqwjdpl/chart.pngTHE BIG UNWINDGlobal index providers such as MSCI, S&P Dow Jones and FTSE Russell as well as the New York Stock Exchange have been forced to eject high profile firms on Trumps list like China Mobile, China Telecom and semiconductor giant SMIC from their top benchmarks.William Blairs Lin Thurston explained how those removals then trigger a wave of selling by investment funds that passively track the indexes.As soon as it is delisted - bang its gone, she said referring to the need to shed the stocks.While incoming President Joe Biden could reverse the ban, analysts at UBS say the new administration may not want to appear soft on China.Neither Biden nor his team have commented on the matter, but a reversal still wouldnt undo the billions of dollars of disruption already caused.Chinese investors have swooped in to buy up some of the offloaded shares but may struggle to absorb everything if things snowball.Goldman Sachs estimates there would be a $28 billion selloff if every international fund tracking MSCIs main global, emerging market or Asia indexes were to liquidate holdings of the 42 Chinese firms its views as at risk, not including Tencent or Alibaba.It and fellow Wall Street banks JPMorgan and Morgan Stanley have also said they will withdraw as many as 500 Hong Kong-listed structured products they had issued linked to the Chinese firms.Graphic: Chinese firms with biggest U.S. investor base as percentage sharehttps://fingfx.thomsonreuters.com/gfx/mkt/jbyprbzxzpe/Pasted%20image%201610382815788.pngANT PROBLEMSThe Trump administration has had both Tencent and Alibabas financial technology affiliate Ant Group in its crosshairs for some time.Just last week, Trump signed an executive order banning U.S. transactions with Alibabas Alipay mobile payment app and Tencents WeChat and QQ Wallet over concerns they could be used to track the locations of federal employees and build dossiers of personal information.Chinas foreign ministry responded saying the U.S. was abusing its power and unreasonably suppressing foreign firms with the measures.Tencent and Alibaba have declined to comment.In early November, it was Beijing itself though that rattled investors after the surprise suspension of Ant Groups $37 billion public listing, set to be the worlds largest stock market debut, with just days to go.Alibaba, which owns about a third of Ant, has seen its market value shrink by more than a quarter since the IPO was shelved and regulators zeroed in on its business model, although it is still among the biggest 10 companies globally with a valuation of more than $600 billion.Some fund managers considered Beijings move a sensible one as Ant, a major online lender, lacked adequate capital buffers. But others like Aviva Investors Head of Global Emerging Market Equities Alistair Way are concerned.We have become rather more nervous about the regulatory climate in China and the seeming desire to reduce competitive dominance of big e-commerce players such as Alibaba, he said.In aggregate we have been reducing exposure to Chinese internet firms.Standard Life Aberdeen senior investment director Nick Robinson is also unsure.It feels unlikely at the moment that they (Alibaba and Tencent) will be added to the blacklist, but so far it hasnt been right to bet on a de-escalation.So could it happen? Absolutely. And if it does happen it could be quite significant.Graphic: Mixed fortunes for Chinese firms thrust onto U.S. blacklisthttps://fingfx.thomsonreuters.com/gfx/mkt/rlgvdqrqwpo/Pasted%20image%201610391915814.png"}