{"text": "U.S. President Joe Bidens interim regulators are wasting no time unraveling Wall Street-friendly measures introduced under former Republican President Donald Trump, using quick-fix legal tactics.They have spiked or stalled more than a dozen contentious Trump-era measures that critics said eroded consumer protections, weakened enforcement, and curbed investors' ability to push for environmental, social and governance (ESG) changes.Rather than embarking on the lengthy process of rewriting the rules, the agencies have in many instances used speedy legal tools, according to lawyers, consumer groups, and a review by Reuters. These include delaying unfinished rules, issuing informal guidance, rescinding old policy statements or issuing new ones, and choosing not to enforce existing rules.The swift changes have set off alarm bells in the financial industry, which is having to adapt quickly to the tougher new regime, and set the stage for potential legal challenges down the road, said lobbyists and lawyers.\"The interim Democratic leadership for these agencies are moving very quickly to tackle the deregulatory policy shifts that occurred under Trump,\" said Quyen Truong, partner at law practice Stroock & Stroock & Lavan.\"The agencies' use of guidance and reversal of policy statements demands a quick turnaround of compliance for firms.\"During the previous administration, Trump-appointed regulators eased dozens of rules they said were outdated and hurt jobs, drawing ire from Democrats who said the changes saved Wall Street billions of dollars while increasing risks and hurting consumers.With a slim majority in Congress, Democratic lawmakers will struggle to repeal those rules, while delays to the presidential transition has left many nominees still awaiting confirmation nearly three months in.That has put the onus on interim officials to start executing Bidens agenda to help Americans recover from the pandemic and to tackle social injustice and climate change.Acting Securities and Exchange Commission (SEC) chair Allison Lee, for example, has been very active. She has returned power to senior enforcement staff, who had it stripped from them in 2017, to open probes without seeking senior approvals, and has reversed a 2019 policy that critics said made it too easy for companies that broke the rules to continue with business as usual.She has also begun to reverse the Trump administrations assault on ESG investing with a new effort to police misleading ESG disclosures. The SEC said every decision was made with a view to ensuring \"seamless leadership\" in its mission to protect investors.Likewise, the Department of Labor last month said it would not enforce two rules finalized in the last months of the Trump administration which curbed investments and shareholder votes based on ESG factors. The agency did not respond to a request for comment. And acting Consumer Financial Protection Bureau (CFPB) director Dave Uejio has not disappointed progressives who hoped he would fix policies they said undermined fair lending.\"We are taking a close look at previous policies that hampered the Bureau's effectiveness and simultaneously working nonstop through supervision and enforcement to ensure financial institutions are treating consumers fairly,\" Uejio said.He has revoked policies that had undermined the agencys ability to punish companies for abusive behavior, and which had curtailed the supervisory departments power to tell companies what to do. This month, Uejio delayed new debt collection rules which consumer groups said would do more harm than good, while Reuters has reported that the CFPB is exploring overhauling the countrys credit reporting system.Uejio said he plans to focus on more COVID-19 relief and racial equity measures.\"We've already seen financial agencies, most notably the consumer watchdog, take the hatchet to some of the worst Trump-era policies,\" said Ed Mierzwinski of consumer advocacy group PIRG.PUSHBACKRepublicans, though, say the changes create legal uncertainty and could cause companies to pull back from lending. U.S. Senator Pat Toomey, the top Republican on the Congressional panel that oversees financial agencies, said in a statement that the changes would \"slow economic growth.\"And hastily reversing rules and policies without going through a formal review process could risk litigation, said Brian Johnson, a partner at Alston & Bird and formerly CFPB deputy director.Still, lawyers said they were advising clients to adapt quickly, as permanent appointees were unlikely to change course.\"Consumers cannot wait for help,\" said Uejio. \"They need us now."}