{"text": "U.S. Treasury auctions offering $271 billion of new debt and a key inflation report this week could end a recent lull in the bond market, reigniting a rise in yields that worried investors in the first quarter.Treasury yields have dipped since April 1 during a two-week pause in issuance, reversing some of the dramatic rise in February and March. That eased concerns that higher borrowing costs will hurt stocks, particularly in growth sectors like technology, which have an outsized weighting in the benchmark S&P 500 index (.SPX).Investors said weak demand at upcoming auctions, which kick off on Monday, could send bond prices lower and yields higher, albeit at a slower pace than in the first quarter.\"No matter how you slice it, supply auctions will be in focus,\" said Justin Lederer, Treasury analyst and trader at Cantor Fitzgerald. Of particular interest will be the auction of both three- and 10-year notes on Monday, worth $96 billion in total.The benchmark 10-year yield  rose more than 80 basis points in the first quarter on expectations of blistering economic growth, higher inflation and the estimated $4 trillion in new debt to be issued this year.A poor seven-year note auction in February sparked a run higher in yields, and drove the 10-year real rate  - the 10-year Treasury yield stripped of inflation expectations - to the highest since June 2020. Even after markets cooled slightly in March, demand at that month's seven-year auction was modest.Mondays double auction \"will have some ramifications, but I don't think we move substantially the way we saw in quarter one,\" said Lederer.The Treasury will also be auctioning $24 billion of 30-year bonds on Tuesday and a total of $151 billion in bills throughout the week.U.S. consumer price data for March, due Tuesday, might also drive yields higher. Longer-dated yields rise with inflation expectations, as higher consumer prices can erode their value over time.U.S. producer prices notched their largest annual gain in 9-1/2 years last month, Labor Department data showed Friday, likely marking the start of higher inflation as the economy reopens amid an improved public health environment and massive government aid.  read more \"The next potential catalyst I see for the rates market is the CPI print, said Eric Winograd, senior economist for fixed income at AllianceBernstein. It shouldnt be a surprise, but you might still get some sticker shock and a bit of indigestion.While the most recent Fed projections see inflation reaching 2.4% this year, well above target, the central bank believes it will fall back to 2% next year. The consumer price index, which does not map perfectly onto the Fed's metric, is expected to have risen 2.5% year-over-year in March, according to a Reuters survey.Some investors and strategists said there may be greater demand for Treasuries now than during March, which could cap any rise in rates. April 1 marked the start of a new fiscal year in Japan, ending a period of portfolio readjustment in which investors sold off Treasuries, said Meghan Swiber, U.S. rates strategist at Bank of America.\"Japanese real money accounts were notably absent in March, likely because the combination of volatile rates and a stronger dollar kept a lot of buyers on the sidelines ahead of their fiscal year-end on March 31,\" said Guy LeBas, chief fixed income strategist at Janney Montgomery Scott.\"Now, with those buyers back in and currency markets a bit more stable, the balance has tipped slightly in favor of demand.\""}