{"text": "China Express Airlines (002928.SZ), a regional carrier based in the southwestern city of Chongqing, is betting that its business model of flying heavily subsidised routes using an increasingly Chinese-made fleet will give it an edge over rivals.The airline reported a 22% rise in annual profit last year - a near-impossible feat in the pandemic-ravaged aviation industry - thanks to subsidies of more than 625 million yuan ($97.14 million) that accounted for 87% of its total profits before tax.Routes in third and fourth-tier cities, 90% of which are monopolies, helped fuel growth and made it the only listed Chinese airline to make a profit in 2020.That put the previously obscure carrier on the radar of investors seeking faster-growing, domestic-focused alternatives to China's three biggest airlines.\"The company has very few direct competitors nationwide, but only faces localised competition on their shared routes,\" said Wu Yifan, transportation analyst at Huachuang Securities.Shares in China Express, with a fleet of 52 mostly Western-made planes as well as 100 domestically manufactured jets on order, surged 56% last year and have risen close to 20% this year.It is benefiting from Beijing's drive to develop new airports in regional areas, as well as a push for locally built jets to challenge the dominance of Airbus, Boeing and Brazil's Embraer.The airline's strategy, which depends on continued government route subsidies and the reliability of relatively unproven Chinese-made planes, is not without risk.But analysts say the benefits from the subsidies and other government policies should continue for at least a few years. A blueprint issued by the State Council in February said China will build 150 civil airports in the next 15 years, mostly small facilities in less-developed regions.Guosheng Securities forecast the airline's earnings will double from last year's 613 million yuan to 1.24 billion yuan by 2023.In a sign of its strategic importance, China Express was the first private airline in China to take delivery of the home-grown ARJ21 regional jet; it plans to buy a mix of 100 ARJ21s and C919s, a boost to state plane maker Commercial Aircraft Corporation of China (COMAC).China Express predicts COMAC planes will account for the majority of its fleet by 2025.The Civil Aviation Administration of China (CAAC) will offer favourable airport slots to domestically made airplanes and favour them in fleet planning over the next five years, the agency said late last year.China Express set a record in 2020 for the most time flown by any ARJ21 jet in a single day at 13.53 hours, it said in December. But the CAAC, out of safety concerns, asked the airline to cut back on its utilisation and build up public confidence in the jet slowly, a source with direct knowledge of the matter told Reuters.China Express, which had declined an interview with Reuters to discuss its strategy, referred any comment on ARJ21 utilisation to CAAC. CAAC did not respond to a Reuters request for comment.DOMINANT PLAYERFounded in 2006, China Express is the only listed airline focused on regional aviation in China, making its investment profile very different from the three big state-owned carriers.From CAAC alone, China Express, though tiny compared to the biggest airlines, got the most in government subsidies, at 217 million yuan, followed by China Eastern's 186 million yuan and China Southern's 130 million yuan. It is set to get 297 million yuan this year.It also has other fixed-price deals with local governments and airports that pay it regardless of passenger numbers.Subsidised routes are a small business for China's biggest three airlines, which are focused on reviving the lucrative traffic between big cities.Other regional airlines in China, part-owned by local governments, are small and focus mostly on local routes.In Xinjiang, China Express chose Korla, the region's second-largest city, as its regional hub and has linked it with around 15 other cities across the region. It has cooperated with big airlines, which usually have the best time slots at big airports, to direct traffic from Urumqi to Korla.The airline is looking to replicate that in Yunnan, a popular tourist destination that has poor infrastructure, after signing an agreement last year with Dehong Prefecture government to make it a regional hub.There are signs the subsidies are luring tourists.Philip Yu, a travel enthusiast, said he had flown China Express around half a dozen times over the last year as pandemic-related restrictions kept him from flying overseas.\"I would recommend China Express to any of my friends who want to fly within regions like Xinjiang, Guizhou or Inner Mongolia, particularly places where high-speed railways have yet to reach or have a limited presence,\" he said. \"It's really convenient.\"($1 = 6.4610 Chinese yuan renminbi)"}