{"text": "Argentinas bonds have slid to basement lows in recent weeks, but analysts and investors warn that theyre still no bargain, given stalled talks with the IMF, fears about a pre-mid-term election spending binge and dry weather denting crops.The South American country's bonds, restructured last year, have slid back with some under 30 cents on the dollar, while an index of how risky investors perceive the country has climbed as traders worry key economic reforms are being put on hold.The country's center-left Peronist government is braced for mid-term elections in October and keen to avoid spending cuts before then. Prices of the country's key farm exports like soy have been a bright spot, but hopes were dented this week with a sharp cut to the soy harvest outlook due to a lack of rain.\"Investors who buy Argentine bonds today are calculating that, at most in the next five years, there will be a crisis again and another restructuring,\" economist Aldo Abram of the Fundacin Libertad y Progreso told Reuters.\"There is a loss of credibility and difficulty obtaining credit to be able to pay the new bonds.\"Graphic: Argentinas post-restructuring USD bondsInvestors are concerned talks are stalling with the International Monetary Fund over a deal to restructure some $46 billion from a failed 2018 agreement. A deal once hoped for in  April or May now looks likely to slip to later in the year.The country, which last year defaulted on its sovereign debt for the ninth time, has been mired in recession since 2018 and has been forced to impose strict capital controls to protect the peso currency and stem an outflow of hard currency.Argentine bonds are now some of the cheapest and riskiest in the world, with annual yields above 20%. The restructured bonds have dropped sharply since September, while a J.P. Morgan country risk index is at its highest level since the swap.Graphic: Argentina: risks rising again\"While dollar bonds may improve, given that they are at basement prices, it's unlikely they will achieve a sustained rally before the elections in October,\" said Roberto Garetto, economist and portfolio manager at Fundcorp investment fund.Fitch Ratings in a report this week said that Argentina faced persistent \"weakness in debt repayment capacity following its September 2020 bond restructurings, and acute political uncertainty that clouds prospects for an improvement.\"It pointed to dwindling foreign reserves, a high fiscal deficit - 6.5% of GDP last year - and upcoming payments due to the IMF and the Paris Club. Gross foreign reserves of $39.7 billion are far below a year-ago target of over $50 billion.Graphic: Argentinas schedule of payments to the IMFHigh global soy prices are a bonus, though even that is being balanced out by dry weather ahead of the March/April harvest. A key grains exchange cut its forecast for the soy harvest by a huge 4 million tonnes on Wednesday. Farm exports still offer a potential glimmer of hope given sky-high prices. They are key to bringing in tax dollars needed for future repayments on foreign debt.\"The super-bullish commodity cycle is our only hope to join the global financial party, which allows many financial assets to reach ridiculous valuations,\" said Leonardo Chialva, analyst at consulting firm Delphos Investment.Siobhan Morden, head of Latin America Fixed Income Strategy at Amherst Pierpont Securities, said bond prices were \"low\" but that any bounce would likely have to wait until after the mid-term polls or a major positive commodities shock.\"There is no rush to shift towards a bullish credit view until later this year or if the positive commodity cycle reverses the balance of payments stress and allows for FX reserve accumulation,\" she said."}