{"text": "SINGAPORE/NEW YORK/LONDON Global oil and fuel prices are picking up as demand returns to pre-pandemic levels amid easing coronavirus lockdowns in key countries like China and India and signs of increasing road travel in several countries.Gasoline prices in Asia, Europe and the United States all scaled 1-year highs this week, while benchmark global crude oil Brent futures topped $60 per barrel for the first time in a year.The firmer prices are welcome news after the oil sector suffered its worst ever demand contraction in 2020, encouraging traders to drain brimming storage tanks to ease a supply glut.(GRAPHIC: Global gasoline prices - )https://fingfx.thomsonreuters.com/gfx/ce/yxmvjxkoxvr/GlobalGasolinePrices.pngThere are, however, questions over how quickly refiners with idled capacity can respond to increased demand. Analysts say the recovery pace will vary by region and fuel type, and that jet fuel demand will remain the weakest performer until more international air travel resumes.In its outlook on Thursday, the Organization of the Petroleum Exporting Countries (OPEC) noted that current oil demand levels were still lagging prior forecasts - an observation that knocked prices - but are expected to pick up in the second half of 2021.The International Energy Agency (IEA), in a separate forecast on Thursday, said it expected demand to rise strongly later this year.ASIA FIRSTAsia Pacific gasoline demand is expected to recover to 2019 levels by the end of the first quarter, following the regions return to pre-COVID gasoil consumption levels in late 2020, said Max van der Velden, principal analyst at Wood Mackenzie.This is primarily driven by China which has managed the pandemic very well, van der Velden said. We forecast the impact of renewed Chinese lockdown measures that restrict mobility to be short-lived.An accelerating shift from public transport to personal cars is also bullish for Chinas gasoline demand, he said.Recovering industrial activity in India - the second largest net oil importer behind China - has also tightened supplies of diesel, or gasoil, across Asia, which is usually a net exporter of the fuel.(GRAPHIC: Key Asian economies are recovering following sharp contractions in 2020 - )https://fingfx.thomsonreuters.com/gfx/ce/jznpnobeyvl/AsiaGDPDashboard.pngWith Asian refiners scheduled to curb output for annual facility maintenance in the second quarter, Asias gasoil surplus could narrow to around 300,000 barrels per day (bpd) in April-May from 500,000 bpd in the first quarter, FGE analyst Sandy Kwa said.Asias gasoline demand is expected to increase by 400,000 bpd in February from January, Kwa added, noting that the expansion over the same period in 2019 was closer to 600,000 bpd.Higher diesel demand in Europe may also soak up excess Asian supplies, Kwa added.U.S. SUMMER DRIVING SEASONU.S. gasoline prices for May, when the peak driving season typically gets underway, have climbed 16% so far this year, putting them above corresponding levels in 2020 and 2019 on improving demand and constrained supply.(GRAPHIC: U.S. May gasoline futures prices push above where they were at this time in 2020 & 2019 - )https://fingfx.thomsonreuters.com/gfx/ce/xlbvgdgyopq/USMayRBOBFutures.pngU.S. gasoline output has partially recovered from the lows of the pandemic, but was still down 11% on the year in January, while stocks were roughly 3.2% lower, according to American Petroleum Institute data.(GRAPHIC: U.S. gasoline production and stocks - )https://fingfx.thomsonreuters.com/gfx/ce/qmyvmwonrvr/USGasolineProdvsStocks.pngThat lower level of output and stocks means refiners and traders may be caught flatfooted if demand surges, said John Kilduff, partner at Again Capital in New York.Wood Mackenzie analyst Paula Jara said U.S. gasoline demand will reach 8.83 million bpd this year. Thats about 800,000 bpd above 2020 levels but still around 500,000 bpd below 2019 levels.Truck traffic held up better than passenger car travel thanks to increased deliveries of food, goods and protective equipment. As a result, demand for diesel fell by only 340,000 bpd versus 2019, Jara said.For 2021, total U.S. diesel use is expected to be 3.5% above 2020s levels, but around 3% below 2019s total, she added.EUROPEIn Europe, renewed lockdowns and a low rate of vaccinations might quash fuel demand in the coming weeks, but better weather and eased travel restrictions in the spring will likely boost fuel demand by June, analysts said.European refining margins are still lower than a year ago, but rising prices and narrowing price spreads between gasoil futures delivery months indicates a tightening market, analysts said.(GRAPHIC: European gasoil prices push higher & price spreads narrow on improved demand expectations - )https://fingfx.thomsonreuters.com/gfx/ce/bdwvkndyjpm/EuropeGasoil.pngThe six-month diesel contango reached $1 a tonne on February 5, its narrowest in almost a year, Refinitiv data showed.(GRAPHIC: Europe fuel prices - )https://fingfx.thomsonreuters.com/gfx/ce/xklpyoggbpg/EuropeFuelPrices.pngEuropean gasoline and diesel demand to rise by some 900,000 bpd to 8.3 million bpd by June, according to Rystad Energy.We are forecasting economic growth and a recovery in mobility associated with lockdowns easing from a combination of better weather and vaccination programmes (through June), which increases global gasoline demand by over 2 million b/d over that period, said Alan Gelder at Wood Mackenzie."}