{"text": "CARACAS Venezuelas deteriorated health system and collapsed economy will make the country one of the toughest places in the region to conduct a coronavirus vaccination campaign, an effort that already trails most of South America, experts said.The country has one of the regions lowest coverage rates for even basic vaccines, according to regional health figures, driven by years of blackouts, loss of medical personnel and decay of local clinics that are crucial for such campaigns.Venezuela on Thursday moved a step closer to getting access to COVID-19 vaccines as opposition leaders and officials from President Nicolas Maduros cash-strapped government began talks on how to pay for inoculations.But without filling the gaps in its health infrastructure, reaching remote corners of the economically devastated country will prove difficult. That could leave pockets of isolation that undermine the global mitigation effort and boost the risk for the creation of new variants.Cold storage facilities are operational in Caracas, but regional distribution centers in state capitals have seen extensive decay of refrigeration units, said Dr. Huniades Urbina, a pediatrician and a member of the National Academy of Medicine.You dont accomplish anything by storing the vaccine in Caracas without being able to take it into the provinces, Urbina said in an interview. In the states, in the regions, theyre not prepared with the cold chain (capacity) they need.The impact of Venezuelas hyperinflationary economic crisis is evident in the countrys vaccination rates, which trail far behind even Haitis in inoculations for measles-mumps-rubella (MMR) and hepatitis B shots, according to Pan American Health Organization (PAHO) data.CLINICS ABANDONEDHealth experts blame years losses of qualified personnel due to mass migration, inadequate budgets for vaccination campaigns, and the abandonment of clinics in rural areas.By 2017, vaccination had dropped off so sharply that Venezuela suffered a measles outbreak that was only controlled through a campaign involving PAHO that was meant to ensure that it didnt spread to other countries.Venezuela blames its current situation on U.S. sanctions that have crippled oil exports and made it more difficult to import goods including medicine.The information ministry did not immediately reply to a request for comment.Venezuelas economic collapse has fueled the migration of more than 5 million people since 2015, and the situation on the ground has worsened in recent years.Fuel shortages are now so severe that basic travel is complicated and expensive, creating obvious hurdles to distributing vaccines in remote areas.Provincial cities have suffered frequent blackouts since a 2019 power outage paralyzed the country for nearly a month, further undermining cold-chain capacity.And local humanitarian organizations have denounced a systematic campaign of intimidation of aid workers that has drawn criticism from the United Nations Office on Human Rights, undermining trust among crucial local allies.Dr. Alberto Paniz-Mondolfi, assistant professor of pathology at Mount Sinai Icahn School of Medicine in New York, says when he did his residency in Venezuela two decades ago, even clinics in the remote Amazon region were fully equipped for vaccine campaigns.(Now) you do not have refrigerators in the ambulatory clinics. You do not have secure access to dry ice, said Paniz-Mondolfi, who fled Venezuela in 2019 after being threatened by government officials over his research on the resurgence of vaccine-preventable diseases.You go to any community in Venezuela, a remote community in the provinces, most of the ambulatory network has been shut down."}