{"text": "(This October 12 story corrects spelling of PanAgora)NEW YORK/LONDON A fund trading strategy that tracks hundreds of billions of dollars in assets and often gets blamed for exacerbating market selloffs is facing a challenge from the policy response to the pandemic. But fund managers said they are adapting, and new money is flowing in.Most closely associated with investment funds such as Bridgewater Associates and AQR, the strategy, called risk parity, typically spreads risk over stocks, bonds and other financial assets, as against traditional 60-40 stock and bond portfolios where equities carry more risk. It uses leverage to magnify returns from lower-risk assets such as bonds.But the U.S. Federal Reserves policy of keeping interest rates near zero in response to the coronavirus crisis has raised questions about the strategy. Bond prices, which move inversely to yields, have little room to rise and volatility has been generally low, which dulls Treasury bonds appeal, analysts and investors say.Managers of risk parity assets said they are adjusting to the new reality, that the industry can thrive in a low-yield environment and investors can still benefit from the diversification it brings.Bridgewater, which manages around $148 billion, told Reuters it has around 45 new commitments this year to invest money from existing and new clients. Many, it said, were in the $1 billion-plus range.Investor demand has been pretty constant, said Bob Prince, Bridgewaters co-chief investment officer, said recently.Prince said his firm had reduced its exposure to Treasuries in favor of assets like inflation-linked bonds, and increased exposure to China. Within Treasuries, he said longer-dated maturities like the 30-year -- which are less influenced by Fed policy -- were more attractive. Bridgewaters move into TIPs was previously reported by Bloomberg.Bridgewaters All Weather fund returns were up between 1% and 7% this year, he said.Hakan Kaya, a senior portfolio manager at asset manager Neuberger Berman, which has more than $1 billion under management in risk parity strategies, also reported positive inflows. Kaya said he had made shifts such as rotating into assets like Treasury Inflation-Protected Securities.AQR, which manages around $141 billion total, said with all assets, including stocks, challenged by todays low risk-free rate environment, we believe that the risk diversification of risk parity remains an excellent approach to portfolio construction.At least two major investors have decided to withdraw in recent months from risk parity, however, part of a trend which one pension fund consultant said was seeing large funds do their own diversification and seek higher yielding assets. The $34 billion Texas Permanent School Fund, for example, has mostly withdrawn, meeting records show.CHALLENGES AHEADFirst introduced in the mid-1990s by Bridgewater here, risk parity grew in popularity after the 2007-2009 global financial crisis, investors said. Estimated assets under management are now about $120 billion, or roughly $400-$500 billion with leverage, according to Neuberger Berman here.Investors and analysts said the strategy had benefited from bond yields trending ever lower. But with little space for bonds to rally, the strategy faces a problem, said Grant Wilson, head of Asia-Pacific at macro advisory firm Exante Data, in an Australian Financial Review column here.Michael Kushma, chief investment officer, global fixed income, at Morgan Stanley Investment Management, said if yields move upwards of 1%, higher returns become possible again. Benchmark 10-year yields are currently around 0.77%.Im worried that the whole concept of risk parity will be much more complicated, given the level of interest rates now, Kushma said.Market turmoil in March hurt industry returns.This year so far, risk parity strategies that target volatility of 12% had annual returns of negative 4% versus a 20.5% gain last year, according to HFR, a hedge fund industry data provider. In September, returns were down 1.3%.Others counter the view that risk parity struggles in low yield environments. A paper here by PanAgora Asset Management said its research showed portfolios targeting low-yielding sovereign bonds held up well.PENSION FUND MOVESThe Texas fund, which had around $2 billion here allocated, decided to withdraw after saying in a report here the strategy underperformed its benchmark. Holland Timmins, chief investment officer of the $34 billion fund, told a board committee on Sept. 1 here that it had nearly exited risk parity.The Pennsylvania Public School Employees' Retirement System, which had $3.6 billion here devoted to risk parity, said here this summer that its investment office had recommended reallocation to other assets.Still, the Indiana Public Retirement System, with $4.3 billion allocated to risk parity, in Dec. 2019 started evaluating implementing a passive risk parity strategy to complement existing allocations.Rhett Humphreys, partner at investment consulting firm NEPC, said he expects risk parity to return around 5%-5.25% over the next decade -- not enough for many pension funds.Humphreys is working with some funds that are eliminating the strategy, which he said also suffered from being less exposed to outperforming U.S. equities than a 60/40 portfolio.Bridgewaters Prince, however, said the 60/40 portfolio was probably disadvantaged much more by a zero interest rate environment due to a lower return on bonds and more downside risk on equities. With risk parity, the portfolio can be restructured to keep diversification.Humphreys added that while risk parity can make sense for smaller funds that may not have the capacity to diversify, larger funds can buy different assets directly.Peter Willett, senior investment manager researcher at Mercer said while he expects investors to reassess their risk parity allocations, they may not necessarily exit the space.The fundamental principle of risk balance still holds, Willett said."}