{"text": "Eight years ago this month Jerome Powell, still in his rookie year as a Federal Reserve governor, surveyed the U.S. job market and declared it was good enough for the central bank to reduce the support for the economy it had rolled out to fight the 2007 to 2009 financial crisis.The unemployment rate had just hit a post-crisis low of roughly 7.5%. But for Blacks it remained a catastrophic 13%, a fact not raised by Powell or any other policymaker during their meeting.\"We've achieved substantial progress towards our economic objectives,\" Powell told his colleagues according to transcripts of that April 30-May 1, 2013, Federal Open Market Committee meeting. He encouraged them to reduce the Fed's monthly bond buying at \"the next plausible opportunity.\"The \"taper\" from that earlier crisis began later in 2013.The Fed is again confronting a similar debate with Powell now its chair - singing a markedly different tune. The shift in his language on the matter now shows how fully the central bank has switched gears to emphasize maximum employment as the paramount of its two congressionally mandated goals.Though markers like unemployment insurance claims and labor force participation are, because of the pandemic, worse today than they were when the Fed started withdrawing crisis support the last time, some broad indexes of labor market health are in fact better now than they were then.Yet Powell, who speaks of the homeless people he sees on his commute as a measure of his job performance, says he is nowhere near ready to pull back on the throttle. In fact he cringes at labor market data like the current Black unemployment rate of 9.6%, which is far better than when he was ready to tighten policy after the last crisis.The Fed today \"has a different view of what constitutes full employment,\" said Nick Bunker, economic research director for the Indeed Hiring Lab. \"The labor market may be roughly as healthy as it was at the end of 2013, but the Fed thinks it's further from full employment.\"TAKING THE OPPOSITE BETThe Fed's commitment to this new approach will be tested in coming months with an expected jump in inflation, beginning this week when data due on Tuesday is likely to show consumer prices in March rose 2.5% from a year earlier.Though largely due to comparison with weak prices at the start of the pandemic last spring, the surge in the index will likely mark the beginning of what Fed officials acknowledge will be a \"tricky\" battle to convince the public, financial markets and elected officials that higher inflation is what the economy needs, with wage gains and higher headline growth likely to come with it.It's a hard argument to win if gas prices skyrocket this summer and the airline travel people avoided during the pandemic becomes too expensive.\"Price stability,\" defined by the Fed as inflation averaging 2% annually, is its second area of responsibility. Fed policymakers have spent much of the last decade trying to understand why inflation remained below the targeted level despite efforts to lift it.Their conclusion is inflation is generically weak, so much so they can take some calculated risks around it.Previously Fed officials saw inflation and unemployment levels as closely linked: Low joblessness drove prices higher, and a falling unemployment rate offered a cue for when to make economic conditions more restrictive so prices would not rise too fast.That's what they were doing in 2013. Even though the unemployment rate was high, around 7%, when the Fed announced its bond taper, it was expected to drop quickly. Officials did not want to fall behind in tailoring policy to fit the improving economy.Now, they are prepared to take the opposite gamble: that they can wait for unemployment to fall ever lower without much danger of inflation becoming unmoored.Many are skeptical. A coming jump in short-lived \"base effects\" inflation may ease quickly. On the horizon, though, are the impact of pandemic-driven supply bottlenecks like the current microchip shortage, a potential surge in demand for in-person services as those become safe again, and a government spending pipeline turbocharged with coronavirus aid and potentially new infrastructure spending.\"There is a massive experiment under way,\" said Edward Al-Hussainy, senior rates analyst with Columbia Threadneedle. \"We are going to try to run the economy hot. We have a bunch of supply-side constraints left over from COVID. The economy is reconfiguring after the COVID shock, and we don't know how that is going to result in how prices are formed.\"ADDRESSING AN UNEQUAL BURDENMarkets are betting the Fed will have to raise interest rates sooner than telegraphed, and if there is a severe enough inflation surprise \"a hard landing cannot be ruled out,\" said Karen Dynan, a Harvard University economics professor and senior fellow at the Peterson Institute for International Economics.But after arguably jumping the gun in ending crisis programs last time, the Fed is now ready to err in the other direction, with the hope that women find their way back to the labor force a bit faster, people of color regain the economic footing they had before the health crisis, or perhaps that the tent city along Powell's route home disappears.The current unemployment rate is 6% now and by the Fed's projections is heading to 4.5% by year's end, a level that previously would have been seen as a trigger for faster inflation.Jobs openings are surging and the million-a-month job additions expected perhaps through this summer dwarf the strongest employment showings of the last recovery.For the Powell of 2021, it isn't enough.The economic downturn has not fallen equally on all Americans, and those least able to shoulder the burden have been the hardest hit, Powell said in March after a Fed meeting that reaffirmed its pledge to keep pouring help into the economy. We understand that our actions affect communities, families and businesses across the country."}