{"text": "ROME After decades locked away in a basement, some of the finest sculptures from antiquity have been pulled from the gloom and returned to public view in Rome.Busts of Roman emperors, intricate sarcophagi and an ancient Greek relief carved 2,500 years ago are just some of the 92 pieces on display in the citys Palazzo Caffarelli.The marbles belong to the aristocratic Torlonia family and represent a fraction of their 620 sculptures, believed to be the largest such private collection in the world.We could do seven, eight, 15 more exhibitions, said art historian Salvatore Settis, who was picked by the family to help curate the show and had the difficult task of deciding which works should see the light of day.Like many leading Rome families, the Torlonias initially put their huge collection on display in a museum. But after 101 years, they locked its doors in 1976, looking to convert the building into private apartments.The reappearance of such a legendary collection is a very important event, said Settis. When I saw them for the first time it was very emotional because I knew most of those pieces from books, but I had never seen them.The Torlonias, who built their wealth off the back of papal contracts, snapped up established collections, some dating back to the 15th century, and built up a collection of collections.Among the pieces on view is a fountain basin carved in ancient Greece that was believed to have stood in the garden of Julius Caesar when it was already considered an antiquity.Many of the works have undergone substantial restoration over the years, including a statue of a goat whose body dates to the first century AD but whose head is believed to have been created by the famed 17th century Italian sculptor Bernini.Anna Maria Carruba helped prepare the statues for the exhibition.Many of these pieces were already restored from 1600 onwards. We didnt need to work on the structure of the statues but only on the surfaces, cleaning them, removing the dust that had accumulated over the years and materials used in previous restorations, she said.The Torlonia Marbles show had been due to open in April, but was pushed back because of the coronavirus. It runs in Rome until June 2021 and is expected to move on to at least one other European country and the United States before returning to Italy where it will be given a permanent home."}