{"text": "Wall Street ended sharply higher on Monday, fueled by expectations of a coronavirus relief package and by a rally in Amazon, Apple and other technology stocks ahead quarterly earnings season.The S&P 500 was about 1% below its record closing high from Sept. 2, nearly recovering from most of a 9% pullback last month.Apple is crushing it. Theres some euphoria around the name, said Phil Blancato, chief executive of Ladenburg Thalmann Asset Management in New York. The market leaders are once again the tech names, supported by the fact that the economy continues to expand.Optimistic sentiment dominated after the Trump administration on Sunday called on Congress to pass a stripped-down coronavirus relief bill as negotiations on a broader package ran into resistance.It looks like the administration wants a deal done before the election, said Brian Battle, director of trading at Performance Trust Capital Partners in Chicago. Now its up to the Republican Senate to figure out how big the number is going to be.Many investors view Democratic candidate Joe Biden as more likely to raise taxes, and for months have seen a second term for Trump, who favors deregulation, as better for the overall stock market.However, with growing expectations of a Democratic win in next months presidential election, investors are increasingly pointing to potential benefits of a Biden presidency, such as greater infrastructure spending and less global trade uncertainty.Betting odds aggregated by RealClearPolitics suggest bettors see a 67% chance Biden will win and a 33% chance for Trump, the greatest gap so far between the two candidates.With the Oct. 15 presidential debate officially canceled, Trump plans to travel to key battleground states this week as his doctor declared he was no longer a transmission risk for the novel coronavirus.Overall, analysts expect third-quarter earnings for S&P 500 companies to fall 21% from a year earlier, smaller than a 31% slump in the second quarter.Earnings are expected to be negative, but I think most people would say, Yes, but we set the bar so low that we will probably beat Q3 numbers the way we beat Q2 numbers, said Sam Stovall, chief investment strategist at CFRA in New York."}