{"text": "Miner Argonaut Resources (ARE.AX) is preparing to start drilling for copper next week on the shores of South Australia's Lake Torrens, it said on Friday, against the stated wishes of local Aboriginal groups.Drilling for the Murdie project is set to begin after 20 semi-trailer trucks delivered accomodation units, ground protection matting, vehicles and specialist drills, Argonaut said in a filing to the stock exchange.    \"Argonaut anticipates that drilling will be underway early in the week commencing 15 March 2021. Drilling be conducted 24/7 in two daily shifts,\" it said. The project comes after the miner received approval from South Australia's government in January to drill, which came despite opposition from Indigenous groups who say they have ancestral ties to the lake.\"We are telling them, 'you can't do that mate, it's against our beliefs,\" said heritage services manager Glen Wingfield of Kokatha Aboriginal Corporation.\"They disregard the stories and the importance for our community - they just want to go off and mine,\" he told Reuters, adding that Argonaut had not obtained their consent to drill.Argonaut director Lindsay Owler did not immediately respond to a request for comment on Friday.Last year mining giant Rio Tinto Ltd (RIO.AX) destroyed two ancient and sacred Indigenous rock shelters in the Pilbara region of Western Australia as part of an iron ore mine expansion.The destruction focused a spotlight on Australia's laws that have been skewed to favour development at the expense of Aboriginal heritage, sparking international condemnation and a national inquiry.   Below Lake Torrens are fragile fresh water acquifers that local Aboriginal groups fear could be damaged by mining, jeopardising water supplies in the arid region, while the lake itself is part of their spiritual beliefs.A native title judgement in 2016 raised questions about whether local Aboriginal groups had ancestral and ongoing ties to the region, citing a lack of ethographic evidence. "}