{"text": "Protests against racism triggered by the death of African American George Floyd have inspired art around the world, from murals in Syria and Pakistan to graffiti in Nairobi.At the Berlin Wall, a large portrait of Floyd is seen alongside yellow block letters spelling I CANT BREATHE, words he repeated before dying as a white Minneapolis police officer knelt on his neck for nearly nine minutes.The May 25 incident, captured on video, prompted widespread protests across the United States and in other countries. The case was ruled a homicide by medical examiners, and Derek Chauvin, the white officer was charged with second-degree murder.Syrian artist Aziz Asmar said he wanted to send a message of solidarity through his mural.After witnessing the increased racism against black people in the United States, and because it is our duty to stand with all humanitarian causes around the world, we painted today on a wall destroyed by Assad planes in Idlib, said Asmar, referring to Syrian President Bashar al-Assad.Asmar said the images of Floyd reminded him of those of Syrian children killed by suspected chemical attacks in Damascus and Khan Sheykhoun.In Afghanistan, a blast wall in Kabul was the canvas for Mehr Aqa Sultani, of arts activist group ArtLords.George Floyd is a global figure now and he was killed in the United States because of the blackness of his skin, he said. We want to say no to discrimination because discrimination has no benefit for us.In Paris, street artist Dugudus depicted U.S. President Donald Trump as a police officer pressing his knee into Floyds neck while holding a Bible.The mural referred to Trumps photo op in front of St Johns Church in Washington last week, after police forcefully removed protesters in a nearby park to clear the area for him.In Pakistan, where elaborately painted trucks are a common sight, Karachi-based artist Haider Ali, 40, painted Floyd on the wall of his house - until he can return to his usual moving canvas.I painted these candles and I made these flowers as garland around his neck to pay him tribute, said Ali, who is raring to paint on trucks again to spread the message of Floyds death."}