{"text": "U.S. President Joe Biden met with executives from major companies on Monday to discuss the global chip shortage that has hit automakers and spurred Intel Corp (INTC.O) to announce it plans to make chips for car plants at its factories in the next six to nine months.During the meeting, Biden said he had bipartisan support for legislation to fund the semiconductor industry. He previously announced plans to invest $50 billion in semiconductor manufacturing and research as part of his drive to rebuild U.S. manufacturing under a $2 trillion infrastructure plan.The global chip shortage stems from a confluence of factors as carmakers, which shut plants during the COVID-19 pandemic last year, compete against the sprawling consumer electronics industry for chip supplies. That industry has seen a boom as people spend more time at home.Biden and his top advisers view the semiconductor shortage as a \"top and immediate priority,\" the White House said after the meeting.Intel Chief Executive Pat Gelsinger, who attended the meeting virtually, told Reuters the company wanted to start producing chips at its factories within six to nine months to address the shortage, which has idled assembly lines at some U.S. automotive plants.The supply crunch could lead to a potential 1.3 million shortfall in U.S. car and light-duty truck production this year. \"We're hoping that some of these things can be alleviated, not requiring a three- or four-year factory build, but maybe six months of new products being certified on some of our existing processes,\" Gelsinger said. \"We've begun those engagements already with some of the key components suppliers.\"Intel last month announced plans to vastly scale up chips manufacturing for outsiders as it builds new factories in the United States and Europe. Its talks with automotive suppliers disclosed on Monday represent an acceleration of those plans.The White House meeting included executives from 19 major companies, including General Motors (GM.N) Chief Executive Mary Barra, Ford Motor (F.N) CEO Jim Farley and Chrysler-parent Stellantis NV (STLA.MI) CEO Carlos Tavares. White House national security adviser Jake Sullivan, National Economic Council Director Brian Deese and Commerce Secretary Gina Raimondo also took part.\"Today I received a letter from 23 senators, bipartisan and 42 House members, Republican and Democrat, supporting the chips for America program,\" Biden said at the top of the session.Executives from companies such as GlobalFoundries, Taiwan Semiconductor Manufacturing Co (2330.TW), AT&T (T.N), Samsung Electronics Co (005930.KS) and Google-parent Alphabet Inc (GOOGL.O) also were in attendance.Participants emphasized the importance of increasing transparency in the semiconductor supply chain to help mitigate current shortages, and improving demand forecasting to help stave off future challenges, the White House said in a statement.They also discussed \"the importance of encouraging additional semiconductor manufacturing capacity in the United States to make sure we never again face shortages,\" it added.Participants discussed short and long-term approaches to address the chips shortage, but no immediate decision or announcement was likely to come from the meeting, White House Press Secretary Jen Psaki told reporters.Broadband internet, cellphone and cable TV companies also face delays in receiving \"network switches, routers, and servers,\" according to an industry group.Later this week, the Senate Commerce Committee will hold its first hearing on a bipartisan measure to bolster technology research and development efforts in a bid to address Chinese competition.Trying to address supply chains on a crisis-by-crisis basis creates critical national security vulnerabilities, national security adviser Sullivan said in a statement."}