{"text": "LOS ANGELES U.S. President Joe Biden has moved swiftly to start dismantling a cornerstone of former President Donald Trumps hardline immigration policy, a program that sent thousands of asylum seekers back to Mexico to await their immigration court hearings.Bidens focus on ending the Migrant Protection Protocols (MPP) - under which 65,000 migrants were sent back to Mexico - fulfills a key election campaign promise, but it leaves thousands of migrants not in the program unsure of their fate, migrants, attorneys and activists told Reuters.Some of those migrants not in the program have been waiting along the U.S.-Mexico border longer than those who were enrolled in MPP after they were caught crossing the border illegally. Now, migrants with active MPP cases are eligible to claim asylum in the United States. The exact number of non-MPP asylum seekers along the border is not clear because there is no single record of them, but advocates say there could be thousands.The presidents focus on MPP is not surprising - it was one of Trumps most controversial immigration policies, and Biden denounced it on the campaign trail.Trump said the program aimed to curb the release of thousands of migrants who had entered the United States to claim asylum. But migrant groups said many of those people were forced to live in squalor in Mexico and were vulnerable to violence, including kidnappings and extortion.In the rush to get rid of the program, attorneys and activists say one unintended effect is that non-MPP asylum seekers who have spent months and even years at the border have been left in limbo. Advocates are now pressing the U.S. government to allow these asylum seekers entry into the United States to make their claims.The issue highlights the challenges facing the Biden administration as it seeks to reform immigration policies, while also emphasizing that not everyone who comes to the border will be granted asylum.Republicans and critics have coalesced around the message that Biden has implemented an open-border policy. Biden officials, however, are discouraging migrants from making their way to the United States, stating that the majority of people who arrive will be turned away.The White House referred questions to the Department of Homeland Security, which said in a statement that the system to process individuals with active MPP cases is the first phase of a program to restore safe and orderly processing at the southwest border.It declined to elaborate on when or if asylum seekers without active MPP cases would be allowed to claim asylum in the United States.THE LISTAngeles, a Nicaraguan mother of two who asked that Reuters use her middle name for her safety, is one of the asylum seekers not in MPP.She has been waiting with her family in the Mexican city of Tijuana for 15 months after fleeing her country for political persecution.Afraid of kidnappings, the family rarely goes outside their home and struggles to buy basic necessities like food. Her husband works as a mechanic in exchange for a room for his family. Angeles children, aged 15 and 7, are not in school, and her eldest son is sleeping poorly.Despite her familys difficult situation, Angeles says she wants to enter the United States legally. In November 2019, she added her family to La Lista, - The List - an informal, handwritten book maintained by migrants on the Mexican side of the border. Administrators recorded the names of thousands of migrants and gave them numbers as they waited their turn to make asylum claims to U.S. officials.She and her family got two numbers - 4,465 and 4,466 - on two scraps of paper. For more than a year, that has been their only clue about when they could enter the country.La Lista was borne out of another policy embraced by Trump called metering, which limited how many migrants could seek asylum each day at U.S. ports of entry. The Strauss Center, a University of Texas research organization, estimates that 9,600 people were on La Lista in Tijuana alone up until it closed in March 2020, though it is not clear how many of those people are still at the border.But Angeles family never got called. After the COVID-19 outbreak, the United States sealed the southern border to the vast majority of asylum seekers. Angeles doesnt know whether her familys numbers mean anything anymore.I just want an answer, for them to tell me, Look, come present yourself on this day, even if they interviewed me and gave me a number and told me to come back, Angeles said. But I have nothing.Theres basically almost no access to asylum for people who are not in the MPP program, said Ginger Cline, a lawyer who represents migrants in Tijuana with Al Otro Lado, an immigration nonprofit group. Its an issue because there are now thousands of people who are waiting in dangerous border cities who dont have access to basic needs.BLACK MIGRANTS FACE UNCERTAINTYTijuana also has a large population of Haitian migrants as well as migrants who traveled from Africa. They are particularly vulnerable to extortion and racism, migrants and advocates say. They, too, have been left in limbo as MPP was mostly limited to Spanish-speaking asylum seekers.The situation is really difficult for those of African descent, said Katerine Giron, an organizer with Espacio Migrante, a migrant community organization in Tijuana.The Biden administration has not done anything for Black immigrants except continuing the cruel and inhumane system that existed before Trump but heightened under Trump, said Guerline Jozef, executive director of the Haitian Bridge Alliance, an activist group which provides humanitarian assistance to migrants along the border and in the United States.The group estimates there are about 5,000 Black immigrants in Tijuana, and 10,000-15,000 border-wide.The White House and DHS did not respond to questions about how its approach to unwinding MPP is affecting Black migrants.In the absence of clarity from the U.S. government, hundreds of asylum seekers have begun camping near the port of entry in Tijuana, hoping to make their asylum claims.The camp has swelled to about 1,500 people since mid-February, said Alex Mensing, a Tijuana-based immigration advocate with Innovation Law Lab who is part of a coalition that has been trying to help migrants coming to the port of entry.The expansion of the camp comes as U.S. officials have declared that the swift processing of MPP claimants has allowed Mexico to close the sprawling Matamoros camp on the border that was the most visible symbol of Trumps crackdown on migration from Central America.Mensings group had counted 241 tents at the port as of Tuesday. Many people camping out do not have active MPP cases but have spent more than a year at the border.Theres almost universally this idea that it doesnt make sense to let some asylum seekers in and not others, Mensing said. They do not see that as fair."}