{"text": "TORONTO As Canadian provinces struggle to contain rising COVID-19 infections, a lack of adequate paid sick leave for front-line workers is fuelling transmission, doctors and advocates say.While political leaders and health officials advise sick people to stay home, many people cant afford to. Some 58% of workers in Canada lack enough paid sick leave, according to the Decent Work and Health Network, and that percentage rises as wages drop.One morning last spring, 67-year-old part-time support worker Susan woke up feeling a hurt in my heart like a knife. She went to work at a Toronto rehabilitation home anyway -- she said it was the only way to pay the bills. Susan, who is using an pseudonym for fear of professional repercussions, had no sick days and couldnt afford to miss even a days pay.She told Reuters she felt pressured to go in to work.As her symptoms worsened, she took a COVID-19 test, which came back positive.I went to work two days sick and I was scared to call in sick because they dont believe you. Thats ridiculous. It should not be like that, Susan said.Reuters reached out to the home, which confirmed there was a coronavirus outbreak in the spring. It said the exact source is unknown.Canadas federal government launched a program last fall that provides money after the fact to people who have had to miss work due to COVID-19. Critics charge it does not provide the same security sick leave would.Some 60% of the long-term care workers represented by SEIU Healthcare, a union, are part-time. Even if they do get paid sick days it averages three days a year, said president Sharleen Stewart.Believe me, they do not want to go to work sick. They have no choice: They have to put food on the table, Stewart said.Thats causing transmission in their workplaces.Our experience has been that outbreaks in long-term care tend to be introduced by workers, Ontarios Associate Chief Medical Officer of Health Barbara Yaffe told reporters last month.STARK CHOICEAs the number of COVID-19 outbreaks and deaths in long-term care homes rise, the pressure to work while sick worries doctors like Samir Sinha, Director of Geriatrics at Mount Sinai Hospital and University Health Network in Toronto.Its a system that is increasingly not there for workers and its making residents sick, he said.The issue exists in non-health sectors, as well. In Peel Region west of Toronto, home to the industrial hubs surrounding the countrys largest airport, many front-line employees are faced with the stark choice: obeying isolation guidelines or feeding their families, said Lawrence Loh, the regions Medical Officer of Health.Peel Public Health has definitely seen certain outbreaks that have been seeded by workers that needed to break isolation early or may have worked through mild symptoms, Loh said.Lack of paid sick days is a deterrent to isolation, its a deterrent to detection and its a deterrent to them getting the support they need.Loh pointed to places like Germany, where he says guaranteed paid sick leave helped contain the pandemic.In November, Peel Region said it would start charging employers up to $5,000 per day for failing to take necessary action to stop the spread of COVID-19 in the workplace.The action stops short of imposing paid sick leave, the press release said, because that was outside the health regions power.Provincial governments point to Canada Recovery Sickness Benefit when asked why they wont guarantee paid sick leave.But the program requires users navigate a government website for paperwork and the payout is delayed, which means someone could be waiting weeks for missing grocery or rent money, said Deena Ladd, executive director of the Workers Action Centre.Ontario Labour Minister Monte McNaughton said the province has spared no expense to keep COVID-19 out of workplaces. But when asked about mandating paid sick leave he referred to the federal program.My message is, if youre sick, stay home."}