{"text": "MUMBAI (Thomson Reuters Foundation) - Farhana Shaikh used to recoil in disgust when she went to the communal toilet in Dharavi. But since the pandemic struck, efforts to fight COVID-19 have dramatically improved public sanitation in one of Asias largest slums.As Indian cities face record daily deaths, new cases have plunged in the Mumbai slum in recent weeks as officials bolstered anti-virus measures first put in place last year - from mass testing to disinfections in public areas, including bathrooms.The toilet is being cleaned every day since the last year as against once a week earlier. Theres soap and sanitiser and a box for disposing sanitary pads that were otherwise strewn around, Shaikh, 30, told the Thomson Reuters Foundation.People are also more cautious now: they are using masks and sanitisers ... exposure to deaths and infections has made everyone fearful, said the mother-of-one.Home to 850,000 people cramped in 55,000 mostly one-room homes, Dharavis confirmed coronavirus cases fell to nine on Monday - down from a one-day peak of 99 a month ago, according to local government data.Residents and local officials say that is largely the result of lessons learned during last years first wave of cases, when Dharavi defied expectations by tackling an initial surge in infections.A testing protocol including free tests for tens of thousands of residents was revived as cases crept into double digits, fever camps were set up to scan for symptoms and quarantine facilities set up last year were reopened.Despite vaccine shortages, announcements have blared out from loudspeakers across the slum, urging residents to get vaccinated. Another campaign sought to overcome vaccine hesitancy by offering free soap to anyone getting their jab.There is a strong community outreach, contact tracing continues and toilets are being deep cleaned with jet sprays, said Yusuf Kabir, a water, sanitation and health specialist with UNICEF, listing factors that helped the slum turn the tide.Toilet operators and sanitation workers are more vigilant, Kabir said.No one can guarantee it wont be affected in the third wave. But Dharavi is not complacent, he said.WE WERE GOING MADAbout a third of the worlds urban population lives in informal settlements like Dharavi, which lies at the heart of Indias economic hub, according to the United Nations.Poor living conditions, malnutrition and weakened immune systems make slum dwellers more vulnerable to contracting infections, disease experts have warned.Wary of Dharavis potential to become a COVID-19 nightmare, Mumbais civic officials were closely monitoring cases in the neighbourhood when Indias deadly second wave took hold in March.Initially, the slums quarantine centres were empty. Some experts suggested the metropolis might have moved towards herd immunity following last years outbreak.Everybody sensed if Dharavi was fine, Mumbai was fine. We slightly misjudged Dharavis quiet and calm as everything under control, said Kiran Dighavkar, assistant municipal commissioner with Mumbais civic body.Cases in Mumbai and Dharavi steadily increased through March, peaking in April to a daily high of 11,000 cases, before steadily coming down to less than 2,000 on Monday.The 15 days from April 10 to 25 were horrible ... We were going mad, Dighavkar said, adding that lessons learned in the slum had helped the city as a whole respond to the crisis.We adopted the Dharavi model of aggressive testing and screening. And that actually helped, Dighavkar said.PAYING ATTENTIONLocal politician and Dharavi resident Babu Khan spent years challenging Mumbais municipal corporation over poor hygiene, overcrowding and rubbish-dumping in the slum that heightened the risk of disease.But the COVID-19 crisis has forced both authorities and local people to rethink sanitation and public health issues.The coronavirus has changed a lot: doctors, health posts, ward officers are paying attention. Dharavi has got the attention we had been seeking all these years, he said.Local residents are more cautious, too, and the slums narrow streets are cleaner.After the first COVID-19 death in Dharavi last year, there was panic among people. They became alert and realised they had to save themselves, Khan said.Local doctor Sudhir Patil who has been practicing in Dharavi for years said the number of asthmatic bronchitis and tuberculosis cases have dropped over the last year as residents wear masks and take better care of their diets.Despite a cautious optimism that the worst is over, officials are already making plans for a possible third wave, including setting up facilities for children, who are not yet eligible for vaccination.We cant assume everything is okay... every wave has its own challenges, said Dighavkar.But there is a positive impact of these changes in Dharavi on children who have had an early exposure to good habits. And that will be permanent change."}