{"text": "Legal challenges were being fought across multiple federal courts on whether to allow Tuesdays scheduled execution of convicted murderer Lisa Montgomery, the only woman on federal death row in the United States, who doctors say is brain-damaged and mentally ill.It is one of three executions the U.S. Department of Justice had scheduled for the final full week of President Donald Trumps administration, and would mark the first time the U.S. government has executed a female prisoner since 1953.Two other executions scheduled for Thursday and Friday have been delayed, for now at least, by a federal Judge in Washington to allow them to recover from COVID-19.Whether Montgomerys execution proceeds will almost certainly fall to the U.S. Supreme Court, whose conservative majority has previously allowed all of the 10 previous executions last year under death penalty proponent Trump, a Republican, to proceed.But it entails that the Justice Department succeed in having the rulings of several judges in lower courts overturned, some of whom have criticized the government for its apparent urgency in completing an extraordinary spree of executions before Trumps term ends and before all constitutional challenges are fully aired.Lawyers for the death row inmates are trying to get the remaining execution dates pushed back past Jan. 20, when President-elect Joe Biden, a Democrat who says he will seek to abolish the death penalty, takes office.On Monday, the U.S. Court of Appeals for the District of Columbia Circuit voted to stay the execution to hold hearings on whether the Justice Department gave insufficient notice of Montgomerys execution date.On Tuesday evening, more than two hours after the execution was scheduled to begin, the Supreme Court agreed to a Justice Department petition to overturn that stay.Separately on Monday night, a federal judge in Indiana ordered the execution to be postponed to allow for a hearing on whether she was too mentally ill to be executed. But the 7th U.S. Circuit Court of Appeals in Chicago overturned the stay on Tuesday afternoon, a ruling that Montgomerys lawyers have since asked the Supreme Court to overturn.Around the same time, the St. Louis-based 8th U.S. Circuit Court of Appeals issued its own stay of the execution, siding with her lawyers that the government had scheduled her execution in violation of the original sentencing courts judgment issued in 2007. That stay was still in place on Tuesday evening.Montgomery, 52, had been scheduled to be killed by lethal injections of pentobarbital, a powerful barbiturate, at 6 p.m. EST (2300 GMT) on Tuesday in the Justice Departments execution chamber at its prison in Terre Haute, Indiana.She was convicted in 2007 in Missouri for kidnapping and strangling Bobbie Jo Stinnett, then eight months pregnant. Montgomery cut Stinnetts fetus from the womb. The child survived. Some of Stinnetts relatives have traveled to witness Montgomerys execution, the Justice Department said.In the Indiana ruling, U.S. District Judge James Patrick Hanlon granted a stay to allow the court to conduct a competency hearing. The Supreme Court holds that executing an insane prisoner breaches a constitutional ban on cruel and unusual punishments.Doctors who have examined Montogomery and scans of her brain say that her brain shows sign of structural damage and that she has bipolar disorder, among other mental illnesses. Her lawyers say the brain damage likely stemmed from her mothers alcohol abuse during her pregnancy with Montgomery and from her stepfather often slamming Montgomerys head against a concrete floor while raping her as a child.She has auditory hallucinations, has expressed uncertainty about whether the child of the woman she killed was really her own, and has said that God speaks with her through connect-the-dot puzzles, according to court filings.Justice Department lawyers countered with transcripts of Montgomerys prison phone calls they said showed she understood her execution date was drawing near.Montgomerys lawyers asked for Trumps clemency last week, saying she committed her crime after a childhood in which she was abused and repeatedly raped by her stepfather and his friends and pimped out for sex by her mother, and so should instead face life in prison.Federal executions had been on pause for 17 years and only three men had been executed by the federal government since 1963 until the practice was resumed last year under Trump, whose outspoken support for capital punishment long predates his entry into politics."}