{"text": "LONDON/FRANKFURT The world is racing towards a vaccine in record time, stirring public concerns about safety to the extent that nine leading developers have felt compelled to issue a pledge to uphold scientific standards and testing rigour.Yet, while more than 40 experimental COVID-19 vaccines are being tested on humans, the insurance companies with decades of experience in assessing the risks of clinical trials dont see anything to be unduly concerned about.They argued there was little structural difference to trials carried out in the past, despite drugmakers around the world competing to shatter the fastest time in history for developing a vaccine, which stands at around four years.Rates have been relatively stable. Even this year we have so far seen only moderate price increases on average, with higher price jumps for particularly exposed COVID-19 trials, said Mark Piazzi, senior underwriter liability at Allianz Global Corporate & Specialty (AGCS).This was echoed by David Briggs, managing director, life sciences practice at Gallagher, who said every trial was rated on its methods and the kinds of patients involved.Gallagher said premiums in Britain, for example, started at about 5,000 pounds ($6,500) per trial.Total claims limits in policies were typically set at roughly $6-12 million, depending on the countrys rules, according to several insurance companies interviewed by Reuters.In Britain, for instance, claim limits were usually set at no lower than 5 million pounds, while in Germany the figure was around 10 million euros ($11.8 million).LOSS EXPERIENCE NOT DRAMATICHowever part of the reason why premiums have not risen as sharply as some people might have expected is that claims from trial are generally uncommon, according to executives. This is because patients have often signed so-called informed consent agreements, they said.So, you know, everything from you could have a sore spot on your arm. To you could potentially die. And you know, they would literally go that far in some of these protocols, he added.Those generally tend to hold up in courts and in legal systems around the world. That means that the loss experience coming out of clinical trials is not very dramatic.Claims are often limited to circumstances linked to the improper conduct of trials or any wrongdoing, rather than side-effects of the treatment, executives said.Such have been the worries about the vaccine race among some members of the public, who fear safety standards could slip, that nine developers issued a joint pledge last month to uphold the integrity of the scientific process.ASTRAZENECA TRIAL SUSPENSIONBut the insurers said such delays were not unexpected, and could even reflect the extra caution of vaccine developers given the lack of data about COVID-19.Pharma companies and insurers alike are even more careful than usual with COVID-19 trials because there is so much at stake, particularly for the patients safety.All trials of the vaccine candidate have resumed, with the exception of the U.S. study.There have been examples in recent memory of drug trials going catastrophically wrong, though.In 2016, for instance, one participant died and five were hospitalised in a Phase I trial run by French company Biotrial in the city of Rennes, testing an experimental mood brightener made by Portuguese drugmaker Bial.In 2006, six patients required intensive care after receiving a potential treatment against leukaemia and auto-immune disease in London. One was described as looking like the elephant man after his head swelled. Another lost fingertips and toes. Germanys TeGenero, the initial developer of the medicine, folded.But insurance executives stress such disasters are rare, given the thousands of clinical drug trials being carried out every year.Walters of Aon, speaking about the 2016 trial, said it was obviously a horrible situation.But thats one of very few incidents of really bad loss experience that the industry has faced. So, clinical trial insurance is not hugely expensive. Lets put it that way."}