{"text": "LONDON/NEW YORK President Donald Trumps challenge of the U.S. election result in the courts has emboldened some to bet he can still win, even as most bookies have settled bets by accepting that President-elect Joe Biden will succeed him.Trump still has a 10% chance of remaining in the White House for a second term, according to Betfair, an online betting exchange that matches opposing wagers by punters. That is up from 3% late last week.Democrat Biden is currently projected to win 279 electoral college votes, more than the 270 he needs to become president. He is ahead of his Republican rival Trump in the voting count in states that would bring his electoral vote total to 306, according to Edison Research.All major U.S news organizations have called the Nov. 3 election for Biden based on preliminary voting tallies.The discrepancy shows how some punters are backing Trumps long-shot bid to overturn the election outcome in the courts, based on unproven claims of extensive voting fraud and irregularities.Im a loyal Trump supporter and I put my money where my mouth is, said Chris French, a 53-year-old mortgage broker from West Sussex in Britain. After losing a 50 pounds ($66) bet on Trump with a bookie that settled bids once TV networks called the presidency for Biden, French placed a new 10 pounds bet on Trump this week with an online exchange that still accepted wagers.Trump was so far ahead on the election day. I believe things will turn once fraud is uncovered, French added.Despite a flurry of lawsuits filed by the Trump campaign in the last few days, legal experts say the litigation has scant chance of changing the outcome.A Trump campaign spokesman said: With every action we take, we are moving closer to the goal of re-electing President Trump. More than 70.5 million Americans voted for the President and he owes it to them  and everyone who voted for Joe Biden as well  to ensure that the election was fair and secure.The Biden campaign did not respond to a request for comment.Nearly 80% of Americans, including more than half of Republicans, recognize Biden as the winner of the presidential election, according to a Reuters/Ipsos poll published this week.Prominent Republican lawmakers and other Trump allies have defended Trumps refusal to concede, arguing he has the legal right to contest the results.Betting exchanges such as Betfair and Predictit that are still taking bets on the election said they needed more certainty to call the outcome, and declined to specify when they would follow the lead of the bookies. A Predictit spokeswoman said the company was seeking clarity in light of ongoing vote counts, potential recounts and any legal challenges.Not all betting exchanges remain open to election bets. Smarkets settled bets on Saturday after U.S. TV networks called the election for Biden. It appeared clear that Bidens leads in the key swing states was unassailable, a spokesman for the firm said.Those who are still bullish on Trumps odds remain defiant. I think the betting odds show that there are some smart people that are realizing this is not over, said Nathan Lands, a Silicon Valley entrepreneur and Trump supporter."}