{"text": "DESSAU, Germany In the German town of Dessau, one of the sites of the Bauhaus art school, an institute was set up in 1921 to mass-produce vaccines that later helped strengthen the German Democratic Republic. Exactly 100 years later, the site is gearing up to be a one-stop shop to produce COVID-19 vaccines for Germanys pandemic response.Its just one example of a rash of efforts by governments across the globe to access fragmented vaccine production, after manufacturing setbacks deprived European Union members of drugs made on their own soil this year. From Australia to Thailand, states planning home-based vaccine plants are starting to reshape the industry.The German venture has the backing of the regional government, as part of a national effort to secure supplies and add vaccines to Germanys exports. Saxony-Anhalt premier Reiner Haseloff said he believes Germany could become a swing producer of vaccines, in the same way that power companies maintain capacity for times of strong demand.Ultimately, this is comparable to the energy industry, where the state also pays to keep power plants in reserve, Haseloff told Reuters.Unlike the United States, where the governments Operation Warp Speed began funding the expansion and retrofit of pharmaceutical manufacturing sites early in the pandemic, few countries globally have the option to commandeer factories. The German plan is one of more than half a dozen by governments around the world to avert shortages by supporting drug companies local production.Some - including Australia, Brazil, Japan and Thailand - are setting up manufacturing partnerships with Swedish drugmaker AstraZeneca PLC. Elsewhere, Italy has pledged state backing for a public-private vaccine production centre, while Austria, Denmark and Israel plan a joint research and development fund and will explore whether to produce their own next-generation vaccines.India plays a significant role in vaccine production globally, and the United States, Japan and Australia also plan to help finance vaccine production capacity there, a senior U.S. administration official told Reuters.The moves aim to address a global shortage of doses. With vaccines key to restart economies, some countries have pre-purchase agreements to secure their supply.2 BILLION DOSESThe vaccine crunch in Europe has shown that states that depend on deliveries from multinationals can be vulnerable. In January, AstraZeneca cut supplies to the bloc by more than half for the first and second quarters, and told Brussels it was not able to divert Belgian-made drugs that were earmarked for the United Kingdom. The cut heightened tensions between London and Brussels and prompted European leaders to set curbs on exports of vaccines made in the EU - starting this month, when Italy blocked exports of AstraZenecas shot.Germany is a net importer of all vaccines, with a $720 million trade deficit in this area. Berlin plans to change that, and Germanys former Bacterial Institute of the Anhalt Counties in Dessau will help. Now a family-owned firm called IDT Biologika, it and AstraZeneca plan to invest more than 100 million euros ($120 million) to expand the plant into a factory for complete vaccines.The company says it aims to make between 30 million and 40 million doses a month from the end of 2022, producing the bulk vaccine and also dispensing it into vials, which Chief Executive Juergen Betzing told Reuters would make it one of Europes biggest manufacturers and add capacity for at least 360 million doses a year from within the EU.Germany has not yet reserved the right to purchase any of these vaccines, but the government wants to come up with a plan on measures to support and incentivise long-term vaccine production capacity by May 1, according to a document seen by Reuters. A government source said drug company representatives have told Berlin long-term purchase guarantees would be more important to their investment decisions than aid.The IDT plant will also be able to produce vaccines for other companies and, together with a cluster of firms in Saxony-Anhalt, form the heart of a government strategy to make Germany a new centre for vaccine production in Europe.Berlin is targeting an annual capacity of 2 billion COVID vaccine doses from IDT and other facilities, a person familiar with the matter told Reuters. For comparison, AstraZeneca has stated its ambitions to produce up to 3 billion doses of its vaccine by the end of this year, which would make it the largest COVID-19 vaccine producer globally.Berlins target could prove to be far in excess of the EUs needs for its 450 million people, but it isnt yet clear how often vaccinations will be needed to bolster immunity.The COVID pandemic is an unprecedented challenge to inoculate billions. While the drugs are badly needed in the near term, such piecemeal plans reflect the lack of any coherent global strategy to cover vaccination in a pandemic, which the world needs, according to Robert Van Exan, a consultant and former Sanofi executive.It takes time to build that infrastructure properly, and some thought has to go into it, Van Exan said.LESSONS LEARNEDPrevious vaccine disputes between allies have served as a prelude to the COVID-era fight for supplies.In a flu scare in 1976, the United States blocked vaccine exports, derailing a vaccination plan in Canada. Ottawa learned a lesson: During the H1N1 flu pandemic of 2009, it bought drugs from a local producer, and waited until its outbreak was largely over before then donating extra doses to the World Health Organization.And then, in the years after the 2009 pandemic, Washington paid hundreds of millions to several companies to build or expand private facilities that could be used to make and package a pandemic vaccine on short notice within the countrys borders.When COVID-19 hit, at least two of those sites became part of Operation Warp Speed, producing vaccines for Johnson & Johnson, AstraZeneca and Moderna Inc . Federal officials used the Defense Production Act to put participating companies first in line for supplies made by other U.S. companies, and the U.S. Army Corps of Engineers directly oversaw some construction projects. When companies struggled to hire enough qualified staff, 16 Department of Defense employees were sent to work in quality control at two manufacturing sites, according to a recent federal report.RUBIKS CUBEGlobally, vaccines are manufactured across drug firms existing networks and often need to pass through several countries - and even between continents - before they are ready to inject into arms. Within the EU alone, more than 30 plants from Sweden to Spain are involved in the production of COVID-19 vaccines. AstraZeneca says it has manufacturing capacity in 25 sites across 15 countries, in a chain of partnerships that one company executive likens to a Rubiks Cube puzzle.Its a similar picture for others, including vaccines made by Russia and China, and hitches are common when trying to accelerate production across multiple sites and borders. Switzerland-based Lonza Group AG makes the ingredients for Modernas vaccine which then go to Spain to be put into vials. J&Js shot is made in the Netherlands and sent to the United States for bottling. Pfizer-BioNTech has contracted factories across a network of 13 sites to meet production needs this year - their supplies to Europe also briefly fell short when a plant had to be re-engineered.But friction between AstraZeneca and the EU in Brussels has continued to chafe since a supplier to the drugmaker in Seneffe, Belgium ran into difficulty in January.AstraZenecas vaccine production starts with living cells being infected with a modified form of the virus. The cells are grown in tanks, or bioreactors, harvested and purified over about two months. Once the active ingredient is created, water and proteins are added and the liquid is bottled - a stage known as fill and finish. Sometimes, different stages happen at different sites.Problems at the Belgian plant, combined with AstraZenecas contractual commitments to supply the United Kingdom, meant that even though the product involved was made a short drive from Brussels, EU citizens were left wanting.The German company IDT Biologika now plans to cover all stages of the cycle. Other German vaccine developers BioNTech SE and CureVac NV, which are at the forefront of new vaccine technology and have both received government funding, will also be part of Germanys cluster. BioNTech recently brought a new German plant online to produce up to 750 million doses per year and pharma giant Bayer AG will help make CureVacs shot.The developers of the Russian vaccine, Sputnik V, have also made inquiries about producing it in the region, Saxony-Anhalt premier Haseloff said. Russias sovereign wealth fund Russias Direct Investment Fund (RDIF), which is promoting Sputnik V internationally, declined to comment.AstraZenecas arrangement with IDT is similar to other deals the company has reached, for instance in Japan and Australia. Arrangements like this also help reduce the risk for companies.AstraZeneca declined to comment on the deals it has reached, but one of its executives has said in the past the company tried hard to create independent supply chains to enable full access to the vaccine around the world.MAKING MONEYBuilding up vaccine production capacity makes sense given the need to vaccinate the world, potentially repeatedly, against COVID-19, as well as the threat of future pandemics.But large manufacturing sites are the most efficient and at some point, extra capacity spread across many countries may not be economical.Prashant Yadav, a senior fellow at the U.S.-based Center for Global Development, said the advantages of scale kick in once you can produce at least 100 million doses per year.He believes four or five countries could likely scale up without raising costs, but if many build small operations, I think we get to a point where everybody will end up paying a higher price.In Canada, the federal government is building a publicly-owned facility in Montreal that would make about 2 million vaccine doses per month beginning next year, leaving it well below that 100 million annual dose threshold.Asked if the small size will raise costs, Canadas National Research Council said it is not meant to compete with the private sector: The objective of the facility is to respond quickly to future health emergencies."}