{"text": "Asian stocks were mostly lower on Tuesday, tracking Wall Street declines as political turmoil in Washington and rising coronavirus cases worldwide weighed on sentiment ahead of the start of the quarterly earnings season.Political uncertainty dominated trading as House Democrats introduced a resolution to impeach U.S. President Donald Trump, accusing him of inciting insurrection following a violent attack on the Capitol last week.  read more Several big tech giants, including Twitter Inc (TWTR.N), Amazon.com Inc  (AMZN.O), Alphabet Inc (GOOGL.O), Facebook Inc (FB.O) and Apple Inc (AAPL.O), have taken actions against Trump and his network of supporters, as concerns mounted over the risk of continued violence.Twitter's stock tumbled 6.4% on Monday after the micro-blogging site permanently suspended Trump's account last Friday.Investors also kept an eye on the continued spread of the coronavirus globally as cases surpassed 90 million on Monday, according to a Reuters tally.  read more \"The weakness was led by tech and I think the banning of Trump's account by Twitter and Amazon stepping up against Parler all brought a renewed focus on increased regulation and reining in on tech,\" said Thomas Hayes, chairman of Great Hill Capital in New York.Japan's Nikkei (.N225) slipped 0.48%, South Korea's KOSPI (.K11) fell 0.91% and Hong Kong's Hang Seng index futures (.HSI) lost 0.54%.Defying the broader selloff, Australia's S&P/ASX 200 (.AXJO) rose 0.24%.On Wall Street, the Dow Jones Industrial Average (.DJI) fell 0.29%, the S&P 500 (.SPX) lost 0.66% and the Nasdaq Composite (.IXIC) dropped 1.25%.Investors are expecting guidance on the extent to which executives see a rebound in 2021 earnings and the economy from  results and conference calls from JP Morgan, Citi (C.N) and Wells Fargo (WFC.N) Friday. Meanwhile, longer-term Treasury yields were at their highest since March before new long-dated supply coming this week and on speculation of more U.S. fiscal stimulus as Democrats will have control of Congress and the White House.  read more \"People are optimistic to see the yield curve steepening and it could help spreads and net interest margins for banks,\" Hayes said.Benchmark 10-year notes  last fell 11/32 in price to yield 1.1443%, from 1.107% late on Friday.The spread between the two-year and 10-year Treasury yields  brushed against 100 basis points to hit its steepest since July 2017. The climb in yields in turn offered some support to the dollar, which rose to its highest in over two weeks against a basket of currencies.The U.S. dollar index  rose 0.256%, with the euro  down 0.54% to $1.2152. The Japanese yen weakened 0.24% versus the greenback at 104.20 per dollar, while Sterling  was last trading at $1.3516, down 0.35% on the day.Crude oil prices fell, hit by renewed concerns about global fuel demand amid tough coronavirus lockdowns across the globe, as well as the stronger dollar. U.S. crude  recently fell 0.1% to $52.19 per barrel and Brent  was at $55.61, down 0.68% on the day.Safe-have spot gold  dropped 0.2% to $1,844.27 an ounce. Silver  fell 1.70% to $24.94."}