{"text": "NEW YORK Asian equities are set to fall sharply on Friday after Wall Street stocks and oil tumbled over growing concerns that a resurgence of coronavirus infections could stunt the pace of reopening economies.The three major U.S. stock indexes fell more than 5%, posting their worst day since mid-March, when markets were sent into freefall by the abrupt economic lockdowns put in place to contain the pandemic.All of a sudden the coronavirus, which has been an also-ran story for some days now, became more important as the virus began picking up in some states, and the market began thinking there may be delays to reopening, said Tim Ghriskey, chief investment strategist at Inverness Counsel in New York.Australian S&P/ASX 200 futures were down 3.04% at 20:59 GMT, while Japans Nikkei 225 index closed down 2.82% at 22,472.91 on Thursday. Hong Kongs Hang Seng index futures were down 2.06%.Cases of the disease have jumped in several U.S. states in recent days, raising concern among experts who say authorities have loosened restrictions put in place to contain the spread too early.Cases in New Mexico, Utah and Arizona rose by 40% for the week ended Sunday, a Reuters tally shows. Florida and Arkansas are other hot spots.The U.S. Federal Reserve released a gloomy economic outlook at the end of its two-day monetary policy meeting on Wednesday. Chair Jerome Powell warned of a long road to recovery.Economic data appeared to back up the Feds projections, with jobless claims still more than double their peak during the Great Recession and continuing claims at an astoundingly high 20.9 million.On Wall Street, the Dow Jones Industrial Average dropped 6.9%, the S&P 500 lost 5.89%, while the Nasdaq Composite shed 5.27%.Oil prices tumbled on renewed concerns about demand, as new cases of the coronavirus disease rise globally, and a large buildup of U.S. crude inventories. [O/R]Benchmark Brent crude futures settled 7.62% lower at $38.55 a barrel in U.S. trading hours, before sliding further in Asia on Friday. U.S. crude oil futures settled at $36.34 a barrel, down $3.26, or 8.23%.U.S. Treasury and euro zone government bonds rallied after the Fed on Wednesday signaled it plans years of extraordinary support to counter the economic fallout from the pandemic.Yields on 10-year Treasury notes dropped sharply from last weeks peak of 0.96%. [US/]The 10-year Treasury note fell 8.6 basis points to yield 0.6625%, while Germanys 10-year benchmark fell 10 basis points to a nine-day low of -0.43%.Gold futures settled more than 1% higher and the dollar, yen and Swiss franc all benefited from safe-haven flows.The yen rose to a one-month high against the dollar, while the Swiss franc climbed to a three-month peak. The dollar also rose 0.4% to 96.556 against a basket of currencies.The euro fell 0.63% to $1.1297, and the yen slid 0.22% to $106.8500.U.S. gold futures settled up 1.1% at $1,739.80 an ounce."}