{"text": "Asian shares faltered on Monday as investors wait to see if U.S. earnings can justify sky-high valuations, while bond markets could be tested by what should be very strong readings for U.S. inflation and retail sales this week.MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) was off 0.6% in slow trade. Tokyo's Nikkei (.N225) edged down 0.5%, while South Korean stocks (.KS11) were near flat.Chinese blue chips (.CSI300) eased 0.9% ahead of a rush of economic figures from the country.Investors were anxious to see how shares in Alibaba Group Holding Ltd  fared after China slapped a record 18 billion yuan ($2.75 billion) fine on the e-commerce giant.Reverberations could be felt beyond China as over a third of the stock is held by U.S. investors, and given the stock makes up more than 8% of the MSCI EM index.  read more Some felt the decision was already in the share price.\"Ever since the Ant IPO was cancelled and with the antitrust laws in the pipeline, the market has expected that Alibaba would pay a price,\" said Louis Tse, managing director at Wealthy Securities in Hong Kong.\"I think it's good for the share price now that the news has been delivered and it is cleared up at last.\"  read more Nasdaq futures  slipped 0.% on Monday, as did S&P 500 futures .  EUROSTOXX 50 futures  dithered either side of flat, while FTSE futures  were down 0.2%.Growth and tech stocks had seen something of a revival last week as U.S. 10-year Treasury yields retreated to 1.66% , from a 14-month top of 1.776%.Thomas Mathews, a markets economist at Capital Economics, doubted the rally in bonds would last, however.\"Given the pace of the economic recovery and the Feds apparent unwillingness to stand in the way of higher yields, we think long-term yields will rise again before long,\" he said.Over the weekend, Federal Reserve Chair Jerome Powell said the economy was about to start growing much more quickly, though the coronavirus remained a threat.Data out this week are expected to show U.S. inflation  jumped in March, while retail sales is seen surging perhaps even with a double-digit gain. Treasury is also set to test demand with offers of $100 billion in debt this week.\"Rapid economic growth, supported by reopening and accommodative fiscal policy, may disproportionately benefit the sectors of the stock market that are more sensitive to the health of the economy,\" said Mathews at Capital.\"And the composition of that growth is likely to be more skewed towards those sectors than it might have been during a typical economic expansion.\"It is also likely to show in profits. The banks kick off first-quarter earnings season this week with Goldman Sachs (GS.N), JPMorgan (JPM.N) and Wells Fargo (WFC.N) scheduled to report on Wednesday.Analysts expect profits for S&P 500 firms to show a 25% jump from a year earlier, according to Refinitiv IBES data. That would be the strongest performance for the quarter since 2018.The pullback in yields was enough to see the dollar come off the boil last week. It was last trading at 92.265  against a basket of currencies, down from a peak of 93.439.It was flat on the yen at 109.60 , and short of its March peak of 110.96. The euro was holding at $1.1892  and above its recent trough of $1.1702.Gold prices were idling at $1,739 an ounce , having failed to sustain a top of $1,758 last week.Oil prices fell around 2% last week as production increases and renewed COVID-19 lockdowns in some countries offset optimism about a recovery in fuel demand.Brent  was quoted up 28 cents on Monday at $63.24 a barrel, while U.S. crude  added 22 cents to $59.54."}