{"text": "Asian shares hovered just below a record high on Friday as mixed U.S. economic data caused some investors to show restraint after a global stock market rally pushed many bourses to dizzying heights.MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) fell 0.03%, trading just shy of an all-time high reached in the previous session. Australian stocks (.AXJO) lost 0.31%. Shares in Tokyo (.N225) fell 0.32%, pulling back from 30-year highs.Futures for the S&P 500  were off 0.12%.Markets in Greater China and most of Southeast Asia are closed on Friday for the Lunar New Year holiday. China's stock and bond markets, foreign exchange and commodity futures markets are closed through Feb. 17 for the holiday.Bitcoin  surged yet again to a new record high after BNY Mellon said it will offer custodian services for cryptocurrencies. The dollar  headed for a weekly loss, stung by bitcoin's assent and disappointing U.S. economic data. Trading in the United States and Europe on Thursday did not move prices enough to provide much direction, said Tom Piotrowski, a market analyst at CommSec in Sydney.\"We didn't get much of a lead-in from the northern hemisphere,\" Piotrowski said. \"Markets are in a bit of a holding pattern waiting for the next catalyst and it is just a question of whether that catalyst is going to be a positive one or a negative one.\"World stock markets were holding close to record highs on Thursday as investors weighed some tepid economic data against increasing vaccinations against COVID-19 and the prospect that more government spending and continued cheap money from central banks will drive higher growth and, eventually, inflation.The MSCI world equity index (.MIWD00000PUS), which tracks shares in 49 countries, fell 0.12% on Friday, also pulling back from a record high.On Wall Street, the Nasdaq (.IXIC) and S&P 500 (.SPX) eked out gains of 0.4% and 0.2%, respectively, while the Dow Jones Industrial Average (.DJI) slipped 0.02%.  read more Prices held near records as investors bet on more government spending, although enthusiasm was tempered when U.S. President Joe Biden said that China was poised to \"eat our lunch,\" raising fears of renewed strain on Sino-U.S. ties.  read more U.S. weekly unemployment claims fell less than expected and core consumer prices rose at a slower pace, which caused some traders to temper the optimism about the economic outlook.  read more    Cryptocurrency bitcoin BTC=BTSP reached a record high of $49,000 before paring gains to trade up 0.57% at $48,282. BNY Mellon (BK.N) said it will form a new unit to help clients hold, transfer and issue digital assets.That came just days after Elon Musk's Tesla (TSLA.O) revealed it had bought $1.5 billion worth of the cryptocurrency and would soon accept it as a form of payment for its cars.  read more Spot gold  fell 0.22% to $1,821.86 per ounce. U.S. gold futures  fell 0.19% to $1,823.30. Gold prices are still on track for their best week in three amid broad dollar selling. The dollar index  drifted 0.02% lower on Friday, on course for a 0.6% weekly decline. Soft demand at an auction of $27 billion of new 30-year Treasuries on Thursday continued to weigh on prices in Asia on Friday. The yield on 10-year U.S. Treasuries  rose to 1.1632%, while the 30-year yield  edged up to 1.9468%.Brent crude  fell 0.69% to $60.72 a barrel, having dropped half a percent the previous session. U.S. oil  fell 0.81% to $57.77 a barrel, after falling by 0.8% on Thursday.OPEC cut its demand forecast and the International Energy Agency said the market was still oversupplied, which cast a gloom over energy markets.  read more "}