{"text": "European shares reversed earlier losses to close higher on Friday, led by ASML and LOreal, although a dip in Volkswagen weighed on Germanys main index.The pan-European STOXX 600 index closed up 0.6% at a three-week high for a second straight week of gains.ASML Holding NV rose 3% after the Dutch equipment maker said the chip shortages slowing car production were a symptom of a broader increase in demand.The worlds biggest cosmetics group LOreal hit a three-month high after forecasting a strong rebound in makeup sales.Germanys DAX underperformed, ending flat as carmaker Volkswagen slipped 0.7% after the company said deliveries slid in January.Gains in Spains IBEX were capped after data showed consumer prices rising slightly below expectations in January.ING Groep NV jumped 6.7% after the largest Dutch bank reported better-than-expected quarterly pre-tax earnings of 1.05 billion euros ($1.27 billion).Analysts expect growth in corporate earnings this year, driven by stimulus-induced liquidity, but are wary of next year as the measures may start to fade.Market participants were hopeful that a proposed $1.9 trillion U.S. stimulus bill would be passed soon by lawmakers, with a stalling recovery in the U.S. labour market strengthening the case for it. [MKTS/GLOB]Were still not out of the woods...and the market is potentially overdue a reckoning, said Connor Campbell, analyst at spreadbetter Spreadex.Once the (U.S. stimulus) package has been implemented, it will be interesting to see how markets will behave, as they will no longer have this big thing to cling on to.The STOXX 600 is about 5% away from its peak of February 2020 after rallying 50% since a crash in March, aided by historic monetary and fiscal stimulus and the rollout of COVID-19 vaccines.We believe a hospitalization rate low enough to enable sustainable reopening and economic recovery can be achieved by April in the U.S. and by June in Europe, said Mark Haefele, chief investment officer at UBS Global Wealth Management.Britains coronavirus-ravaged economy shrank 9.9% in 2020, the biggest annual fall in output since modern records began, but it avoided heading back towards recession at the end of last year, data showed.Londons FTSE 100 index erased early losses to rise 0.9% with healthcare stocks in the lead."}