{"text": "Britain's AstraZeneca (AZN.L) has agreed to buy U.S. drugmaker Alexion Pharmaceuticals (ALXN.O) for $39 billion in its largest ever deal, diversifying away from its fast-growing cancer business in a bet on rare-disease and immunology drugs.The deal comes in a week that AstraZeneca said it was conducting further research to confirm whether its COVID-19 vaccine could be 90% effective, potentially slowing its rollout, and as a rival shot from Pfizer (PFE.N) was launched in Britain and approved for use in the United States.  read more The British company said on Saturday that Alexion shareholders would receive $60 in cash and about $115 worth of equity per share - either in AstraZeneca's UK-traded ordinary shares or in dollar-denominated American Depositary Shares. Based on a reference average ADR price of $54.14, that implies a total price of $175 per share. Alexion shares closed at around $121 apiece on Friday.\"It is a tremendous opportunity for us to accelerate our development in immunology, getting into a new segment of disease, a new segment of physicians, and patients we havent been able to cover so far,\" AstraZeneca Chief Executive Pascal Soriot told a media call. Alexion's best-selling drug is Soliris, used against a range of rare immune-disorders including paroxysmal nocturnal hemoglobinuria (PNH), which causes anaemia and blood clots, and whose revenue rose 3.6% in the first nine months to $3 billion. Astra hopes that an improved version of Soliris called Ultomiris has an even larger market potential. It expects more growth from introducing the target's rare-disease treatments to China and other emerging markets.The British firm said the boards of both companies had approved the deal which is expected to close in the third quarter of 2021.AstraZeneca was once seen as leading the race to develop a COVID-19 vaccine, but has fallen behind Pfizer and its partner BioNTech (22UAy.DE), as well as Moderna (MRNA.O), whose shots have shown greater efficacy in late-stage clinical trials. With a planned capital increase of about $25 billion after the deal closure, Soriot is looking to harness a strong advance by Astra stock, driven by the stellar growth of new cancer drugs.The shares have climbed about 70% through the past three years. A precursor cash call, on a much smaller scale, was a $3.5 billion issue last year to fund the purchase of rights to cancer drug Enhertu from Daiichi Sankyo (4568.T).RARE DISEASES    Despite generating billions in cash from treatments such as Soliris, one of the most expensive drugs in the world costing hundreds of thousands of dollars per patient, its shares have struggled in recent years as investors have worried about competition heating up. That has made it seen as a possible bid target. Hedge fund and activist investor Elliott Management has urged Alexion to seek a buyer and in May spoke out publicly. The fund, which had held private meetings with the company,  said CEO Ludwig Hantsons go-it-alone approach had failed to gain traction and opposed its plan to buy rivals to diversify its research pipeline. Elliott first invested in Alexion in 2017 when the share price was only slightly lower than Friday's close of $120.98. Elliott did not immediately respond to a request for comment.AstraZeneca said it expected the deal to immediately boost core earnings and to deliver pretax synergy gains of around $500 million per year. It also expects around $650 million in one-time cash costs during the three years following completion. Speaking on an analyst call, 61-year-old Soriot said the deal should put to rest speculation he was on his way out, as he was determined to stay on board to see the strategic benefits of the transaction delivered.Soriot also told reporters the deal was the result of exclusive talks and no competitive bidder was involved. AstraZeneca finance chief Marc Dunoyer said a capital increase for the equity component of the transaction would take place on closure of the deal. On AstraZeneca's COVID-19 vaccine, Soriot said it wasn't yet clear if the company would need results from a U.S. clinical trial before filing for approval with U.S. regulators. Assuming positive results from that trial, the company should be able to submit the vaccine to U.S. regulators within the next six weeks, he added.      "}