{"text": "BRUSSELS, March 12 AstraZeneca cut its supply forecast of COVID-19 vaccines to the European Union in the first quarter to about 30 million doses, a third of its contractual obligations and a 25% drop from pledges made last month, a document seen by Reuters shows.The shortfall will represent a further blow to the EUs vaccination plans, which have been hampered by repeated delays in vaccine supplies and by a slow rollout in some nations.The document, shared with EU officials and dated March 10, shows that the company now expects to deliver 30.1 million doses by the end of March, and another 20 million in April.On Feb. 25, AstraZeneca boss Pascal Soriot told the European Parliament that the company would try to deliver 40 million doses by the end of March..The document shows that on Feb. 24, the Anglo-Swedish company already estimated a supply of only 34 million doses to the EU for the January to March period, well below its contracted target of 90 million doses.A spokesman for AstraZeneca declined to comment on Friday.A person familiar with the situation said that the uplift the company had expected for the first quarter did not materialise because of the difficulties of moving vaccines around global supply chains.The United States, from where AstraZeneca expected to partly supply the EU market, told the EU that it would not export AstraZeneca shots in the near future, Reuters reported on Thursday, citing EU officials.The company had said its initial supply cuts were caused by production problems in the EU.I see efforts, but not best efforts. Thats not good enough yet for AstraZeneca to meet its Q1 obligations, EU industry commissioner Thierry Breton said on Twitter late on Thursday. Its time for AstraZenecas Board to exercise its fiduciary responsibility and now do what it takes to fulfil AZs commitments, Breton added.The AstraZeneca document also shows that the company expects to deliver about 20 million doses to the EU in April. It includes no forecasts for May and June.Under the contract, AstraZeneca committed to supplying the 27-nation bloc with 180 million doses in the April to June quarter, for a total of 300 million shots from December. (Reporting by Francesco Guarascio @fraguarascio, Editing by Rosalba OBrien)"}