{"text": "For many investors, the appointment of former army general Joaquim Silva e Luna as the new chief executive of Brazils state-run oil company Petrobras was unexpected - and unwelcome.President Jair Bolsonaro announced the 71-year-old Luna would take the helm of Petroleo Brasileiro SA (PETR4.SA), as the firm is formally known, in a Facebook post in February.Luna - set to be elected at a Monday shareholder meeting to the Petrobras board of directors, and then as CEO - has no experience in the oil sector.His last posting, as head of the Itaipu hydroelectric dam on the Paraguay border, is a far cry from running one of the southern hemisphere's largest companies.Petrobras shares fell sharply when Lunas predecessor, Roberto Castello Branco, was forced out after the group hiked domestic fuel prices several times in February, angering Bolsonaro. They have since recovered from their lows but remain down some 17% so far this year, with the dismissal sparking widespread fears of increased government interference in the company.Yet Luna and those around him insist market jitters are overblown. Luna has pledged to keep politicians from filling key Petrobras positions with underqualified allies, a serious problem under previous administrations.\"Political appointments aren't part of my management plans,\" said Luna. \"I've already dealt with political requests, I didn't accept and it wasn't easy.\"A native of Brazil's northeastern Pernambuco state and a career soldier, Luna served as Brazil's defense minister in 2018. He is the first military man to run Petrobras since the 1980s.Since Bolsonaro announced his appointment, Luna has talked informally with Castello Branco and other experts in the Brazilian oil and gas sector, he told Reuters in recent weeks.His friends say he has a history of aggressive cost-cutting, not unlike his predecessor, who won market plaudits for selling off billions of dollars in non-core assets in a bid to reduce the oil company's hefty debt load.Luna is known for his \"Spartan\" ways, said Jos Carlos Aleluia, a board member at Itaipu. He eschews elaborate business dinners, wakes up early and is one of the first people into the office, according to Aleluia.\"If he has a social life, he doesn't mix it with work,\" Aleluia said.DISDAIN FOR EXCESSLuna's ascetic attitude is also reflected in a disdain for excess and redundancy, said Carlos Marun, a Brazilian congressman who sits on Itaipu's board.Among his initiatives at Itaipu, Luna closed the dam's offices in the city of Curitiba and radically downsized its footprint in the federal capital Brasilia.\"He once told me, 'If I buy a pair of pants, I throw another one out. If I buy shoes, I throw a pair out',\" Marun said.Among the most eagerly awaited decisions will be how he handles domestic fuel pricing, the issue that led to Castello Brancos ousting. From 2011 to 2014, Petrobras lost about $40 billion selling fuel beneath international parity at the governments behest. In interviews, Luna said the companys new pricing policy has not been finalized, but will be determined by the government. He said it would be crucial for officials - rather than the company - to pick up the tab for below-market fuel prices. Still, he said, Petrobras had to think about society as a whole, rather than just shareholders, when setting prices.\"One has to look for an equilibrium,\" he said.Luna and those around him say he puts a high value on technical expertise and often changes his mind when presented with compelling evidence.Within the company, one of his first challenges will be overcoming widespread skepticism about his lack of industry experience, as well as rapid turnover of senior management.Several executives and board members have quit in recent weeks or have said publicly they plan to follow Castello Branco out the door. "}