{"text": "DUBAI At least 400,000 Yemeni children under 5 could die of starvation this year without urgent intervention amid soaring rates of severe malnutrition driven by war and the coronavirus pandemic, four U.N. agencies said on Friday.The warnings come nearly six years after the outbreak of war that rendered 80% of the population reliant on humanitarian aid.In a report published on Friday, the agencies projected a 22% increase in severe acute malnutrition among children under 5 in Yemen, compared to 2020.Severe acute malnutrition means there is a risk of death from lack of food. Aden, Hodeidah, Taiz and Sanaa are among the worst-hit areas, the report said.These numbers are yet another cry for help from Yemen where each malnourished child also means a family struggling to survive, World Food Program (WFP) Executive Director David Beasley said in a joint statement with the Food and Agriculture Organisation(FAO), UNICEF and the World Health Organisation (WHO).Another 2.3 million under 5s are expected to suffer acute malnutrition in 2021. Acute malnutrition among young children and mothers in Yemen has increased with each year of the conflict, they said, driven by the high rates of disease and rising rates of food insecurity.Around 1.2 million pregnant or breastfeeding women are projected to be acutely malnourished this year.Famine has never been officially declared in Yemen. The U.N. says the country is the worlds largest humanitarian crisis.Along with conflict, economic decline and the pandemic, a shortfall of donations last year is also contributing to the worsening humanitarian crisis.Nutrition and other services that keep millions from starvation and disease are gradually closing across Yemen amid the acute funding shortage.The agencies said they had only received $1.9 billion of the $3.4 billion required for the countrys humanitarian response. Programmes have started to close and scale down.A Saudi-led coalition intervened in Yemen in March 2015 to restore the Yemeni government ousted from power in the capital Sanaa by the Houthi movement in late 2014. The Houthis say they are fighting corruption."}