{"text": "It would be better to compete in an empty stadium at the Tokyo Olympics than one where spectators would be forced to sit in silence, American 200 meters world champion Noah Lyles said on Friday.Lyles, who will compete indoors for the first time in three years on Saturday running the 60m and 200m at the New Balance Grand Prix in Staten Island, said he will be at the delayed Games in Tokyo this year.However, if the COVID-19 guidelines laid out by officials remain in place then the 23-year-old believes fans should stay home.No chanting, no cheering - that kind of sucks, said Lyles, when learning of the protocols during a video conference ahead of Saturdays meet. It would kind of be better if there werent fans if that is what they are going to continue with.That way you could just stay home, they would be able to chant there and they could probably send videos through social media and things like that and be a lot more engaged then having silent audiences.Ive competed in a stadium where the audience was silent and it was extremely weird, I think I would rather have nobody there.Tokyo Olympic officials earlier this month unveiled the first of many COVID-19 rules for the Games this summer, including the banning of singing and chanting during events and mandating participants to wear masks at all times except when eating, sleeping or outdoors.The Tokyo Olympics were delayed by a year due to the novel coronavirus pandemic in 2020 and are scheduled to begin in July.Rated a gold medal prospect in the 100m, 200m and 4x100m relays, Lyles plans to be in Tokyo unless ridiculous regulations are implemented.I definitely plan to go no matter what as long as they are not ridiculous, he said. If it is definitely within reason like if I am advised to get the vaccine, yes I can get vaccine, if you travel a certain way, I will definitely travel a certain way, if I need to quarantine for two weeks Ill do that.If we are only allowed the company of our team, I will do that.Like every other athlete Lyles has seen his Olympic buildup disrupted by the pandemic.In a normal year Lyles would compete in 10 or 11 meets but estimated that due to the virus he had only run in five. He now plans to spend as much time as possible close to home and his training base in Clermont, Florida during the months leading up to the Games to limit risk of exposure.We wanted to do more races this year but again what is the risk, said Lyles. If someone comes in contact, how long will we be out of track meets? It throws everything off.Probably our thought process for the rest of the year is as much as we can stay in the U.S. and as much as we stay close to home is preferably how we like it.(This story refiles to amend says in headline. No change to text.)"}