{"text": "MUMBAI Losing the best three players of all time would be a massive blow to any sport but ATP chief Andrea Gaudenzi says tennis is strong enough to thrive after Roger Federer, Rafa Nadal and Novak Djokovic hang up their rackets.Federer returned to the court this week after 14 months on the sidelines, and Nadal and Djokovic are going nowhere soon, but they are all well past the age of 30 and the ATP will eventually have to put on tournaments without them.I am not worried at all for our sport, if we do the right thing, Gaudenzi told Reuters this week.And that doesnt mean taking anything away from those three guys. They are probably the best players our sport has ever had and maybe will be for a very, very long time.Federer, who turns 40 in August, and 34-year-old Nadal are tied for the mens record of 20 Grand Slam singles titles, with 33-year-old Djokovic in hot pursuit on 18.American Pete Sampras, who retired in 2002, is next on the list with 14 majors -- a mark many thought would never be bettered.Its going to be very, very difficult to achieve that type of records, even though I said the same thing when Pete Sampras retired, Gaudenzi said, before adding with a laugh: I thought there wont be anyone ever beating Petes records.Here we have three guys doing that. So never say never.The so-called Big Three continue to lure fans to the stands even after two decades on the tour, while their commercial pull still mesmerizes brands and advertisers.Only 11 of the last 68 Grand Slams have been won by other players but Gaudenzi is convinced more champions and fan favourites will emerge, if not necessarily immediately.We have to be realistic, even if you look back you know you build these personalities over the years, he said.We were concerned after Sampras retired. And its not that when Roger started winning right away we said, Oh! This is the guy whos going to save us. He grew into that.We will be capable of building new personalities, new champions that will attract the attention of fans.Gaudenzi is confident tennis is well-placed to compete in rapidly-changing global entertainment market, even if he thinks more work needs to be done on how the product is offered to the public.The reason Im extremely optimistic is because tennis fits perfectly into the distribution of content nowadays, in terms of volumes, different time zones, the Italian said.Its global, gender neutral, we are the best sport in terms of equality for women, and its just super entertaining.You could argue, yes its too long. But we can actually format it with short-form and long-form highlights.Its the way we distribute it, its the way we package it, its the way we sell it, its the way we govern it, thats mostly where I see opportunity. Thats what we need to change."}