{"text": "* Offering $30 one-way fares on most flights* Virgin Australia has matched the cut-price fares* Melbourne-Adelaide, Melbourne-Gold Coast routes strongerSYDNEY, May 12 Australian airline Regional Express Holdings Ltd (Rex) is not doing as well as it would like on the highly competitive Sydney-Melbourne route, where it is offering A$39 ($30.38) fares on most flights, its deputy chairman said on Wednesday.The once regional airline in March expanded into big-city routes to compete against Qantas Airways Ltd and Virgin Australia taking advantage of cut-priced aircraft leases, starting with one of the worlds busiest domestic routes from Sydney to Melbourne.The only route we want to do better on is Sydney-Melbourne, Rex Deputy Chairman John Sharp said at a CAPA Centre for Aviation event.He did not deny claims by Qantas that Rex was flying as few as 20 passengers per flight, but he said those tended to be mid-week flights in the middle of the day.It is not unique, but it is not where we want it, Sharp said of the vacant seats. If you went any lower (priced) youd have to pay people to get on the plane.Rex last week began selling A$39 one-way fares. As of Wednesday morning, all four available Sydney-Melbourne flights for the same day had A$39 seats on offer, its website showed, a sign it had many last-minute seats to fill.Virgin Australia matched with fares of its own from A$39 but as of Wednesday morning, only three of 12 flights had that fare available for later in the day, with the others priced at a minimum of A$99 to A$299, its website showed.Sharp said Rexs performance on other new routes such as Melbourne-Adelaide and Melbourne-Gold Coast was stronger, followed by Sydney-Gold Coast.Rex said on Monday it hoped to boost its jet fleet from six Boeing Co 737-800s to 10 by the end of the year. The airline forecast it would report break-even financial results for the 12 months ending June 30. ($1 = 1.2839 Australian dollars) (Reporting by Jamie Freed. Editing by Gerry Doyle)"}