{"text": "SYDNEY, Feb 12 The Australian and New Zealand dollars slipped on Friday as risk sentiment took a knock after alarmingly high U.S. jobless claims and Victoria states entry into a five-day snap lockdown after a fresh coronavirus outbreak in Melbourne linked to the UK strain.Both currencies were still on track for small weekly gains led by a recent run of upbeat domestic data.The Australian dollar was off 0.2% at $0.7739 as the lockdown, starting at midnight on Friday, in the countrys second-most populous state cast a shadow over broader economic recovery hopes.For the week, it is so far up 0.6%.The New Zealand dollar was also slightly weaker at $0.7213 but was on track for a small weekly gain.In Australia, measures of consumer and corporate sentiment, card spending, credit growth and home building have surpassed expectations in recent months underpinning the Aussie dollar.However, a short, sharp circuit breaker banning public gatherings, home auctions, weddings and religious gatherings in Victoria, of which Melbourne is the capital city, hung heavy on the outlook.Also worrying investors, U.S. data out overnight showed weekly jobless claims were still alarmingly high.Meanwhile on the virus front, we see declining infection trends in most countries...and hospitalization rates too, said Ray Attrill, head of forex strategy at National Australia Bank.Vaccination roll-outs are proceeding apace. All encouraging, but not sufficient to allow markets to price in much full economic re-openings in H2 2021 than they already are.Three-year yields are pinned at 0.12% thanks to the Reserve Bank of Australias (RBA) yield curve control policy. Ten-year yields stood at 1.214%, keeping the yield curve step at 109 basis points.In New Zealand markets, a run of strong economic data and a housing boom have seen a move to price in rate hikes from the Reserve Bank of New Zealand (RBNZ) as early as 2022.The RBNZs own survey of inflation expectations revealed a marked pick-up in the one-year outlook to 1.73%, while the two-year forecast climbed to 1.89% and near the middle of the central banks 1-3% target band.All of which lifted yields on 10-year bonds this week to their highest since last March at 1.45%, a rise of 40 basis points in just nine sessions. Yields have since come off to be last at 1.338%. (Editing by Simon Cameron-Moore)"}