{"text": "* Mining, travel stocks weigh on ASX200* Healthcare stocks outperform benchmark* NZX 50 index falls for 2nd day, down 0.4%April 12 Australian shares closed lower on Monday, weighed down by travel and mining stocks, after the federal government abandoned its COVID-19 vaccination targets following a shift in stance over AstraZenecas shot last week.The S&P/ASX 200 index slipped 0.3% to 6,974, closing lower for the second straight session. Last week, it had posted its best weekly performance in nine.Over the weekend, Australia dropped its goal to inoculate nearly all of its population by the end of 2021 following advice that people under the age of 50 take Pfizers COVID-19 vaccine over AstraZenecas shot.The market is mainly down on (the) vaccination target cancellation debacle and the pop in bond yields, said Mathan Somasundaram, Chief Executive Officer at Deep Data Analytics.Trading turnover has been relatively low for last three weeks and this week also started with low turnover, Somasundaram said, adding that: Any market volatility will be exaggerated in low turnover.Travel-related stocks were hit by setbacks in vaccination efforts. Ticket booking and tour operating firm Webjet and carrier Qantas Airways slipped more than 2% each.Miners tumbled 1.3% to mark their second straight session of falls on subdued iron ore prices.The countrys mining triumvirate - BHP Group, Rio Tinto and Fortescue - fell between 0.9% and 2.2%.Gold stocks dropped 2.6%, snapping a five-session winning run, as bullion prices sagged after data showing robust readings for U.S. inflation and a faster economic rebound bolstered Treasury yields.Newcrest, the countrys biggest gold miner, skidded 2.6% and Northern Star Resources fell 2.8%.Healthcare stocks outperformed the benchmark to close 0.7% higher. CSL rose 0.9%, while ResMed gained 1.8%.New Zealands benchmark S&P/NZX 50 index fell 0.4% to close at 12,518.7, marking its second straight session of drop. (Reporting by Riya Sharma in Bengaluru; Editing by Subhranshu Sahu)"}