{"text": "SYDNEY, May 12 The Australian and New Zealand dollars pared recent gains on Wednesday as a sell-off in global shares dragged on risk currencies, while Aussie bonds underperformed as government borrowing plans disappointed bulls.The Aussie faded to $0.7817 and away from a 10-week top of $0.7891 hit early in the week. A sustained break of chart support around $0.7820 could see a test of $0.7790, and risk a relapse toward $0.7700.The kiwi dollar eased to $0.7248, having also failed to sustain a 10-week high at $0.7304. The loss of $0.7240/50 could see it back to $0.7210.The Aussie was undermined in part by news Chinas Dalian Commodity Exchange was proposing to reduce the standard iron content requirement in its flagship futures, seeking to broaden supply sources and stem a record-setting rally.Australia is a major producer of high quality iron ore, which is also the countrys biggest export earner, so such a shift could temper prices and export receipts.The strength of iron ore prices has been a windfall for miners profits and taxes, helping the Australian government deliver a lower budget deficit than first feared.Yet the 2021/22 budget released on Tuesday also included more spending than expected, which should support economic growth but also lifted its borrowing needs.As a result, the government announced it would issue a total of A$210 billion ($164.35 billion) of bonds in the current year to end June, and A$80 billion in 2021/22.That was above what most analysts had hoped for and triggered some selling of bonds, which pushed 10-year yields up to 1.728% from a low of 1.598% at the start of the week. The spread over U.S. Treasuries also widened by about 3 basis points to 10 basis points.George Tharenou, an economist at UBS, estimated the budget contained A$96 billion in extra stimulus over five years, leading to upward pressure on wages and inflation.That also increased the chance the Reserve Bank of Australia (RBA) would decide to limit its bond buying plans.We still expect the RBA to hold the cash rate until end-22, but we now see the risk of an earlier rate hike than the RBAs forward guidance, he added."}