{"text": "* Tech stocks up 2% despite overnight sell-off in U.S. peers* Travel stocks fall as border reopening pushed to mid-2022* ANZ, NAB and Westpac down between 0.6% and 1.2% (Updates to close)May 12 Australian shares fell on Wednesday, dragged down by financials and miners, as global investors fretted over whether a potential spike in U.S. inflation could force the Federal Reserve to raise rates earlier than planned.The S&P/ASX 200 index dropped 0.7% to 7,044.9, settling lower for the second straight session.Investors remained on edge ahead of U.S. inflation data due later in the day, as rising commodity prices boosted inflation expectations and lifted U.S. Treasury yields while hurting growth stocks, leading to a drop in global equities.Australias finance stocks ended lower despite a 0.7% gain in Commonwealth Bank, while energy stocks were the biggest percentage losers, closing 0.7% lower.Top miners BHP Group and Rio Tinto lost 0.8% and 0.4%, respectively. Chinas Dalian Commodity Exchange proposed certain changes in its flagship futures that could result in tempering of prices, a potential blow to Australian miners which are a major producer of high quality iron ore.Travel and tourism stocks fell after the government said international travel was not expected to resume before mid-2022. Flag carrier Qantas lost 3.9%.Tech stocks rebounded despite a slump in their U.S. peers overnight. Afterpay jumped as much as 6%, recovering from a more than 8.5% drop in the previous session.The last two-three years, buying the dip in growth/tech stocks has been a winning strategy and such that we are getting investors trying to pick the bottom, said Mathan Somasundaram, founder of Deep Data Analytics.If the U.S. Fed steps into buy bonds and keep real yields negative tonight, then you might see a short-covering rally in tech. If not, tech will continue to slide.Australias federal budget announced late on Tuesday promised billions of dollars of new spending, and was largely in line with expectations.New Zealands benchmark S&P/NZX 50 index slipped 0.6% to close at 12,564.2. (Reporting by Savyata Mishra in Bengaluru; Editing by Subhranshu Sahu)"}