{"text": "* Technology stocks rebound, Afterpay rises 2.2%* Iron ore prices recover; BHP, Rio and Fortescue gain* Energy companies gain as Brent hovers near $70/barrel* NZ50 up 1.3%; restrictions lifted in Auckland (Updates to close)March 12 Australian shares closed higher on Friday on hopes for a swifter global economic rebound after U.S. President Joe Biden signed into law a massive $1.9 trillion stimulus package, while upbeat U.S. jobs data also painted a picture of recovery.The S&P/ASX 200 index rose 0.8% to 6,766.80 by the close of trade, clocking a gain of the same margin for the week.Biden on Thursday signed into law one of the biggest relief packages in the U.S. history, aimed at spurring economic growth, while data showed fewer-than-expected Americans filed new claims for unemployment benefits last week.The Biden stimulus will be positive for American and Asian markets in the short-term, Jeffrey Halley, a senior market analyst at OANDA, said in a note.Its effects, and those of the general recovery, will start to accelerate in the March data everywhere. The inflation we will see is recovery inflation, not stagnation inflation.Technology stocks, which had come under pressure this week, bounced 2.3%. Buy-now-pay-later giant Afterpay added 2.2%, while other software firms such as Altium , Appen and Xero added more than 2% each.Recovering iron ore prices lifted miners of the commodity, after a steep drop earlier this week. Fortescue Metals Group added 2.3%, BHP Group rose 2.5% and Rio Tinto ended 0.8% higher.Brent crude prices hovered near $70 a barrel amid production cuts, leading to a 1.5% rise in the energy sub-index. Woodside Petroleum added 1.4%, while Santos Ltd gained 0.7%.New Zealands benchmark S&P/NZX 50 index rose 1.3% to finish the session at 12,426.77.All remaining restrictions in New Zealands largest city Auckland have been lifted after no locally transmitted cases of coronavirus were reported for two weeks.Shares of Skycity Entertainment Group climbed to a near three-month high after the entertainment company said its Auckland property would now start operating without restrictions. (Reporting by Rashmi Ashok in Bengaluru; Editing by Subhranshu Sahu)"}