{"text": "MELBOURNE Australia recorded a handful of new locally acquired coronavirus cases on Tuesday, with frictions increasing between state leaders over the best approach to manage and contain the outbreaks.The northern state of Queensland recorded one new case, in the quarantined partner of a cleaner who was found to have the highly infectious UK strain last week, which triggered a three-day lockdown over the weekend to Monday.The countrys most populous state of New South Wales logged five new locally acquired infections, including two mystery cases that caused the emergency department at Sydneys Mount Druitt hospital to close for deep cleaning on Monday.Including cases from returning travellers in hotel quarantine, Queensland registered three new cases and New South Wales logged 16 new cases. Victoria recorded no community infections for a sixth consecutive day.Thanks to border closures and widespread compliance with social distancing rules, along with aggressive testing and tracing programmes, Australia has been more successful than most advanced economies in managing the pandemic, with total infections in the country of 25 million people at around 28,633, including 909 deaths.New South Wales and its capital Sydney have been battling to contain an outbreak since before Christmas, with low but consistent numbers of community transmission sparking concerns infections could spread to other states.It has stopped short of going into full lockdown, rather relying on partial lockdown and contact tracing measures.Premier Mark McGowan of Western Australia said on Tuesday that Australia could rest a lot easier if COVID-19 was eliminated in NSW. Western Australia has not seen any locally acquired infections in nine months.That is in contrast to the national suppression policy that others contend is the most appropriate option if Australia continues to accept returning travellers from overseas.Weve had COVID deaths in this nation but we are going to have more deaths from mental health, from people being locked away in isolation, NSW Deputy Premier John Barilaro told media on Tuesday. Stop lecturing us, look after your own backyard.Australia has halved the number of returning nationals allowed in as authorities come to terms with the implications of highly contagious British and South African variants of the virus."}