{"text": "BEIRUT, Stepping into the delivery room where his wife Emmanuelle was about to give birth, Edmond Khnaisser meant to capture their sons first moments on camera.Instead, he recorded the instant the biggest blast in Lebanons history sent whole windows crashing onto his 28 year-old wifes hospital bed.I saw death with my own eyes...I started feeling is it over? I was looking around and at the ceiling, just waiting for it to fall on us, Emmanuelle said, recollecting the direct aftermath of the massive blast that injured 6000 and killed more than 170 people in Beirut on Aug. 4.Brushing off blood and shattered glass, medical staff instinctively carried Emmanuelle into the corridor, fearing another explosion could follow.About to faint and shaken to the core, Emmanuelle said she knew she had to focus on giving birth.He has to come to life and I have to be very strong, she told herself.Right after the blast, Stephanie Yacoub, chief resident of obstetrics and gynecology at St. George Hospital University Medical Center, had run out the room to help an injured nurse.But it was too late and the nurse died. Yacoub hurried back to Emmanuelle straight away to help her give birth, along with Professor Elie Anastasiades and a team of medics.There was no electricity and the sun was starting to set, so we knew we had to get this done as soon as possible. And with the use of peoples phone lights, he came into the world, she told Reuters a week after the blast.Seventeen people died in St. George hospital right after the blast and dozens were injured, including Edmond Khnaissers mother, who suffered six broken ribs and a punctured lung.Running back and forth between his wife and his mother, Khnaisser said he had one objective in mind, to get his new son George to safety.As they got into strangers cars and out of the blasts perimeter, the extent of the destruction started to sink in.They eventually made it to a hospital right outside of the capital where George was finally bathed and cleaned.George is very special. He is the light in the darkness, a birth in wreckage, Edmond said, showing pictures of his son on the Instagram page he created for the boy they now call miracle baby George."}