{"text": "SANFORD, Fla. President Donald Trump returned to the campaign trail on Monday for the first time since he announced his COVID-19 diagnosis, touting his management of the pandemic as opinion polls showed him losing more ground to Democratic rival Joe Biden.Trump arrived at the outdoor rally in Sanford, Florida, the first of six planned for this week, without a protective mask. He tossed out masks to thousands of supporters standing shoulder to shoulder, most without protective face coverings, and repeatedly talked about his recovery from the coronavirus.I went through it now. They say Im immune. I feel so powerful, Trump told the crowd during his hour-long remarks. I will kiss everyone in that audience, I will kiss the guys and the beautiful women, I will give you a big fat kiss.Trumps return to his signature campaign rallies kicked off a three-week sprint to the Nov. 3 election. The Republican president, 74, is seeking to change the dynamics of a race that national opinion polls and some key state polls show he is losing to Biden, who is 77.The airport rally in Sanford indicated that Trump had not reshaped his campaign approach or outlook since contracting the coronavirus, which has infected more than 7.8 million people in the United States, killed more than 214,000 and put millions out of work.He told supporters that coronavirus safety lockdowns had done great damage to the economy and were too drastic.Its risky, but you gotta get out, he told supporters, who chanted: We love you.Critics have faulted Trump for failing to encourage supporters at campaign events, and White House staff, to wear protective masks and abide by social-distancing guidelines. At least 11 close Trump aides have tested positive for the virus.As Trump was holding his rally, top U.S. infectious disease expert Anthony Fauci told CNBC the United States faced a whole lot of trouble if it did not encourage universal wearing of face masks and avoid mass gatherings.Trumps rally came hours after the White House said he had tested negative for COVID-19 on consecutive days and was not infectious to others. They were the presidents first negative COVID-19 tests announced by the White House since Trump said on Oct. 2 that he contracted the virus.In a memo, Dr. Sean Conley did not say when the tests were conducted but that they and other clinical and laboratory data indicate a lack of detectable viral replication.RECKLESS PERSONAL CONDUCTTrump has worked furiously for months to shift public attention away from the virus and his handling of the pandemic.But his own illness has put the spotlight squarely on his coronavirus response during the closing stretch of the race, with Biden scaling up his attacks and reaching into states that normally lean Republican.On Monday, Biden made two campaign appearances in Ohio, where he was once considered a long shot but polls now show a tight race. Speaking in Cincinnati, he criticized Trump for playing down the coronavirus threat and mocked the presidents statements that he did not want to panic Americans.Trump is the one who panicked. His reckless personal conduct since his diagnosis, as well, has been unconscionable. And the longer Donald Trump is president, the more reckless he gets, Biden said.Biden tested negative for COVID-19 on Monday, his campaign said in a statement, the latest in a series of negative results the former vice president has released since Trump announced his positive test.It was Bidens second campaign trip in as many weeks to Ohio. Trump won the state by 8 percentage points four years ago and almost certainly must carry it again to win re-election. No Republican has won the White House without Ohio.Biden has pulled further ahead in Wisconsin and Pennsylvania, building momentum in two states that Trump carried in the 2016 presidential election, Reuters/Ipsos opinion polls showed on Monday.The polls, conducted Tuesday through Sunday, showed Biden now leading Trump by 7 percentage points in both states.Most recent polls in Florida, where a Trump loss would dramatically narrow his path to re-election, showed Biden with a small lead and ahead with key demographic groups in the state, particularly seniors. Trump won Florida in 2016 by just 1.2 percentage points.Trump plans rallies in Pennsylvania, Iowa, North Carolina, Georgia and Florida later this week as he barnstorms through crucial battleground states ahead of the election."}