{"text": "WASHINGTON When the pandemic blew a hole in the U.S. labor market last spring, the hope was for a quick return to normal.Its clear that hasnt happened, and with the critical holiday shopping season approaching workers face a new drag on their prospects. Companies appear to be bringing on fewer seasonal workers.Hiring is shaping up differently from previous years, said AnnElizabeth Konkel, an economist with the Indeed Hiring Lab, a research group at the job posting site Indeed. Seasonal postings are about 11% below last year, and Konkel said the reasons vary from concerns about future sales, reduced capacity since some stores are closed, and even disruptions in the supply chains that bring goods to market.Along with job posting sites like Indeed, companies like UKG that manage employee work time are seeing the same thing. The firm noted that among its clients, companies in manufacturing continue to add shifts, while the number of shifts at retailers is flat even as Halloween decorations and Christmas trees pop up in stores.Graphic: A Holiday hiring slump?:https://graphics.reuters.com/GREAT-REBOOT/DATA/gjnpwjqxwvw/chart.pngIts tempting to chalk it up to expectations of weak sales as the pandemic continues. But people have found plenty of ways to spend money even under lockdown. Deloitte in fact estimates holiday sales will be 1% above last years level.Rather, something different may be at work.Ecommerce was already expanding its share of all retail sales. The pandemic caused it to explode.Graphic: Coronavirus moved shopping online:https://graphics.reuters.com/GREAT-REBOOT/DATA/rlgpdjrnapo/chart.pngHiring reflects that.Not only are there fewer seasonal jobs than last year, the mix is different: The share of seasonal postings on Indeed that involve loading & stocking has tripled to 14%, while the share of sales jobs fell from 18% to 10%.Graphic: Share of seasonal job postings by occupation:https://graphics.reuters.com/GREAT-REBOOT/DATA/qzjvqnxwlpx/chart.pngBut theres another change involved as well, and it is one that underscores the challenges facing a full U.S. economic recovery.The number of people searching for seasonal work has also fallen, down 38% from last year.Graphic: Demand for seasonal jobs are lagging also:https://graphics.reuters.com/GREAT-REBOOT/DATA/jbyvrmzqmpe/chart.pngAs Konkel says that seems counterintuitive at a time of such high unemployment.But it shows adaptation in progress. Searches for jobs that can be done from home continue to grow fast.Most seasonal job opportunities require at least some face-to-face interaction and health concerns are still top of mind for many of those looking for work, Konkel wrote recently.Many labor economists have predicted such changes in behavior as people start to perceive in person employment as risky, or else need to accommodate new family obligations when, for example, schools are closed.The open question is whether that mismatch - between open jobs in warehouses and storerooms and job seekers who want to work from home - remains permanent, with implications for economic growth as jobs take longer to fill, or are part of the coronaviruss own passing seasonal influence."}