{"text": "NEW YORK(Thomson Reuters Regulatory Intelligence) - *To read more by the Thomson Reuters Regulatory Intelligence team click here: bit.ly/TR-RegIntelThe U.S. Consumer Financial Protection Bureau, recharged under a new administration, has more on its agenda than its prominent attention to pandemic abuses and racial inequality in consumer finance. Less noticed in the changeover is the stepped-up focus on fintech practices that could have far-reaching impacts on financial services firms.The agency, held in check during former President Donald Trumps administration, has been staffing up its enforcement unit to take on what it termed a tidal wave of distressed homeowners. It has issued a series of alerts and reports documenting a surge in consumer-finance abuses in areas such as lending, debt collection, student loan practices and the disbursement of relief funds.CFPB acting director Dave Uejio said in a staff memo that the agencys two priorities are consumers facing hardship due to COVID-19 and the related economic crisis, and racial equity.No one should be surprised by what is coming, he said in the memo, which was recently made public.The agency will be resuming the role it had prior to the Trump administration as a major new force in retail banking regulation. The pending arrival of Rohit Chopra, a former assistant director of CFPB and member of the Federal Trade Commission who is now awaiting Senate confirmation as CFPB director, is seen as transforming the agency to reflect the rapidly rising role of financial technology. Advanced technology is transforming banking in both operations and consumer facing services. It is transforming business models and oversight in a wide range of functions from credit scoring, online and mobile payments, online personal lending, mortgage servicing, credit card issuance and a host of services that generate data on users.NEW ADMINISTRATION, NEW CFPBSources close to the agency say Chopra, when he receives expected Senate confirmation, plans to expand both the types of enforcement actions the agency takes on and the digital investigative tools it uses. They said Chopra, whose private sector experience included working as a consultant for McKinsey & Co, has a strong interest in building the CFPB fintech capability as the industrys business models shift to more digital forms. He also is expected to exercise the CFPBs statutory role of overseeing how banks and finance firms protect personal data, a role the agency has given little attention to in the past.The CFPB has no choice but to use the same types of technology that the banks are using and they will be using them in tracking the industry, said a compliance expert with a close working knowledge of the CFPB who asked not to be named. Under Chopra they will look very hard at fintech operations. The financial services sector has long relied on data and the bureaus interest in data is a response to that and people should be prepared for that.The most obvious use case for the CFPBs technology will be in mortgage and consumer lending practices, especially abuses in credit rating actions and access to banking services that took place during the pandemic. Economists have concluded that the minorities and women have been hit hardest by the pandemic and suffered most from lack of credit access. The CFPB over the past four years took no actions on discriminatory lending. The next four years could see a surge in such cases, as it applies technology-based analytical tools to detect violations in discriminatory lending that persists after years of government action to halt it.REVIVING DISPARATE IMPACT, UDAAP TOOL IN ENFORCEMENTSThe CFPB will revive the disparate impact doctrine as a means for curtailing business practices that result in racial disparities, whether intended or not, law firm Kirk & Spalding said in a recent client note. The agency will also reassert its authority over a broad range of consumer services under the Dodd-Frank act's unfair or deceptive or abusive practices (UDAAP) provision. The role was revived in March after a Trump administration regulatory action had revoked the CFPB's authority in the area[Link: here].The CFPBs use of data analytics, applied most commonly in the past for pinpointing discriminatory mortgage redlining, will likely be used more broadly in other areas such as consumer lending and access to services or product offerings. Chopra has advocated for regulators to look more closely at how finance and technology firms use data to their advantage. Chopra, in testimony to Congress in late July that marked one of his final public appearances as an FTC commissioner, said regulators looking at consumer apps need to dig in and understand how that targeting works, how those algorithms work.Fintech with manipulative code that hides incremental fees or allows unauthorized use of client data should be scrutinized more closely because it can amplify fraud, he said, adding, We cant just go after fraudsters one by one, we need to look at the gatekeepers and those who profit from amplifying them as well.His comments, while referring broadly to use of data misuse, can be applied to a wide range of fintech applications, he said. When he assumes his position as CFPB director, his experience on the FTC will be applied over the landscape of consumer financial services. Already, under acting director David Uejio the agency has provided a glimpse of the types of actions the agency might take increasingly going forward. In an action last month it settled for $11.5 million in charges with fintech GreenSky, LLC[Link: here] for a loan processing service that was enabling contractors and other merchants to take out loans on behalf of thousands of consumers who did not request or authorize them.FINTECH ACTION ECHOES WELLS FARGO CASEThe little-noticed GreenSky enforcement action, alleging unauthorized loan approvals, echoed the landmark CFPB case settled with Wells Fargo & Co in 2016 over unauthorized account openings. The CFPB said it fielded more than 6,000 complaints about GreenSky practices. The CFPB, which sources many of its actions from consumer complaints, will be sorting through the record number of complaints lodged last year during the pandemic[Link: go-ri.tr.com/T2cvme].The agency was flooded with 542,300 complaints last year  a nearly 54% increase over the approximately 352,400 complaints handled in 2019.There will be review of all pandemic lending from origination to servicing to collections and reporting requirements, Allyson Baker, chair of law firm Venable LLPs financial services practice and a former CFPB enforcement lawyer. They will move ahead on that pretty seamlessly.In a report on the complaints[Link: go-ri.tr.com/7CmrIB], the CFPB cited a number of top pandemic concerns, which acting director Uejio highlighted in a statement, including:-Mortgage servicers gave consumers incomplete and inaccurate information about forbearances under the COVID-relief CARES Act, failed to process forbearance requests, and collected and assessed late fees despite having approved forbearances.-Servicers withdrew money even though consumers loans were in deferment.-One student loan servicer denied thousands of forbearance extensions because the loan holder never responded.-Companies across markets misreported accounts to credit bureaus and violated CARES Act amendments that added protections to the Fair Credit Reporting Act.-Some banks set off stimulus payments and unemployment insurance benefits in order to cover bank fees and other debts.-Examiners found that the widely used policy of banks only taking Paycheck Protection Program applications from existing customers may have a disproportionate negative impact on minority-owned businesses.In addition to dealing with past complaints over pandemic services, banks will face emerging regulatory risks as the pandemic recedes. The consumer finance agency recently warned mortgage servicers to take all necessary steps now to prevent a wave of avoidable foreclosures this fall when pandemic protections end.The CFPB has taken on a broad range of concerns related to the pandemic. Baker said the agency has been recharged by its new leadership and the Supreme Courts rejection of a challenge to its constitutionality. Its ambitious agenda will require firms to spend more time preparing to undergo examinations and avert potential enforcement actions, by reviewing and documenting their efforts to serve customers during the pandemic.The staggered ending of relief programs has added to uncertainty. Some protections are ending, while others have been extended, most notably the student loan payment moratorium, which was extended to January 31 of next year.The bureau is looking closely at how consumers have been treated amid the confusion and uncertainty everyone faced, said Baker. There are direct concerns for anybody with consumer facing business, either in demand for services that arose during the pandemic or in existing credit and how it changed to reflect the COVID-19 mandates.(Richard Satran covers new and emerging regulation and enforcement topics for Regulatory Intelligence.)*To read more by the Thomson Reuters Regulatory Intelligence team click here: bit.ly/TR-RegIntel"}