{"text": "Investment banks are shifting more rainmakers out of London to financial centres across the European Union, accelerating the pace of moves after the pandemic and uncertainty over Britains access to the bloc slowed relocations.Morgan Stanley (MS.N), Barclays (BARC.L) and Goldman Sachs (GS.N) are among those moving senior bankers, according to sources at the lenders, as European regulators push banks to better staff their EU offices and travel restrictions ease. Local hiring has also increased.The lack of a breakthrough in talks for a meaningful deal between Brussels and London on financial services post-Brexit has added to the impetus. Client-facing bankers in London are required a \"chaperone\" based inside the bloc whenever they speak to clients, spurring some to relocate to avoid that complication when sealing deals.Lifestyle choices are also playing their part, with traders and other senior staff moving too. Working from home during the pandemic enabled some bankers to leave London for warmer continental climes, mirroring a shift by Wall Street executives to Miami during the height of the COVID outbreak in New York.Some European bankers are now looking at making the shift permanent.\"There is Brexit but not only, there is a post-Covid phenomenon too,\" said Emmanuel Goldstein, Morgan Stanley's France chief executive, explaining that some French bankers were returning home having spent their entire careers overseas.Morgan Stanley will add 50 staff to its 150-strong Paris office by end-2021 and plans to double in size by 2024 through a mix of relocations and local hiring as it expands its central Parisian hub, Goldstein said.Barclays' head of M&A for Europe and the Middle East, Pier Luigi Colizzi, has recently moved to Milan and will run the region's deals team from there, two sources familiar with the lender said, making him one of the few regional M&A heads based outside of London.The bank has also beefed up its offices in Paris and Frankfurt with local hires, poaching senior M&A bankers from BNP Paribas and Greenhill & Co. Goldman Sachs' head of European corporate and sovereign derivatives, Alessandro Dusi, has moved to Milan, where overall headcount has swelled to about 60 from 20 in 2017, a person familiar with the matter told Reuters. In its Madrid office, Goldman now has 60 staff, double pre-Brexit levels, a second source close to the bank said.Barclays and Goldman Sachs declined to comment.Predictions of an exodus of tens of thousands from London after the 2016 Brexit referendum have not yet materialised -- consultancy EY calculates that 7,600 Brexit-related financial services jobs had left London up until March, a fraction of London's half-a-million financial workforce.But bankers and analysts say many of the moves are still to happen.JPMorgan (JPM.N) is to shift around 200 more employees into the EU from London this year including traders, bringing total relocations since the referendum to some 400 with the largest number in Paris, a person familiar with the plans said.Financial lobby group Paris Europlace in 2016 predicted Brexit would create 10,000 new finance jobs in Paris by 2025. To date, fewer than half of those jobs have materialised but it's sticking with its forecast.Up to 35,000 London financial jobs could eventually disappear, said William Wright of think tank New Financial.The European Central Bank's bank supervisor, Andrea Enria, this month said that he understood the pandemic had slowed down relocations and the ECB's objective was not \"to put people in chains and move them to Frankfurt\". But he stressed banks need to ensure people in charge of interactions with European clients and managing risk are inside the bloc.\"There are banks that have done the 'full monty' and are already there and we're fully satisfied and there are banks that have done much less,\" he said.PARIS AHEADExpectations Frankfurt would emerge the biggest beneficiary of 7,600 Brexit job moves to date have been confounded, with Paris attracting the most people, according to EY, which estimates 2,800 jobs have gone to Paris. Bank of America, for example, has 400-odd staff in the French capital.Other cities including Milan, Madrid and Amsterdam are also luring senior figures as banks give employees more leeway about where to work.The Bank of France's banking supervisory arm, ACPR, said by December 2020, 50 financial firms from Britain had obtained authorisation in Paris, representing almost 2,500 jobs transferred to the French capital, along with at least 170 billion euros in assets.\"We are seeing an acceleration of jobs in investment banking and trading activities after a slowdown due to COVID,\" said Arnaud de Bresson, Paris Europlace's managing director, adding that bankers had chosen Paris because of its proximity to London, the lifestyle and its \"capital markets culture.\"Morgan Stanley's Goldstein said there was \"a new found attractiveness\" for working in France today, pointing to a more pro-business climate under President Emmanuel Macron.According to estimates from the city of Frankfurt, it expects 2,000 new Brexit-related jobs created by end-2022, up from the 1,500 new jobs created in Frankfurt by end-2019.A senior banker at UBS said some employees had relocated to Italy or the Netherlands rather than Frankfurt for personal reasons, and the city's bland image and relatively small size didn't help.\"We have to do more to promote it,\" the banker said.Bankers say they have struggled to find sufficient skilled staff in Frankfurt and that German regulators' inexperience versus French supervisors in overseeing several major investment banks had frustrated some American banks in particular.Still, Frankfurt offices are expanding hiring too. Andreas Halin, founder of Global Mind Executive Search Consultants, said senior bankers had realised they \"cannot hide behind COVID\" and were under regulatory pressure to expand Frankfurt headcount.While Paris is ahead for staffing numbers, no city has emerged a single EU capital markets hub.Germany is the preferred destination for EU legal bank entities, while Paris has won trading-related divisions. Amsterdam has gained much of the stock and swap trading departing London, as well as trading platforms, but few new jobs.New York has meanwhile emerged the global winner in derivatives, winning a bigger volume of the interest rate swap trading leaving London than the EU.  read more "}