{"text": "TORONTO Money markets see an increased chance of the Bank of Canada cutting interest rates closer to zero, as tightening economic restrictions to contain a second wave of COVID-19 cases offset optimism that activity will rebound later this year.Interest rates were thought to have hit rock bottom in Canada after they were slashed 150 basis points last March to a record low of 0.25%, a level the Bank of Canada considered the effective lower bound. But in November, Governor Tiff Macklem said a lower floor could allow Canadas central bank to ease further if the economy weakens.Data on Friday showed that Canada shed jobs in December for the first time in eight months. Economists are bracing for further weakness in Januarys report after a slow start to vaccine rollout and as some provinces move to stricter lockdowns.The BoC, which is due to make a policy decision next week, has ruled out negative interest rates, so further easing would likely be a so-called micro rate cut of less than 25 basis points. Thats an increment the central bank has not used since the target for the overnight rate became its main policy tool in February 1996.The fact that the Bank of Canada has kept the door open to it (a rate cut) in recent months hasnt gone unnoticed by markets, said Andrew Kelvin, chief Canada strategist at TD Securities.People have their guard up even though its not clear more stimulus is needed, Kelvin added.Reflecting rate cut risk, Canadas three-month overnight index swap rate has moved below the 0.2% level where the overnight rate has been settling. It has eased 4 basis points since November to trade at about 0.17%.A BoC spokeswoman declined to comment, citing a blackout period ahead of next weeks rate decision.Other central banks have moved in small increments. In November, the Reserve Bank of Australia cut its policy rate by 15 basis points to 0.1%, while the Bank of England did the same last March.If you think that 25 basis points is not the effective lower bound, then why wouldnt you be moving rates to the effective lower bound, since we have ongoing quantitative easing and we are still buying provincial bonds, Kelvin said.A rate cut could add stimulus by reinforcing already low borrowing costs and checking further gains for the Canadian dollar.Adjusting the asset-purchase program and setting yield-curve targets are other easing options the BoC has flagged, seeing risk of economic scarring if the recovery takes too long.Economic activity is expected to pick up once lockdowns end and vaccinations become more widespread, but analysts say the potential for another rate cut should not be ignored.The Bank of Canada just mentioning it in prepared remarks means that theyre thinking about it, said Royce Mendes, a senior economist at CIBC Capital Markets."}