{"text": "WASHINGTON Republican Senator Kelly Loeffler of Georgia unleashed her first full-scale TV attack ads on Democratic challenger the Rev. Raphael Warnock on Thursday, as the final battle for control of the U.S. Senate intensifies ahead of their January runoff.Loeffler, who spent much of the year fighting fellow Republican Doug Collins for conservative votes in their 20-candidate Nov. 3 multiparty election, released two 30-second spots that accused the Democrat of celebrating anti-American hatred, praising Marxism and calling police thugs and gangsters.Saving the Senate is about saving America from that! concludes one of the ads, in what the Loeffler campaign described as a statewide TV buy worth more than $1 million.A spokesman for Warnock, who is a Black pastor at Atlantas Ebenezer Baptist Church where slain civil rights leader Martin Luther King Jr. once preached, called the ads misleading and said they showed Loeffler resorting to the lowest of the low attacks to try and salvage her campaign.In anticipation of the Republican onslaught, Warnock, who has never held political office, previously launched a humorous online ad in which he warned he would likely face a surge in attack ads.Republican strategists say Loefflers ads are only the first salvo in an expected all-out assault on Warnock that is likely to include outside groups such as the Senate Leadership Fund, a political action committee aligned with Republican Senate Majority Leader Mitch McConnell.A Georgia Democratic Party official said Warnock entered the runoff campaign with strong positions in fundraising and polling and that robust resources would be available to launch a counterattack on Loeffler as a right-wing radical who has associated herself with extreme positions to curry favor with conservative voters.SENATE CONTROL AT STAKEThe Warnock-Loeffler matchup is one of a pair of Jan. 5 Senate runoffs in Georgia that will determine whether Republicans or Democrats lead the U.S. Senate after Democratic President-elect Joe Biden takes office. In the other race, Republican Senator David Perdue faces Democrat Jon Ossoff.Democrats need to win both seats to split the Senate 50-50 and give Vice President-elect Kamala Harris the tie-breaking vote. Georgia has not elected a Democratic senator since 1996, but Biden narrowly leads President Donald Trump there by 49.5% to 49.2% in last weeks election.Biden performed better than either Ossoff, who trailed Perdue by 1.7 percentage points, or Warnock, who got 32.9% of the vote in a race where Loefflers real rival was fellow conservative Collins.By running relatively unscathed ahead of the November election, Warnock was able to establish himself as a candidate seeking to represent ordinary Americans after growing up as one of 12 children in public housing in Savannah and being the first in the family to attend college.He had several months and good funding, so her attack ads could be less successful than if theyd been used against him in September, said Charles Bullock, political science professor at the University of Georgia.A Remington Research poll this week showed him a single point behind Loeffler at 49% to 48%, with strong favorable ratings among independent voters and even some Republicans.Warnock has yet to really take a punch, said one Republican strategist involved in the Georgia races. Its going to be very difficult for him to explain a lot of these things that hes done in his past.Loefflers ads play on Warnocks 2008 defense of the Rev. Jeremiah Wright, a onetime pastor of Democratic former President Barack Obama. Wright attracted national attention in 2008 with fiery sermons that critics condemned as anti-American and anti-Semitic.I know Rev. Wright. Im not an anti-Semite. Ive never defended anti-Semitic comments from anyone. And Kelly Loeffler knows better, Warnock told MSNBC on Thursday."}