{"text": "The $5 billion-plus bid battle for British security firm G4S will be settled by a rare head-to-head auction later this month if one of its two North American suitors hasnt prevailed by then, Britains takeover regulator said on Friday.The Takeover Panels decision comes after Canadas GardaWorld and U.S.-based Allied Universal both extended deadlines for their offers several times.The panel said the bidders would have until Feb. 20 to make revised bids for G4S, and if the situation hadnt been settled by then, the process would head to an auction.G4S, which employs more than 500,000 people around the world, in December backed a 3.8 billion pound ($5.2 billion) bid from Allied Universal, after repeatedly rejecting offers from GardaWorld.Allieds latest offer of 245 pence per G4S share is 10 pence higher than GardaWorlds last bid.Both GardaWorld and Allied Universal are trying to buy a larger business which has had to restructure over the past few years following a series of setbacks. Last year, G4S sold its cash handling unit, barring a few operations including the one in the UK, to U.S. peer Brinks Co.As GardaWorld and Allied Universal head into a bidding war... employment conditions of security guards employed by G4S everywhere must be addressed and standards must be protected, said Christy Hoffman, general secretary of UNI Global Union.Hoffman added that the union, which represents more than 20 million workers globally, expects the new owner to remain committed to its global agreement with G4S, no matter who wins the bid.G4S shares, which have soared more than 80% since private-equity backed GardaWorld first made its offer public on Sept. 14, were last up 1%. They hit a more than two-year high of 269 pence earlier on Friday.The decision to instigate an auction is rare, with only a handful of bidding wars taking that route in the past. In 2018, Comcast beat Rupert Murdochs Twenty-First Century Fox in an auction for pay-television group Sky.The panel said on Friday that G4S, GardaWorld and Allied Universal had all agreed to the terms of the auction procedure.The procedure provides for up to five days of public bidding over sequential business days, with Feb. 22 set as the first day of the auction.($1 = 0.7254 pounds)"}