{"text": "The main representative of the Chinese government in Hong Kong said on Saturday people trying to turn the city into a \"pawn in geopolitics\" were the \"real enemies\" and Beijing was the true defender of the city's special status.Luo Huining, director of China's Hong Kong Liaison Office, told a forum that the financial hub, a former British colony handed over to China in 1997, remained one of the world's most competitive economies, the South China Morning Post reported.\"Those trying to turn Hong Kong into a pawn in geopolitics, a tool in curbing China, as well as a bridgehead for infiltrating the mainland, are destroying the foundation of one country, two systems,\" Luo said, referring to the formula agreed when Britain handed the city back aimed at preserving its freedoms and role as a financial hub.\"They are the real enemies of Hong Kong's prosperity and stability,\" he said, without identifying any people or groups.Luo said the ruling Communist Party was \"the creator, leader, implementer and defender of one country, two systems\".Despite such assurances, many Hong Kong residents have over recent years become worried about what they see as attempts by Beijing to curtail its freedoms.China denies that.The Liaison Office did not answer calls outside normal business hours to confirm the contents of the speech and it did not immediately respond to faxed questions.Unease among many Hong Kong residents grew in 2014 when pro-democracy protesters took to the streets to demand universal suffrage. Demonstrations snowballed again in 2019, sparked by opposition to judicial reform that many people saw as a threat to their way of life.Beijing imposed a sweeping national security law on the city last June stifling the pro-democracy movement and raising new concerns about the city's prospects.The law's supporters say it has restored order and improved prospects for the city's economy, which Luo said was among the world's most competitive despite fears it would deteriorate under Chinese rule."}