{"text": "MOSCOW Belarus police will now be permitted to use combat weapons in the streets if needed, the Interior Ministry said on Monday, as security forces again clashed with protesters who want President Alexander Lukashenko to quit after a contested Aug. 9 election.Fascists, the protesters chanted in a tense standoff with security forces personnel wearing balaclavas who responded with flare guns and an unidentified spray, according to video clips circulating on social media.The sound of a blast could be heard as plumes of grey smoke filled the air at the scene. There were no immediate reports of injuries or arrests.A spokesman for the Interior Ministry later confirmed that police had used flare guns and tear gas to disperse an unauthorised rally.The protests, which have shifted largely to Minsk, have become organised and extremely radical, the Interior Ministry said in a statement.In this regard, the Interior Ministrys employees and internal troops will not leave the streets and, if necessary, will use special equipment and military weapons, it said.Tens of thousands of Belarusians have demonstrated every weekend since the election, in which Lukashenko was declared the winner. His opponents say the vote was rigged, a charge denied by Lukashenko, who has been in power for 26 years and has now turned to Russia for financial and other support to keep power.Mondays clashes occurred after thousands of people took part in a march of pensioners in the capital Minsk. The protesters chanted Go away and waved white flags with a red stripe, a symbol of the Belarusian opposition.On Sunday, when 713 people were detained for taking part in mass protests, security forces used water cannon and batons to break up crowds demanding a new presidential election.European Union foreign ministers agreed on Monday to sanction Lukashenko and other senior officials over what they said was a rigged election and worsening police violence against protesters.Lukashenko was not on an earlier EU sanctions list agreed on Oct. 2 that targeted 40 names, but the bloc now says his refusal to consider new elections as a way out of the crisis leaves it with no choice."}