{"text": "MOSCOW Police detained at least 46 protesters on Saturday as thousands of people gathered in the Belarus capital Minsk demanding the release of a jailed opposition leader, the latest in a wave of mass protests following a disputed election.Maria Kolesnikova, 38, has emerged as a key opposition figure after others were either jailed or forced out of the country, including Sviatlana Tsikhanouskaya who challenged President Alexander Lukashenko in the presidential election.Protesters say the Aug. 9 election was rigged to hand Lukashenko a phoney landslide win and that Tsikhanouskaya - who has since fled to Lithuania - was the real winner. Lukashenko, who has been in power for 26 years, denies this and has said foreign powers are behind the protests.At least 5,000 protesters, many of them women, gathered in central Minsk on Saturday, chanting Go away! in reference to Lukashenko, and Masha - a common alternative for Maria - in support of Kolesnikova, a Reuters witness said.Sveta is my president, Masha is my queen, read one of the slogans held up in the crowd.Police started detaining people shortly after the protests started at 1200 GMT. As of 1650 GMT, at least 46 were held in police stations, mostly women, according to the Spring human rights group.Kolesnikova was driven to the Ukrainian border earlier this week after being seen snatched off the streets of Minsk and into a van by masked men.According to two allies who were with her, she prevented an attempt to expel her from Belarus by tearing her passport up into small pieces and throwing it out of a car window. She is now detained in Minsk, and faces a potential long prison term over accusations of trying to seize power illegally.Tsikhanouskaya, who stood against Lukashenko in place of her better-known husband who was detained before election, called on Saturday for the police to stop cracking down on dissent.Violence you are putting on women is disgraceful, she said in a statement. Anyone who commits a crime against peaceful protesters will be called to answer.On Saturday, Lukashenko met his law enforcement officials, asking for an update with political situation in Belarus, Belta newsagency reported, without providing other details.He is due to meet Russian President Vladimir Putin on Monday in the Russian Black Sea resort of Sochi to discuss energy cooperation and two countries strategic partnership, the Kremlin has said."}