{"text": "Berkshire Hathaway Inc (BRKa.N) shareholders on Saturday easily rejected proposals requiring the company run since 1965 by Warren Buffett to disclose more about its efforts to address climate change and promote diversity and inclusion in its workforce.The rejections were not a surprise, given that Buffett controls nearly one-third of Berkshire's voting power and opposed both proposals.But the climate change proposal won support from just over 25% of votes cast and the diversity proposal from 24%, suggesting greater discontent than Berkshire shareholders historically demonstrate.The votes came as a growing number of major investors, including BlackRock Inc (BLK.N) and the California Public Employees' Retirement System (CalPERS) pension plan, call for companies to promote adherence to good environmental, social and governance principles.CalPERS, along with Federated Hermes and Caisse de Dpt et Placement du Qubec, had proposed requiring Berkshire to publish annual reports about its climate change efforts.The nonprofit shareholder advocate As You Sow separately proposed annual reports on diversity, saying companies such as Berkshire benefit from a diverse workforce.Buffett doesn't dispute that both issues are important, but opposed the proposals because of Berkshire's decentralized model, where its dozens of businesses run largely without his interference so long as they perform and are managed well.\"We do some other asinine things because we're required to do it, so we'll do whatever's required,\" Buffett said. \"But to have the people at Business Wire, Dairy Queen ... make some common report, ... we don't do that stuff at Berkshire.\"The company has also said it is seeing \"great results\" from many subsidiaries addressing climate change on their own.Berkshire shareholders also re-elected all 14 directors, despite calls from Institutional Shareholder Services and Neuberger Berman to withhold votes from members of Berkshires governance, compensation and nominating committee. The vote totals were not immediately disclosed."}