{"text": "A seat on a spaceship ride with billionaire Jeff Bezos went for $28 million during a live auction on Saturday, concluding the month-long bidding process for the sightseeing trip on the Blue Origins maiden voyage next month.Within four minutes of the open of Saturday's live phone auction, bids reached beyond $20 million. The bidding closed seven minutes after the auction began. The identity of the winner - presumably an ultra-wealthy space aficionado - was not immediately disclosed.The July 20 launch of Blue Origin's New Shepard booster from West Texas would be a landmark moment as U.S. firms strive toward a new era of private commercial space travel.Blue Origin's founder and Amazon.com Inc (AMZN.O) executive Bezos, the world's wealthiest man and a lifelong space enthusiast, has been racing against fellow aspiring billionaire aeronauts Richard Branson and Elon Musk to be the first of the three to travel beyond Earth's atmosphere.\"To see the earth from space, changes you. It changes your relationship with this planet, with humanity,\" Bezos said in a video before the final bidding took place, adding that his brother Mark will join him on the trip.As the month-long bidding process leading up to the live auction closed on Thursday, the winning figure stood at $4.8  million, fueled by entries from more than 6,000 people from at least 143 countries, Blue Origin said.\"Putting the world's richest man and one of the most recognized figures in business into space is a massive advertisement for space as a domain for exploration, industrialization and investment,\" Morgan Stanley analyst Adam Jonas told clients earlier this month.While the funds raised from the event are earmarked for charity, Blue Origin is hoping to galvanize enthusiasm for its nascent suborbital tourism business.However, Branson, who founded Virgin Galactic Holdings Inc (SPCE.N), may attempt to steal Bezos' thunder by joining a possible test flight to the edge of space over the July 4 weekend aboard Virgin's VSS Unity spaceplane, one person familiar with the matter said.The race is fueled by optimism that space travel will become mainstream as nascent technology is proven and costs fall, fueling what UBS estimates could be a $3 billion annual tourism market by 2030.Blue Origin and Virgin Galactic, as well as Musk's SpaceX, have also discussed using their rockets to link far-flung global cities. UBS says that long-haul travel market could be worth more than $20 billion, though several barriers such as air-safety certification could derail the plans.Blue Origin has not divulged its pricing strategy for future trips.Reuters reported in 2018 that Blue Origin was planning to charge passengers at least $200,000 for the ride, based on a market study and other considerations, though its thinking may have changed."}