{"text": "SEOUL/TOKYO/WILMINGTON, Del. In their first calls with Joe Biden since the U.S. election, the leaders of Japan, South Korea and Australia on Thursday reaffirmed plans to form close ties with the president-elect to tackle issues including climate change and regional security.The three key Asian allies - Japanese Prime Minister Yoshihide Suga, South Korean President Moon Jae-in and Australian Prime Minister Scott Morrison - join other global leaders in recognizing the Democratic challengers Nov. 3 victory over incumbent Donald Trump, who has so far refused to concede.Bidens projected win comes against a backdrop of Chinas growing military and economic assertiveness in the region, and after years of sometimes tumultuous relations between Asian allies and the United States under Trump over issues including trade, defence and the environment.All sides expressed their determination to strengthen bilateral ties as well as tackle global issues such as the coronavirus pandemic and climate change, Bidens office said.Japans Suga said he spoke with Biden by telephone and confirmed the importance of bilateral ties.President-elect Biden said that he looks forward to strengthening the U.S.-Japan alliance and working together on achieving a free and open Indo-Pacific, Suga said to reporters, in separate comments made at the Prime Ministers Office.Biden had earlier spoken to the leaders of Germany, the UK, Canada and France, but China and Russia have so far held off passing on their congratulations and speaking with the President-elect.SECURITY AND PROSPERITYBiden on Wednesday named Ron Klain as his White House chief of staff, his first major appointment as he builds his administration. Anthony Blinken, a diplomat and longtime confidant of Biden is seen as a likely pick for Secretary of State or National Security Adviser, both key roles for Asian allies.Speaking to South Koreas Moon, Biden reaffirmed the U.S. commitment to defend South Korea, highlighting the Asian ally as a lynchpin of the security and prosperity of the Indo-Pacific region, Moons spokesman Kang Min-seok said.President Moon asked for close cooperation for the forward-looking development of the bilateral alliance, and the denuclearisation and peace on the Korean peninsula, Kang told a briefing. President-elect Biden said he would closely cooperate to resolve the North Korean nuclear issue.Trump and North Korean leader Kim Jong Un vowed to work towards denuclearisation at their unprecedented summit in 2018, but little progress has been made since their second summit and working-level talks collapsed last year.While Biden has said he would not meet with Kim without preconditions, he has also said he would embrace principled diplomacy with North Korea.South Korean officials are also hopeful that Biden will quickly resolve a drawn-out, multi-billion dollar dispute with Washington over the cost of thousands of U.S. troops on the peninsula.Tackling the global coronavirus pandemic and climate change were key themes in Bidens calls with all three leaders, readouts from Bidens office showed.Australias Morrison said he spoke with Biden about emission reduction technology, though a target for zero net emissions by 2050 was not discussed.I raised with the president-elect the similarity between the president-elects comments and policies regarding emissions reduction technologies that we needed to achieve that, and we look forward to working on those issues, Morrison told reporters in Canberra.Both Moon and Suga said they agreed to arrange summits with the new president shortly after his inauguration in January.Biden will also face the challenge of managing unresolved political and economic disputes between South Korea and Japan, which have threatened a military intelligence-sharing arrangement and complicated U.S. efforts to counter China."}