{"text": "President Joe Biden nominated three people for top U.S. Justice Department posts on Monday, including a person who will provide legal advice to the administration and another supervising criminal investigations, the White House said.Biden picked Christopher Schroeder, who ran his transition team's efforts on the Justice Department, to be assistant attorney general for the Office of Legal Counsel, according to the White House.The president also picked Kenneth Polite to run the department's Criminal Division, and a former prosecutor and New Jersey attorney general, Anne Milgram, as his nominee to run the Drug Enforcement Administration (DEA), the department's lead agency for investigating drug trafficking and manufacturing.All three nominees require Senate confirmation.The Office of Legal Counsel (OLC) is a powerful post that entails providing legal interpretations to the executive branch. Although the opinions are not considered legally binding, they are nonetheless often treated as legal gospel.Perhaps the most notable case illustrating the power that the OLC wields came about during the investigation of former President Donald Trump's campaign by then-Special Counsel Robert Mueller.Much to the chagrin of many of Trump's critics, Mueller was constrained by an OLC opinion that stated a sitting president could not be indicted.    Schroeder, who previously served in the office during the administration of President Bill Clinton, is also an expert on environmental law.SENSITIVE INVESTIGATIONSAs head of the criminal division, Polite will inherit some highly sensitive criminal investigations. The U.S. attorney for Delaware, for instance, is currently conducting a criminal tax investigation into Biden's son Hunter.Criminal investigators are also looking into sex-trafficking allegations against Republican congressman Matt Gaetz. Gaetz has denied wrongdoing and says he and his father are the subject of an extortion plot.Polite formerly served as U.S. attorney for the Eastern District of Louisiana, in his hometown of New Orleans. He knows the impact of crime firsthand. His half-brother was murdered, a factor that motivated him to become a prosecutor, according to an interview he gave the Times-Picayune in 2014.Two more of Biden's DOJ nominees - Kristen Clarke and Todd Kim - will go before the Senate Judiciary Committee on Wednesday. Clarke has been nominated to lead the civil rights division, while Kim has been nominated to lead the environment and natural resources division."}