{"text": "President Joe Biden sought to demonstrate his much-touted interest in working with Republicans in Congress on Monday, witha bipartisan White House meeting as lawmakers prepared to grapple with his $2.3 trillion proposal to improve U.S. infrastructure.The Democratic president appears to be losing political capital with 10 Senate Republicans who have signaled an openness to working with Democrats, according to aides and observers. Those Republicansinclude Susan Collins and Mitt Romney, whose support could give him the votes to pass bipartisan legislation.Biden's party narrowly controls the House of Representatives and the Senate, meaning he can ill afford to lose Democratic votes. That has emboldened Democratic moderates such as Senator Joe Manchin, who have outsized influence over his legislative priorities.Biden met for an hour and 40 minutes on Monday with four Republicans with leading roles on relevant committees in the House and Senate. But they afterward showed little sign of lending support to his sweeping infrastructure proposal or the corporate tax increases he would use to pay for it.\"Clearly there are parts of this program that are non-starters for Republicans,\" Senate Commerce Committee Chairman Roger Wicker told reporters after the meeting. He said he told Biden it would be \"almost impossible\" for Biden to get a bipartisan agreement on corporate tax hikes.Another Republican attendee, Senator Deb Fischer, said she told the president she hoped he would consider a smaller package of \"traditional infrastructure\" like roads and bridges, ports, water and pipelines.Biden stressed the need for Congress to go big to set the country up for global success. But he also expressed an openness to breaking up the package, according to a Democratic aide, who  added that there was bipartisan support for broadband to be included as part of the package.The meeting led to some confusion about Biden's position on  taxes, after a media report that Democratic U.S. Representative Donald Payne said the president expressed openness to raising a gasoline tax. A White House official later said Biden had said he did not favor a gas tax hike to fund his proposal because it would not raise a great deal of money.  read more Biden, who was in the Senate for 36 years and has repeatedlystated his desire to collaborate with Republicans, is expected to hold further meetings that involve Republican lawmakers, according to Wicker.He said Biden was fully engaged during the meeting, which he said took place without any sense of contention. Biden asked Republicans at the meeting to come to him with a \"serious\" counter proposal, a Democratic aide with knowledge of the meeting said.But Biden can expect a skeptical reception from 10 Senate Republicans who met the president on his COVID-19 relief legislation in February, only to have their calls to shrink the package dismissed. Democrats later used a special legislative tool to pass the $1.9 trillion bill without Republican support.The White House official said the COVID-19 bill was a response to a raging national crisis andthat negotiations on infrastructure would be more deliberative.Republicans object to Biden infrastructure provisions aimed at addressing climate change and human services over traditional infrastructure projects, as well as a proposal to increase corporate taxes that were lowered by former President Donald Trump's 2017 tax restructuring.Republicans instead are coalescing around a targeted infrastructure approach focused on improvements to roads, bridges and broadband access that would be funded through user fees and tax incentives.Without Republican support, Democrats would have to rely on the parliamentary process called reconciliation that lets the 100-member Senate pass certain legislation with a simple majority rather than the 60 votes needed to advance most bills."}