{"text": "WASHINGTON Incoming U.S. Treasury secretaries have been confronted over the past two decades with the financial rescue of other countries, the bailout of the U.S. banking system and a trade war.But whoever Joe Biden chooses may face an agenda of historic depth and breadth, fighting crises while pursuing the lofty goals the president-elect set during his campaign. Bidens Treasury pick will have to cope with a recession and joblessness, as well as serving as the fulcrum to address wealth inequality, climate change and other issues.Names floated so far have spoken or written across those issues, and have extensive experience either at Treasury or the Federal Reserve, or both. Perhaps as significantly, each has pushed institutional boundaries during their careers.The candidates include former Fed chair Janet Yellen, who deepened the Feds focus on workers and inequality, and has remained active in policy debates at the Brookings Institution think tank after President Donald Trump replaced her as head of the central bank after a wide-ranging career.Current Fed Gov. Lael Brainard was the Treasury Under Secretary for international affairs during the critical years when the Obama administration faced the global financial and euro currency zone crises. Her experience could be a particular asset if the next secretary is focused on resetting global initiatives, as former officials hope here.Sarah Bloom Raskin served as a Fed Governor and Deputy Treasury Secretary, the only woman so far to hold that second-in-command role at the agency. A lawyer and former state financial regulator in Maryland, she has worked in finance, and currently serves a director with Vanguard, the investment giant with $6 trillion in assets under management. She helped craft a recent memo to the Biden team on how financial regulation could be used to shape climate policy.Atlanta Federal Reserve bank president Raphael Bostic, the first Black regional Fed president, was an assistant secretary at the Department of Housing and Urban Development during the first Obama administration and wrote an influential essay here this summer on why the country needed to address racial wealth and income inequality.At a moment of wide divisions in U.S. government and society, and amid expectations of change domestically and in the U.S. approach to the world, boundary-pushing may be whats needed, former Treasury Secretary Lawrence Summers said in an online forum this week.This is a very different kind of moment...COVID and climate and global shortfalls of output represent enormous challenges, Summers said, while the rest of the world waits for a renewal of U.S. leadership.DIVIDE AT HOME, UPHEAVAL ABROADThe next Treasury secretary will have to decide whether existing record deficits matter, whether there should be a global drive for more borrowing, how far spending can be pushed to help families and businesses through the pandemic and invest in new infrastructure.Then theres the rest of the world, restless for America to lead on global issues like climate change, trade and corporate tax avoidance, and anxious over how Bidens team will manage the critical relationship with China.The current situation is vastly different from the very healthy conditions Summers inherited in 1999 when the United States had a government budget surplus and he focused on international debt relief, he said during a Peterson Institute for International Economics forum.Even at its most basic, Treasury is a core agency that collects taxes and writes $4 trillion each year in checks for the federal government, whose approximately two million employees make it the largest employer in the United States. Still, its head can still fade into the background mechanics of government.Obamas second Treasury Secretary, Jack Lew, had a lower profile than his Great Recession-era predecessor, Timothy Geithner, serving during a time of no pressing crisis and relative government gridlock.Biden may face similar constraints if the Republican Party remains in control of the Senate, but his tenure will open at least with a lengthy agenda dictated by the pandemic and campaign pledges to fulfill.The president-elect wants to raise taxes on wealthier Americans and corporations, following Trump-era tax cuts, but may first crack down on tax cheats, key Democrats say.His Build Back Better plan includes extensive use of tax law to further everything from climate goals to helping lower- and middle-class families save more, and top economic adviser Ben Harris has written extensively on how to shape the tax code to serve social ends.Even if Senate Republicans curb some of Bidens more expansive ideas, campaign advisers see ways to make progress through Treasury.Casting climate change as an investment and financial risk, for example, can change how capital flows to the advantage of projects that curb or mitigate carbon emissions.Financial regulation through Treasury, the Fed and other agencies, gives the administration another toolkit to deploy to address the enormous economic risk that climate change is already creating, said Andy Green, managing director of economic policy at the Center for American Progress and a member of the transition teams for Treasury, the Fed, and financial regulatory agencies."}