{"text": "THURMONT, Md. Joe Biden arrived on Friday for his first weekend as U.S. president at Camp David, the storied retreat in the mountains of western Maryland that many predecessors found to be a rustic getaway from the political battles of Washington.Nestled in the Catoctin Mountains, the heavily guarded compound operated by the U.S. Navy provided a refuge for Jimmy Carter to fish and George W. Bush to ride his mountain bike.A coating of snow in the mountains provided a wintry landscape for Biden and his family. Biden was joined also by national security adviser Jake Sullivan and deputy chief of staff Bruce Reed.It provides a chance to get a blast of fresh air away from the press and a chance to be with family and friends, said presidential historian Douglas Brinkley.It has also been the site of high-pressure negotiations. Bill Clinton, hoping to recreate the magic of Carters Camp David Accords of 1978, brought together Palestinian leader Yasser Arafat and Israeli Prime Minister Ehud Barak at Camp David in 2000 for a summit, but failed to reach a breakthrough in the long-standing conflict.Bush frequently held meetings with foreign leaders at Camp David and surprised the world one day by scheduling a teleconference there with Iraqi leaders only to turn up secretly in Baghdad for the meeting.Biden, whose home is in Wilmington, Delaware, is expected to make greater use of the facility than his predecessor Donald Trump, who visited it 14 times over four years.The secluded nature of the compound and its rustic lodges - and its lack of a world class golf course - were drawbacks for Trumps style, aides to the former president have said.Instead he often traveled to his properties in New Jersey and Florida, where he could play golf and hang out with friends.Rather than fly directly aboard the Marine One helicopter to Camp David, Biden flew on Air Force One to Hagerstown, Maryland, and then rode in a motorcade to avoid any bad weather that might surface.The trip will get Biden out of Washington for the remainder of the Trump impeachment trial, which is expected to conclude as early as Saturday.White House spokeswoman Jen Psaki reiterated on Friday that Biden was watching bits of the trial but otherwise leaving it to the Senate to do its job.Camp David can be a wonderful retreat from the 18 acres of the White House grounds, which can often be confining, said Eric Schultz, former deputy press secretary to former President Barack Obama, adding that it is a rare luxury for the president to be able to walk freely in the open air."}