{"text": "Ron Klain was once tapped by Democratic President Barack Obama to safeguard the United States from the threat of a lethal virus. As President-elect Joe Bidens chief of staff, he will take on a similar mission.In 2014, Obama named Klain to serve as the Ebola Czar after an outbreak in West Africa that ended up killing thousands around the globe. All in all, only 11 people were treated in the United States for the virus and two died.Biden has made combating the resurgent coronavirus, which has killed more than 239,000 people in the United States, his top priority as he looks toward taking office in January. He tapped Klain as his chief of staff late on Wednesday, and the longtime adviser is expected to assume a leading role in crafting a COVID-19 action plan.Ron has been invaluable to me over the many years that we have worked together, Biden said in a statement. His deep, varied experience and capacity to work with people all across the political spectrum is precisely what I need in a White House chief of staff as we confront this moment of crisis and bring our country together again.Klain, in a statement, called his selection the honor of a lifetime.Biden has begun building his administration since clinching enough electoral votes to win the Nov. 3 election. President Donald Trump, who has made unsubstantiated claims of voter fraud, has yet to concede and is pursuing legal challenges to try to overturn the results.Klain, 59, functioned as an outside councillor to Biden during the campaign, particularly concerning the coronavirus, and spoke almost daily with the candidate, Klain has said in media interviews.He served as Bidens top aide in the White House before, when Biden was vice president under Obama. He held the same job under Vice President Al Gore during the Clinton administration.Gore called Klain a trusted and capable adviser.He was always highly informed and his advice was always grounded in exceptional command of the policy process, the merits of the arguments, and the political and justice context, the former vice president told Reuters.Klains stint in the White House with Biden came during the fallout from the 2008-2009 financial crisis, when Biden was charged by Obama with overseeing implementation of the $787 billion Recovery Act to needy state and local governments.Biden and Klain worked to ensure the money was directed to shovel-ready projects with a minimum of waste and fraud. At times, there were complaints from some states and cities that the funds were going out the door too slowly.Biden said his office was trying to be methodical in getting the money to where it would be most effective.LET THE MEDICAL EXPERTS BE THE TOUCHSTONEAfter Klain left Bidens office, Obama brought him back to manage the White House response to the Ebola threat, a move that was criticized by some because the Harvard Law School graduate was not a public health expert.Klain won praise from some public health experts, however, for his skill at manipulating the levers of government. He coordinated the U.S. response to the threat among the various agencies involved and focused on getting assistance to West Africa to help contain the epidemic, insisting on regular face-to-face meetings so he could identify problems quickly, he said in an interview with WIRED magazine earlier this year.The high-level lessons applicable today are, first and foremost, let the medical experts be the touchstone of the response - let them be the people who are formulating this strategy, let them be the spokespeople, Klain told the magazine.Klain drew upon that experience to advise Biden this year about the coronavirus outbreak. He recorded a viral video for the campaign during the first spike in COVID-19 cases, detailing what he felt were the Trump administrations failures on the coronavirus with the assistance of a whiteboard.Klains history with Biden dates back to Bidens chairmanship of the Senate Judiciary Committee in the 1980s. In 1991, when the committee held the contentious Supreme Court confirmation hearing for Clarence Thomas, Klain, the committees top lawyer, was charged with investigating sexual harassment claims against Thomas made by Anita Hill.Criticism of Bidens treatment of Hill by womens groups followed him into his 2020 presidential run. Klain said in 2018 on Twitter that he never doubted the veracity of her allegations.Klains experience with confirmation processes  he also shepherded the late Justice Ruth Bader Ginsburg onto the court during President Bill Clintons administration  is expected by Biden aides to be a help with a Senate that may stay under Republican control. Klain himself clerked on the court for Justice Byron White.Klain was also active on Gores behalf in the 2000 Florida recount drama that saw the U.S. Supreme Court side with Republican George W. Bush, making him president over Gore. Klain was played by Kevin Spacey in the HBO movie Recount."}