{"text": "U.S. President Joe Biden will hold a solo news conference after meeting his Russian counterpart Vladimir Putin next week, denying the former KGB spy an elevated international platform to castigate the West and sow discord.Putin's bravura performance at a 2018 news conference with  Donald Trump led to shock when the then U.S. president cast doubt on the findings of his own intelligence agencies and flattered the Russian leader.Talking about the summit alone will also spare Biden, 78, from open jousting with Putin, 68, before the world's media after what is certain to be a combative encounter.\"We expect this meeting to be candid and straightforward,\" a White House official said.\"A solo press conference is the appropriate format to clearly communicate with the free press the topics that were raised in the meeting  both in terms of areas where we may agree and in areas where we have significant concerns.\"Biden will meet Putin on June 16 in Geneva for a summit that will cover strategic nuclear stability and the deteriorating relationship between the Kremlin and the West.Putin, who has served as Russias paramount leader since Boris Yeltsin resigned on the last day of 1999, said ahead of the meeting that relations with the United States were at their lowest point in years. Asked about Biden calling him a killer in an interview in March, Putin said he had heard dozens of such accusations.\"This is not something I worry about in the least,\" Putin said, according to an NBC translation of excerpts of an interview broadcast on Friday.The White House has said Biden will bring up ransomware attacks emanating from Russia, Moscow's aggression against Ukraine, the jailing of dissidents and other issues that have irritated the relationship.Biden has said that the United States is not seeking a conflict with Russia, but that Washington will respond in a robust way if Moscow engages in harmful activities.Russia says the West is gripped by anti-Russian hysteria and that it will defend its interests in any way it see fit.British Prime Minister Boris Johnson, who is hosting G7 leaders including Biden at a summit in southwestern England, told CNN that Biden would be giving Putin some pretty tough messages, and thats something Id only approve of."}