{"text": "U.S. President Joe Biden said on Wednesday he sees room for a compromise on his proposal for trillions of dollars in infrastructure spending after meeting with Republican leaders but will move forward without the opposition party if necessary.In their first White House meeting since Biden, a Democrat, took office in January, Senate Republican leader Mitch McConnell and House of Representatives Republican leader Kevin McCarthy signaled a willingness to work with the president on infrastructure but drew the line at tax increases.Biden told reporters after the nearly two-hour meeting that he saw some reason to be optimistic.\"I'm generically encouraged that there's room to have a compromise on a bipartisan bill that's solid and significant,\" he told reporters.In an interview with MSNBC he indicated an interest in passing part of his package with bipartisan support and part of it without.\"Let's see if we can get that agreement to kick-start this and then fight over what's left,\" Biden said in the interview. \"We'll see if I can get it done without Republicans if need be.\"Biden's $2.25 trillion infrastructure bill and a $1.8 trillion education and childcare plan have faced sharp resistance from Republicans in Congress, with disagreements over the price tag, scope and funding proposals.\"You won't find any Republicans who are gonna go raise taxes. I think that's the worst thing you can do in this economy,\" McCarthy said after the talks in the Oval Office. He cited rising gasoline prices as a reason not to back tax increases.McConnell said Republicans were \"not interested\" in reopening a 2017 legislative effort that cut taxes for companies and the wealthy under former Republican President Donald Trump.\"We both made that clear to the president. That's our red line,\" McConnell said.Before a pipeline outage caused fuel prices to spike, Republicans and businesses suggested \"user fees\" such as raising gasoline taxes instead, a more traditional form of infrastructure funding.Biden has expressed concern that such a model would hurt lower-income Americans. His investment plans, and intention to tax wealthy Americans and companies to cover the cost, are popular with voters from both parties.But recent history does not augur well for a deal.No Republicans voted for Biden's $1.9 trillion COVID-19 relief plan that passed in March. House Majority Leader Steny Hoyer, a Democrat, said on Tuesday the Biden administration was \"not going to wait a long time if we don't see that agreement is possible.\"White House spokeswoman Jen Psaki said Biden did not want to raise taxes on working Americans.\"His bottom line is that inaction is unacceptable, and that he is not going to raise taxes on the American people who are making less than $400,000 a year, but he's open to a range of proposals,\" she told a briefing.Biden has said he wants to raise the U.S. corporate tax rate to between 25% and 28%, from 21%, to pay for badly needed infrastructure.House Speaker Nancy Pelosi, a Democrat, said she felt more optimistic about prospects for a bipartisan infrastructure bill after the meeting, which she attended.\"We have a different set of values. But what we did agree in the meeting is: Let's agree on what we're trying to achieve. And then we can talk about how we pay for it. Let's not lead with a disagreement. We'll find a way because the public knows that this is necessary,\" Pelosi told reporters.CHENEY EXPULSIONMcCarthy came to the White House talks shortly after leading his House Republican colleagues in expelling Liz Cheney from their leadership team for rejecting Trump's false claims that Biden stole last year's election.McCarthy, who has sought to placate Trump, cast Cheney's dismissal from the No. 3 Republican leadership post in the House as necessary to unify Republicans and reclaim control of the House in 2022.Psaki said the Republicans' support for Trump's false claims would not get in the way of Biden attempting to work with them.\"The president is no stranger to working with people who he disagrees with ... or who he has massive fundamental disagreement with,\" she said.Congressional Democrats are giving Biden plenty of room to try to broker a deal, but they are preparing for the possibility of moving a massive spending bill along strictly party lines if Republicans do not join in negotiations, according to congressional and White House sources.Democrats in Congress may struggle, however, to retain the necessary support of enough of their own members to pass Biden's spending proposals through both chambers, where they have slim majorities. They are betting the sheer volume of the spending measures will include enough attractive items to overcome any internal opposition, the sources told Reuters."}