{"text": "The Biden administration should expand antitrust cases against Alphabet's Google (GOOGL.O) and Facebook (FB.O) and encourage  breaking up companies, according to a group whose founder is working with the president-elect's transition team.The American Economic Liberties Project, an influential Washington-based anti-monopoly group, issued a report with  guidance for antitrust enforcers in the next administration. The group is led by Sarah Miller, who is working with President-elect Joe Biden's transition team and has been instrumental in making antitrust enforcement against Big Tech a mainstream issue. The report's recommendations offer a glimpse into the thinking that could influence future policymaking under the Biden administration. The group urged that the U.S. Justice Department make clear it will continue antitrust action against Google by expanding the scope of litigation beyond search to maps, travel and its app store. The Justice Department sued Google on Oct. 20, accusing the $1 trillion company of dominating search and advertising. In December, the Federal Trade Commission (FTC) sued Facebook saying the company used a \"buy or bury\" strategy to hurt rivals. read more The report calls on the Biden administration to appoint aggressive Justice Department and FTC antitrust enforcers and urges Biden's attorney general nominee, Merrick Garland, to \"publicly commit to seeking a Google breakup.\"\"The anti-monopoly movement is really young...We wanted to lay out a vision that people in a new administration can rally around and can use as a clear roadmap for not only what's possible but what's necessary,\" Miller told Reuters.Backers of this view want antitrust enforcement to move away from the prevailing standard which only looks at whether consumers are benefiting from lower prices.  The report encourages antitrust agencies to challenge mergers involving a powerful buyer and calls for regulators to stop entering settlements with companies that do not require them to admit wrongdoing. Among other recommendations it wants to do away with non-compete clauses in work arrangements and end conflicts of interest by stopping companies from operating and competing on the same platform. For example, Amazon.com Inc (AMZN.O) operates a third-party, seller-driven marketplace where it also competes.    The report also urges the FTC to prioritize bringing an antitrust case against Amazon for hurting competitors."}