{"text": "WASHINGTON U.S. President Joe Biden pushed for the first major legislative achievement of his term on Friday, turning to a bipartisan group of local officials for help on his $1.9 trillion coronavirus relief plan.Biden invited a set of mayors and governors to the Oval Office and described what he said was a need to give those officials more help supporting millions of unemployed workers and reopening schools.We need to help the states economically in terms of unemployment, Biden said during a small part of the meeting that was open to reporters. The federal government has a major role to play here.The White House summit came as public health officials in the administration readied new guidelines for reopening schools and as Treasury Secretary Janet Yellen said the time to go big is now as she pushed for more stimulus globally during the first meeting of the Group of Seven wealthy economies since the new U.S. administration took office.The Democratic presidents proposed spending package, coming on top of $4 trillion enacted by his Republican predecessor, Donald Trump, would have important consequences for a global economy that is slowly and unevenly recovering after last year suffering its worst downturn since the Great Depression of the 1930s.More than 400 mayors wrote to leaders in Congress earlier this month to urge them to pass Bidens relief package, but Republicans are backing a plan with a much smaller price tag.Taking part in the Oval Office meeting were Republican and Democratic elected officials whose states and cities have been hammered by the coronavirus pandemic and its economic fallout. Many have seen tax revenues fall and costs soar as they race to vaccinate their citizens.The group includes four governors, including New York Governor Andrew Cuomo, a Democrat, and Maryland Governor Larry Hogan, a Republican, and five mayors, including Jeff Williams of Arlington, Texas, a Republican.Williams, who met with Yellen virtually last week, said his city urgently needs the federal aid earmarked for state and local governments in Bidens rescue plan. He said cities were crushed when Congress removed similar aid from a previous relief bill that passed in December.Weve been crippled. We havent gotten help, Williams said in an interview. Our property taxes are down and costs are way up. It doesnt matter if youre a Democrat or a Republican, this is the right solution so we can achieve economic growth much faster.Arlington, which is home to the largest General Motors Co plant in the world, is bracing for a 10% drop in the appraised value of its commercial properties, which would cut revenues by some $30 million after an $18 million loss last year, Williams said.Biden on Thursday said the U.S. coronavirus death toll was likely to reach 500,000 next month, but said the United States was on track to have enough vaccine for 300 million Americans by the end of July.While economic growth is picking up, unemployment remains high and many communities of color are not expected to recover for years."}