{"text": "NAIROBI (Thomson Reuters Foundation) - Joe Bidens electoral victory has revived the American Dream for scores of African LGBT+ refugees who fled persecution at home only to languish in Kenya when President Donald Trump denied them a fresh start in the United States.Trump is due to leave office in January, with his Democratic successor promising to open the door wider to migrants and lead a more LGBT+-friendly administration.Under his presidency, Trump lowered the cap on refugee admissions every year, culminating in an all-time low of 15,000 for the fiscal year 2021.Biden has pledged to increase annual refugee admissions to 125,000. He has also advocated for the rights of sexual minorities, raising hopes among LGBT+ asylum seekers fleeing discrimination and criminalisation in their home countries.Many of us had given up on our dreams over the last few years, said Dhalie, 29, a lesbian who left Uganda in 2016 after facing threats to her life.Like hundreds of others, she resettled in more liberal Kenya, awaiting the go-ahead to start anew in the United States.With Biden, there is now a chance of having a life in the U.S. where I am free (to) study, have a job and love who I want.Dhalie, who did not want to give her full name, said she was expelled from school in Uganda for being a lesbian and wanted to complete her education to become an orthopaedic surgeon.She has been awaiting resettlement since 2017.CRIMINALISEDAfrican countries have some of the worlds most prohibitive laws governing homosexuality. Gay sex is a crime across most of continent, with punishments ranging from imprisonment to death.Although gay sex is also punishable in Kenya, the law is rarely enforced and the east African nation is seen as more tolerant, even though discrimination remains prevalent.There are more than 750 LGBT+ refugees in Kenya - mostly from Uganda, but also from Rwanda, Burundi and the Democratic Republic of Congo. Most live in the shadows, lack protection and safe housing, and are not permitted to work.Craig Paris, executive director of the Refugee Coalition of East Africa, said the Trump administration sat idle on many case files for refugees, as well as cutting funding for vital LGBT+ refugee support programmes.In Biden, refugees finally dare to hope, said Paris, a 28-year-old gay social worker from Uganda who has been waiting five years for resettlement.There are so many reasons to be hopeful - not only because of Bidens refugee policy but also his stand on LGBTQI issues, he said. Its amazing that something happening so far away in the U.S. can affect people here in this tiny corner of Africa."}