{"text": "WASHINGTON A handful of U.S. Senate Armed Services Committee Democrats voiced reservations on Tuesday about making another retired general the top civilian official at the Department of Defense, some citing last weeks rampage at the U.S. Capitol.Democratic President-elect Joe Biden has nominated retired General Lloyd Austin to be defense secretary. Because he left the army in 2016, Austin needs Congress to waive a law - designed to ensure civilian oversight at the Pentagon - that requires top brass to have hung up their uniforms for at least seven years.Democrats said they were concerned because it would be the second such waiver in four years. The last was in 2017 for Republican President Donald Trumps first defense secretary, retired General Jim Mattis.We are now in danger of setting a precedent, after precedent, with a new norm, creating a danger that exception will swallow the rule, Democratic Senator Richard Blumenthal said.A committee hearing on Tuesday addressed the issue, ahead of an as-yet-unscheduled vote on the waiver.Several senators alluded to the Jan. 6 attack on the Capitol by supporters of Republican President Donald Trump opposed to Congress certifying Bidens Nov. 3 election victory.Lawmakers have called for an investigation into why it took so long for troops to be deployed to help Capitol Police repel the attackers. Others have expressed concern that military veterans were among extremists charged since the assault.This attack was the greatest threat to constitutional order in my lifetime, said Democratic Senator Jack Reed, who will become the Armed Services Committee chairman when Biden is sworn into office on Jan. 20.Democrats Tammy Duckworth, Elizabeth Warren and Blumenthal said they opposed the waiver. Democratic Senator Tim Kaine said he was undecided.The waiting period is important and the length of time matters, said Duckworth, a military veteran.Opposition to the waiver does not mean the Democrats - whose party will control the Senate after Biden and Vice President-elect Kamala Harris take office - will oppose Austins nomination.Republican Senator Jim Inhofe, the outgoing committee chairman, said the date of Austins confirmation hearing, which had been Jan. 19, might be changed.Most Senate committees, now led by Trumps Republicans, have not even scheduled hearings for Bidens nominees, despite a Senate tradition of holding pre-inaugural hearings to help ensure a smooth transition.The Army told Reuters it was working with the FBI to see if any attackers were current service members and with the Secret Service to see if any of the nearly 10,000 National Guard troops securing Bidens inauguration would need additional screening."}