{"text": "Gary Gensler will be named chair of the U.S. Securities and Exchange Commission (SEC) by President-elect Joe Biden, said two sources familiar with the matter, an appointment likely to prompt concern among Wall Street firms of tougher regulation.Gensler was chair of the Commodity Futures Trading Commission (CFTC) from 2009 to 2014, and since November has led Biden's transition planning for financial industry oversight.His appointment as the country's top securities regulator is expected to put an end to the four years of rule-easing that Wall Street banks, brokers, funds and public companies have enjoyed under President Donald Trump's SEC chair Jay Clayton.At the CFTC, Gensler implemented dramatic new swaps trading rules mandated by Congress following the 2007-2009 financial crisis, developing a reputation as a hard-nosed operator willing to stand up to powerful Wall Street interests. A former Goldman Sachs banker and a professor at MIT Sloan School of Management, Gensler also oversaw the prosecution of big investment banks for rigging Libor, the benchmark for trillions of dollars in lending worldwide.Gensler did not respond to a request for comment. A spokesperson for Biden did not immediately respond to a similar request.TOUGH LINE ON ENFORCEMENTProgressives are likely to cheer the appointment. Gensler is expected to take a tough line on enforcement, and to pursue rules that address Democratic policy priorities on such issues as climate change and social justice.In particular, policy experts expect Gensler will pursue new corporate disclosures on climate change related-risks, political spending, and the composition and treatment of their workforces. Democrats also are keen to reverse new investment advice protections which they say do more harm than good, to restore some shareholder rights, and complete post-crisis executive compensation curbs. \"The top of the agency is going to be setting an agenda in the opposite direction of where Jay Clayton and the congressional Republicans have been steering for years, by expanding and improving industry disclosures and restoring investor rights,\" said Ty Gellasch, head of Washington-based, Healthy Markets.A former Wall Street lawyer, the incumbent Clayton was criticized by Democrats for his extensive ties to many companies he was tasked with overseeing and for leading an ambitious agenda to reverse a 20-year decline in U.S. public company listings with an overhaul of dozens of rules.Among the most controversial changes were measures critics said reduced corporate disclosures to investors, weakened auditor independence, made it harder for shareholders to push for corporate votes on issues such as climate change and racial justice, and allowed more retail investors to dabble in private company investments.Clayton has said his changes maintained important investor and marketplace protections, and his tough stance cracking down on cryptocurrency frauds and offerings won praise from consumer groups. But consumer and investor groups said that for the most part, his changes too frequently made life easier for corporations by weakening investor safeguards or diminishing investor rights. \"The good news is that much of that action came late enough in his tenure that it may still be possible to reverse course,\" said Barbara Roper, investor protection director for the Consumer Federation of America."}