{"text": "WASHINGTON President Joe Bidens aides have launched a formal review of the U.S. military prison at Guantanamo Bay in Cuba, reviving the Obama-era goal of closing the controversial facility with the aim of doing so before he leaves office, the White House said on Friday.Aides involved in internal discussions are considering an executive action to be signed by Biden in coming weeks or months, two people familiar with the matter told Reuters, signaling a new effort to remove what human rights advocates have called a stain on Americas global image.Asked whether Biden would shut the high-security prison located at the Guantanamo Naval Station by the time his presidency ends, White House spokeswoman Jen Psaki told reporters: That certainly is our goal and our intention.But such an initiative is unlikely to bring down the curtain anytime soon on the offshore facility, due largely to the steep political and legal obstacles that also frustrated efforts by his ex-boss, former President Barack Obama, to close it.Set up to house foreign suspects following the Sept. 11, 2001, attacks on New York and Washington, the prison came to symbolize the excesses of the U.S. war on terror because of harsh interrogation methods that critics say amounted to torture.We are undertaking an NSC process to assess the current state of play that the Biden administration has inherited from the previous administration, in line with our broader goal of closing Guantanamo, National Security Council spokeswoman Emily Horne told Reuters, which was the first to report that the review was under way.The NSC will work closely with the Departments of Defense, State, and Justice to make progress toward closing the GTMO facility, and also in close consultation with Congress, she added.The immediate impact of a new approach could be to reinstate, in some form, Obamas Guantanamo closure policy, which was reversed by Donald Trump as soon as he took office in 2017.Trump kept the prison open during his four years in the White House. Now, 40 prisoners remain, most held for nearly two decades without being charged or tried.Bidens campaign said during the 2020 race that he continued to support closing the detention center but did not say how he would do it.It is also unclear how specific Bidens coming executive action might be about his plans for the prison, which holds suspects in the Sept. 11 attacks among its detainee population.This is an encouraging and much welcome development, said Scott Roehm, Washington director of advocacy group The Center for Victims of Torture. The process needs to move quickly.FILLING OUT BIDENS GUANTANAMO TEAMSignaling that deliberations are still at an early stage, Horne said a number of key policy roles still need to be filled, including ones at the Defense, State and Justice Departments. We need to have the right people seated to do this important work, she said.Biden, who was Obamas vice president, can expect to confront many of the same hurdles faced by his former boss.Opened under President George W. Bush, the prisons population grew to a peak of about 800 inmates before it started to shrink. Obama whittled down the number further but his effort to close the prison was stymied largely by Republican opposition in Congress.The federal government is still barred by law from transferring any inmates to prisons on the U.S. mainland. Even with his own Democratic party now controlling Congress, their majorities are so slim that Biden would face a tough challenge securing legislative changes because some Democrats might also oppose them.A revived Guantanamo strategy is expected to focus initially on further decreasing the number of prisoners by repatriating them or finding other countries to accept them, according to the people familiar with the matter.This could also mean re-establishing a State Department post of Guantanamo closure envoy, created by Obama but eliminated by Trump, to resume negotiations with other governments on detainee transfers, the sources said.In addition, the Pentagon could restart a parole-style review process of prisoners cases to determine whether they still posed a threat, the sources said.Still, any closure plan could initially be hampered by the coronavirus pandemic, making moving prisoners unlikely for now.Just over three weeks after taking office, the Biden administration has not made Guantanamo one of its top early priorities as it grapples with the pandemic and its economic fallout. Obama made closing Guantanamo one of his first executive orders in 2009 but failed to do so by the end of his second term.While Im glad to hear that the new administration will be reviewing policy with an eye towards closing Guantanamo, its concerning that it is coming so late in the game, said Andrea Prasow, deputy Washington director for Human Rights Watch.Shutting the facility has been a demand of progressive Democrats whose support helped Biden win the White House.The prisons continued existence, critics say, is a reminder of detention practices that opened the United States to accusations of torture.Privately administration officials express skepticism about getting the support they will need from Congress.Defense Secretary Lloyd Austins statement during his January confirmation hearing that the new administration would seek Guantanamos closure drew a letter of rebuke signed by seven Republican House members, all military veterans.If we release these GITMO detainees, theyll become rockstars in the Islamist Extremist world, posing an even greater threat to America and the world, tweeted U.S. Representative Mike Waltz, one of the signatories.Of the prisoners who remain, nine have been charged or convicted by military commissions. The most notorious is Khalid Sheikh Mohammed, the accused Sept. 11 mastermind. About two dozen have not been charged but have been deemed too dangerous to release.Six inmates have previously been cleared for release by a government panel yet remain jailed with no arrangements for transfer."}