{"text": "WASHINGTON The U.S. government next week will begin to gradually process thousands of asylum seekers forced to wait in Mexico under a controversial program put in place by former President Donald Trump, officials said.The moves are part of a plan by the administration of President Joe Biden to end the program, known as the Migrant Protection Protocols (MPP), an effort complicated by the ongoing coronavirus pandemic and concerns over illegal immigration.The Trump administration launched the program in 2019 as part of a wide-ranging crackdown on the ability to seek asylum in the United States, which Trump officials depicted as rife with fraud and meritless claims.The initiative forced more than 65,000 non-Mexican asylum seekers back across the border to wait for their U.S. court hearings, although far fewer are believed to still be waiting in Mexico.The Biden administration will begin by working to process about 25,000 migrants with active claims in the program, officials said on Thursday. The new guidelines will require migrants to register online or via phone, be tested for the coronavirus in Mexico and then come to a U.S. port of entry on a specific day.The news was welcomed with relief in a sprawling migrant camp in the Mexican city of Matamoros, just across the border from Brownsville, Texas.Ive been reading all the articles, said Salvadoran asylum seeker Sandra Andrade, who has been waiting in Mexico for over a year to resolve her U.S. court case. Honestly, I have no words for how Im feeling right now!Biden vowed on the campaign trail to roll back restrictive Trump-era immigration policies, including MPP, which is informally known as remain in Mexico. His administration suspended new entries into the program when he took office on Jan. 20, but did not immediately put forward a plan to bring the people enrolled in it into the United States. Some have been waiting for as long as two years.Republicans embracing Trumps hardline immigration views have criticized the ending of MPP and could use it as fuel for political attacks if illegal border crossings increase on Bidens watch.Top Biden officials have stressed in recent weeks that migrants should not attempt to enter the United States, saying they need time to build up the capacity to process more asylum seekers.Individuals who are not eligible under this initial phase should wait for further instructions and not travel to the border, Homeland Security Secretary Alejandro Mayorkas said in a statement accompanying the MPP announcement. Due to the current pandemic, restrictions at the border remain in place and will be enforced.Mexican President Andres Manuel Lopez Obrador echoed that message on Friday, saying migrants should not think the gates of the northern border are open or believe human smugglers who say as much.During a call with reporters on Thursday evening, three Biden administration officials described the plans to process MPP enrollees, with the first phase beginning on Feb. 19.The officials, all of whom requested anonymity, only outlined procedures for people with active cases in U.S. immigration courts. Those with non-active cases, many of whom may have returned to their home countries, will have other opportunities, one of the officials said.Under the plan, migrants will need to register with international organizations over the internet or by phone and await instructions. One of the organizations will also handle coronavirus testing in Mexico, another official said.Biden officials declined to identify the organizations on Thursday. However, a spokesman for the United Nations High Commissioner for Refugees said the refugee agency would work with both the U.S. and Mexican governments to ensure migrants in the program could safely enter the United States.STARTING SMALLThe migrants claims will initially be heard at three ports of entry along the border, with organizations working to identify those in line the longest and those deemed particularly vulnerable.At two of the ports, the Biden administration expects to process 300 people per day at each port. The effort will expand to additional ports over time.We will start small, said one of the officials.The Biden officials declined to name the ports where the administration planned to begin processing, citing concerns that people would rush to those locations.Migrants entering the United States through the program will not be placed in detention centers, but could be subject to an alternative form of monitoring, including ankle bracelets.The United States developed the strategy in close coordination with Mexican authorities, the official said.Even while Biden moves to end one Trump program, he faces growing pressure from advocates to end another known as Title 42. The pandemic-era order allows U.S. authorities to rapidly expel to Mexico migrants caught crossing the border illegally, a practice advocates say bypasses due process.The Biden administration has not said whether it will end that program. More than 400,000 migrants have been expelled under the measure since it became effective in March 2020, although many of those caught are repeat border crossers and therefore counted multiple times.The effort to process MPP enrollees comes as arrests of migrants at the U.S.-Mexico border have been increasing after a steep drop at the beginning of the coronavirus pandemic."}