{"text": "BENGALURU The U.S. economy will grow faster than previously thought and reach pre-COVID-19 levels within six months, according to a majority of economists polled by Reuters who however said unemployment would take well over a year to recover.Optimism was largely driven by the House of Representatives passing President Joe Bidens $1.9 trillion relief aid in response to the pandemic, which has killed around 530,000 people in the U.S. and left millions out of work.After shrinking 3.5% last year, the worlds largest economy was forecast to grow 5.7% this year - the highest since polling began for this period over two years ago, according to the March 8-11 survey of over 100 economists.In response to an additional question, 85% of economists, or 51 of 60, said the economy would reach pre-COVID-19 levels within a year, including more than 60% expecting it within six months.With the vaccination roll-out going well and President Biden indicating all adults will have the opportunity of a vaccine by the end of May we expect a broad re-opening of the economy through the second quarter, said James Knightley, chief international economist at ING.With more stimulus coming and plenty of pent-up demand and strong savings levels to fuel it, we see a strong likelihood that all the lost output will have been regained by the end of Q2.(Graphic: Reuters Poll: U.S. economic growth forecast revisions - )https://fingfx.thomsonreuters.com/gfx/polling/yzdvxeoldpx/U.S.%20graphics%202.PNGFollowing approval of one the largest stimulus packages in American history the U.S. economy was forecast to grow 4.8% this quarter and 7.2%, 7.1% and 5.0% in the subsequent three quarters respectively, higher than 2.8%, 6.0%, 6.3% and 4.6% predicted last month.While the U.S. economy created more jobs than expected in February and the jobless rate dropped further, the latest employment report showed it would probably take several years for the labor market to heal from the pandemics deep scars.Over 92% of economists, or 49 of 53, in response to a separate question said it would take over a year for the jobless rate to fall to pre-pandemic levels, including 22 respondents who said two or more years.Only four participants said within a year.The U.S. labor market came roaring back in February. However, signs of slack remain, said Joe Song, U.S. economist at BofA global research.So while the labor market has made significant progress since the height of the pandemic, a wider measure of labor underutilization would argue that the economy still has a long way to go before reaching maximum employment.(Graphic: Reuters Poll: U.S. economy outlook - )https://fingfx.thomsonreuters.com/gfx/polling/xklvyrkarpg/u.s%20graphics.PNGDespite expectations for solid growth in 2021, the core Personal Consumption Expenditure (PCE) price index - the Federal Reserves preferred inflation gauge - was forecast to average 2.0% this year and next. In 2023 it was expected to average 2.1%.While a recent rise in U.S. Treasury yields has fueled expectations for higher inflation, over 80% of 48 economists said they were unconcerned a sustained rise in price pressures would dampen economic growth prospects in the coming year.Those concerns have been brushed aside by U.S. policymakers who are focusing on achieving and maintaining maximum employment and see inflation as a minimal risk.The central bank was expected to keep its supportive monetary policies intact over the next two years and Fed chief Jerome Powell was likely to reiterate that message at a press conference on March 17 following the central banks next policy meeting.At current levels, the Federal Open Market Committee does not seem very concerned about longer-term rates as they may still reflect the improved outlook for inflation and growth on the basis of new fiscal policy impulses, said Philip Marey, senior U.S. strategist at Rabobank.(For other stories from the Reuters global economic poll:)"}