{"text": "The Big 12 Conference will proceed with its fall sports season, the collegiate athletic league said on Wednesday, a day after two other Power Five conferences said they would postpone the upcoming football season.The Big 12, one of the most powerful conferences in U.S. college football that includes reliable favorites University of Oklahoma and University of Texas at Austin in its ranks, said it was confident sports could be conducted safely with enhanced measures to mitigate the risk of COVID-19.We are comfortable in our institutions ability to provide a structured training environment, rigorous testing and surveillance, hospital-quality sanitation and mitigation practices, said Commissioner Bob Bowlsby.Pac-12 and Big Ten said on Tuesday that they would each postpone their upcoming football seasons, citing the continuing coronavirus outbreak, with Pac-12 planning to host no sports competitions for the remainder of 2020 and Big Ten pushing back its entire fall sports lineup. Both have said they would evaluate the possibility of holding competitions in the spring.Ultimately, our student-athletes have indicated their desire to compete in the sports they love this season, and it is up to all of us to deliver a safe, medically sound, and structured academic and athletic environment for accomplishing that outcome, said Bowlsby.The upheaval across the multibillion-dollar college football industry has widespread ramifications for broadcasters, advertisers and small businesses in college towns across the country that rely on the weekly American cultural ritual for a steady stream of income.Big 12 said that conference play would start Sept. 26, with the Big 12 Championship Game tentatively scheduled for Dec. 12. Stadium capacity will be left up to individual schools to determine.The conference said that participants in high-contact sports - including football, soccer and volleyball - would be subjected to three COVID-19 tests per week.We remain vigilant in monitoring the trends and effects of COVID-19 as we learn more about the virus, said Texas Christian University Chancellor Victor Boschini, chairman of the conferences board of directors.If at any point our scientists and doctors conclude that our institutions cannot provide a safe and appropriate environment for our participants, we will change course.Rounding out the Power Five conferences, the Atlantic Coast Conference said Tuesday it will continue to make decisions based on medical advice, while the Southeastern Conference said it will continue to further refine our policies and protocols for a safe return to sports.The University of Oklahoma said it supported Big 12s decision, with one reported COVID-19 positive among its football student-athletes since players reported for training earlier this summer.There are risks in playing, in not playing, and in returning everyone to their homes, said team physician Brock Schnebel. We feel that for the student-athletes mental and overall well-being, it is best to let them continue in this setting.At a White House event on Wednesday on reopening schools, President Donald Trump reiterated his support for college football to resume play and said he spoke with Clemson University quarterback Trevor Lawrence and Ed Orgeron, head coach of the reigning national champion Louisiana State University team, which plays in the Southeastern Conference.We want to see college football, said Trump. Ill tell you who wants to do it, the players and the coaches, they want to do it."}