{"text": "Hot flows of ash, rock fragments and gas tore down the flanks of the La Soufriere volcano on the tiny Caribbean island of Saint Vincent on Monday after its most powerful explosion yet, four days after it first started erupting.La Soufriere erupted back into life on Friday after decades of inactivity, pumping dark clouds of ash some 10 km (6 miles) into the air and prompting an evacuation by sea and land of thousands of nearby residents.No deaths have been reported so far but a roughly a third of the island is off limits and airspace remains closed while power and water supply is intermittent in some communities. Several Vincentians told Reuters they were avoiding venturing outdoors as the ash was clogging the air and turning into what looked like cement in the rain, making it difficult to walk or drive. \"We are having a lot of ashfall, and it is hard to breathe sometimes,\" said Aria Scott, 19, a student living in the capital of Kingstown of Saint Vincent and the Grenadines. \"Im not going outside because I dont want to take the risk.\"Monday's explosion at around 4 a.m. local time was the most powerful to date, said Erouscilla Joseph, director at the University of the West Indies Seismic Research Centre, which warned the eruption could cause mudflows as ash was swept into rivers.\"We expect more explosions are possible in the next days to weeks,\" she said.Saint Vincent and the Grenadines, where just over 100,000 people live, had not experienced volcanic activity since 1979, when an eruption caused approximately $100 million in damages. The eruption of La Soufriere - which means sulfur outlet in French -  in 1902 killed more than 1,000 people.The Caribbean Disaster Emergency Management Agency said on Monday it estimated around 16,000-20,000 people would be displaced by volcanic activity, with 3,600 currently in shelters and others staying at the homes of relatives and friends.Neighboring countries, have pledged aid. A navy ship from Venezuela arrived on Monday bringing 20 tonnes of supplies and over 12 trained emergency medical personnel, the government said.Primary school teaching assistant Clea Westfield, 20, said her family was coping with the water supply outages because they had stocked up ahead of the eruption on Friday but were running low on food after panic buying emptied supermarket shelves over the weekend.I am just hoping that the explosions would ease down and get back to normalcy within the next month or so, she said. When we do get back, there will be a lot of cleaning to do."}