{"text": "ZURICH PolyPeptide Group, controlled by a foundation of Swedish billionaire adventurer Frederik Paulsen Jr., said Monday it plans to list a 40% stake on the Swiss stock exchange to finance the contract drug makers growth.The company, which makes ingredients for U.S.-based Novavax Incs, COVID-19 vaccine candidate, plans to list in the second quarter.It plans to place existing shares and a primary offering, with some proceeds to go for potential acquisitions.PolyPeptide is eyeing adjacent business areas, in not only oligonucleotides that can be used in genetic diseases as well as personalised neoantigen cancer immunotherapies, outgoing Chief Executive Jane Salik said in an interview.There could be acquisitions within our business area as well as in some of the adjacent areas, Salik, a board member and 25-year veteran of PolyPeptide based in California, said. It just gives us a lot more flexibility and opportunities to expand more rapidly.The company will get a new CEO, Raymond De Vre, after the IPO.It would join peptides maker Bachem, PolyPeptides biggest competitor, on the Swiss exchange.PolyPeptide has six facilities in Europe, the United States and India, with 900 employees and 2020 revenue of 223 million euros ($265 million).Paulsen in 2007 co-piloted a Russian submersible to the seabed below the North Pole and flew an ultralight aircraft from Alaska to Russia. reut.rs/3a4fTQWHe is not on PolyPeptides board, but will remain an owner via his Foundation Mamont, which also makes Siberian vodka and finances polar expeditions. Paulsen is Russias honorary consul in Lausanne, Switzerland.He is also chairman of Ferring Group, focused on reproductive health and gastroenterology, and is on cigarette-maker Philip Morris Internationals board.Credit Suisse, Morgan Stanley and BofA Securities are the IPOs joint global coordinators and bookrunners. Berenberg, Danske Bank and Zrcher Kantonalbank are acting as bookrunners. Rothschild & Co is advising PolyPeptide.($1 = 0.8414 euros)"}