{"text": "NEW YORK Viacom and CBS Chairman Emeritus Sumner Redstone, the media mogul who took his fathers movie theater chain and built it into an empire that included Paramount Pictures, CBS and MTV, has died at 97, ViacomCBS and National Amusements said on Wednesday.CBS and Viacom were combined from 2000 to 2006, when Redstone separated them in an attempt to unleash the value of Viacoms cable channels.His position as one of the worlds leading media moguls had begun fading in 2015 as those close to him began questioning his mental capacity. The long-running legal battle that ensued put him at odds with a former girlfriend and long-time confidante Philippe Dauman but reunited him with his daughter Shari, from whom he had been estranged.Shari Redstone said in a statement: My father led an extraordinary life that not only shaped entertainment as we know it today, but created an incredible family legacy. Through it all, we shared a great love for one another and he was a wonderful father, grandfather and great-grandfather. I am so proud to be his daughter and I will miss him always.The challenges to Redstones mental health resulted in him being replaced as executive chairman at CBS by Les Moonves and at Viacom by Dauman, whom Redstone would later drop from the trust that was to determine the direction of CBS and Viacom after his death.After legal and backroom wrangling that one observer likened to Game of Thrones, the Redstone family ousted Dauman from Viacom in August 2016, ultimately replacing him with Robert Bakish. Dauman had been among those questioning Redstones mental capacity and his influence had waned after Redstones daughter, Shari, started taking a more active role in his business.Since 2016, Shari pushed twice to merge CBS and Viacom. Shes also weathered a lawsuit aimed at diluting her familys control of CBS, and a sexual misconduct scandal at CBS, which resulted in the September 2018 resignation of CEO Les Moonves. Viacom and CBS re-merged in 2019.Shari Redstone and her son Tyler Korff will now take over two seats on a trustee board that controls the voting interest in an entity, National Amusements Inc, that holds the controlling stake in ViacomCBS, according to a source familiar with the matter.RISK TAKERRedstone was born on May 27, 1923, into a Boston family that owned a chain of drive-in movie theaters. He graduated first in his class at Boston Latin High School, went through Harvard in three years and worked with an elite U.S. Army unit that cracked Japanese codes during World War Two.After the war, he earned a law degree at Harvard and successfully pleaded a case before the U.S. Supreme Court. He joined National Amusements, his familys theater chain, in 1954, and became chief executive officer in 1967.Known for his blunt talk, Boston accent and audacious risk taking, Redstone was in his 60s in 1987 when he bought Viacom for $3.4 billion with mostly borrowed money. A few years later he acquired Paramount for more than $10 billion and added CBS to the portfolio in 1999 in a deal valued at $37 billion.Before his health deteriorated, Redstone had claimed to swim naked every day and always liked to be surrounded by beautiful young women.With a striking head of orange hair, Redstone is a vainglorious, old-school egomaniac who has an operatic personal life that has been largely kept out of the media undoubtedly because he controls so much of it, author Michael Wolff wrote in New York magazine in 2002.LIVING GHOSTAfter decades spent building his empire, Redstones participation at corporate events became minimal in 2014 and he spoke only a few words on earnings calls. Fortune magazine reported he attended his last board meetings that year and cited a witness who said he dozed and drooled during it, which raised the question about whether he was fit to run the company.Despite the concerns about his health, Redstone hung on to his chairmanship as long as possible. In June 2015, he told Vanity Fair in an email correspondence, You should know that I am never retiring!!!Later that year, the Wall Street Journal reported Redstone had suffered mini-strokes that made speaking difficult, although he remained mentally sharp.Former girlfriend Manuela Herzer challenged Redstones mental competence in a lawsuit filed in November 2015, referring to him as a living ghost.The suit was thrown out in May 2016 by a California judge who ruled that Redstones testimony had disproved Herzers claims. Herzer appealed the judges ruling, and the parties settled in 2019.Redstones death, which comes at a time the media landscape is enduring wrenching changes, thins the ranks of a group of media executives, including Rupert Murdoch and Ted Turner, who changed the world of news and entertainment with the companies they built.Redstone displayed a penchant for forcing out top executives, including Viacom President Frank Biondi; Mel Karmazin, the CEO of CBS; and Tom Freston, who was canned as CEO of Viacom after losing a deal to acquire the social media network MySpace to Murdoch.Asked in his last interview, in January 2014, with The Hollywood Reporter, about who might succeed him, Redstone exploded, I will not discuss succession. You know why? Im not going to die."}