{"text": "New England Patriots head coach Bill Belichick announced Monday night that he will turn down an invitation to the White House to receive the Presidential Medal of Freedom.Belichick explained his decision in a statement that did not mention President Donald Trump by name but alluded to the events of the past week, when a mob of Trump supporters stormed the U.S. Capitol. Five people, including a police officer, died.Recently, I was offered the opportunity to receive the Presidential Medal of Freedom, which I was flattered by out of respect for what the honor represents and admiration for prior recipients, Belichick said. Subsequently, the tragic events of last week occurred and the decision has been made not to move forward with the award. Above all, I am an American citizen with great reverence for our nations values, freedom and democracy.I know I also represent my family and the New England Patriots team. One of the most rewarding things in my professional career took place in 2020 when, through the great leadership within our team, conversations about social justice, equality and human rights moved to the forefront and became actions. Continuing those efforts while remaining true to the people, team and country I love outweigh the benefits of any individual award.Trump has drawn support from Belichick, Patriots owner Robert Kraft and ex-Patriots quarterback Tom Brady in previous years. During his 2016 presidential campaign, Trump boasted about a receiving a letter of support from Belichick.Belichick said Trump ran a tremendous campaign and called the media negative and slanted, Trump said at the time.According to Trump, Belichick wrote, Hopefully tomorrows election results will give the opportunity to make America great again.The support was in line with the Patriots owner, whose Kraft Group reportedly donated $1 million to the Trump inaugural committee.Trump recently reappointed Belichick to the Presidents Council on Sports, Fitness and Nutrition. The Patriots coach first was appointed in 2018.Belichick holds NFL records among head coaches for most Super Bowl victories (six) and most Super Bowl appearances (nine).--Field Level Media"}