{"text": "DETROIT Democratic presidential candidate Joe Bidens pick of Kamala Harris as his running mate showed his commitment to Black voters, African-American activists said, but they warned it would not guarantee him the support he needs to win.In choosing Harris to be the first Black woman on a major party presidential ticket in U.S. history, Biden signaled to activists he was heeding the lessons of 2016, when the first decline of Black voter turnout in 20 years helped Republican President Donald Trump win the White House.Some prominent Black political operatives had urged Biden to choose a Black woman as the country grappled with nationwide protests against racial injustice and as the coronavirus pandemic disproportionately hurt people of color.Black Americans - and Black women particularly - are the most loyal Democratic constituencies.Hes answering the call of millions of us, and its a really critical message to the base of the party: I see you, I hear you, said Aimee Allison, founder of She the People, a group that promotes women of color in U.S. politics.Allison had sounded alarms earlier this summer after she felt Biden had been too slow to engage Black communities and risked repeating mistakes from the last presidential election.She said she has been heartened that Bidens campaign has responded by hiring new, diverse staff members and reached out to Black elected leaders across the country.Other Black leaders said Harris, a U.S. senator from California, has a record of building a multi-racial coalition of voters that would boost Biden in the Nov. 3 election.They said she would drive turnout not only with Black voters but also suburban white women in crucial states such as Michigan and Wisconsin, where Trumps 2016 margins of victory were slim.There is going to be tremendous momentum as a result of this announcement, said Adrianne Shropshire, the executive director of BlackPAC, a super PAC focused on Black Democrats.But Shropshire said adding Harris to the ticket would not be enough, and that the Biden campaign still needed to accelerate its local outreach efforts given that early voting is beginning soon in some states.WORK TO DOMany Black activists and voters have said Bidens policies were the most important factor in winning their support, not the race of his running mate.Yvette Simpson, the Black chief executive of the advocacy group Democracy For America, said there was a disconnect in agendas between her group and the campaign.Liberal Democrats criticize both Biden and Harris on criminal justice issues, for example. They argue Harris failed to crack down on police misconduct as a former prosecutor and attorney general in California.They pan Biden for his vote as a senator in favor of a 1994 crime bill that critics see as a cause of current mass incarceration, and for his staunch opposition to the Defund the Police movement following the death of George Floyd, a Black man, in police custody in May.Hes so divorced from the community that he says he wants to serve, and hes not bold and willing to take on real challenges, said Simpson, who is based in Ohio, a state that could be competitive this fall.Simpson, speaking before Bidens choice was announced, said she has yet to see a strong presence from the campaigns field organizing and political engagement in her state, with only a few months to Election Day.Keith Williams, chairman of the Michigan Democratic Black Caucus, advocated for Harris and will help the campaign with outreach in his battleground state. He, too, has warned the campaign has a heavy lift to overcome a split between more moderate and older Black voters, and younger progressives.We have work to do, he said. We cant sit on our laurels."}