{"text": "Jones Day, the go-to law firm for U.S. President Donald Trumps election campaign, is under fire for representing Republicans in a lawsuit over Pennsylvanias extended deadline to receive mail-in ballots, with law students threatening to boycott the firm and a prominent anti-Trump group targeting it online.The firm defended its representation in a statement on Tuesday, saying the case raises important constitutional questions, pushing back on critics claims that its main goal is to sow distrust in the results of the election. A request by Republicans for the Supreme Court to hear the case is pending.But Jones Day distanced itself from legal challenges filed by Republicans after Democrat Joe Biden captured the presidency on Saturday, saying it is not representing any entity in any litigation challenging or contesting the results of the 2020 general election.Despite its statement, Jones Day has faced criticism, which some attorneys have spoken out against, arguing that a tenet of law firm business and the U.S. legal system is that even controversial clients deserve counsel.Orin Kerr, a professor at the University of California Berkeley School of Law, on Tuesday said on Twitter: Going after lawyers for representing unpopular clients in unpopular legal claims has a really bad history, and tends to not go well. Our legal system needs lawyers to take on unpopular clients.On Tuesday, The Lincoln Project, a group of anti-Trump Republicans, said it will spend $500,000 on ads targeting Jones Day and a smaller law firm working for Trump, following a Monday New York Times report citing dissent among Jones Days senior attorneys over its election work for Republicans.In tweets online, the group, co-founded by conservative lawyer George Conway, who is the husband of former Trump counselor Kellyanne Conway, has encouraged lawyers and clients to abandon Jones Day.A Twitter post by General Motors on Monday recognizing women leaders at the auto company has garnered more than 40 responses, including sever ties with @JonesDay or be prepared for a #BoycottGM and Are you a Jones Day client? Do you really want your name associated with them?Representatives for the companies did not respond to requests for comment.One law firm recruiter, who asked not to be named for fear of exposing the identities of clients, said three Jones Day attorneys were, as of Wednesday, looking to leave because their clients do not want to be associated with the firm.Law students from U.S. schools including Harvard and the flagship university for Jones Days home state Ohio are also mobilizing against the firm. Some are considering a boycott, said Molly Coleman, a 2020 Harvard Law School graduate and executive director of the law student and attorney network Peoples Parity Project.Jones Day did not respond to requests for comment on whether its work for Republicans and the Trump campaign has impacted its ability to recruit lawyers and retain clients.Both the Trump and Biden campaigns have marshaled armies of lawyers to fight election-related legal battles.Jones Day served as outside counsel for Trumps 2016 presidential campaign and again in 2020. The firm earned more than $4.5 million for campaign work between Jan. 1, 2019 and Aug. 31, 2020, federal disclosures show.Trump has declined to concede the election to Biden, instead bringing a flurry of lawsuits in close-run states to try to back his unsupported claims of widespread electoral fraud. [nL1N2HX04S] Jones Day is not listed as counsel on any of the post-election lawsuits."}