{"text": "SEATTLE Boeing Co delivered about 60% fewer aircraft to customers in 2020 than 2019 and less than one-third the deliveries of rival Airbus, the lowest in 43 years, company data showed on Tuesday.Tuesdays snapshot of orders and deliveries caps a year in which the coronavirus pandemic and the tail-end of a 20-month 737 MAX grounding after fatal crashes prevented embattled airlines from adding new jets to their sidelined fleets.Also, for a second month, Boeing handed over zero 787 Dreamliners to customers, as intensive inspections over recent production flaws compounded delays from the COVID-19 crisis.Jet deliveries are being closely scrutinized by investors as they generate much-needed cash during the coronavirus crisis.Overall, the U.S. planemaker delivered 39 planes to customers in December, including 27 737 MAX jets, one P-8 maritime patrol aircraft, and 11 widebodies.For the year, it delivered a total of 157 airplanes, down from 380 in 2019 and a record 806 jets in 2018.By comparison, Airbus posted stronger-than-expected deliveries of 566 jets in 2020, remaining the worlds largest planemaker, a title Boeing held from 2012 through 2018.Even so, deliveries at Airbus fell 34% from a record a year earlier, when travel demand was riding high on the increasing mobility of consumers in fast-growing markets across Asia.For jet orders, Boeing booked 90 orders in December, including a previously announced lifeline deal from budget airline Ryanair for 75 737 MAX jets. The best-selling narrowbody was cleared to resume service in November in the U.S. after a 20-month grounding order.Boeing also booked orders for seven MAX jets from unidentified buyers in December, and for eight 777 freighters from the courier arm of Deutsche Post AG DHL Express.But the fresh orders were eclipsed last month as buyers walked away from orders for 105 MAX jets and two 787s, Boeing said.For the year, gross orders were 184 jets, down 25% compared with 2019, and the lowest since 1994.Adjusted for stricter accounting standards, cancellations and orders where the buyer converted to another model, 2020 net orders for all Boeing models moved to negative 1,026 at year-end, from negative 1,048 in November.For the MAX, buyers canceled orders for some 641 jets, while Boeing removed from its backlog another 523 seen as unlikely to be filled when stricter accounting standards are applied."}