{"text": "Boeing Co (BA.N) unveiled a new order for its 737 MAX on Friday, pushing its shares up 6% as it renews efforts to recapture investor confidence following a two-year safety crisis.The deal to sell 24 of the 737-8 model to a backer of Canadian low-cost carrier Flair Airlines comes after Reuters reported it was poised to win another, much larger deal with Southwest Airlines (LUV.N).Shares in Boeing rose 6.2% to $267.86.Boeing has been trying to rebuild its image with passengers and airlines following the nearly two-year grounding of the MAX after crashes in Indonesia and Ethiopia killed 346 people.This week marked the second anniversary of the second accident, with a final investigative report expected any day.Boeing said Miami-based private equity firm 777 Partners, which has a stake in Flair Airlines, agreed to buy 24 737-8 airplanes with an option to purchase a further 60. Flair, which was recently relaunched by veterans of European budget giant Wizz Air (WIZZ.L), is now operating one plane for domestic flights. It said it would lease 13 of the 24 aircraft from 777 Partners starting this year.Reuters on Wednesday reported Boeing was on the verge of a deal to sell dozens of 737 MAX 7 jets to Southwest Airlines in potentially its largest 737 MAX order since the jets safety ban was lifted. Both deals would provide a much-needed injection of cash for the U.S. planemaker, which ended last year with more than $60 billion in debt and an historic loss of $12 billion.The coronavirus pandemic has further complicated the MAX's recovery by decimating demand for air travel and new jets.Ultra low-cost carriers, or ULCCs, are seen as the winners of the COVID-19 crisis as they offer a no-frills experience at low prices.They are pervasive in Europe's fragmented market, with Hungarian Wizz Air - a key Airbus customer - competing with the likes of Ireland's Ryanair, a top Boeing user like Southwest.They have grown more slowly in North America.  In December, Alaska Airlines (ALK.N) agreed in December to buy 23 737 MAX 9 jets and Ryanair (RYA.I) ordered 75 jets.At Southwest, Boeing was fending off a challenge from the newer Airbus A220, building on a position as the airline's exclusive supplier as Airbus struggles to reduce production costs for the Canadian-designed A220, industry sources said.Analysts have described Southwest as a must-win for Boeing and crucial to its broader recovery.Analysts caution it faces a list of other challenges, from production of its 787 Dreamliner to the delayed development of its 777X and financial overruns on a U.S. Air Force tanker."}