{"text": "Investors counting on the Bank of Japan to put a floor under stock prices may be disappointed as the current rout likely falls short of new thresholds set in March for its exchange-traded fund (ETF) buying, findings unveiled by the central bank show.As part of efforts to make its massive stimulus sustainable, the BOJ in March ditched a pledge to buy ETFs at a set annual pace and now promises to step in only \"when necessary.\"Since then, the central bank has bought ETFs on three days in March, once in April and not at all so far in May. That is well below its average appearance of six days per month last year.Some investors have blamed recent stock falls partly on the absence of the BOJ - the biggest owner of Japanese stocks after its massive ETF buying spree last year.The central bank did not buy ETFs on Tuesday even as the Nikkei index (.N225) and the broader Topix (.TOPX) both marked their biggest daily drops since Feb. 26.It also refrained from purchases on Wednesday, when the Nikkei shed 1.61% and the Topix fell 1.47%. While concerns about the recovery of Asian economies were driving stocks down, the BOJ has shown no signs of supporting the market, said Takatoshi Itoshima, strategist at Pictet Asset Management. \"That has disappointed investors,\" he said.VOLATILITY KEYThe BOJ has been buying risky assets, such as ETFs, as well as government bonds to shore up market confidence and pump in money to revive growth. It is part of the bank's massive stimulus programme aimed at firing inflation up towards its elusive 2% target.A closer look at an analysis the BOJ released in March in tandem with the new guidelines show the hurdle for buying ETFs has risen significantly, and focuses not just on the degree of price falls but on volatility.With estimates using two indicators - equity risk premium implied by option prices and yield spreads - the BOJ concluded that \"the more volatile the market and the larger the size of purchases, the larger the effects of ETF purchases.\"The analysis also pointed to survey results showing its ETF buying has a more positive effect \"during periods of market instability,\" such as the Brexit shock in 2016 and last year's coronavirus pandemic-triggered rout.\"It's effective to buy huge sums when markets are severely unstable,\" the BOJ said, signalling that it would take a crisis like last year's market crash to justify huge ETF purchases.BOJ Governor Haruhiko Kuroda may offer more clues on the bank's new approach on ETF purchases when he appears in parliament for a semi-annual testimony on Thursday.In the eyes of BOJ policymakers, markets are far from a crisis now, however, with volatility subdued and stock levels above trend.The Topix shed 7.5% on Wednesday from its latest peak two months ago, much smaller than a 32.4% slump triggered by the pandemic last March. The Nikkei volatility index (.JNIC) stood around 26, far below levels exceeding 60 in March last year.\"The BOJ could buy ETFs in small portions at times, but won't buy in a way that props up markets,\" said Izuru Kato, chief economist at Totan Research. \"It will face a test of its resolve to refrain from intervening in the market.\""}