{"text": "SARAJEVO Feb 12 Bosnian health workers received their first COVID-19 vaccine shots on Friday and officials in the countrys autonomous Serb Republic announced a mass inoculation drive for later this month.Bosnia had not received any vaccines until last week, when its first batch of Russias Sputnik V vaccine arrived, enabling it to start inoculating medical staff working in COVID-19 hospitals and departments in its Serb-dominated region.In January, the Balkan country announced plans to order Russian and Chinese-made vaccines, fearing deliveries ordered under the COVAX scheme for poor countries and from the European Union would be too little too late.Bosnia, which also comprises the Bosniak-Croat Federation that has not received any vaccines yet, has ordered 1.2 million vaccine doses under the COVAX scheme and nearly 900,000 from the EU. Officials hope the first doses will arrive later this month.We expect that Republika Srpska will receive the first quantity of vaccines for 100,000 people in the second half of February, and kick off a mass inoculation with the Russian vaccine, Serb Republic Health Minister Alen Seranic said in the regions main city of Banja Luka.The region has ordered 400,000 doses of the Sputnik V vaccine and Serbia has donated vaccines for 5,000 Bosnian Serb medical staff who will be inoculated in Serbia, he said.As of Thursday, Bosnia had recorded 125,123 cases of the new coronavirus and 4,868 deaths.In the Western Balkans region, inoculations have begun only in Serbia, which ordered the Pfizer/BioNTech , Sputnik V and Sinopharm vaccines. Serbia has also announced it could have the capacity to manufacture Sputnik V domestically by the end of the year..Montenegro, North Macedonia and Kosovo have not received any vaccines yet. Albania has received some. In Montenegro, municipalities along the Adriatic coast have been hit hard by COVID-19, with 118 new cases alone in the coastal town of Budva. It has reported 66,857 coronavirus cases and 861 deaths. (Reporting by Daria Sito-Sucic, with additional reporting by Aleksandar Vasovic in Belgrade; Editing by Timothy Heritage)"}