{"text": "STOCKHOLM Cecilia Braekhus will be looking to reclaim the five world titles she lost in a shock defeat by Jessica McCaskill in August of last year when the two meet in a rematch in Dallas, Texas on Saturday night as her battle for equality in boxing goes on.The 39-year-old hinted at retirement in the aftermath of that welterweight loss. But several months spent running at home in Norway and a seven-week camp in the U.S. have teed her up to re-conquer a sport she has dominated since turning pro in 2007.I feel great, this is a completely different situation, Ive had a normal camp and I havent had all these other things going on. Im just happy now and Im looking forward to Saturday, she told Reuters in a telephone interview.McCaskill, an investment banker from Chicago who spent a period of time homeless as a child, pulled off the greatest win of her career when she edged Braekhus on the judges scorecards to hand the Norwegian her first professional loss and take her WBA, WBC, IBF, WBO and IBO titles.It was a very special situation, I was stuck in training camp when the (COVID-19) pandemic broke out, so I hadnt seen my friends and family for about six months. Around that time I was just concerned about getting back to see them and get home and be with my people, Braekhus recalled.My head was definitely not in the right place, and I was also struggling with guilt - I took the choice to stay and train, rather than going home to check up on them, so there were a lot of other things going on outside what was happening in the ring.Braekhus said that the sport had changed a lot since she won her first world titles in 2009, with women now able to earn a lot more money, but added that there is still a long way to go to achieve equality.Promotion is the key. It needs to be a good opponent, and good marketing and promotion behind it, she said. This is up to the promoters and TV.We can do what we do on social media and different stuff, but without the promoters and the television behind us, it really doesnt matter that much.Braekhus maintains that boxing could learn from the Ultimate Fighting Championship (UFC) mixed martial arts organisation when it comes to marketing female fighters.We have to be honest, the guys (in boxing) are definitely pushed more, even when they have female fighters like Claressa Shields.The UFC, youve seen what they have done with their female fighters like Ronda Rousey and Holly Holm - Id say the UFC is a very good measurement for how it should be with promoting, Braekhus said, adding that she has no plans to switch to MMA.When she enters the ring on Saturday, Braekhus says she is doing so for no-one but herself.My legacy is already done, its already written. This is just for me - I need to get my belts back, she said."}