{"text": "Coronavirus outbreaks had affected their workers while running operations at full steam.Brazil trails only the United States as the worlds coronavirus epicenter. Brazilian President Jair Bolsonaro has sought to play down the severity of the pandemic, however, even dismissing it at one point as a little flu.Randon has only half of its workers going to its main plant, a spokesman said. He acknowledged a small number of its workers contracted COVID-19 but said they were quarantined even before testing positive.The company has acquired a number of coronavirus test kits, a thousand of which it donated to the factory town of Caixas do Sul, where most of its workers live, the spokesman said.Some workers feel safer inside the company than in the outside world, said Daniel Ely, who heads human resources at Randon, where operations started gradually reopening in April.Marcopolo is staggering shifts and bringing workers to the factory in half-filled buses. The reduced workforce is partly due to health concerns, but also a consequence of reduced demand.Embraer has roughly a third of its workers going to its plants, another third working from home and a third furloughed. About 10 employees in Brazil and 10 abroad have contracted the coronavirus, the company said earlier this month.Bus sales in Brazil plummeted 81% in April and 61% in May compared to a year earlier, according to automakers association Anfavea. Embraer, meanwhile, is dealing with customers seeking to defer plane deliveries until next year or later because of the falloff in global air travel.At the Marcopolo plant in the southern Brazilian state of Rio Grande do Sul, workers are constantly monitored to verify they are adhering to social distancing.Weve installed cameras inside the plant to avoid crowding in any company space, including in recreational and eating areas, said Rodrigo Pikussa, who heads Marcopolos bus business.Many automakers have resumed production, but with auto sales last month at 30% of their normal levels, there is now also more space in the factories than before to keep workers safe.But we are coming back to work with protocols based on international standards, that our companies learned in countries like China or Germany."}