{"text": "Former Brazilian Health Minister Eduardo Pazuello failed to take up Pfizer Inc (PFE.N) on its offer of COVID-19 vaccines last year because he believed Brazil should rely on British and Chinese shots made in the country, two sources told Reuters.Hundreds of thousands of deaths later, with Brazil badly short on vaccines, the three-star army general has been summoned by a parliamentary inquiry looking into the mishandling of the deadliest coronavirus outbreak outside the United States.His testimony could be so damaging to far-right President Jair Bolsonaro that the government is trying to avoid his appearance before the Senate committee next Wednesday, where senators will grill him on the delay in securing vaccines.Two sources in the government with knowledge of the matter said the thinking in Pazuello's office last year was that Brazil would be able to guarantee enough vaccines through a transfer of technology from AstraZeneca PLC (AZN.L) and China's Sinovac Biotech Ltd (SVA.O) to public laboratories in the country.When Pfizer first approached the Health Ministry in August, Pazuello thought Brazil would not need a wide range of vaccines and did not even meet with Pfizer executives to discuss their offer, the sources said on condition of anonymity.\"When the contract with AstraZeneca was signed, there was an optimistic view that Brazil would be able to produce its own vaccines and there was no need for Pfizer,\" one source said.The Health Ministry did not respond to a request for comment on the matter.Pazuello did not respond to questions from Reuters. He missed his first scheduled appearance before the Senate committee last week, saying he was in quarantine due to contact with two people with COVID-19.Pfizer made its first proposal to sell vaccines to the Brazilian government in mid-August last year, according to a company statement, with a plan to deliver the first of 70 million doses by December. But talks never got off the ground.A Health Ministry statement in January attacked Pfizer's terms and criticized the small volumes of vaccines offered for immediate delivery.It wasn't until March 18 that Brazil signed its first contract with Pfizer for 100 million vaccines. By then, Pazuello was on his way out, as deaths grew exponentially in an aggressive second wave of infections in Brazil.Production problems at the federal government's Fiocruz biomedical center and delays in receiving essential inputs from China at Sao Paulo's Butantan Institute have put Brazil well behind schedule in delivering vaccines. Just 11% of adults have been fully vaccinated.The first doses of the Pfizer vaccine arrived in Brazil on April 29, more than eight months after the company's first offer. A second contract for an additional 100 million doses was signed on Tuesday for delivery in the last quarter of this year."}