{"text": "RIO DE JANEIRO (Thomson Reuters Foundation) - Before they can even start the grim task of tallying coronavirus deaths in Brazils favelas, Ana Paula Sales and her team must negotiate access with the drug traffickers and armed militias that run them.It is dangerous work - on one visit to a favela in Itagua, a town in Rio state, the all-female team had to run for their lives after getting caught up in a shoot-out between drug gangs and police.Sales sees an accurate count of victims as a crucial part of the fight against the pandemic in a country facing a brutal surge in COVID-19 deaths.Last week the daily death toll in Brazil topped 4,000 for the first time, nearing the single-day record that the United States registered on Jan. 20 of 4,405 deaths.But those trying to count the deaths in Rios favelas believe the true toll is even worse, with many cases and deaths going unrecorded by officials.We are in a state of war, said Sales, who has lost close relatives and many friends to the disease. The counting never stops.Government data show 226 COVID-19 deaths in the whole of Itagua since the pandemic began, yet Sales and her team counted 212 deaths in her favela of Engenho alone.The 51-year-old is one of several contributors to a dashboard launched last year by Catalytic Communities, a non-profit that aggregates coronavirus data from Rios favelas to try to give a truer picture of the devastating impact.Catalytic relies on government information and news reports, but also on a group of favela-based volunteers, usually local leaders. A year on, many of them are feeling the strain.Its nerve-wracking work, Sales told the Thomson Reuters Foundation by phone. We need to go in very strategically and with focus.STIGMABrazil is grappling with a coronavirus outbreak that is spiralling out of control, with hospitals overwhelmed and running low on critical supplies.Douglas Heliodoro gave up counting coronavirus deaths in his Brazil favela after residents stopped responding to his surveys, fearing they would have to quarantine.For many of Rio das Pedrass more than 60,000 people, having to stay home rather than going to work would mean not being able to put food on the table.They fear the stigma, said Heliodoro, a community leader who also runs a local charity. Theres a lot (of under-reporting), but we hear through word of mouth that lots of people are dying.That is the reality facing most of the about 1.3 million people who live in Rios favelas, where COVID-19 infection rates are feared to be higher due to poor nutrition, cramped housing and ill health.Last month, Catalytic and dozens of other favela charities published an open letter saying residents should get priority for vaccines.Theres a lot of under-reporting, and its higher in favelas, said Theresa Williamson, head of Catalytic Communities. With the data we have ... we already know that (favelas) are more vulnerable.The Catalytic dashboard has information from 230 of the about 1,000 favelas in the state and shows 3,687 dead. But many are from the early months of the pandemic, said Williamson.She said Catalytics use of government data had improved, but that many researchers had switched focus from counting victims to feeding the needy and raising awareness.In January the situation worsened when a government subsidy ended, increasing the demand for food handouts.Heliodoro is among those now focused on helping by handing out food staples and spreading awareness about the vaccine.Im in anguish, because theres so little I can do, he said.NOT JUST A NUMBEROne place where deaths are still being counted is Mar, a complex of 16 favelas home to more than 140,000 people where Brazils leading public epidemiological institute has opened a free testing center in partnership with local non-profits.The center makes Mar one of the few favelas with an accurate assessment of coronaviruss toll on the population, said Daniele Moura, who coordinates the project for Redes da Mare, one of the non-profits involved.It currently leads Catalytics dashboard in number of cases, with 3,419 confirmed, and 173 deaths.Having an accurate count, however, does not dull the pain of those who lost someone to the disease, said Moura, whose father died from COVID-19.I have a great personal difficulty seeing this number as just a figure, said Moura. When I see it, I remember my dad is among them."}