{"text": "BRASILIA Brazil is amassing a record debt that has evoked memories of crises past in South Americas largest economy, but some economists say rock-bottom interest rates and low foreign debt mean the government can continue to spend its way out of recession.The debate in Brazil about getting the public finances in order is cranking up, with a key government fiscal rule looking set to be broken.Brazil is on course to post a record 800 billion reais ($115 billion) budget deficit this year due to crisis-fighting expenditure, swelling the national debt to a high of around 95% of gross domestic product - an exceptional level for an emerging market economy.Barring a dramatic surge in revenues or an expenditure squeeze, the spending cap - which limits growth in non-obligatory government outlays to the rate of inflation - will be broken next year.The government will present its 2021 budget later this month. The ceiling is 1.485 trillion reais ($275 billion), only 31 bln reais more than this year. That leaves hardly any room for maneuver in normal times, never mind the extra social, health and investment spending needed in a pandemic.Economy Minister Paulo Guedes and many economists say the cap, passed during the presidency of Michel Temer in 2016, is the foundation on which Brazils fiscal credibility is built. The belief that it will not be breached has compressed market-based interest rates and given the central bank room to cut official rates to a record low of 2.00%, they say.But several market-based rates show scant evidence of these fears, and the case for maintaining or even increasing deficit spending to mitigate the biggest economic crash on record is compelling, many others say.Congress already passed an emergency war budget this year worth around 600 billion reais, which is exempt from normal budget rules like the spending cap.Just as the market has learned to live with an 800 billion reais deficit, it can learn to live with a conversation about modifying the spending cap. Its inevitable it will be changed in some way, said Jose Francisco Goncalves, chief economist at Banco Fator in Sao Paulo.Crucially, just 3 percent of Brazils total $1.45 trillion debt is in foreign currency, according to the Bank for International Settlements. That is one of the lowest levels in emerging markets - leaving the government less exposed to currency fluctuations than in the past.Within that, over 90% is owed to its own citizens, according to Treasury figures, meaning the government is also less exposed to changes in sentiment among foreign investors.Graphic: Brazil debt composition - BIShttps://fingfx.thomsonreuters.com/gfx/mkt/rlgvdnbaovo/BISEM1.pngGraphic: Brazil foreign debt - BIShttps://fingfx.thomsonreuters.com/gfx/mkt/bdwvkemllvm/BISEM2.pngAnd if a debt crisis were to arise, Brazil has a warchest of $334 billion in foreign currency reserves to fight it. That is more than 20% of GDP, high by international standards.As long as Brazilians are prepared to lend to the government - and there is no evidence to the contrary - it can bend its rules, help millions of its citizens through a savage recession, and provide much-needed economic stimulus.People said there was no money. Then 600 billion reais appeared from nowhere, and its all right. Money creation is just a question of what it is for, said Goncalves.RETHINKING DEFICITSSome analysts say the fixation with deficit and debt reduction is a legacy of crises past. As recently as the 1990s Brazil experienced hyperinflation of 7,000%, and a painful currency and debt crisis.People in Brazil think that big deficits will create a confidence crisis which will lift short-term interest rates and then you cant finance your budget. But what we are seeing is the opposite, said a budget analyst in Brasilia, speaking on condition of anonymity.People think big deficits will create inflationary pressures. But this doesnt make any sense because right now we have massive unemployment and huge spare capacity, he said.For many economists, Brazil is part of the global trend since the Great Financial Crisis of tepid growth, low inflation, and plunging interest rates, despite ballooning budget deficits.The real yield on Brazils five-year inflation-linked bonds is just 1.55%, less than pre-coronavirus levels of over 2%. The real interest rate on January 2022 rate futures, accounting for market inflation forecasts, is negative. The real benchmark Selic rate is also now negative.Graphic: Brazil real yield - 5-yr linkerhttps://fingfx.thomsonreuters.com/gfx/mkt/xlbvgbxzbpq/5YLINKERREALYIELD.pngThis suggests financial markets believe the record budget deficit poses little inflation, interest rate or government financing risk, despite the public and often noisy debate.The government insists Brazil cannot afford to keep the fiscal taps running. But it may be that it cannot afford not to, according to a working paper by PhD student Marina Sanches and professor Laura Carvalho at the University of Sao Paulo, which looks at current fiscal policy in the wake of the 1997-2018 period.They found that if government investment had been held constant since its fiscal consolidation plan started in 2015, GDP in 2017 would have been 1.4% higher. If federal investment had expanded at the same average pace as in the 2006-10 period, GDP would have been 6.7% higher.Output would be 2.5% lower if social benefits had not grown in 2016 and 2017 due to tight spending controls, they said.($1 = 5.45 reais)"}