{"text": "SAO PAULO/CHICAGO Harvesting delays in Brazil, the worlds top soybean producer, are prompting buyers led by China to rely on rival exporter the United States for longer than usual in 2021, according to government data and traders.Sustained demand for U.S. soybeans is accelerating an historic drawdown of U.S. supplies of the oilseed and could further drive up soybean prices at a time of rising food inflation as countries hoard staples during the pandemic.Concerns over tight global soybean supplies after China dramatically increased purchases in recent months ignited a 4.5% U.S. soybean futures rally last month to a 6-1/2-year high.Brazil usually harvests its soybeans in the first three months of the year, marking an end to the dominance of U.S. exports. However, that process has been delayed by a drought last year that slowed plantings, and rainfall at harvest time.The countrys shipments of soybeans in January were 28 times lower than a year before at 49,500 tonnes, an amount insufficient to fill up a single vessel, Brazilian trade data showed.In contrast, the United States, its biggest rival in global markets, inspected some 8.9 million tonnes for shipment in the month, the highest on record, according to United States Department of Agriculture (USDA) data.Anec, a Brazilian group representing grain exporters like Cargill and Bunge, confirmed current shortages in Brazil may give competitors an edge.We assume this is happening, Anec director Sergio Mendes said by telephone, adding Brazils low soy availability is elongating the U.S. export window.In February Brazilian soy shipments could be as little as 6 million tonnes, down from 8.5 million tonnes initially expected, Anec has said.Brazils supplies are only expected to normalize by March, one large trader told Reuters.That could spell chaos at Brazilian ports, as by March and April soybeans will be competing with sugar for finite loading capacity.Speaking on condition of anonymity, the trader said it is tapping grain suppliers in the United States and Argentina. Much of the burden will fall on the United States, as Argentinas soy harvest does not start until March.Importing countries, particularly China, have been boosting purchases of grains and oilseeds during the pandemic to guard against shipping disruptions or further price increases in agricultural commodities.China buys grains and oilseeds from South and North America to make livestock feed. It is currently rebuilding its hog herd after a deadly pig disease killed millions of animals.The nearly 5.6 million tonnes bound for China from U.S. ports last month represented the largest-ever January U.S. soy shipments to the worlds top importer of the foodstuff.January shipments to other top U.S. soy buyers Mexico and Egypt were also the largest on record, USDA data show.U.S. soybean stocks are expected to shrink to the smallest in seven years just before the northern hemisphere harvest ramps up in September.At that point the country is expected to have just 9.5 days worth of soybean supplies, the tightest on record and down sharply from the seven-week supply held at the same point last year, according to a Reuters analysis of USDA data.Despite the delay to its harvest, Brazil, which sells the bulk of its soy to China, is poised to reap a record 133 million tonne crop in coming months.In an indication it thinks any shortfalls from a slow start to Brazils harvest will be made up by Sept. 1, the USDA this week left its 2020/21 projection for Brazilian exports unchanged, while raising its U.S. soybean export forecast by 550,000 tonnes.However, with strong demand and uncertainty surrounding logistical issues at ports, it remains unclear whether that will ease upward pressure on prices, according to analysts and traders."}