{"text": "Brazil will run out of raw materials to produce Sinovac Biotech Ltd's (SVA.O) COVID-19 vaccine by Friday, as a supply shipment has been held up in Chinese export clearance, authorities in the state of Sao Paulo said on Wednesday.Sao Paulo Governor Joao Doria blamed the delay - the second China export clearance to hit production this year - on \"diplomatic ill-will\" and said the federal government should apologize to Beijing for its harsh criticism of China.  read more Beijing-based Sinovac sends the vaccine's active ingredient to Brazil for the Butantan biomedical center, which is backed by the Sao Paulo state government, to fill and finish in vaccine vials.Butantan Director Dimas Covas told a press briefing on Wednesday that China would not clear a cargo of active ingredients for shipment to Brazil by May 13, as previously expected. Covas said there was no clear date for when Chinese authorities would approve the shipment.Butantan will deliver 1 million doses to the Health Ministry on Friday and after that will need to halt production due to the lack of raw materials, Doria said.President Jair Bolsonaro's office did not immediately reply to a request for comment. The Chinese Embassy in Brasilia declined to comment.The right-wing Bolsonaro has periodically criticised China since campaigning for the presidencyin 2018, using rhetoric similar to former U.S. President Donald Trump.Brazilian lawmakers have strongly criticized Bolsonaro's administration for its handling of the pandemic, including alleged missteps in acquiring vaccines. A special Senate committee is conducting a probe into the pandemic response.Critics say missteps include failing to secure vaccines from Pfizer (PFE.N) earlier. Sources told Reuters that former Health Ministry Eduardo Pazuello, who stepped down in March, saw no need for the Pfizer vaccine because he believed Brazil could rely on Sinovac and AstraZeneca (AZN.L) vaccines alone.  read more Pazuello and the Health Ministry did not respond to requests for comment."}