{"text": "LONDON/NEW YORK (Reuters Breakingviews) - The largest acquisition in AstraZenecas history is bold as well as big. The British drugmaker on Saturday announced it is buying U.S biotech Alexion Pharmaceuticals, which makes treatment for a rare immune disease, for $39 billion in cash and stock. Competitive challenges and a wayward M&A strategy have held down the targets price. Thats an opportunity and a threat for AstraZeneca Chief Executive Pascal Soriot.Despite recent speculation about big mergers, the Alexion deal is probably not what shareholders were expecting from AstraZeneca. Soriot is busy pushing the groups fast-growing cancer business and rolling out a vaccine for Covid-19. His target specialises in diseases that affect a small number of people, not one of the $142 billion companys key strengths.Yet AstraZenecas timing looks smart. Its stock is trading at a hefty 21 times expected earnings for next year, according to forecasts compiled by Refinitiv, giving it a powerful acquisition currency. The chances of healthcare reformers putting serious pressure on drug prices are fading after the recent U.S. election failed to hand Democrats decisive control of the Senate.Alexions unpopularity could also be an opportunity. Though Fridays closing stock price valued the company at just 9 times forecast 2021 earnings it is still growing quickly, thanks in particular to its expertise in treating paroxysmal nocturnal hemoglobinuria, a disease in which the immune system damages blood cells. It is also throwing off cash.Analysts expected standalone Alexion to generate almost $4 billion of operating profit by 2023, according to Refinitiv data. AstraZeneca reckons it can add $500 million merger of synergies, most of which are cost savings. Apply Alexions 16% tax rate and Soriot will earn a return on his outlay of just below 10%, after deducting expected net cash of $400 million by the end of this year. Thats ahead of Alexions cost of capital, which Morningstar estimates at 8.8%.Alexion is cheap for many reasons. It has a history of questionable deals, among them spending $8.4 billion on Synageva in 2015. Alexion thought it was buying a $1 billion plus drug annually, but revenue ended up about a tenth of that. There are also longer-term concerns. Cash cow Soliris, which represents about two-thirds of current revenue, is threatened by new medicines from Roche, as well as looming competition from cut-price duplicates.Yet Alexion may be better able to manage those pressures as part of AstraZeneca. The larger UK group may also open markets such as China. And Soriot hopes Alexions technology will work in other less niche conditions. If hes right, trading a rich stock for a depressed one could be a smart move."}