{"text": "LONDON/NEW YORK/MILAN/MELBOURNE (Reuters Breakingviews) - Corona Capital is a daily column updated throughout the day by Breakingviews columnists around the world with short, sharp pandemic-related insights.LATEST- Disney+ plusSCREEN TIME. Walt Disney owes a depth of gratitude to Hamilton and baby Yoda. The Magic Kingdom said on Thursday that over 73 million people subscribe to its flagship streaming product Disney+, which it launched nearly a year ago. The $250 billion media giant is closing in on its own five-year forecast of 90 million subs, and in this short time has climbed to represent more than one-third of Netflixs global customer base.That helped buffer an 82% plunge in the companys operating profit for the quarter ending Oct. 3. Shuttered theme parks and movie theaters weighed down the results. But the raging pandemic and fresh European lockdowns may help Disney reach its forecast target one year out of the gate. (By Jennifer Saba)UPSTREAM DOWNER. The International Energy Agency is the latest Covid-19 vaccine party-pooper. Brent crude prices have bounced 15% to $43 a barrel since the start of the month, helped by Mondays news of Pfizers coronavirus jab. Yet the IEAs latest monthly update doesnt foresee a significant impact on oil markets in the first half of 2021.For prices to sustainably rise, global demand needs to return from 2020s daily estimated 91 million barrels back towards 100 million. The IEA doesnt see that happening until late next year, and recovering production in the United States, Libya and Iraq means supply will jump too. Meanwhile, while the so-called OPEC+ group of oil-producing states are sticking to supply cuts hastily agreed when Covid-19 hit in April, theres no guarantee this will last. Throw in uncertainties over exactly how the vaccine will be rolled out, and the IEAs caution is deserved. (By George Hay)NATIONWIDE NETFLIX. Americans may have just voted for a nationwide lockdown. A member of President-elect Joe Bidens coronavirus taskforce, Michael Osterholm, said a four-to-six week shutdown would pay huge benefits and minimize damage prior to widespread vaccine availability. There has been a massive spike in new cases, with over 144,000 on Nov. 11, according to The Covid Tracking Project, or around six times the daily rate at the start of September.A coordinated U.S. lockdown hasnt been tried, partly due to cost. As Osterholm points out, the government can borrow cheaply thanks to the personal savings rate rising to more than 14%. He suggested the state could fund all lost wages, small business losses and support local, city and state governments.Whether the Senate plays along may depend on runoff elections in Georgia. But given the acceleration in new cases, lockdowns of some sort are inevitable  a well-funded one would at least reduce deaths and minimize economic pain. (By Robert Cyran)LOOKING FORWARD. Some things are outdated even before they are released. Thats the case for UK GDP data, which on Thursday showed the economy grew by a record 15.5% in the third quarter compared with the previous three months. New restrictions on activity have been announced since then and what matters is how sharply GDP will fall back in the last quarter.The relapse wont be as bad as the downturn caused by the first national lockdown. But theres little room for optimism. The economy remains nearly 10% smaller than it was at the end of 2019 and a separate monthly report revealed it expanded more slowly than expected in September and that growth in all the main sectors has slowed from June peaks. While extra fiscal and monetary stimulus measures were announced earlier this month, the economy is likely to need even more help to recover its pre-Covid-19 stature. (By Swaha Pattanaik)BLING AMBITION. The pandemic is prompting Burberry to ditch its markdown addiction. Encouraged by a return to sales growth in October, the $9 billion UK maker of 2,000-euro trench coats said it was cutting the amount of products sold at a discount. Thats encouraging. Rival Prada, which like Burberry is in the middle of a turnaround, took a similar approach earlier to bolster its profit margins. The Italian group sold 99% of its products at full price in September against 82% for Burberry, a Bernstein analysis of bling online platforms shows.Prada is forecast to report a 30% EBITDA margin at the end of the next fiscal year against 24% for Burberry, Refinitiv data show. The shift will inevitably dent revenue at first. But investors may not mind in a year already hard-hit by Covid-19. The groups ability to shove more full-price clothes and bags on customers will give a measure of Burberrys luxury status. (By Lisa Jucca)DIVIDEND DIVIDE. Generali and Legal & General are highlighting the challenges of paying dividends in a pandemic. On Thursday, the 21 billion euro Italian insurer said that although it had increased its capital ratio to 203%, up 9 percentage points since the half-year, it would delay paying a dividend. Meanwhile, L&G said its final dividend would be flat this year and investor payouts would fall short of expectations. It instead plans to increase payouts by 3% to 6% annually over the next five years. The two insurers shares fell on the news.Investor disappointment is understandable. L&G CEO Nigel Wilson had boosted expectations earlier this year by paying a 750 million pound dividend despite caution from the Bank of England. Investors had expected the same aggressive approach when it came to the final dividend and growth ambitions. Generali, by contrast, had no choice but to stick to its regulators ruling. But as its capital stores build, it may play tortoise to L&Gs hare. (By Aimee Donnellan)SPLITTING WIRES. Australian telecommunications titan Telstra is trying to find a silver lining from the pandemic. After suspending cost-saving job cuts, the $26 billion company said on Thursday it would break into three parts with an eye toward selling its towers division. The restructuring should unlock value as boss Andrew Penn intends.As it stands, Telstra trades at less than 10 times expected EBITDA for the next year. The companys towers operation and separate infrastructure unit  which houses fibre, undersea cables, and more  should each fetch higher multiples, especially as the shift online means customers have deepened their appreciation of mobile and internet services, enhancing the value of the underlying infrastructure. On the other hand, the so-called ServeCo business, which develops new products, is probably a drag on the valuation. It will take over a year to complete the carve-up, but Telstra is sending the right signal. (By Jeffrey Goldfarb)"}