{"text": "NEW ORLEANS (Reuters Breakingviews) - The United States has achieved the feat of having too many banks and yet too few people with bank accounts. It has nearly 5,000 commercial lenders, yet 5% of households are unbanked according to government data. Helping these Americans will advance President Joe Bidens drive to boost the economy and especially the incomes of the poorest.The share of households with no bank account has fallen since 2011, according to Federal Deposit Insurance Corp data, but is still five times higher than in developed countries like France and Germany. And national numbers mask big disparities. One in seven Black U.S. households is unbanked versus just one in 40 white households.Its an old problem with new urgency. Biden wants to close wealth gaps through measures like a $3,600 payment to families with children aged under 6. That is harder to achieve when 7 million people languish outside of the financial system. Some unbanked families who received checks in 2020 could have paid $195 or more to cash them, according to research for Brookings by the Financial Health Network.Apps and innovation help narrow digital gaps, as Treasury Secretary Janet Yellen suggested on Wednesday, but wont erase them. Almost 15% of those with incomes below $15,000 dont have access to a mobile phone, the FDIC found in 2019. Fee-free basic bank accounts work too, but the United States lags Britain, where big lenders are legally obliged to offer such products.Banks are taking some action. JPMorgan plans to open its first branch in Mississippi this year, having previously neglected Americas most unbanked state. But adding more tellers isnt a panacea. One-third of the unbanked say they dont trust lenders. Decades of discriminatory lending will make it difficult to change this. One way around is for large banks to invest in and alongside small, local ones. Southern-based Hope Credit Union has, for example, received funding from Goldman Sachs, Bank of America and even Netflix.Biden can pursue more dramatic options if the gap doesnt close quickly enough. His economic advisers have already proposed giving every U.S. resident a free account at the Federal Reserve. That would require a change to the law. Profit-seeking lenders, which would lose deposits as a result, would hate the idea. All the more reason for them to fix the problem themselves."}