{"text": "NEW YORK (Reuters Breakingviews) - A three-way bidding war for laser maker Coherent will incinerate value. A $6.4 billion takeover offer from optical component maker II-VI is the U.S. companys third in a month. Original bidder Lumentum looks outgunned, since II-VI and second bidder MKS Instruments have more strategic fit and can theoretically afford to offer more. But Coherent is already overpriced, and passions are kicking in.II-VI, pronounced two six, on Friday offered $130 in cash and just over 1.3 common shares for each Coherent share, or about $260 a share based on Thursdays close. Thatll leave shareholders with more cash up-front, but 23% of the new company, compared with 25% after a MKS deal. MKS, which makes chip-manufacturing parts like Coherent, offered about $240 in cash and stock, or a bit under $6 billion.The newest bidder has identified synergies of $200 million. Tax these and put them on a multiple of 10, and they are worth perhaps $1.6 billion. Lumentum only identified $150 million worth, which are worth perhaps $1.2 billion. But Lumentum could use the deal because a big chunk of its business is in communications and buying Coherent would raise its exposure to the fast-growing chip industry.That means the ball is now in Lumentums court, and it has to choose whether to raise its bid. While it wants the diversification and Coherent has scarcity value, Lumentums investors werent enamored with the prospect of a purchase, sending the companys stock down sharply when the initial offer was made. On Friday Lumentums stock rose again, perhaps because investors thought it would lose the bidding.While the bids by II-VI and MKS probably are partly defensive and, to keep Coherent out of rivals hands, and perhaps scale will wring more out of Coherent, the price already looks high, and there may be antitrust concerns. Consider that Coherents $6.4 billion market capitalization on Friday is now $2.5 billion higher than before the first bid emerged. Thats more than the value of savings any buyer, including II-VI, has identified. The victors shareholders are the one who will get singed."}