{"text": "LONDON (Reuters Breakingviews) - Renault Chief Executive Luca de Meo is relying on French lan to boost the Gallic companys dim prospects. On Thursday he will launch an awkwardly named Renaulution to boost earnings. However, any recovery is hampered by lopsided relations with Japanese partner Nissan Motor. Selling part of Renaults 43% stake in the Japanese carmaker would help smooth an uneven power balance and rev up cost savings.Relying on vintage fashion is a tried and tested strategy. As a protg of former Fiat Chrysler Automobiles boss Sergio Marchionne, de Meo helped successfully relaunch the Italian marques epochal Fiat 500. He now hopes to do something similar to Renaults iconic Super Cinq model from the 1980s, Reuters reported last week.The loss-making company could certainly do with a makeover: its shares are down 35% over the past two years, while the STOXX Europe 600 Automobiles index is up a tenth over the same period. De Meo also faces a powerful new European rival in the fusion of Peugeot and FCA, inelegantly christened Stellantis. The group has pledged at least 5 billion euros in synergies from the merger over the medium term. By contrast, Renault and Nissan, which sold over 800,000 more vehicles than their Franco-Italian rivals in 2019, are aiming for combined savings of 4.4 billion euros.A full-blown merger between the French and Japanese groups, which would produce greater benefits, is unlikely. But closer integration could give de Meos bottom line a boost. A necessary first step would be to smooth the alliances uneven power dynamic, which is underpinned by cross-shareholdings. When Renaults stake in Nissan rose above 40% in 2001, a proviso in French law stripped the Japanese group of voting rights over its Renault holding, currently at 15%. If Renault sold some Nissan shares to dip under the threshold, it would help restore its partners influence, buy Japanese goodwill, and raise a cool 727 million euros at the current market price.The French state, which still controls the largest chunk of Renaults votes, would have to support a sale. But even after such a move it would remain the most influential shareholder. De Meos new vintage look may be a good start. But he needs some governance grease to really draw investors applause."}