{"text": "SAN FRANCISCO (Reuters Breakingviews) - Donald Trump started the trade war with China, but the broader fight between Washington and Beijing will outlast him. Thats one of the main takeaways from Superpower Showdown. The book reminds readers that U.S. anger at the Peoples Republic predates the current occupant of the White House. Much of the very public tariff row is familiar. But miscalculations on both sides are a sober warning for future policymakers.Authors Bob Davis and Lingling Wei provided some of the best real-time reporting about the trade battles for the Wall Street Journal. That makes it harder for them to break new ground about Trumps tariff one-upmanship against Chinese President Xi Jinping. The former reality TV star also provided a running commentary about the ups and downs of the talks on Twitter.Still, the book provides some insights on negotiating tactics. U.S. Trade Representative Robert Lighthizer at one point quoted Confucius to indicate that the United States would only be satisfied when Chinas actions matched its words. Xi also asked Japanese Prime Minister Shinzo Abe about his rounds of golf with Trump, which helped the two leaders develop a rapport.The accounts of the broader economic forces at work in the two countries before Trumps election are also illuminating. Bill Clinton flirted with being tough on China when he entered the White House in 1993. The 1989 Tiananmen Square crackdown was still fresh, and the new president wanted to tie Americas economic policy to Beijings human rights record. That affected the potential renewal of Chinas trade status as a most favored nation in 1994.Lobbying from American corporations pushing for Chinas inclusion in the global economy won the day, as it did for years afterward. Boeing was one of the top cheerleaders, sponsoring ads tying U.S. business success in China with improved human rights. The aerospace giant also suggested that aircraft sales worth about $5 billion were at risk if Chinas trade status was explicitly tied to human rights improvements.Boeing and its American corporate cohorts, such as AT&T and General Electric, later played a role in helping China formally join the World Trade Organization in 2001. While big business was eager to access the Chinese market, smaller American firms were devastated.Superpower Showdown focuses on several companies and workers affected by the changes. Stuart Shoun, a North Carolina resident, was laid off three times because of competition from Chinese furniture makers. One of the occasions he lost his job was after producing samples for Chinese suppliers to learn from. These forgotten workers would help propel Trump to victory in 2016.Meanwhile, Chinese businesses that had previously focused on the domestic market grew exponentially by exporting to America. Guangrao, a county in eastern China inhabited by farmers, was designated as a tire manufacturing hub. After China joined the WTO, exports to the United States soared at the expense of American rivals. Xis experience as a provincial Communist party chief in that period, which taught him how to embrace market economy policies while maintaining political control, are also informative.By the time the Chinese president came face to face with Trump, underlying tensions that had festered for years bubbled to the surface. Yet Beijing failed to recognize the changing political landscape in the United States and relied on its old tactic of depending on U.S. corporations to come to its rescue. But big companies had become increasingly angry over cyber thefts, forced technology transfers and unfulfilled Chinese promises of opening sectors like financial services. In 2008, 64% of U.S. Chamber of Commerce members in China were optimistic about their two-year prospects in the country. By 2014 that figure had dropped by half.At the same time, U.S. officials overestimated Chinas weakness. They thought Beijing would capitulate when faced with American tariffs, rather than viewing the levies as another way to contain the Peoples Republics economic ambitions. Trump could not understand why Xi did not immediately promise to spend tens of billions of dollars on American farm goods to end the trade war. The two sides finally agreed on a limited so-called Phase One deal in January.The forces unleashed in the trade fight have emboldened hardliners in both countries, spilling over into other issues like U.S. restrictions on telecom equipment provider Huawei Technologies, the future of Hong Kong and the blame game over the outbreak of Covid-19. Similar miscalculations are also being made in these areas. And neither Trump nor Xi shows signs of backing down.American voters will decide in November whether Trumps anti-China pitch is a sufficient reason to re-elect him. Regardless of the outcome of the presidential election, however, anti-China sentiment runs deep in both parties in Congress. Tariffs have become normalized weapons. That will continue to push Washington and Beijing on a collision course, no matter who occupies the White House."}