{"text": "LONDON (Reuters Breakingviews) - Herbert Diess is copying Elon Musk in more ways than one. Like his Tesla rival, the Volkswagen boss recently took to tweeting about his share price. He has also started promising a technology transformation for automotive hardware and software alike. Even a modest slice of estimated sales from driver downloads ought to put some rocket fuel in the automakers analogue-like valuation.In homage to Musks Battery Day last year, Diess is due to boast about VWs own tech nous at the companys Power Day on Monday. In addition to cheaper and longer-range batteries, he is expected to provide more details on the companys 27 billion euro digital push, following an announcement last week that its ID electric models will soon receive downloads every 12 weeks to ensure up-to-date functionality. The company is way behind on that score  Tesla has had that functionality for years. But its part of becoming, in VWs wince-inducing description, a software-driven mobility provider, rather than merely a purveyor of souped-up jalopies.Just as well. Its medium-term operating margin target of around 7% looks drab compared to European rival Stellantis, which aims to leapfrog that hurdle as early as this year. And assuming Diess hits his ambitious goal of producing 3 million electric vehicles a year by 2025, gas-guzzlers are still likely to account for four out of every five rides sold. Thats why, even after a 25% run-up in shares this year, VW trades at an uninspiring 9 times forward earnings, according to Refinitiv data. Diesss tech bet can give that dour multiple some whizz.UBS reckons sales of software such as assisted-driving programmes could generate $81 billion in industry operating profit globally by 2025. Assume Diess can snatch 16% of that  in line with VWs estimated share of the battery vehicle market the same year. Putting the fast-growing niche on a 17.5 times multiple, the same as German software provider SAP, implies VWs tech sales alone might be worth $222 billion, or nearly three-quarters higher than the Golf makers current total equity value.Thatll probably be well behind digital pace-setter Tesla, whose current market capitalisation is roughly triple that already. But its a lucrative second place well worth chasing."}