{"text": "LONDON (Reuters Breakingviews) - Leicester is hardly a global hub for investigative journalism. Yet the British city is where former office administrator Eliot Higgins marshals a multinational volunteer network to scour publicly available images and online data. In just over half a decade this unconventional news organisation, dubbed Bellingcat, has uncovered the perpetrators of mass murder and human rights abuses. Its approach offers both journalistic and strategic lessons for the media industry.The name Bellingcat comes from a fable in which a group of mice protect themselves from a feline by hanging a bell around its neck so they can hear it coming. Its a useful analogy for the philosophy underpinning Bellingcats work since it launched in 2014. Its network of volunteers, many of whom have no experience of investigative journalism, pieces together images and other data sources to discover things previously thought undiscoverable. Often, the cat turns out to be the Kremlin.The outfits breakthrough was arguably its investigation into the 2014 downing of a Malaysia Airlines flight over Ukraine which killed 298 people. In We Are Bellingcat: An Intelligence Agency for the People, Higgins provides a gripping account of the techniques online investigators used to trace the journey of a so-called BUK missile from Russia to where it was likely deployed. Volunteers managed to find a series of photos and deduce where they were taken by matching them to images on social media as well as Googles Street View and maps. They were able to disprove the Kremlins unfounded accusation that Kyiv was responsible for the attack.Another landmark case was identifying those responsible for poisoning Russian double agent Sergei Skripal and his daughter in the British city of Salisbury in 2018. Here, purchased phone records, flight manifests and voice audio matching supplemented the scouring of online content and social media as evidence against two Russian intelligence officers.Bellingcats impressive track record, showcased in the page-turning book, and its unconventional model has attracted the news industrys attention. Higgins has collaborated with mainstream outlets including the New York Times and CNN. Media organisations including the Wall Street Journal and Reuters have set up video verification teams to aid open-source reporting.Its all the more impressive that Higgins has delivered these investigations a shoestring budget. Between July 2018 and the end of 2019, Bellingcats income amounted to just 920,250 euros, more than half of which came from running workshops. Unlike regular news organisations, it earned no revenue from advertising or subscription fees.Its hardly the first donor-funded journalistic enterprise. However, its rarer to draft in unpaid members of the public as contributors. Bellingcats diverse funding also gives it credibility and helps protect it from charges of bias, even when the villain of many of its most high-profile investigations is in Moscow. It is intuitively appealing that the readers, investigators and benefactors of Bellingcats journalism are all citizens.The sustainability of this model depends on Bellingcats accuracy and integrity being beyond reproach. Any big errors, or doubts about its agenda, would risk deterring the organisations financial backers and its eager investigators who, for the most part, work for free. Its practice of paying for information, such as leaked phone mast data, raises both ethical and practical concerns: the leaks could be false.Higgins writes that the next frontier of open-source reporting could be to replace his mischief with artificial intelligence: using machine learning to trawl through public data and images at scale. Bellingcats funding appears to be too tight for it to lead in this field. In an interview with Russia-focused publication Meduza, a Bellingcat journalist spoke of how he paid for phone records out of his own pocket to help advance an investigation into the poisoning of Russian opposition politician Alexei Navalny.Other organisations that rose to prominence by harnessing the power of the internet have gone astray: think of Julian Assanges WikiLeaks, for example. Yet Bellingcats methods look set to seep further into mainstream journalism, especially when much of the news media is facing severe financial strains. Higgins mice have shown the way."}