{"text": "NEW YORK/HONG KONG/LONDON (Reuters Breakingviews) - Corona Capital is a column updated throughout the day by Breakingviews columnists around the world with short, sharp pandemic-related insights.LATEST- Ryan Tedder- IMF credit cushionMUSIC PLAYS, KKR DANCES. Henry Kraviss private-equity firm is getting into the hip music-buying business. KKR is purchasing a majority stake in a catalog of tunes written by OneRepublic star Ryan Tedder including songs written for Beyonc, Lady Gaga, and Cardi B. The deal, worth $200 million according to Reuters, is one of several recently including Universal Musics purchase of Bob Dylans entire oeuvre and Hipgnosis Songs Funds $323 million splash on a set of songs that included hits by Fleetwood Mac and Mariah Carey.Musicians may be seeking to monetize their hit backlogs because the pandemic has taken out the concert business. Older icons like Dylan may choose to cash out completely. Tedder, at 41 years old, will retain an interest alongside KKR. Thats a helpful example for younger musicians, who have plenty of time to squeeze more value out of their ballads. (By Lauren Silva Laughlin)MARGIN OF SAFETY. The International Monetary Fund is bumping up its target for its squishy version of a loss-absorbing capital cushion after Covid-19-related lending surged. Oddly, though, it isnt changing anything to help reach the new goal. The multilateral lender said on Friday that it would increase by 25% its target precautionary balance, a buffer that protects member countries reserves, equivalent to around $36 billion. It follows a jump in the IMFs credit outstanding. Loans via the funds rapid financing instrument, a sort of emergency option for members, spiked to over $22 billion through October, 25 times the level a year earlier.The fund said its directors agreed it was unnecessary to take additional measures to increase reserve accumulation, although it noted some dissent on this point. So its not clear how the new target buffer will be achieved. With the pace of the coronavirus vaccine rollout uncertain, especially in developing countries, the IMF may be called on for far more aid. It may want to plump up its cushion, not just talk about it. (By Anna Szymanski)MORBID ANNIVERSARY. One year after China confirmed its first death from Covid-19, there is a sense of dj vu. Daily cases in mainland China surged past 100 for the first time in five months on Sunday. The capital of Hebei province is in lockdown: people are barred from leaving the city and residents have been ordered to stay home. Beijing, Shanghai and Shenzhen have urged people to avoid travel for the upcoming Lunar New Year.The crackdown comes just weeks ahead of the week-long holiday, typically the largest human migration in the world and a $150 billion consumption boom. So the economic implications are grim. Wuhan went into lockdown on the eve of last years break. Restrictions, mass testing and tracing, plus the vaccine rollout, will likely prevent a nationwide outbreak. But retail spending has lagged Chinas broader industrial recovery and the ongoing struggle will be closely watched. (By Yawen Chen)RED CARDED. French soccer star Paul Pogba had better raise his game: trophy players have not been immune to the pandemic. Despite matches restarting last summer, KPMG calculates that the aggregate value of Europes top 500 players, including the Manchester United midfielder and Barcelonas Lionel Messi, has declined by 2 billion euros to 18.7 billion euros since February 2020. The drop reflects clubs diminished purchasing power. As matchday sales evaporated, even historical spendthrifts such as Paris Saint-Germain and Manchester City became wary about marquee signings: CIES estimates that the value of transactions during last summers transfer window in Europes top five leagues dropped by 43% to 3.3 billion euros.The rest of the season looks equally grim. The European Club Association reckons leagues face a two-footed 3.1 billion euro tackle to their top lines this year as stadiums remain mostly empty, pushing player wages up towards 80% of sales. That may lead to pay cuts for Pogba and his rivals. (By Christopher Thompson)OUT OF JOINT. The pandemic is dealing a heavy blow to the business of fixing creaky hips and knees. Just look at Smith & Nephew, the 14 billion pound manufacturer, which said on Monday it expects revenue to decline by around 7% in the fourth quarter. The rise in Covid-19 cases in hospitals has prompted customers to delay hip and ligament surgeries. The news knocked around 3% off the companys share price and pulled rivals Fresenius and Straumann down by around 2%.Further pain is likely. Covid-19 infections are rapidly rising in the United States and Europe, Smith & Nephews two main markets. This means private hospitals, which are often the setting for elective surgeries, are being used to treat more urgent cases. Despite a relatively strong wound management business, Smith & Nephews new Chief Executive Roland Diggelmann reckons full-year revenue will decline by around 12%. Until hospitals are less overwhelmed, there will be little relief for these aches and pains. (By Aimee Donnellan)"}