{"text": "LONDON (Reuters Breakingviews) - According to Greek myth, the multi-headed Hydra would immediately regrow a head after one was chopped off. The serpentine creature, eventually slain by the wily Hercules, comes to mind as governments and medical professionals grapple with mutations of Covid-19. Though vaccines are highly effective at stopping the original virus, they are less well-equipped to defeat its variants. The world faces a lengthy battle.HOW DANGEROUS ARE THE NEW VARIANTS?Viruses are constantly mutating: Covid-19 has so far spawned some 4,000 variants. Although many display the same characteristics as the conventional variety that emerged in the Chinese city of Wuhan, a trio of mutations named after the places they originated are of particular concern. The Kent variant, first detected in the British county, spreads more easily. A Brazilian version is also causing concern. The South Africa mutation, known as B.1.351, is the most worrying. It is suspected to be 70% more transmissible than the original and has already spread to 32 countries. Crucially, its mutations give it a kind of cloaking device that allow it to hide from the antibodies created by vaccines. This raises the risk of people who have had jabs still getting sick. The British government was so concerned about the new mutation earlier this month that it embarked on a door-to-door testing blitz of 80,000 people after detecting just 11 cases of the variant in people with no links to recent arrivals from South Africa.WONT CURRENT VACCINES PROVIDE SOME PROTECTION?There are two big questions about the current crop of vaccines. Can they protect against infection from a new variant? And even if they dont, can they provide enough antibodies to lower the risk of serious illness and death? Data is too patchy to provide a definite answer. A recent study on genetically engineered blood samples of the variants showed the jab developed by Pfizer and BioNTech was effective on the Kent and South African mutations. Other vaccines offer far less protection against the South African variant, with the AstraZeneca jab only reducing the risk of developing mild to moderate Covid-19 by 22%, compared with about 70% in trials involving the original virus. This information, revealed in a study last weekend, prompted the government in Pretoria to block the use of AstraZenecas vaccine until there is more data. Modernas vaccine produces just one-sixth of the antibodies when confronted with the South African variant than it does for the original virus.Other jabs are more versatile. Johnson & Johnsons level of protection against moderate and severe Covid-19 was 57% in its South Africa trial and Novavaxs efficacy was as high as 60% for the prevention of mild, moderate and severe Covid-19. Thats lower than the protection provided against the mainstream strain, but still above the 50% threshold typically set by regulators for approving a vaccine. News of Novavaxs effectiveness against the South African variant prompted the companys share price to double on Jan. 28. Still thats limited consolation for Western governments which have bet heavily on the Pfizer, Moderna and AstraZeneca vaccines to inoculate their populations and reopen their economies.Reliable protection against the new variants may have to wait for new vaccines specifically designed to block them. Developing, testing and manufacturing such booster shots will take around seven months, though, and a further four to five months to roll out across the globe. Mixing and matching existing vaccines, a process known as heterologous prime boost vaccination, might provide a speedier solution. This is being tested on humans in a trial run by the University of Oxford.WHAT ELSE CAN THE AUTHORITIES DO?Knocking on doors and doling out tests may be the best bet. China and South Korea have shown the way by testing millions of people when they detect a handful of new cases. Germany is looking to test commuters crossing its borders to identify those carrying the more infectious mutations. A more drastic alternative is to impose strict quarantines on new arrivals, as implemented in countries including New Zealand. The Pacific nation requires some returning travellers to spend a mandatory 14 days in a hotel, at a cost of nearly $3,000 for a couple. But even that strategy has limitations. The Australian state of Victoria, which has a similarly strict regime for arrivals, on Friday imposed a five-day lockdown following an outbreak of the British variant in Melbourne.DOES THIS MEAN LOCKDOWNS WILL LAST LONGER?Though vaccines will provide people with some protection, they may not be enough to keep cases to a level that would allow widespread easing of restrictions. The dilemma for governments is that relaxing lockdowns would allow the mutations to spread more quickly, in turn spawning new variants that will be even better at evading vaccines. All of this will delay the moment when governments can declare the pandemic to have been defeated. Moreover, countries that have been more successful at limiting the spread will be reluctant to open their borders. Grant Shapps, Britains transport minister, on Feb. 10 warned citizens not to book summer holidays.WHAT DOES THAT MEAN FOR COMPANIES AND INVESTORS?Investors seem oblivious to the risks of a delayed recovery. The S&P 500 Index is trading close to its all-time high, buoyed by optimism about rapid vaccine rollouts. Equity analysts expect the 1,585 companies included in the MSCI World Index to report 8% higher net profit this year, on average, than in 2019, according to Refinitiv data. They project next years earnings will be 24% above pre-Covid-19 levels.Industries like airlines and hospitality are particularly vulnerable to any prolonged lockdown or delayed loosening of travel restrictions. Governments will also face pressure to further extend fiscal support to companies and individuals, as will central banks. The world deserves great credit for rapidly developing vaccines which can defeat the virus. The worry is that, having chopped one head off the Hydra, new ones are growing back even faster."}