{"text": "HONG KONG (Reuters Breakingviews) - JD.com hardly has any crumbs to spare. The Chinese e-commerce company grew fourth-quarter sales by 31% from a year ago to 224 billion yuan ($34.4 billion). It is barely breaking even, however, and going up against Alibaba in supermarkets probably will eat into profitability. Boss Richard Liu could be testing investor patience.JD Retail is doing just fine as China recovers from the pandemic. The $146 billion company said on Thursday that the top line at the unit, which accounts for roughly 90% of the group total, rose 28% year-on-year in the three months ending Dec. 31. Even better, JDs Amazon-like model of owning inventory and operating logistics has been getting more profitable as the company gets bigger. Adjusted net margins for the year, though still razor-thin, improved to 2.3% from 0.7% in 2018.That may not last. Liu is ramping up investments in fast-growing areas such as online groceries. In December, JD injected $700 million into Xingsheng Preference Electronic Business, a Groupon-like grocery app. It also snapped up a stake in agricultural wholesale operator China Dili and started its own community-buying service. More may be coming. Its 2021 adjusted net margin will barely grow to 2.4%, Bernstein analysts forecast.The market for customers purchasing goods together in bulk was expected to triple to 89 billion yuan in 2020 from 2018, according to consultancy Kantar. Rivals from Alibaba to Pinduoduo are pouring in huge sums to capture share. Lius edge is a logistics arm that operates a network of more than 900 warehouses across the country with some 190,000 employees who can deliver fresh produce ultra-fast.Even so, returns look distant. Building a refrigerated supply chain will be expensive, and the crowded sector is rife with cash-burning subsidies to win over price-sensitive shoppers. Moreover, regulators are cracking down on price-fixing. In December, officials hauled in representatives from JD and peers for a disciplinary meeting.After more than doubling over the past year, JD shares now trade at some 37 times expected earnings. Thats a higher multiple than at rivals Alibaba and Tencent, which backs JD and also has its own group-buying app. Charging into another expensive and protracted battle raises questions about the optimism."}