{"text": "LONDON (Reuters Breakingviews) - Neil Woodford fancied himself as Britains answer to Warren Buffett. That ego helped the fund manager become one of the countrys best-known stock-pickers, but also brought about his spectacular downfall in 2019. A new book on the saga shows how changes to the UKs pension rules, combined with supine regulation, left British savers exposed.Built on a Lie: The Rise and Fall of Neil Woodford and the Fate of Middle Englands Money by Owen Walker charts the asset managers rise from relatively humble origins in a commuter town outside London. He owed his fame to two big bets. During the internet boom of the late 1990s, Woodford shunned technology companies because he failed to understand their stratospheric valuations. When the bubble burst, his High Income fund outperformed. Years later, he made a similar astute call to avoid bank stocks, avoiding losses when they tumbled during the financial crisis.These successes prompted investors to entrust Woodford with their cash. The resulting fees allowed him to embrace a lavish lifestyle, buying a seven-bedroom manor house once owned by Formula 1 tycoon Flavio Briatore. It also emboldened him to leave Invesco Perpetual, one of Britains best-known investment houses, and set up his own firm.The investors who eagerly followed Woodford knew little of the risks he was taking with their money. This vulnerability was a result of sweeping changes to Britains pension market. Walker, a journalist at the Financial Times, explains how the closure of company-supplied final salary retirement schemes forced savers to manage their own pensions. Confronted with thousands of products savers relied on financial advisers, many of whom were loyal to Woodford, as well as best buy lists from groups like Hargreaves Lansdown. The 7 billion pound wealth manager supported Woodford until the end.The strategy for Woodford Investment Management, which at its peak oversaw 18 billion pounds, was to invest in riskier unlisted companies alongside its big holdings in dividend-paying blue-chips like cigarette maker Imperial Brands. However, seemingly solid companies like Provident Financial, the doorstep lender which was once a member of the FTSE 100 Index, disappointed. By the time Woodfords Equity Income fund was suspended in 2019, only 19 of the 72 companies it owned three years earlier were showing a positive return.The lack of liquidity in Woodfords funds hastened his demise. When Kent County Council, one of his loyal clients, yanked its 263 million pound investment, Woodford did not have the cash to meet the demand. While savers believed they had instant access to their money, his unlisted holdings were difficult to sell, while his positions in listed companies had become so large that they could not be liquidated without further depressing the price.This flaw, which goes far beyond Woodford, is the lie of the books title. When former Bank of England Governor Mark Carney was asked about the Woodford implosion at a parliamentary hearing, he explained that the problem could be systemic for large parts of the asset management industry.Walker reckons regulators share part of the blame. The UKs Financial Conduct Authority authorised Woodfords new firm in record time even though he faced an open investigation into his dealings at Invesco. The regulator also allowed Woodford to use outsourcing firm Capita Asset Services as a kind of external regulator, or Authorised Corporate Director, even though the fund manager was also the largest shareholder in the providers parent company.Internal checks and balances also failed. In one incident described in the book, Woodford planned to invest $250 million into U.S. bioscience company Evofem, despite having only met an executive from the San Diego-based company twice in London. When the Equity Income fund came close to breaching the 10% limit on assets invested in unquoted companies, he pressured some of those firms to list their shares on the obscure Guernsey Stock Exchange.Woodfords demise also provides another nail in the coffin of the active asset management industry. The growth of low-cost index-tracking funds has put pressure on active managers to show that they can add value. His successful contrarian bets appeared to justify higher fees. But his clients would have been much better off if they had entrusted their retirement funds to an index fund.Walker juxtaposes the lifestyle of fund managers with the pensioners whose money they manage. Woodford spent nearly 14 million pounds on a 1,000-acre country retreat in the Cotswolds and test-drove a Ferrari in the carmakers private track in northern Italy. Meanwhile, a 67-year-old owner of a bed and breakfast lost a chunk of her retirement savings and is still working as a result.Despite all this, Woodford doesnt seem to think hes beyond redemption. Last month he unveiled plans to launch a new fund in Jersey, managing only institutional money. But with the findings of an FCA review into his failings yet to be published, a comeback seems unlikely. The best Woodford should hope for is that investors and regulators learn the lessons of his failings."}