{"text": "LONDON (Reuters Breakingviews) - Three years ago, this column suggested that bitcoin, whose price soared 15-fold during 2017, faced a total wipeout. The cryptocurrency wasnt money, but instead resembled the gold prospectors fabled sardine tin: good for trading but not for eating. It was a timely call: over the following months, bitcoin shed more than two-thirds of its value. But now the crypto is back from the dead and trading at around twice its peak. Was my earlier bitcoin judgement wrong?Most seasoned bubble-watchers would say no. Bitcoin is particularly susceptible to speculative fervour because its supply is pretty much fixed in the short run while demand is volatile. Certainly, its near-vertical ascent into the beginning of 2021 resembles a classic bubble. The fact that the Grayscale Bitcoin Trust, a retail investment vehicle, has traded recently at a 40% premium to net asset value is another reliable indicator of irrational exuberance. Google Trends shows a soaring interest in bitcoin on a par with the 2017 spike.Nor should it be overlooked that the latest bitcoin frenzy has taken place against the backdrop of one of historys great investment manias. Last year, Teslas share price went up by more than twice bitcoins surge. With the Federal Reserve printing more money at a faster pace than ever and interest rates stuck at zero, monetary policy is guaranteed to stoke bubbles. Under these conditions, financial assets which generate no income, like bitcoin, tend to do best.Large investment managers have caught the crypto bug. The arrival of institutional investors calls to mind the late stages of the dotcom mania at the end of the 20th century. Having put together a large crypto-assets division, Fidelity Investments is encouraging its high net worth clients to plunge. Corporate treasuries are said to be looking into bitcoin. Hedge funds have sought to get ahead of Wall Streets big move into cryptocurrencies. Multimillion-dollar orders placed in an illiquid market have ramped bitcoins price.Paradoxically, the very forces behind the current bubble may turn out to be the cryptos salvation. Take monetary policy. Bitcoin was created in the wake of the Lehman Brothers bust to offer an alternative to fiat currencies whose stability appeared threatened by central bank money-printing. Yet fears of runaway inflation turned out to be premature. Last year, however, the central banks created a great deal more money than during the financial crisis. Rather than remaining trapped in the financial sector, as was the case with earlier quantitative easing, the new money has financed spending by governments and seeped into the broad economy.Having tasted the forbidden fruit of the magic money tree, theres no going back. Central bank-financed government deficits are here to stay. If inflation returns in the near future, as seems likely, investors will look for alternative stores of value to fiat currencies. Gold, which has been around for many millennia, is an obvious contender. But a digital age demands digital gold, and bitcoin is in a prime position to fulfil that role.In fact, bitcoin has much in common with gold, not only as its supply is limited but since the crypto produces no income, it is impossible to value. Value is in the eye of the beholder. Bitcoins failure to date to serve as money is not a great drawback. As investment strategist Dylan Grice of Calderwood Capital Research points out, gold retained its value even after it was demonetised.Having survived several bubbles and busts over the past decade, bitcoin has shown itself to be remarkably durable. Bubbles are great marketing tools: just about everyone on earth now knows about the bitcoin brand. In a world where network effects are all-powerful, this free publicity gives the best-known crypto a huge advantage over rivals.Institutional investors may be ramping bitcoin, but the arrival of the suits is making cryptos respectable. In its early years, bitcoin exchanges were notoriously unreliable, with massive thefts occurring at Mt. Gox and other dubious outfits. Today, cryptos can be stored safely at reputable operations, such as Coinbase. Bitcoin ownership is also coming under the regulatory umbrella, as digital exchanges jockey to meet the know your customer requirements.Transactions in bitcoin have always been notoriously inefficient. But financial technology companies have come to the rescue. For a small fee, bitcoin held in fintech accounts can be converted into dollars for transaction purposes and turned back into cryptos on receipt. True, this goes against the grain of the distributed ledger and looks much like traditional banking, but what the heck, it seems to work. You will soon be able to pay for a morning Starbucks with a crypto. More importantly, its possible to envisage bitcoin serving as the monetary base for a digital payments system, performing a similar role to gold prior to 1914.Since the Lehman bust, savers have become accustomed to negative real interest rates. The massive costs incurred by the pandemic ensure that financial repression will continue for years. Zero interest rates are possible because central banks can issue fiat money in limitless quantities. The dollar has become a zero-interest perpetual bond which, by definition, has no value. Curiously, things look more normal in the world of so-called decentralised finance, where digital tokens can be borrowed and lent over the Ethereum network at reasonable rates of interest.Several years ago, Claudio Borio of the Bank for International Settlements warned that unconventional monetary policies threatened an epoch-defining seismic rupture. Borio envisaged a breakdown of globalisation, accompanied by rising inflation and capital controls. In recent years, bitcoin has proved its value in countries like Argentina, where currency regulations have been tightened and inflation remains endemic. As Grice points out, people who cant see bitcoins uses havent personally felt any need for its benefits. If Borios nightmare is realised, that day may not be far away.On reflection, Id say my 2017 bitcoin bubble call was spot on. But I underestimated the cryptos longer durability. Today, the ersatz currency is in another bubble, but it will survive the inevitable bust. If we have learned anything from its brief history, its that that which doesnt kill bitcoin only seems to make it stronger."}