{"text": "Oil prices hit their highest in nearly a year on Tuesday on lower supply bets and Treasury yields tightened after strong demand at an auction.Stocks, meanwhile, edged higher, led by Asia, with eyes on U.S. earnings and U.S. President-elect Joe Biden's inauguration next week.The 10-year U.S. yield touched its highest since March but tightened to near flat on the day after a $38 billion offering from the Treasury was well bid. The yield has risen every session this year on expectations of a massive stimulus package from the incoming Democratic administration.Brent crude prices hit their highest since February as tighter supply and expectations of a drop in U.S. inventories offset concerns over rising coronavirus cases globally. Saudi Arabia said it plans to cut output by an extra 1 million barrels per day in February and March.\"Saudi Arabia in particular is ensuring, through its additional voluntary production cuts, that the market is undersupplied if anything,\" said Eugen Weinberg of Commerzbank.Brent  was at $56.55, up 1.6% on the day, while U.S. crude  recently rose 1.74% to $53.16 per barrel.On Wall Street, stocks fluctuated near unchanged for the session, not far from record highs. The Dow (.DJI) rose 69.3 points, or 0.22%, to 31,077.99, the S&P 500 (.SPX) gained 1.13 points, or 0.03%, to 3,800.74 and the Nasdaq Composite (.IXIC) added 24.72 points, or 0.19%, to 13,061.15.The pan-European STOXX 600 index (.STOXX) rose 0.05% and MSCI's gauge of stocks across the globe (.MIWD00000PUS) gained 0.31%.Emerging market stocks rose 0.54%, while Nikkei futures rose 0.50%. Mainland Chinese shares (.SSEC) gained 2.2% overnight to close at their highest in over five years.Democrats said they will give President Donald Trump one last chance on Tuesday to leave office days before his term expires or face an unprecedented second impeachment over his supporters' deadly Jan. 6 assault on the U.S. Capitol.  read more An impeachment trial could proceed even after Trump leaves office. Some Democrats have expressed concern that a trial could hamper Biden's agenda, slowing confirmation of his appointees and distracting from legislative priorities such as a new coronavirus relief package.\"Even if (additional stimulus) is delayed, it's going to be a matter of days, maybe weeks, not months. The question is the shape and form of it,\" said Keith Buchanan, portfolio manager at GlobAlt in Atlanta.Benchmark U.S. government 10-year debt  last rose 1/32 in price to yield 1.1325%, from 1.134% late on Monday. The yield hit 1.187% earlier in the session.The U.S. dollar was down after hitting its highest since December on Monday, and the tighter Treasury yields pushed the greenback down further.The dollar index  fell 0.452%, with the euro  up 0.44% to $1.2203.\tThe Japanese yen strengthened 0.48% versus the greenback at 103.76 per dollar, while Sterling  was last trading at $1.3661, up 1.09% on the day.  Spot gold  added 0.5% to $1,854.17 an ounce. Silver  gained 2.52% to $25.55.Bitcoin  last fell 3.86% to $34,087.00."}