{"text": "LONDON Britains economy will narrowly dodge a double-dip recession and will have returned to pre-COVID-19 levels within two years, according to economists in a Reuters poll who said the Bank of England was unlikely to take borrowing costs negative.The country has suffered the highest coronavirus-related death toll in Europe and the government has reimposed strict lockdown measures to try and stop the virus spreading, dealing a hammer blow to its dominant service industry.Gross domestic product was forecast to contract 3.0% this quarter, the Feb. 8-11 poll of around 70 economists found, more than double the 1.4% fall predicted last month. Conversely, the median for Q4 was revised up to 0.4% growth from a 2.0% contraction previously.But Britain is among the leading countries in rolling out vaccines to its population and GDP was expected to grow 4.7% in the second quarter as some restrictions are likely to be lifted. In Q3 and Q4 it will expand 2.7% and 1.5% respectively.The UKs success in vaccinating high-risk groups and the sharp fall in COVID-19 cases suggests the government will on Feb. 22 be able to set out plans for schools to reopen... followed by non-essential retailers in the second half of March and the consumer services sector in the second half of April, said Samuel Tombs at Pantheon Macroeconomics.For 2021 as a whole the growth forecast was revised down to 4.7% from 4.9% while the 2022 median was revised up to 5.5% from 5.3%.When asked how long it would take for the economy to reach pre-COVID-19 levels 18 said within two years from now. One said within a year and nine said would take over two years. Last month 14 of 23 said it would take over two years.Britain also faces the added headache of Brexit and just under half of British companies that export goods have run into difficulties caused by the shift in trade terms with the European Union since the start of the year, a survey showed on Thursday.Trade analysts think some of the extra cost and bureaucracy will be permanent, and the Bank of England has forecast they will lower trade by 10% in the long run compared with a frictionless arrangement.HOLDING ABOVE WATERLast year the BoE slashed Bank Rate to 0.1% and restarted its bond buying programme to offer support to the economy. Medians in the poll suggest there will be no unwinding of that ultra-loose monetary policy until 2024 at the earliest.There had been talk the Bank would take borrowing costs negative - and markets had been pricing it in - but 30 of 34 economists who responded to an extra question said it was unlikely or very unlikely. Only four said it was likely.An economic recovery from spring onwards and a continued rise in inflation towards the BoEs 2% target over the course of 2021 will likely put to bed any remaining expectation that the Bank Rate could fall further, said Kallum Pickering at Berenberg.Reuters poll graphic on the UK economic and monetary policy outlook:https://fingfx.thomsonreuters.com/gfx/polling/qmypmwoexpr/Reuters%20Poll%20-%20UK%20economy%20outlook%20-%20Feb%202021.PNG"}