{"text": "NEW YORK Parties to the International Criminal Court on Friday elected Britains Karim Khan as the new prosecutor for a nine-year term starting on June 16.Khan won a secret ballot against three other candidates to replace lead prosecutor Fatou Bensouda. The 123-member Hague-based court, which began work nearly 20 years ago, handles war crimes, crimes against humanity, genocide and crimes of aggression.British barrister Karim is best known for heading the United Nations special investigative team looking into Islamic State crimes in Iraq.In his 27-year law career Khan, who is also Queens Counsel, has worked for almost every international criminal tribunal in roles in prosecution, defence and as counsel for victims. At the ICC Khan is best known for being a lead defence counsel who has worked on cases from Kenya, Sudan and Libya.There was intense political jostling for the top ICC job at a time of heightened scrutiny of the prosecutors office.Former U.S. President Donald Trumps administration imposed sanctions last year on court staff including Bensouda over investigations by her office into possible war crimes committed in Afghanistan, including by American troops. The United States is not a member of the court.New U.S. President Joe Bidens administration will thoroughly review the sanctions on ICC officials, a State Department spokesman said last month.Then last week the court said it has jurisdiction over war crimes committed in the Palestinian territories, which could lead to an inquiry strongly opposed by non-ICC member Israel and the United States.One of the first decisions by Khan could be whether to press ahead with a full investigation into the Palestinian territories, where Bensouda said there is a reasonable basis to conclude war crimes may have been committed by both Israeli forces and Palestinian armed groups.Karims extensive experience in international law will be pivotal in ensuring we hold those responsible for the most heinous crimes to account and gain justice for their victims, Britains Foreign Secretary Dominic Raab posted on Twitter."}