{"text": "Darktrace, the British cyber security firm backed by tech entrepreneur Mike Lynch, fired the gun on its $4 billion London listing on Monday, aiming to raise new funds to accelerate product development and strengthen its balance sheet.The technology company, founded in 2013 in the university city of Cambridge, uses AI to understand IT networks and detect attacks by identifying unusual behaviour.\"We are in a new era of attacks...it's going to be these little pieces of code fighting it out in the background of our businesses,\" said Chief Executive Poppy Gustafsson in an interview with Reuters, calling the planned listing a major milestone for the company.Darktrace, which counts Rolls-Royce and Coca-Cola among its customers, was the first company to apply AI to the challenge of cyber security, she said, and its technology currently interrupts a threat once every second.A source familiar with the transaction told Reuters earlier this year the company would target a 3 billion pound ($4.1 billion) valuation.Darktrace was an early investment by Lynch's venture fund Invoke Capital, established after software company Autonomy was sold to Hewlett-Packard for $11 billion.Lynch, Autonomy's founder and former CEO, is fighting a U.S. extradition request to face fraud charges related to the sale, and is waiting for the verdict of a multi-billion dollar civil claim by HP at London's High Court. He denies the charges.He stepped down from Darktrace's board in 2018 after the U.S. filed charges related to Autonomy.Gustafsson said Lynch was a visionary technologist, but he was not involved in the day-to-day running of the business.Investment bank UBS, however, resigned from working on the IPO in February in the context of the extradition proceedings, Sky News reported at the time.Gustafsson said other issues were in play. UBS did not immediately comment.GROWTH FOCUSDarktrace's revenue grew from $79.4 million to $199.1 million between its 2018 and 2020 fiscal years, although it is loss-making on the operating and pretax levels.\"Our focus is on growth,\" Gustafsson said. \"But due to our operating leverage, we've got a fantastic high gross margin and the fundamental foundations of the business are demonstrably sustainable.\"Darktrace joins a flurry of deals, with Madrid-based Allfunds targeting an Amsterdam IPO and Sweden's Trustly on Monday announcing its bid for a Stockholm listing. The European IPO market recorded its strongest quarter since 2015 in the first three months of 2021, but a poor debut for Deliveroo (ROO.L) -- its shares dropped 30% on the first day of trading -- cast doubts on whether the momentum could last.  read more Deliveroo was a great way to get a burrito delivered on a bicycle, Gustafsson said, but a completely different proposition to Darktrace's fundamental technology.Darktrace expects to have a free float of at least 20% of issued share capital. As well as the primary offer, it said there would be a secondary sell-down of shares by existing shareholders.Jefferies, Berenberg and KKR Capital Markets are the global coordinators.($1 = 0.7277 pounds)"}