{"text": "A Brooklyn man pleaded not guilty on Monday to insider trading charges, after prosecutors accused him of using information from a Bloomberg News reporter about certain deals to trade.Jason Peltz, 38, entered his plea through his lawyer before U.S. Magistrate Judge Roanne Mann in Brooklyn.On March 23, a federal grand jury indicted Peltz for trading on \"material nonpublic information\" obtained from a company insider and a financial reporter.Peltz has been charged with securities fraud, money laundering and tax evasion, among other offenses, according to the indictment filed in the Eastern District of New York.The indictment does not name the financial reporter or the media outlet, but Reuters and other media outlets have identified him as Ed Hammond, a deals reporter with Bloomberg in New York, based on a review of articles mentioned in the indictment.Hammond has not been accused of wrongdoing.Bloomberg News declined to comment on Monday. \"Ed Hammond is a very accomplished reporter,\" Bloomberg said in an April 1 email. \"We're not aware of any facts to suggest any wrongdoing on his part.\"The case casts a light on the workings of the world of corporate mergers and acquisitions, where a cadre of bankers, lawyers and other advisers - as well as executives - know about talks. Information often leaks, studies have shown.The alleged scheme ran from November 2015 to October 2020, according to the indictment.Among the trades Peltz allegedly executed, the indictment said, was the purchase of securities and options in chemical manufacturer Ferro Corp (FOE.N) based on information, obtained from a friend, that Ferro had received a takeover offer.After Peltz began placing the trades with the help of unidentified co-conspirators between Feb. 22 and March 11, 2016, Peltz had \"numerous contacts\" with Hammond over the phone and in person, the indictment alleged.Bloomberg published an article by Hammond about the approach to Ferro on March 15, 2016, and Ferro's stock rose 4.7% that day.Ferro did not respond to a request for comment.Apart from the Ferro transaction, Peltz was accused of having frequent conversations with Hammond over several months, during which he obtained material nonpublic information about articles Hammond was working on regarding other companies.Each article mentioned in the indictment cited multiple sources and involved two or more reporters."}