{"text": "Warren Buffett's Berkshire Hathaway Inc (BRKa.N) said on Saturday its earnings are rebounding from the worst effects of the COVID-19 pandemic and that it has extended its aggressive stock repurchases with $6.6 billion of new buybacks.A 20% increase in first-quarter operating profit suggests that the Omaha, Nebraska-based conglomerate,whose dozens of businesses include the BNSF railroad and Geico auto insurance, may already have suffered the worst effects of the pandemic, which included the loss of tens of thousands of jobs.Indeed, Berkshire said many businesses are enjoying \"considerably higher\" earnings and revenue, while others such as the Precision Castparts aircraft parts unit still struggle.\"Results were really good,\" said Jim Shanahan, a Edward Jones & Co analyst with a \"buy\" rating on Berkshire. \"The vaccination rollout and broad economic recovery are evident throughout Berkshire's franchise.\"The $6.6 billion of stock repurchases in the quarter allow Buffett to deploy excess capital, as high valuations and the growth of special purpose acquisition companies make takeovers of whole companies more difficult.More buybacks likely occurred from March 31 to April 22 because Berkshire's share count declined, and may have exceeded $1.2 billion. Berkshire repurchased $24.7 billion of its own stock in 2020.\"It reflects that Buffett isn't being overly tight with Berkshire's valuation metrics and that he's confident about its future,\" said Tom Russo, a partner at Gardner Russo & Quinn in Lancaster, Pennsylvania, who has owned Berkshire since 1982.Quarterly operating profit rose to $7.02 billion, or about $4,600 per Class A share, from $5.87 billion a year earlier.Net income of $11.71 billion, or $7,638 per Class A share, compared with a year-earlier net loss of $49.75 billion, or $30,653 per share.Last year's results reflected $55.62 billion of losses on investments and derivatives, as stock markets worldwide plunged.Despite the buybacks, Berkshire ended March with $145.4 billion of cash, in part because it sold $3.9 billion more in stocks in the quarter than it bought.Its largest stock holdings, Apple Inc (AAPL.O) and Bank of America Corp (BAC.N), totaled $110.9 billion and $40 billion respectively.Berkshire's Class A shares are up 19% this year, outperforming the Standard & Poor's 500 (.SPX) after badly lagging in 2020.Buffett and Vice Chairman Charlie Munger will host Berkshire's annual meeting on Saturday afternoon.BRINGING IT ALL BACK HOMEManufacturing operations boosted pre-tax profit by 15%, with earnings nearly doubling at the Clayton Homes mobile housing unit as sales revenue increased and expected credit losses fell.Russo expects more improvement in housing-related businesses. \"Between Johns Manville [insulation], Acme Brick, and Benjamin Moore paint and Shaw carpets, Berkshire has the entire homebuilding sector in its sweet spot,\" he said.Pre-tax profit from retailers such as the Nebraska Furniture Mart and See's Candies more than doubled, while Berkshire's auto dealerships sold more vehicles and some results surpassed pre-pandemic levels despite supply chain disruptions.At Geico, underwriting profit rose 4% as people drove less and had fewer accidents, offsetting lower premiums resulting from credits on policy renewals.\"Results were most impressive in the insurance segment,\" Shanahan said. \"Geico isn't growing as fast as Progressive (PGR.N), but underwriting performance is much improved, after underperforming our expectations last year.\"BNSF revenue was essentially unchanged, as higher shipping volume of food and consumer goods offset less demand from energy companies for petroleum and sand.\"It looked like there was increased pricing competition, with rail volumes up but revenue down fractionally,\" said Cathy Seifert, an analyst at CFRA Research.Berkshire Hathaway Energy's profit rose 25%, including gas pipeline assets it recently bought from Dominion Energy (D.N).Precision remained a trouble spot, even after a $9.8 billion writedown and 13,400 job losses in 2020.Quarterly revenue fell 36%, and Berkshire said revenue and earnings should remain \"relatively low\" in 2021 because aircraft production is unlikely to grow significantly."}