{"text": "Two Buffalo, New York, police officers who eluded criminal charges for shoving an elderly man to the ground at a protest last June still face an internal review that could go on for a year, a police spokesman said on Friday.An Erie County prosecutor on Thursday said a grand jury declined to indict the officers, Aaron Torgalski and Robert McCabe, for the widely viewed shove of the 75-year-old man during a national wave of protests for racial justice.The two officers were arraigned on felony assault charges two days after the June 4 demonstration outside City Hall in which local rights activist Martin Gugino was pushed to the ground and hit his head as police cleared the area.Erie County District Attorney John Flynn Jr. said grand jurors voted to dismiss the case despite his own belief that a crime had been committed.We have a system in place here where society makes those decisions, not one person, Flynn told a press conference. And thats the way it should be, and thats the way it was.The officers remain suspended with pay pending the outcome of an internal affairs investigation, Buffalo police spokesman Captain Jeff Rinaldo said by email.There is a one-year timeline for the investigation to be completed, Rinaldo added.Flynn said he was duty-bound under state law to charge the officers with felony assault - even though he did not believe their actions rose to the level of a felony. He stressed that he presented a forceful case to the grand jury.The video, shot by a local reporter and seen by tens of millions of people on the Internet, shows Torgalski pushing Gugino before he fell and McCabe about to kneel toward the man sprawled on the sidewalk before being moved along by a supervisor.Gugino, who had approached the officers during the protest after a curfew had been imposed, was rushed to a hospital with a critical head injury, from which he recovered.In an emailed statement, Guginos attorney, Kelly Zarcone, said: Our position remains that the governments use of unnecessary physical force against peaceful protesters is patently wrong and un-American.The Buffalo Police Benevolent Association hailed the grand jurys decision, saying in a statement that the officers were simply following orders to clear the area."}