{"text": "Warren Buffett on Saturday likened the millions of inexperienced day traders who entered the stock market in the past year to gamblers, and said commission-free brokerages such as Robinhood Financial for promoted a casino-like atmosphere.Speaking at Berkshire Hathaway Inc's annual meeting (BRKa.N), Buffett said Robinhood has attracted, \"maybe set out to attract,\" a large number of people who are just gambling on short-term price movements in stocks such as Apple Inc (AAPL.O).\"There is nothing illegal to it, there's nothing immoral, but I don't think you build a society around people doing it,\" he said.Buffett's long-time business partner, Charlie Munger, was more harsh.\"It's just god-awful that something like that would draw investment from civilized man and decent citizens,\" he said. \"It's deeply wrong. We don't want to make our money selling things that are bad for people.\"Buffett said that while the odds of profiting from day trading stocks and derivatives are better than playing the state lottery, many new investors would have better results buying and holding shares of good companies.\"The gambling impulse is very strong in people worldwide and occasionally it gets an enormous shove,\" Buffett said. \"It creates its own reality for a while, and nobody tells you when the clock is going to strike 12 and it all turns to pumpkins and mice,\" he said.Some critics have said free trading platforms can encourage millennials to view trading as a game or amusement.Brokers like Robinhood Financial have attracted controversy this year as traders drove huge rallies in shares of video game retailer GameStop Corp (GME.N), movie theater chain AMC Entertainment Holdings Inc (AMC.N) and other companies despite no fundamental reason for the frenzy.Some of the buying was fueled by chats on forums like Reddit's WallStreetBets to ostensibly to punish hedge funds that had bet against so-called meme stocks.Robinhood faces many lawsuits over its decision in January to curb trading in GameStop and other stocks, and Massachusetts is seeking to revoke its broker-dealer license.  read more "}