{"text": "A federal judge in Missouri said on Wednesday a group of hair salons and restaurants can sue their insurance carrier for business interruption losses caused by the coronavirus pandemic, which they say caused a direct physical loss to their premises.The decision against Cincinnati Insurance Co by U.S. District Judge Stephen Bough in Kansas City appears to be first victory for policyholders suing insurers for improperly denying claims related to shutdowns caused by COVID-19.Insurers had won similar cases in courts in Michigan and Washington, D.C., successfully arguing that coverage was not warranted because the virus travels through the air and does not cause physical damage.In refusing to dismiss the Missouri case, Bough said the presence of COVID-19 was not a benign condition, and the plaintiffs plausibly alleged that particles were a physical substance that attached to and damaged their property, rendering them unsafe and unusable.Bough did not rule on the cases merits. The plaintiffs operate businesses in Missouri and Kansas.Brandon Boulware, a lawyer for the plaintiffs, called the decision a significant win for policyholders.The Cincinnati policy is an all risks policy and does not contain any exclusion for losses caused by a virus, he said. The courts order correctly recognizes that.Business owners have filed hundreds of lawsuits claiming that their business interruption insurance, which typically offers coverage for losses from calamities such as fires or floods, should also cover a pandemic.Insurers have countered that applying such coverage to COVID-19 losses would result in crippling payouts and deplete their capital.Analysts have said the industrys coronavirus-related losses have so far been modest.The Judicial Panel on Multidistrict Litigation is considering whether to consolidate hundreds of lawsuits seeking business interruption coverage for COVID-19.The case is Studio 417 Inc et al v Cincinnati Insurance Co, U.S. District Court, Western District of Missouri, No. 20-03127."}