{"text": "LOS ANGELES About 800 longshoremen from the ports of Los Angeles and Long Beach on Friday got the first COVID-19 vaccinations for dockworkers at the United States busiest seaport complex, which has been hard hit by pandemic-related workforce disruptions and surging imports.The shots were a welcome relief for the International Longshore and Warehouse Union (ILWU) members who snapped up the appointments in about 20 minutes.The inoculations offer peace of mind to longshoremen Patty Castillo, 46, and Adrian Esqueda, 48, who said co-workers and family members have contracted COVID-19 - and some have died of it.We have a fortress against the disease, said Esqueda, as he sat in a truck with Castillo, his wife, during the observation period required after receiving the vaccination.Many dockworkers have jobs that require interacting with dozens of different people every day, ILWU members said.You cant do (working in) pods. There is no way to avoid contact and physical distance in some jobs, said ILWU member Brennan Hill, 52, who also received his first of two injections of Moderna Incs COVID-19 vaccine at the Long Beach Convention Center on Friday.This offers a little hope going forward, Hill said of the start of vaccinations for the 15,000 people who work on the docks.The two ports together account for nearly half of all U.S. maritime trade and some 70 percent of the nations imports from Asia. They have been inundated with incoming cargo, resulting in delays that have caused record numbers of ships to wait to be unloaded and a slowdown in the movement of goods across the United States.Meanwhile, high-stakes battles are raging over which workers should be prioritized as essential.Such decisions are sometimes made at the local level. That has led to a patchwork of vaccination eligibility rules that are exacerbating anxiety at a time when demand for COVID-19 vaccines far outstrips supply.The Long Beach Department of Health and Human Services organized Fridays clinic, the first of a series. It came as mass inoculation sites in other parts of Los Angeles County - including at Dodger Stadium - are temporarily closed due to a lack of vaccine doses.Some states are starting to expand vaccinations beyond first responders, healthcare workers and the elderly to supermarket clerks, line cooks, bus drivers and teachers.In New York state, grocery store and restaurant workers are permitted to get the shots. And in Illinois, some auto factory workers have begun receiving vaccinations."}