{"text": "Retailers, restaurants and theatres in India's richest state are reeling under the impact of harsh restrictions imposed last week by authorities scrambling to curb a resurgence in COVID-19 cases.The western state of Maharashtra, home to India's financial capital Mumbai, has been the worst hit in the pandemic, accounting for about a quarter of the country's 13.5 million case load.  read more Last week, the local government shut down restaurants, bars, gyms, theatres and non-essential stores in a blow to businesses that had barely recovered from the nationwide lockdown last year.After closing for more than eight months, theatres in Maharashtra reopened in November despite sporadic Bollywood releases and capacity restrictions.But with the new surge in cases and the spectre of more curbs, theatre owners say they may never recover from the losses and be forced to shut down.\"It's the final nail in the coffin,\" said Sharad Doshi, vice-president of the Cinema Owners and Exhibitors Association of India. \"We have no choice but to perish.\"Doshi and other business owners have called on the government provide support through tax waivers and subsidies on rent to prevent the crisis from worsening.India reported 168,912 new infections on Monday, inching past Brazil, with a total of 13.53 million cases, data compiled by Reuters shows. India is now the second-most affected country after the United States that is grappling with 31.2 million cases.With barely 4% of more than 1.3 billion people in India estimated to have been vaccinated, experts say the COVID crisis in the country could have a long way to go.STORES CLOSURES, JOB LOSSESMaharashtra, one of India's most urbanised and industrialised states, accounts for nearly 15% of the country's gross domestic product and is crucial for its economic recovery.The Confederation Of All India Traders estimated traders in Maharashtra would lose about 1 trillion rupees ($13.34 billion) during a month-long lockdown.The state has also suffered the most deaths in India's COVID-19 outbreak, and as cases continue to surge, sources said authorities were considering shutting down some industries and restricting public transport.\"One month (of lockdown) is equivalent to about $5 billion of revenue for retailers from just Maharashtra,\" Kumar Rajagopalan, CEO of the Retailers Association of India, told Reuters. \"We are talking about 1.2 million stores and 5 million jobs.\"Rajagopalan said store shutdowns will hit sectors such as manufacturing, distribution and banking and have a snowball effect on the economy.Restaurants and bars in Maharashtra had already felt the pinch as the state mandated a daily curfew after 8pm - prime time for eateries to rake in revenues - before shuttering them completely last week.Riyaaz Amlani, who runs nearly 60 popular restaurants, including SOCIAL, across 15 cities in India, said the shutdown would lead to more job losses.Amlani said many restaurants took loans to re-start their businesses after burning capital during the lockdown last year and would now have to bear interest costs on top of fixed costs.\"So there is a serious crisis looming,\" he said.($1 = 74.9400 Indian rupees)"}