{"text": "Airspace Systems, a California startup company that makes drones that can hunt down and capture other drones, on Thursday released new software for monitoring social distancing and face-mask wearing from the air.The software analyzes video streams captured by drones and can identify when people are standing close together or points where people gather in clusters. The software can detect when people are wearing masks. The system can also process video captured by ground-based cameras, and Airspace aims to sell the system to cities and police departments.Airspace says the system does not use facial recognition and does not save images of people or pass those images to Airspaces customers. Instead, it generates text-based data on how many people in a given area are crowded together and what percentage of people are wearing masks, generating alerts.Cities can decide whether to send those alerts as public messages to residents or route them internally to cleaning crews or law enforcement.Jaz Banga, Airspaces chief executive said in an interview, that the software does not track individuals.Jay Stanley, a senior policy analyst with the American Civil Liberties Unions Speech, Privacy and Technology Project, said that even with those protections in place, the system is still a step toward robots that are monitoring our behavior.Do we want to be in a world where machine security guards are watching our every move and blowing the whistle on every petty violation of every law, rule, statute or guideline? Stanley said. Thats potentially a nightmare vision.Bangas intention is to help cities monitor places where people cant help but run into each other, such as crowded bus stops or where subway stations empty onto streets.You can design better barriers. You can disinfect that area if youre allowed to do that in that area, Banga said. It just gives you more targeting to create safer environments.(This story has been refiled to insert dropped word in the fifth paragraph)"}