{"text": "Cambodias capital of Phnom Penh on Saturday began overseeing the dismantling of floating home communities on the banks of the Tonle Sap River over the objections of longtime residents who say they have nowhere else to go.For generations, the floating wooden houseboats of Phnom Penh have been both livelihood and way of life for mostly ethnic Vietnamese families, home to fish farming and interconnected by warrens of hand-built bridges interspersed with sunken poles and small boats.\"Our ancestors have always been here,\" said Kith Dong, 54, as he and relatives dismantled his home of consisting of a grayling timber platform with a sloped tin roof off the shore of Phnom Penh's Prek Pnov district.He said the city order did not give his family enough time to relocate.\"If they extended by a few more months, we would have time to build a home,\" he said.The Phnom Penh Municipality says the communities amount to floating slums that are eyesores and health hazards, with trash bags and raw sewage floating alongside the houseboats.Si Vutha, head of Prek Pnov district's land management office, oversaw the dismantling on Friday.\"There are 316 homes that we have to evict today. This really affects the beauty of the city, the environment. You sit on a boat, it smells very bad,\" Si Vutha told Reuters.Si Vutha said the evictions are intended to clean up the capital ahead of Phnom Penh's hosting of the 2023 Southeast Asian Games, as the newly built stadium is only a few kilometres away.\"There are hundreds of viruses here, foreign tourists come and see our country like this?\" he said.But residents say the crackdown came too soon and questioned why they needed to move with the games still more than a year away.Si Vutha did not specify why the cleanup had to come now, and Phnom Penh city spokesperson Met Meas Pheakdey could not be reached for comment on Saturday.Dang Van Chou, 57, moved to Cambodia more than 20 years ago from neighbouring Vietnam,His family makes a living farming fish in enclosures off their dwelling, but this year's fish are too small to sell to raise money for a move, he said.I dont know where to go, I dont have any land, he said."}