{"text": " (Adds details on activity and updates prices)\n    * Canadian dollar rises 0.5% against the greenback\n    * Loonie touches a three-year high at 1.2461\n    * Canada adds 259,000 jobs in February\n    * Canada's 10-year yield climbs to a 14-month high at 1.596%\n\n    By Fergal Smith\n    TORONTO, March 12 The Canadian dollar rose\nagainst all the other G10 currencies on Friday and Canada's bond\nyields jumped, after a bigger-than-expected domestic jobs gain\nsupported the view that the Bank of Canada would reduce\nquantitative easing purchases next month.\n    Canada added 259,000 jobs in February, beating estimates of\na 75,000 increase, driven by the reopening of businesses as\nCOVID-19 lockdowns put in place in December and January were\neased, data from Statistics Canada showed.             \n    \"There remains a long way to go before the employment\nbackdrop returns to its pre-pandemic state,\" said Ryan Brecht, a\nsenior economist at Action Economics. \"That being said, another\nfirm jobs report for March would likely boost market\nexpectations of a taper as soon as the April announcement.\"\n    The central bank is buying C$4 billion of bonds per week to\nsupport the economy. On Wednesday, it signaled it would reduce\nthe pace of purchases as it continues to gain confidence in the\nstrength of the recovery.             \n    The Canadian dollar        was trading 0.5% higher at 1.2465\nto the greenback, or 80.22 U.S. cents, the biggest gain among\nG10 currencies. It touched its strongest since February 2018 at\n1.2461, while it was up 1.5% for the week.\n    The safe-haven U.S. dollar        rose following a fresh\nspike in Treasury yields as the prospect of economies emerging\nfrom year-long coronavirus lockdowns reignited inflation fears.\n            \n    The price of oil, one of Canada's major exports,\nconsolidated its recent gains. U.S. crude        futures settled\n0.6% lower at $65.61 a barrel.\n    Canadian government bond yields were higher across a steeper\ncurve. The 10-year             touched its highest since January\nlast year at 1.596% before dipping to 1.584%, up 14 basis points\non the day.\n\n (Reporting by Fergal Smith\nEditing by Nick Zieminski and Alistair Bell)\n  "}