{"text": " (Adds strategist quotes and details throughout; updates prices)\n    * Canadian dollar strengthens 0.6% against the greenback\n    * Touches its strongest level since Nov. 16 at 1.2495\n    * Price of U.S. oil settles 1.75% higher\n    * Canadian bond yields rise across the curve\n\n    By Fergal Smith\n    TORONTO, Jan 12 The Canadian dollar strengthened\nto its highest level in nearly two months against its U.S.\ncounterpart on Wednesday as oil prices rose and investors took\nin stride data showing U.S. inflation rose strongly in December.\n    The loonie        was trading 0.6% higher at 1.2505 to the\ngreenback, or 79.97 U.S. cents, after touching its strongest\nintraday level since Nov. 16 at 1.2495.\n    \"We're seeing the U.S. dollar broadly set back,\" said Marc\nChandler, chief market strategist at Bannockburn Global Forex\nLLC. \"So the currencies that are levered toward growth - Norway,\nthe dollar-bloc - are all outperforming.\"\n    Wall Street rose and the U.S. dollar        fell against a\nbasket of currencies. Data showed U.S. consumer prices rising\nsolidly in December but in line with economists' expectations,\neasing some concern about faster-than-expected policy tightening\nby the Federal Reserve.                         \n    The so-called dollar-bloc currencies, which include the\nAustralian and New Zealand dollars              as well as the\nCanadian dollar, are known for their sensitivity to moves in\ncommodity prices. Like Canada, Norway is a major producer of\noil.\n    Oil added to recent gains on tight supply and easing\nconcerns about the potential hit to demand from the Omicron\ncoronavirus variant. U.S. crude        prices settled 1.75%\nhigher at $82.64 a barrel.             \n    On Tuesday, the Canadian dollar broke the neckline of a\nhead-and-shoulders trend reversal pattern at about 1.2600.\n    That move gave rise to a \"measured objective\" of 1.2250,\nChandler said, referring to a technique in technical analysis\nfor identifying a target.\n    Canadian government bond yields rose across the curve, with\nthe 10-year             up 1.7 basis points at 1.720%. On\nMonday, it touched its highest level in more than six weeks at\n1.753%.\n\n (Reporting by Fergal Smith; editing by Jonathan Oatis)\n  "}