{"text": "Aug 12 Canadas main stock index opened higher on Wednesday as energy stocks tracked gains in oil prices, which rose on hopes for a recovery in demand due to a drop in U.S. crude inventories.* The American Petroleum Institute API said on Tuesday that crude stocks fell by 4 million barrels last week, compared with analysts expectations in a Reuters poll for a draw of 2.9 million barrels.* The energy sector climbed 2.3% as U.S. crude prices were up 2.1% a barrel, while Brent crude added 1.8%.* At 09:38 a.m. ET (13:38 GMT), the Toronto Stock Exchanges S&P/TSX composite index was up 158.78 points, or 0.96%, at 16,655.79.* The Canadian dollar strengthened against its U.S. counterpart on Wednesday as oil prices rose and investors weighed prospects of U.S. economic stimulus, while Canadas 10-year yield climbed to its highest in more than two months.* Worlds largest civil aviation training company CAE Inc fell 3.1% as it reported a bigger-than-expected quarterly loss on Wednesday.* The financials sector gained 1.1%, while the industrials sector rose 0.9%.* The materials sector, which includes precious and base metals miners and fertilizer companies, added 1.5% as gold futures fell 0.3% to $1,927.1 an ounce.* On the TSX, 198 issues were higher, while 18 issues declined for a 11-to-1 ratio favoring gainers, with 15.53 million shares traded.* The largest percentage gainers on the TSX were Hudbay Minerals, which jumped 8.5% on better-than-expected quarterly results, and BRP Inc, which rose 7.1%.* Boralex Inc fell 2.9%, the most on the TSX, after announcing a $175 mln share offering. The second biggest decliner was Alimentation Couche-Tard Inc, down 1.7%.* The most heavily traded shares by volume were B2Gold Corp ,Bombardier Inc and Barrick Gold Corp .* The TSX posted 1 new 52-week high and no new low.* Across all Canadian issues, there were 10 new 52-week highs and new low, with total volume of 32.58 million shares. (Reporting by Shivani Kumaresan in Bengaluru; Editing by Vinay Dwivedi)"}