{"text": "    * Canadian dollar strengthens 0.4% against the greenback\n    * Touches its strongest level since Nov. 16 at 1.2513\n    * Price of U.S. oil rises nearly 1%\n    * Canadian bond yields trade mixed across the curve\n\n    TORONTO, Jan 12 The Canadian dollar strengthened\nto its highest level in nearly two months against its U.S.\ncounterpart on Wednesday as oil prices rose and investors took\nin stride data showing U.S. inflation rose strongly in December.\n    The loonie        was trading 0.4% higher at 1.2518 to the\ngreenback, or 79.88 U.S. cents, after touching its strongest\nintraday level since Nov. 16 at 1.2513.\n    U.S. stock index futures extended gains and the U.S. dollar\n       lost ground against a basket of major currencies after\nconsumer prices data came largely in line with expectations,\neasing some concern about faster-than-expected policy tightening\nby the Federal Reserve.             \n    It follows gains for Wall Street on Tuesday as Fed Chair\nJerome Powell said it may take several months to make a decision\non running down the central bank's $9 trillion balance sheet.\n            \n    The price of oil, one of Canada's major exports, added to\nrecent gains on tight supply and easing concerns about the\npotential hit to demand from the Omicron coronavirus variant.\nU.S. crude        prices were up nearly 1% at $82.01 a barrel.\n            \n    On Tuesday, the Canadian dollar broke the neckline of a\nhead-and-shoulders trend reversal pattern at about 1.2600, which\nwas seen by some traders as a bullish signal for the currency.\n    Quebec, Canada's second most populous province, is planning\nto force adults refusing to get COVID-19 vaccinated to pay a\n\"health contribution\" in a move likely to spur a debate about\nindividual rights and social responsibility.             \n    Canadian government bond yields were mixed across the curve,\nwith the 10-year             down about half a basis point at\n1.696%. On Monday, it touched its highest level in more than six\nweeks at 1.753%.\n\n (Reporting by Fergal Smith; editing by Jonathan Oatis)\n  "}