{"text": "VANCOUVER The Canadian judge in Huawei CFO Meng Wanzhous U.S. extradition case rejected her request to admit as evidence Huawei employee statements that contradict a U.S. claim she misled bankers about the companys business in Iran, a ruling said on Friday.But the judge provisionally allowed parts of an experts report that Mengs team requested be permitted into evidence, subject to further submissions about its relevance, the ruling showed.Meng, 49, was arrested in December 2018 at Vancouver International Airport on a U.S. warrant for allegedly misleading HBSC about Huaweis business dealings in Iran and causing the bank to violate U.S. sanctions.She has since been fighting the case from under house arrest in Vancouver and has said she is innocent.The evidence Mengs team sought to add related to their claim that HSBC knew about Huaweis businesses in Iran, and that Meng did not mislead the bank.Two affidavits were from Huawei employees who attended the meeting where the United States alleges Meng lied about the companys business connections in Iran.Associate Chief Justice Heather Holmes of British Columbia Supreme Court said that allowing this into evidence could do no more than invite credibility findings, turning the case into a he-said-she-said.Holmes also rejected two more Huawei employee affidavits alleging that HSBC employees knew about Huaweis connections to businesses in Iran, stating that they were beyond the proper scope of an extradition hearing.The difficulty Ms. Meng faces is that this body of evidence relates to issues properly within the domain of a trial, not the extradition hearing, Holmes wrote.Holmes did provisionally allow parts of a report by an expert on the application of U.S. sanctions law to financial institutions, stating it could address a potentially misleading aspect of U.S. evidence. But she said that more submissions would be necessary to prove its relevance.Meng is set to appear in court on Monday as her case enters the final phase of arguments, scheduled to finish in May.Huawei did not immediately respond to a request for comment."}