{"text": " (New throughout, updates prices, market activity and comments,\nadds strategist comments)\n    * Canadian dollar gains 0.4% against the greenback\n    * Loonie touches its strongest since Feb. 21 at 1.3225\n    * Price of U.S. oil increases 2.6%\n    * Canada's 10-year yield touches a 2-month high at 0.621%\n\n    By Fergal Smith\n    TORONTO, Aug 12 The Canadian dollar climbed on\nWednesday to its strongest level in nearly six months against\nits U.S. counterpart, as the prospect of further economic\nstimulus bolstered the outlook of commodities that Canada\nexports, which benefit from higher inflation.\n    The loonie        was trading 0.4% higher at 1.3250 to the\ngreenback, or 75.47 U.S. cents. The currency touched its\nstrongest intraday level since Feb. 21 at 1.3225.\n    \"The Canadian dollar is riding the tailwind of another rally\nin oil prices and stocks,\" said Adam Button, chief currency\nanalyst at ForexLive.\n    The S&P 500 rallied to finish just short of its February\nrecord closing high as investors awaited news on bipartisan\ntalks over the next federal aid bill to help tens of millions of\nAmericans suffering in the coronavirus pandemic.             \n    The combination of fiscal and monetary stimulus means that\ncoming out of the crisis there is going to be \"a very strong\ninflationary impulse that is going to benefit commodities.\"\n    A measure of U.S. underlying inflation increased in July by\nthe most in nearly 30 years amid broad gains in the costs of\ngoods and services, data showed.             \n    Canada is a major producer of commodities, including oil.\nU.S. crude oil futures        settled 2.6% higher at $42.67 a\nbarrel after government data showed U.S. oil inventories fell\nacross the board, bolstering hopes that fuel demand in the\nworld's biggest economy will withstand the coronavirus pandemic.\n            \n    Ontario, Canada's most populous province and economic\nengine, projected its budget deficit would widen to a record\nC$38.5 billion in 2020-2021 as it raised support for the economy\nravaged by the coronavirus crisis.              \n    Canadian government bond yields were higher across the\ncurve, with the 10-year             up 2.6 basis points at\n0.603%. It touched its highest intraday level since June 11 at\n0.621%.\n\n (Reporting by Fergal Smith; Editing by David Gregorio)\n  "}