{"text": "    * Canadian dollar weakens 0.3% against the greenback\n    * Oil prices pare gains\n    * Canadian bond yields mixed across the curve\n\n (Updates prices)\n    By Saqib Iqbal Ahmed\n    April 12 The Canadian dollar slipped against its\nU.S. counterpart on Monday, giving up nearly all advances logged\nin the previous session, as oil prices pared the day's early\ngains.\n    At 4:01 p.m. EDT (2001 GMT), the Canadian dollar was trading\n0.3% lower at 1.2557 to the greenback, or 79.64 U.S. cents.\n    The loonie had risen 0.3% on Friday after data showed Canada\nadded far more jobs than expected in March, bringing employment\nto within 1.5% of pre-pandemic levels.             \n    A rise in the price of oil, one of Canada's main exports,\ninitially helped the loonie fend off deeper losses against its\nU.S. counterpart on Monday. But with oil barely clinging to the\nday's gains as the trading session progressed, the Canadian\ncurrency came under pressure.             \n    Investors' expectation for a continued rise in U.S. Treasury\nyields has been supportive of the greenback, helping keep the\nCanadian dollar from breaking above the three-year high of\n$1.2361 touched in mid-March.\n    \"While we expect some of the jump in jobs to be unwound this\nmonth as a result of Ontarios lockdown moves, the trend in jobs\nand progress on access to vaccines should provide policy makers\nwith enough confidence in the outlook to at least signal a move\ntowards tapering asset purchases at the April 21st policy\ndecision,\" Shaun Osborne, chief currency strategist at\nScotiabank, said in a note.\n    \"We look for the Canadian dollar to remain better supported\non dips and to make a bit more progress in the short run back\ntowards a $1.24 handle,\" Osborne said.\n    Canadian government bond yields were mixed across the curve,\nwith the 10-year trading at 1.517%, not far from its close on\nFriday at 1.5%, while the 2-year traded at 0.247%, down from\nFriday's 0.254%.\n\n (Reporting by Saqib Iqbal Ahmed; Editing by Jonathan Oatis and\nPeter Cooney)\n  "}