{"text": "    * Canadian dollar rises 0.3% against the greenback\n    * Loonie is on track to fall 1.2% for the week\n    * Canadian industrial capacity use falls in the first\nquarter\n    * Canadian bond yields rise across the curve\n\n    TORONTO, June 12 The Canadian dollar\nstrengthened against its U.S. counterpart on Friday along with a\nrebound in stocks on Wall Street, but after a sharp decline the\nday before, the loonie was on course to end its weekly winning\nstreak.\n    U.S. stocks rallied a day after their biggest one-day dive\nin about three months on fears of a resurgence in coronavirus\ninfections.             \n    Canada runs a current account deficit and is a major\nexporter of commodities, including oil, so the loonie tends to\nbe sensitive to the global flow of trade and capital.\n    U.S. crude oil futures        fell 1.2% to $35.91 a barrel\nand were on track for their first weekly fall in seven as\ninvestors weighed the prospect of a second wave of infections\nhitting demand.             \n    The Canadian dollar        was trading 0.3% higher at 1.3584\nto the greenback, or 73.62 U.S. cents. The currency traded in a\nrange of 1.3527 to 1.3666.\n    The loonie was down 1.2% for the week, having climbed for\neach of the previous three weeks. On Wednesday, it reached its\nstrongest level in more than three months at 1.3311.\n    Canadian industries ran at 79.8% of capacity in the first\nquarter of 2020, down from an upwardly revised 81.4% in the\nfourth quarter, Statistics Canada said.             \n    Separate data from Canada's national statistics agency\nshowed that producer prices, in a flash estimate, gained 1.2% in\nMay from April, led by strong gains in meat prices as COVID-19\nclosed down packing plants.             \n    Canadian government bond yields were higher across the\ncurve, with the 10-year             up 2.1 basis points at\n0.541%. Still, the 10-year yield has tumbled nearly 23 basis\nfrom last Friday's peak.\n\n (Reporting by Fergal Smith; editing by Jonathan Oatis)\n  "}