{"text": "TORONTO, Aug 12 Investors are looking for signs that Canadas next government could dial back historic levels of fiscal spending to support the economy during the coronavirus crisis, with activity already on track to make a full recovery.Political parties tend to use election campaigns to roll out new spending priorities. But additional measures at this time could concern the bond market and credit rating agencies, particularly if they dont boost economic growth. They could also add to inflation pressures.Canadian Prime Minister Justin Trudeau is planning to call a snap election for Sept. 20, Reuters reported on Thursday.Canadian government bond yields, the loonie and Canadas main stock index edged lower as commodity prices fell, with stocks retreating from a record high on Wednesday.Polls show the governing Liberal Party well ahead of the official opposition, the Conservatives.From an economic perspective wed say we dont need more spending right now in the Canadian economy, said Rebekah Young, director, fiscal and provincial economics at Scotiabank.Markets will probably be looking for some sign of restraint; that an incoming government recognizes there is a lot already in the pipeline.In April, the government projected a C$155 billion ($124 billion) deficit for the current fiscal year, about 8% of GDP, and outlined a C$101 billion plan over three years to boost economic recovery.The economy is also expected to benefit from record levels of household savings and a high vaccination rate.Ontario, Canadas most populous province, on Thursday raised its growth forecast for 2021 to 5% from 4% as it cut its deficit projection for the current fiscal year, in a sign that stimulus is already working.Canadian employment has rebounded to 1.3% below its pre-pandemic level and inflation has climbed above the top of the Bank of Canadas target range of 1% to 3%.The central bank has helped lower borrowing costs during the pandemic by buying government bonds. In addition, Canada has been one of a number of major countries, including the United States, to borrow heavily during the pandemic, so that investors have not discriminated against its debt.But that could change, analysts say.I think once you get past the pandemic, youll have some countries not running big deficits, said Darcy Briggs, a portfolio manager at Franklin Templeton Canada. And if you are running big deficits, that could pose a problem to bond markets.Fitch Ratings has already stripped Canada of one of its coveted triple-A credit ratings, but S&P Global Ratings and Moodys Investors Service still give Canadian debt the highest rating.The worry is that rating agencies could take action if programs are added that make deficits more structural in nature rather than cyclical. Examples could include a national pharmacare program and universal basic income, favored by grassroots Liberals.Meanwhile, Conservative leader Erin OToole has promised to balance the budget over the next decade.Thats a path that may not differ much from the Liberals, while the gap on climate change policy has narrowed since the last election, Avery Shenfeld, chief economist at CIBC Capital Markets, said in a note.Measures that Shenfeld says the Conservative Party could include in its platform include increasing foreign competition in the telecom market and tax initiatives to spur capital expenditure.Still, sweeping new revenue measures are not expected from the major parties, such as raising the sales tax. Instead, analysts expect targeted measures, such as a luxury vehicles tax proposed by the Liberals.When we look at those measures, we have to be a bit skeptical as to how much they would bring in at the end of the day in terms of revenue, Young said. (Reporting by Fergal Smith; editing by Jonathan Oatis)"}