{"text": " (Adds strategist quotes and details throughout, updates prices)\n    * Canadian dollar weakens 0.6% against the greenback\n    * Loonie hits a one-week low at 1.3149\n    * Price of U.S. oil settles 0.8% lower\n    * Canadian bond yields ease across a flatter curve\n\n    By Fergal Smith\n    TORONTO, Nov 12 The Canadian dollar fell for the\nthird straight day against the greenback on Thursday, as surging\nCOVID-19 infections weighed on investor sentiment and a senior\nBank of Canada official said the level of economic activity that\nCanada can sustain must rise.\n    The Canadian dollar        was trading 0.6% lower at 1.3135\nto the greenback, or 76.13 U.S. cents, having touched its\nweakest intraday level since last Thursday at 1.3149.    \n    \"CAD seems to be following equities fairly closely, so the\nweakness we're seeing in risk sentiment is probably weighing on\nthe loonie,\" said Erik Nelson, a currency strategist at Wells\nFargo in New York.\n    Wall Street lost ground after New York became the latest\nstate to introduce social distancing restrictions to help\ncontain the virus and investors weighed the timeline of the mass\nrollout of an effective vaccine.             \n    Canada runs a current account deficit and is a major\nproducer of commodities, including oil, so the loonie tends to\nbe sensitive to the global flow of trade and capital.\n    U.S. crude oil futures        settled 0.8% lower at $41.12 a\nbarrel, pressured by an unexpected rise in U.S. crude\nstockpiles.                 \n    After the COVID-19 pandemic, Canada will need to focus on\ncreating sustainable growth that does not leave people behind in\norder to make higher levels of debt more manageable, a senior\nBank of Canada official said on Thursday.             \n    Canadian government bond yields were lower across a flatter\ncurve in sympathy with U.S. Treasuries. The 10-year            \nfell 5 basis points to 0.723%, extending its pullback from a\nseven-month high on Tuesday at 0.803%.\n\n (Reporting by Fergal Smith\nEditing by Nick Zieminski and Jonathan Oatis)\n  "}