{"text": "TORONTO Canadas main securities regulator has cleared the launch of the worlds first bitcoin exchange traded fund, an investment manager said on Friday, providing investors greater access to the cryptocurrency that has sparked an explosion in trading interest.The Ontario Securities Commission has approved the launch of Purpose Bitcoin ETF, Toronto-based asset management company Purpose Investments Inc. said in a statement. The OSC confirmed the approval in a separate statement to Reuters.The ETF will be the first in the world to invest directly in physically settled Bitcoin, not derivatives, allowing investors easy and efficient access to the emerging asset class of cryptocurrency, Purpose Investments said.Investors have been able to trade bitcoin using futures contracts on the CME derivatives exchange. They can also buy closed-end investment funds, such as the Bitcoin Fund on the Toronto Stock Exchange.An ETF could offer some advantages to investors, such as buying at net asset value rather than at a premium, said Arthur Salzer, chief executive officer of Northland Wealth ManagementI think the OSC is doing the right thing allowing for an ETF, Salzer said. It gets rid of some of the negatives of the current funds.Bitcoin notched a record high of $48,975 on Friday. It has gained about 63% so far this year and soared roughly 1,130% since mid-March 2020.Elon Musks Tesla revealed on Monday it had bought $1.5 billion worth of the cryptocurrency and would soon accept it as a form of payment for its cars, while the cryptocurrency has been gaining acceptance among mainstream financial firms.In the United States, eight firms have tried without success since 2013 to create a bitcoin ETF, according to Todd Rosenbluth, director of ETF and mutual fund research at New York based CFRA.Among issues the Securities and Exchange Commission appears to be focused on are the potential for market manipulation and the process of custody audits that verify that a fund holds its purported assets.While some expect that a Canadian ETF approval sets the stage for a near-term U.S. one, we expect the SEC under new leadership to take their time to review some of the new filings from VanEck and others, Rosenbluth said.VanEck is a New York-based investment management firm.Gary Gensler, former chair of the Commodity Futures Trading Commission, was named chair of the SEC last month by U.S. President Joe Biden."}