{"text": "(Adds analyst quotes and details throughout, updates prices)* TSX ends up 120.19 points, or 0.6%, at 21,395.00* Touches its highest closing level since Nov. 25* Energy advances 1.4%, oil settles 1.8% higher* Materials adds 2.3%, copper gains 2.9%TORONTO, Jan 12 Canadas main stock index rose on Wednesday to its highest level in nearly seven weeks as rising commodity prices boosted the attractiveness of resource shares.The Toronto Stock Exchanges S&P/TSX composite index ended up 120.19 points, or 0.6%, at 21,395.00, its highest closing level since Nov. 25.It looks like the market is starting to anticipate an improving economy and an increasing demand for resources, said Colin Cieszynski, chief market strategist at SIA Wealth Management.The energy group advanced 1.4% as oil prices climbed to two-month highs on tight supply and a weaker U.S. dollar.U.S. crude prices settled 1.8% higher at $82.64 a barrel, while copper, which has a reputation for flagging turns in economic activity, was up 2.9%.If Doctor Copper is picking up, thats a good sign broadly for business conditions, corporate earnings and potentially the stock market, Cieszynski said, referring to the nickname given to the base metal.The materials group, which includes precious and base metals miners and fertilizer companies, added 2.3%, while financials, the most heavily weighted sector on the Toronto market, ended 0.5% higher.Wall Street also rose as U.S. consumer price readings came largely in line with expectations, easing concerns around sooner-than-expected policy tightening by the Federal Reserve.Investors were also relieved after Fed Chair Jerome Powell on Tuesday told a congressional hearing it could take several months to make a decision on reducing the central banks $9 trillion balance sheet.We had some volatility disturbances, but now it feels like were ready to get through that and move close to new highs, said Gregory Taylor, portfolio manager at Purpose Investments.The TSX notched a record high in November at 21,796.16. (Reporting by Fergal Smith; additional reporting by Amal S in Bengaluru; editing by Jonathan Oatis)"}