{"text": "    * Canadian dollar rises 0.2% against the greenback\n    * Loonie falls 1.3% for the week\n    * Canadian industrial capacity use falls in the first\nquarter\n    * Canadian bond yields were mixed across the curve\n\n    By Fergal Smith\n    TORONTO, June 12 The Canadian dollar\nstrengthened against its U.S. counterpart on Friday along with a\nrebound in Wall Street stocks, but a sharp decline a day earlier\nleft the loonie with a weekly loss, ending a three-week winning\nstreak.\n    The Canadian dollar        was trading 0.2% higher on the\nday at 1.3595 to the greenback, or 73.56 U.S. cents. The\ncurrency traded in a range of 1.3527 to 1.3666.\n    The loonie was down 1.3% for the week, after climbing for\neach of the previous three weeks. On Wednesday, it reached its\nstrongest level in more than three months at 1.3311.\n    \"The souring mood in markets has lifted the USD from its\nCOVID-depths and may keep the dollar's key peers on the\ndefensive in the short-run, particularly high-beta FX such as\nthe CAD, AUD, and MXN,\" strategists at Scotiabank, including\nShaun Osborne, said in a note.\n    Beta is a measure of a financial asset's volatility compared\nto the market. Canada is a major exporter of commodities,\nincluding oil, so the loonie tends to be sensitive to the\noutlook for the global economy.\n    U.S. stocks rallied a day after their biggest daily dive in\nabout three months, while U.S. crude oil futures settled 0.2%\nlower at $36.26 a barrel.                             \n    Canadian industries ran at 79.8% of capacity in the first\nquarter of 2020, down from an upwardly revised 81.4% in the\nfourth quarter, Statistics Canada said.             \n    Separate data from Canada's national statistics agency\nshowed that producer prices, in a flash estimate, gained 1.2% in\nMay from April, led by strong gains in meat prices as COVID-19\nclosed down packing plants.             \n    Canadian government bond yields were mixed across the curve,\nwith the 10-year             up less than a basis point at\n0.529%. Still, the 10-year yield has tumbled nearly 24 basis\nfrom last Friday's peak.\n\n (Reporting by Fergal Smith; editing by Jonathan Oatis and David\nGregorio)\n  "}