{"text": " (Adds strategist quotes and details throughout, updates prices)\n    * Canadian dollar dips 0.2% against the greenback\n    * Loonie trades in a range of 1.2500 to 1.2533\n    * Price of U.S. oil settles 0.2% lower\n    * Canadian 10-year yield eases half a basis point to 1.256%\n\n    By Fergal Smith\n    TORONTO, Aug 12 The Canadian dollar edged lower\nagainst its U.S. counterpart on Thursday, as data suggesting\nU.S. inflation pressures remain strong raised pressure on the\nFederal Reserve to reduce economic stimulus and investors braced\nfor a Canadian federal election.\n    The U.S. dollar        advanced against a basket of\ncurrencies after data showed producer prices posting their\nlargest annual increase in more than a decade in July.\n            \n    Investors remain vigilant for any signs of inflation running\ntoo hot since it could spur the Fed to pull forward the tapering\nof asset purchases.    \n    \"Fed policy, I think that's the key driver right now,\" said\nMarc Chandler, chief market strategist at Bannockburn Global\nForex LLC. \"People are thinking that the Fed is more hawkish.\"\n    Adding to pressure on the loonie, the price of oil, one of\nCanada's major exports, settled 0.2% lower at $69.09 a barrel,\nafter the International Energy Agency said the spread of the\nDelta variant of the coronavirus would slow the recovery of\nglobal oil demand.             \n    The Canadian dollar        was trading 0.2% lower at 1.2525\nto the greenback, or 79.84 U.S. cents, after trading in a range\nof 1.2500 to 1.2533.\n    Canadian Prime Minister Justin Trudeau is planning to call a\nsnap election for Sept. 20, Reuters reported. Investors are\nlooking for signs that Canada's next government could dial back\nhistoric levels of fiscal spending to support the economy during\nthe pandemic, with activity already on track to make a full\nrecovery.             \n    \"I think (Canadian) policymakers, both the government and\nthe central bank are more confident in the recovery, especially\ngiven the strength of the U.S. economy,\" Chandler said.\n    Canadian government bond yields were little changed across\nthe curve, with the 10-year             easing half a basis\npoint to 1.256%. On Wednesday, it touched its highest level in\nfour weeks at 1.295%.\n\n (Reporting by Fergal Smith; Editing by Chizu Nomiyama and Peter\nCooney)\n  "}