{"text": " (Adds strategist quotes and details throughout; updates prices)\n    * Canadian dollar strengthens 0.5% against the greenback\n    * Loonie trades in a range of 1.2711 to 1.2791\n    * Price of U.S. oil settles 1.7% higher\n    * Canada's 10-year yield touches its highest since March at\n0.887%\n\n    By Fergal Smith\n    TORONTO, Jan 12 The Canadian dollar strengthened\nagainst its U.S. counterpart on Tuesday as oil prices rose and\nthe greenback broadly declined, with the currency rebounding\nfrom its weakest in nearly two weeks the day before.\n    The loonie        was trading 0.5% higher at 1.2714 to the\ngreenback, or 78.65 U.S. cents, having traded in a range of\n1.2711 to 1.2791. On Monday, it touched its weakest since Dec.\n29 at 1.2835.\n    The move higher for the loonie was down to the rally in oil\nand \"general market sentiment,\" said Tony Valente, senior FX\ndealer at AscendantFX, adding that it's \"a slow news week ahead\nof next week's Bank of Canada policy meeting.\"\n    Money markets see an increased chance of the Bank of Canada\ncutting interest rates closer to zero, as tightening economic\nrestrictions to contain a second wave of COVID-19 cases offset\noptimism that activity will rebound later this year.\n            \n    Ontario declared an emergency after the latest modeling put\nCanada's most populous province on track to have more than\n20,000 new COVID-19 cases per day by the middle of February.\n                \n    Oil, one of Canada's major exports, rose to its highest\nsince last February as Saudi Arabia's plans to limit supply\noffset worries that rising coronavirus cases globally would\ncurtail fuel demand.             \n    U.S. crude oil futures        settled 1.7% higher at $56.68\na barrel, while the U.S. dollar edged lower against a basket of\ncurrencies, as its recent rally, driven by a spike in U.S.\nTreasury yields, appeared to run out of steam.             \n    Canadian government bond yields were mixed across a steeper\ncurve in tandem with U.S. Treasuries. The 10-year            \nwas little changed at 0.844%, having touched its highest\nintraday since March 26 at 0.887%.\n\n (Reporting by Fergal Smith; Editing by Kirsten Donovan and\nJonathan Oatis)\n  "}