{"text": "    * Canadian dollar strengthens 0.3% against the greenback\n    * Loonie touches its strongest since May 2015 at 1.2046\n    * Price of U.S. oil increases 1.7%\n    * Canadian 10-year yield touches its highest in nearly two\nweeks\n\n    By Fergal Smith\n    TORONTO, May 12 The Canadian dollar strengthened\nagainst its U.S. counterpart and all the other G10 currencies on\nWednesday as oil prices rose and investors bet that the Bank of\nCanada would be more sensitive to rising inflation than the\nFederal Reserve.    \n    U.S. consumer prices increased by the most in nearly 12\nyears in April as booming demand amid a reopening economy pushed\nagainst supply constraints.             \n    \"Higher inflation in the U.S. will spillover into Canada's\neconomy and place upwards pressure on Canadian CPI,\" said Simon\nHarvey, senior FX market analyst for Monex Europe and Monex\nCanada.\n    The Bank of Canada is likely to be \"much more sensitive\" to\nrising inflation than the Fed, Harvey said.\n    Last August, the Fed shifted to a new monetary policy\nstrategy, putting new weight on bolstering the U.S. labor market\nand less on worries about too-high inflation.             \n    The Bank of Canada last month changed its guidance to show\nit could start raising its benchmark interest rate from a record\nlow of 0.25% in late 2022. It also tapered its bond purchases,\nbecoming the first major central bank to cut back on\npandemic-era money-printing stimulus programs.\n    The Canadian dollar        was trading 0.3% higher at 1.2063\nto the greenback, or 82.90 U.S. cents, the biggest gain among\nG10 currencies. It touched its strongest intraday level since\nMay 2015 at 1.2046.\n    One of the major causes of inflation has been higher prices\nof some of the commodities that Canada produces, including oil.\n    U.S. crude oil futures        were up 1.7% at $66.40 a\nbarrel on signs of a speedy economic recovery and upbeat\nforecasts for energy demand.             \n    Canadian government bond yields were higher across the\ncurve, tracking the move in U.S. Treasuries. The 10-year\n            touched its highest since April 29 at 1.587% before\ndipping to 1.581%, up 4.2 basis points on the day.\n\n (Reporting by Fergal Smith; Editing by Andrea Ricci)\n  "}