{"text": "    * Canadian dollar falls 0.3% against the greenback\n    * Loonie hits a one-week low at 1.3111\n    * Price of U.S. oil rises 0.6%\n    * Canadian bond yields ease across a flatter curve\n\n    TORONTO, Nov 12 The Canadian dollar weakened to\na one-week low against its U.S. counterpart on Thursday as the\nrally in global shares lost some momentum and ahead of a speech\nby Bank of Canada Senior Deputy Governor Carolyn Wilkins.\n    Global shares were on course to end their longest winning\nstreak in over a year, one that has lifted them more than 10%,\nas the post-U.S. election and coronavirus vaccine bull run\npaused.             \n    Canada runs a current account deficit and is a major\nproducer of commodities, including oil, so the loonie tends to\nbe sensitive to the global flow of trade and capital.\n    U.S. crude oil futures        were up 0.6% at $41.69 a\nbarrel, although gains were capped by tempered expectations of\nan early release of a vaccine and after the IEA raised doubts\nabout a quick demand rebound amid surging coronavirus infections\nin Europe and the United States.             \n    The Canadian dollar        was trading 0.3% lower at 1.3099\nto the greenback, or 76.34 U.S. cents, having touched its\nweakest intraday level since last Thursday at 1.3111.\n    It was third consecutive day that the loonie has lost\nground, after the currency notched on Monday a two-year high. \n    Wilkins, who is due to leave the Bank of Canada next month,\nwill speak on the topic \"Exploring Life Post-COVID.\" The central\nbank will make the text available at 1:30 p.m. (18:30 GMT).\n    The Bank of Canada has signaled it will leave interest rates\non hold at a record low of 0.25% until at least 2023,    \n    Canadian government bond yields were lower across a flatter\ncurve in sympathy with U.S. Treasuries as Canada's bond market\nreopened following the Remembrance Day holiday. The 10-year\nyield             fell 1.8 basis points to 0.755%.\n    On Tuesday, it touched a seven-month high at 0.803%.\n\n (Reporting by Fergal Smith\nEditing by Nick Zieminski)\n  "}