{"text": "Answer: Cut out human operators, perhaps?Caterpillars autonomous driving technology, which can be bolted on to existing machines, is helping the U.S. heavy equipment maker mitigate the heavy impact of the coronavirus crisis on sales of its traditional workhorses.With both small and large customers looking to protect their operations from future disruptions, demand has surged for machines that dont require human operators on board.Sales of Caterpillars autonomous technology for mining operations have been growing at a double-digit percentage clip this year compared with 2019, according to previously unreported internal company data shared with Reuters.Fred Rio, worldwide product manager at Caterpillars construction digital & technology division, told Reuters that a remote-control technology, which allows users to operate machines from several miles away, would be available for construction sites in January.The company is also working with space agencies to use satellite technology to allow an operator sitting in the United States to remotely communicate with machines on job sites in, say, Africa or elsewhere in the world, he said.Caterpillars automation strategy was not born during the COVID-19 era, though. The company stepped up investments in such technologies as it emerged in 2017 from the longest downturn in its history, as part of a plan to increase recurring revenue from lucrative sales of services.But its early days, and such tech remains a niche part of Caterpillars operations. Though it does not break out the revenue from technology sales, the rising demand is unlikely to make a major impact anytime soon on the groups revenue, which stood at about $54 billion last year.It is also a costly endeavor with the company pumping billions into R&D as a whole. Yet it is not clear if demand for autonomous and remote tech will hold up in a post-pandemic world while, in the longer term, there is the risk that a technology-driven improvement in productivity could drive down sales of new equipment.IT HAS GOT CRAZIERNonetheless, autonomous technology is helping Caterpillar win equipment deals from customers that were previously not buying a lot of its machines.Rio Tinto declined to comment on the equipment deal.The mining industry has already adopted some technologies for self-driving trucks and remote operation of load-haul-dump machines. However the suspension in activities worldwide following government-mandated lockdowns at the peak of COVID-19, as well as recent outbreaks of infections at coal mines in Poland, have accelerated the deployment of those technologies.Anthony Cook, general manager for autonomous haulage systems at Caterpillars rival Komatsu, said a lot of customers had brought forward their spending plans following the pandemic in a bid to take drivers out of mining trucks.He said the COVID-19 crisis had not hit the fortunes of his autonomous business: If anything, it has got crazier.CATERPILLARS IN SPACECaterpillar and Komatsu hold the lions share of the global autonomous haulage system market worldwide.But Illinois-based Caterpillar has a competitive advantage, according to some analysts, as its technology can be retrofitted onto competitors equipment, making it a better fit for mixed fleets. Komatsus technology currently only works with its own machines.Komatsus Cook said that while retrofitting offered a short-term solution, his company was developing technology to allow different brands of equipment to operate together safely and efficiently, which he added would offer long-term benefits.But Jim Hawkins, general manager at Caterpillars resource industries division, said the ability to retrofit had helped drive up sales, because mining companies can buy the hardware and software to make machines operate autonomously without paying the much larger cost of overhauling their whole fleet.That is a selling point at a time when miners are grappling with the virus-induced business uncertainty.Caterpillar sells autonomous operation technology separately from its machines. While retrofitting existing fleets has been the biggest driver for growth until now, Hawkins says an increasing number of customers are now ordering autonomous-ready mining trucks.The company charges mining customers a hardware fee, a software fee and recurring licensing fee. In all, the technology could cost from $50 million to hundreds of millions of dollars, depending upon the size of the fleet and the duration of the contract, Hawkins said.All these applications are part of the companys endeavor to increases services revenue, which tends to be more resilient and profitable than equipment sales. It aims to increase services sales to $28 billion by 2026 from $18 billion in 2019.Rob Wertheimer, machinery analyst at Melius Research, said the need for mining companies to replace an aging mining fleet and their growing demand for autonomous upgrades should help Caterpillar, with its tech giving it a differential advantage over rivals.Strategically, they are in a better place, he added."}