{"text": "Video games maker CD Projekt (CDR.WA) has no plans to shelve Cyberpunk 2077 and is committed to fixing glitches to make its flagship game a long-term success after a troubled rollout, joint chief executive Adam Kicinski told Reuters.Kicinski said CD Projekt was in touch with Sony (6758.T), which pulled Cyberpunk 2077 from its PlayStation Store only a week after its debut in December amid complaints of glitches in the video game.  read more The role-playing game, billed as an \"open-world, action-adventure story set in ... a megalopolis obsessed with power, glamour and body modification\" and featuring Hollywood star Keanu Reeves, was delayed three times before its debut.\"I don't see an option to shelve Cyberpunk 2077. We are convinced that we can bring the game to such a state that we can be proud of it and therefore successfully sell it for years to come,\" Kicinski said.CD Projekt released a patch for Cyberpunk 2077 last month, and Kicinski said the new 1.2 patch was a step towards the game's return to the PlayStation store and that the Polish games maker had \"friendly relations\" with Sony.Cyberpunk 2077 had been CD Projekt's most-anticipated game since 2015's \"The Witcher: Wild Hunt\".Last month the company also unexpectedly cancelled plans to develop a standalone multi-player version of Cyberpunk 2077.Kicinski said that the format is more risky for the company, which has to date focused on single-player games.In another setback, CD Projekt was hit by a cyber attack in February. Kicinski said the company did not lose any data in the attack, which was caused by a hole in an external software, and it led to only a 2-3 week delay to its development work.  read more Kicinski, who has worked at CD Projekt since it was founded nearly three decades ago, said the company is looking for acquisition opportunities as it embarks on a \"fundamental\" change to be able to develop two high-budget games in parallel from next year. Acquisitions would not be aimed at boosting financial results and would not be restricted to any geographical locations, he said.He also said that since hostile takeovers cannot be fully ruled out in the gaming industry, the company took steps a few years ago to reduce the risk of becoming a takeover target, including capping a shareholder's voting rights to 20%.CD Projekt faces class action lawsuits in the United States following the troubled Cyberpunk debut, and Kicinski said the company is represented by Cooley LLP law firm.In one of those cases, CD Projekt said on Friday that legal claims against the company in the United States regarding the terms of distribution deals with Valve Corp. had now been withdrawn. "}