{"text": "(Reuters) -A U.S. Centers for Disease Control and Prevention advisory panel on Saturday recommended the nations first COVID-19 vaccine, helping clear the way for public health authorities to begin the largest vaccination campaign in U.S. history.The Advisory Committee on Immunization Practices (ACIP) voted 11 to 0 to recommend the vaccine from Pfizer Inc and BioNTech SE as appropriate for Americans 16 and older. There were three abstentions due to prior conflicts of interest.The Food and Drug Administration on Friday issued an emergency use authorization for the vaccine, clearing it for use by the general public.The CDC is expected to consider and approve the recommendations by the panel in short order.State and local public health authorities will use FDA and CDC guidance as they administer the first 2.9 million doses of the vaccine released to state, cities, and territories by the federal government.ACIP already recommended that authorities should prioritize healthcare workers and nursing home residents for the first doses that become available.It then falls on states and certain large cities to start administering the vaccine to local hospitals and nursing homes. Hospitals are expected to start vaccinating their employees as early as Monday.The CDC panel discussed clinical considerations for certain patients like pregnant women and people with severe allergies, who were not studied in clinical trials, but the panel did not formally vote on these considerations.Officials presenting at the meeting said that while there is not yet data on how the vaccine may impact pregnant women, pregnant women could decide for themselves whether or not to be vaccinated and should consult with their doctor.They said that pregnant women should take acetaminophen, more commonly known by its brand-name Tylenol, if they get a fever after vaccination, which is one of the vaccines side effects, as fevers can pose risks to pregnancy.In the same section of the meeting, officials also said patients with severe allergies to vaccines should not get it at this time. A fact sheet about the vaccine, released with its FDA emergency use authorization, also says that patients with a history of anaphylaxis due to severe allergies should not get the vaccine.Experts on the call discussed how to refine language of what qualifies as a severe allergic reaction to ensure that only those who are at risk are excluded from vaccination.Various experts cautioned that data still needed to be collected and their advice about who should get it may change as more information becomes available."}