{"text": "U.S. states are set to begin using the vaccine from Pfizer Inc (PFE.N) and BioNTech SE to inoculate young adolescents against COVID-19 after advisers to the U.S. Centers for Disease Control and Prevention (CDC) backed the plan in a unanimous vote on Wednesday.The U.S. Food and Drug Administration on Monday authorized the vaccine for children aged 12 to 15, offering relief to parents eager to get their children back to schools and summer camps. The action by the CDC group is an important, but not required, final seal of federal regulatory approval.The youngest age previously approved for the Pfizer vaccine was 16 years old.Some states, including Georgia, Delaware and Arkansas, began offering the vaccine to young teens on Tuesday. Californias main COVID-19 website said families could start making appointments for the younger group on Thursday.The Advisory Committee on Immunization Practices (ACIP), which provides recommendations to the CDC, voted 14-0 to back the vaccine after reviewing trial evidence. That showed no one in the 12-to-15 age group who received the vaccine got COVID-19. There were no severe allergic reactions.Moreover, the vaccine produced robust antibody responses in the age group and showed 100% efficacy in the trial, with no cases of symptomatic COVID-19 among the fully vaccinated adolescents.The move will open vaccination to about 17 million adolescents, CDC Director Rochelle Walensky said in a statement, saying the agency officially recommends the vaccine.The vaccination \"will decrease transmission within their family,\" said Dr. Henry Bernstein, a member of the advisory committee and professor of pediatrics at Zucker School of Medicine at Hofstra/Northwell. \"It will contribute to community immunity, and it allows the kids to more safely go back to camps this summer, and back for in-person school.\"About a third of all Americans have been fully vaccinated, according to the CDC data. But the pace of vaccination has slowed in the recent weeks.The rollout of a vaccine for adolescents should help limit the spread of the virus at a time when more contagious variants are circulating, and could shorten the road to normalcy for Americans.Children have been considered by health officials as being at a lower risk for severe COVID-19, but they can still spread the virus. More than 1.5 million cases have been reported among 12 to 17 year olds, and as more adults become vaccinated, adolescents are accounting for a higher proportion of total cases.Adjusted for underreporting, the working group estimated 22.2 million U.S. COVID-19 infections in those aged 5 to 17.Pfizer is running a separate vaccine trial in children as young as 6 months old, and has said it expects data on 2 to 11 year olds in September. The 2,260 participants in the 12-to-15 age group - half of whom were given placebo - were tested as an expansion of Pfizers more than 46,000-person trial."}