{"text": "Central African Republic will vote in a second round of parliamentary elections on Sunday under high security after a surge in rebel violence surrounding Decembers polls.Insurgents laid siege to the capital Bangui in January, strangling food supply routes, forcing more than 200,000 from their homes, and raising concerns that the country was slipping back into the kind of sectarian conflict that has killed thousands over the past decade.President Faustin Archange Touadra won re-election but rebels, who the United Nations say are backed by former president Franois Boziz, sought to take control amid allegations of voting irregularities.Sundays polls concern leglislative elections, including run-off votes in 49 electoral districts and first round voting in 69 districts where violence stopped the vote from taking place in December.The countrys army, backed by Russian and Rwandan forces, and aided by U.N. peacekeepers, have steadily retaken a number of rebel strongholds since their initial offensive.We have a much stronger defense and security forces presence on the ground to help secure the elections, said Abdoul-Aziz Fall, spokesman for the countrys U.N. peacekeeping mission, know as MINUSCA.Government officials are optimistic that the vote will be peaceful, pointing to military victories and the unblocking of a 580-km (360-mile) corridor that brings much needed supplies from Cameroon to Bangui.The situation is far from stable in the gold- and diamond-rich nation of 4.7 million people that has seen repeated bouts of violence since Bozizs ouster in 2013.The U.N. has reported a steep increase in human rights violations by armed groups and security forces since December.It has accused rebels of abducting civilians, shooting into crowds and burning down polling stations. It says state agents have tortured and killed civilians.Impunity can fuel further violations and embolden the perpetrators, said Ravinda Shamdasani, the U.N.s human rights representative. It is very important that the government sends a clear message that such violations will not be tolerated.Meanwhile, Aboubakar Ali Siddick, a spokesman for a coalition of rebel groups known as the Coalition of Patriots for Change denied that the army has made significant headway and dismissed Sundays vote as a masquerade."}