{"text": "An overhaul of bank capital rules would be the most effective step regulators could take to support climate action, a group of 50 sustainable finance experts said on Tuesday.In a survey carried out by the non-profit Climate Safe Lending Network, academics, commercial banks, investors, non-governmental organisations and central banks were asked to rank 10 proposals for how financial regulation could be changed to boost climate efforts.Respondents included the Bank of England, the European Central Bank and Spain's BBVA, as well as Boston Common Asset Management and Amalgamated Bank in the United States, and the UK's Big Society Capital.The proposal drawing the most support was for regulators to impose tougher rules around the amount of capital banks need to keep as a buffer if they want to lend to companies responsible for emitting high levels of greenhouse gases.At the moment, banks can lend to fossil fuel companies relatively cheaply because the risk-weights applied to the lending do not take into account the systemic risks of doing so, the report said.By making it more expensive to lend to these companies, banks would lower their exposure to the risk, build up capital buffers to absorb potential losses from any loan defaults and focus investment on other parts of the economy.On a scale of 1 to 5 assessing the potential impact of the policy proposal, with 5 the highest, the survey respondents rated it 4.13. The feasibility of its implementation was rated 0.3 on a scale of minus 1 to plus 1, with plus 1 most feasible.\"Stranded assets create a credit risk that is not captured by the current framework,\" said Andrew Turvey, prudential risk director at Belmont Green Finance Limited.Sarah Breeden, executive director for UK deposit takers supervision at the Bank of England, however, said more clarity was needed on the path of forward climate policy for the option to be more feasible.\"We would have better sight on how risks might arise and more data to support policy change,\" she said.The next most backed proposal was for regulators to set out a clear framework for what it means to be compliant with reaching net-zero emissions by mid-century, and in line with the goals of the Paris climate agreement.\"This is the type of guidance that could be a game changer,\" said Lauren Compere, managing director of Boston Common Asset Management. The proposal was ranked 4.0 on potential impact and 0.3 on feasibility."}