{"text": "NEW YORK Restaurants are testing new recipes for the nouvelle normal extending through 2021, with ingredients for safe dining and comfort vibes.To discuss the industrys future, Lauren Young, an editor at Reuters, spoke with chef and restaurateur Daniel Boulud as part of our #AskReuters Twitter chat series. Boulud oversees more than a dozen restaurants around the globe, including flagship Daniel in New York City.Below are edited highlights.Q: Winter is coming to North America. What does it mean for indoor and outdoor dining?A: With 25% occupancy in New York City, we had the chance to build outdoor cabanas out of wood, with insulation and Plexiglas. This is something weve never seen before at Restaurant Daniel.People feel very private, cozy and safe in the bungalow and the heated bungalows are protected from snow, rain and cold. The menu is also winterizing itself, so that will help keep the guests warm.Out of these challenges, we raise opportunities. And one of those opportunities is to come to Restaurant Daniel and have your own dining room on the sidewalk.Q: Are customers craving particular foods and beverages in 2020? What are they avoiding?A: We have seen a resurgence in homey food, but yet chef-y dishes. We created a takeout business called Daniel Boulud Kitchen so people could have the dishes from our menu in their home.The dishes at our pop-up restaurant Boulud Sur Mer are very familiar. They are Provenal, they are soulful  and we want to continue like this.For New Years Eve, were planning to serve cheese fondue with truffle in our outdoor cabanas. We like to play the high and low in this way, where theres always the option to indulge, but also the option to really heal your soul and feel good.Q: Can you discuss the safety measures youve put in place?A: First and foremost is the staff. They have their temperatures taken every day as soon as they arrive, and we keep a logbook of that. We have a station for cleaning and washing personal protective equipment.In the back of the house, we really take measures in making sure that our staff respect social distancing and are working in a very careful environment.I wanted our front of house the staff to feel a little bit more comfortable and confident with their uniform. Weve kept those sleek and minimalist.And, of course, for our guests, we have a station for cleaning. We also bring to the table a tea with ginger and lemongrass, and a pinch of vinegar and lemon to refresh and disinfect their hands.Guests who come into the restaurant have their temperatures checked. We also make sure we disinfect the cabanas outside.Q: What are you optimistic about?A: Im optimistic that people will get motivated to cook at home, and theyre going to want to go out and celebrate some normalcy.I want to see people go back to work, back to their offices, and back to their favorite destinations in the world. Im optimistic that travel will start again. We will get more tourists and business people in New York.Im also optimistic that Im opening a new restaurant in the first quarter of 2021 - Le Pavillon at One Vanderbilt. Its a big project that we have been working on for years.Im optimistic for Restaurant Daniel to reopen fully so I can bring back all my staff. And Im optimistic for our economy to stay strong.We are the economy, in a way, and so we have to stay strong in our field, and everyone in other fields will stay strong. I just want to make sure that people are motivated and people are ambitious again.We are going to get through it - and we are going to shine through it, Im sure."}