{"text": "WASHINGTON Scientists have identified a chemical compound released by locusts that causes them to swarm, opening the door to possible new ways to prevent these insects from devouring crops vital to human sustenance as they have for millennia.Researchers said on Wednesday they identified the pheromone - a chemical produced by an animal that affects the behavior of others of its own species - in the worlds most widespread locust species, the migratory locust, or Locusta migratoria.Called 4-vinylanisole (4VA), it is primarily released from the hind legs and is detected by the antennae of other locusts and sensed by odorant receptors, the researchers said.4VA powerfully attracted locusts regardless of age or sex, the research published in the journal Nature showed. Its production was triggered in the insects when as few as four to five solitary locusts came together, precipitating swarming behavior.In human history, locust plagues, drought and flood were considered as three major natural disasters which caused serious agricultural and economic losses all over the world, said research leader Le Kang, a professor of entomology and ecology at the Chinese Academy of Sciences Institute of Zoology.As the most widely distributed and one of the most dangerous locust species, the migratory locust represents a serious threat to agriculture worldwide, Kang added.Swarms can include billions of locusts and span hundreds of square miles (km) as the insects voraciously consume crops, imperiling food security. Migratory locusts inhabit Asia, Africa, Australia and New Zealand, attacking pastures and critical crops such as wheat, rice, corn, millet, barley, oats, sugarcane and sorghum.Kang said further research is needed on whether 4VA exists in other locust species such as the desert locust, called Schistocerca gregaria, that currently is ravaging parts of Africa and the Middle East.The chemical insecticides currently used to suppress locust outbreaks raise concerns about human health and safety. The identification of 4VA could inspire new methods.A chemical could be developed to block 4VAs effects to prevent swarming, Kang said, or a synthetic version could lure locusts into traps to be killed. Locusts genetically modified not to respond to 4VA could be developed and released to establish wild non-swarming populations, subject to biosecurity evaluation, Kang added."}