{"text": "House of Representatives Republicans on Wednesday ejected Liz Cheney from their leadership ranks as punishment for repudiating former U.S. President Donald Trumps false claims of a stolen election, but she remained defiant and made plans to seek re-election to Congress.Her ouster from her party's No. 3 post in the Democratic-led House unfolded in mere minutes in a closed-door meeting. The action signaled that Trump, despite losing to Democrat Joe Biden in November, has solidified his hold over House Republicans as he jockeys to play a major role in the 2022 congressional elections and flirts with running for president again in 2024.Cheney's decision, disclosed by a spokesperson, to seek re-election next year for a fourth two-year term as the lone House member representing Wyoming appears to set the stage for a clash between competing factions in a Republican Party facing a moment of reckoning over its future - either following Trump's lead or finding a new path. Six Republicans already have lined up to challenge her in a heavily Republican state that Trump won with about 70 percent of the vote last year.After her removal, Cheney came out swinging, telling reporters moments later that she would lead the fight to bring her party back to \"fundamental principles of conservatism.\"\"We must go forward based on truth. We cannot both embrace the big lie and embrace the Constitution,\" Cheney said.Cheney has repeatedly rejected Trump's false claims of widespread voting fraud in the November election and depicted him as a threat to American democracy. She also vowed to prevent Trump from regaining the presidency.\"I will do everything I can to ensure that the former president never again gets anywhere near the Oval Office,\" Cheney told reporters.During Trump's time as president, Republicans lost their majorities in the House and Senate and he lost the White House.Cheney, whose father Dick Cheney served as U.S. vice president from 2001 to 2009 after a previous stint in the House, is a lawmaker with impeccable conservative credentials. She was one of 10 House Republicans who voted with the Democrats in January when the House impeached Trump on a charge of inciting insurrection. Senate Republicans provided the votes to prevent Trump from being barred from holding future public office.Trump's January impeachment - his second - focused on an incendiary Jan. 6 speech in which he urged his followers to \"fight\" his election defeat on the day Congress met to formally certify Biden's victory. A pro-Trump mob then stormed the U.S. Capitol building, an attack that left five dead.Cheney's critics said her criticism of Trump's false claims distracted from party messaging opposing Democrats and Biden's agenda. Cheney rejected House Republican Leader Kevin McCarthy's contention that Republicans must refrain from criticizing Trump to win back control of Congress in 2022.\"We have seen the danger that he continues to provoke with his language,\" Cheney said of Trump.McCarthy and Representative Steve Scalise, the No. 2 House Republican, orchestrated Cheney's ouster. Asked if he was concerned about his own leadership position in the party after protecting Cheney up to now, McCarthy replied: \"Not at all. No, I'm looking forward to being speaker in the next Congress.\"'HORRIBLE HUMAN BEING'In a statement issued after the vote, Trump launched personal attacks on her, saying, \"Liz Cheney is a bitter, horrible human being.\" He added, \"She has no personality or anything good having to do with politics or our country.\"Asked during an NBC interview if there is a battle now for the soul of her party, Cheney said, \"This is I think the opening salvo in that battle, and it's a battle we have to win. Because it's not just about the Republican Party, it's about the country.\"Asked about Trump's political team looking to coalesce behind a primary challenger to her, Cheney said, \"You know, bring it on.\"Trump and McCarthy have endorsed Representative Elise Stefanik to succeed Cheney as party conference chair, a role that helps develop Republican positions on legislation and assists rank-and-file members on an array of issues.Stefanik, who gained prominence as a Trump defender, has drawn criticism from some Republicans for a voting record that they portray as being out of step with conservatives. Republican House members will vote on her nomination on Friday, Representative Louie Gohmert told reporters.After Cheney's removal, Stefanik released a letter to colleagues promising a \"disciplined, unified message\" against Democrats and said she would highlight individual Republicans' conservative policies.The Freedom Caucus, a group of Republican House members on the partys right flank, is close to Trump, and some of its members criticized McCarthy for anointing Stefanik as Cheneys replacement."}