{"text": "Chevron (CVX.N) has shut down the Tamar natural gas platform off the Israeli coast at the instruction of the country's energy ministry, the company said on Wednesday, following the wave of unrest in the region.The Israeli energy ministry said all of Israel's energy needs will continue to be met despite the shutting down of Tamar, the main source of natural gas for the local market.\"In accordance with instructions received from the Ministry of Energy, we have shut-in and depressurised the Tamar Platform,\" Chevron said in a statement. The Tamar platform is located some \t25 kilometres (15.5 miles) off the city of Ashdod along Israel's southern Mediterranean coast.Israel carried out hundreds of air strikes in Gaza on Wednesday and Palestinian militants fired multiple rocket barrages at Tel Aviv and the southern city of Beersheba in the region's most intense hostilities in years.  read more The second gas field Chevron operates in the country, Leviathan, continues to run normally and the company was \"working with customers and the relevant regulatory bodies to ensure that natural gas supplies continue.\"Leviathan, whose production platform is located further north of the Gaza Strip, would be able to increase supplies and there is also a backup ship that stores gas offshore for emergencies, the Israeli ministry said in a statement.Chevron became a major investor in Israel's offshore natural gas industry after acquiring U.S.-based Noble Energy for $11.8 billion last year. The move was seen as a bet by CEO Mike Wirth on the volatile region's huge gas resources. Chevron operates and holds a 25% stake in the Tamar gas field. It produced a total of 8.2 billion cubic metres (bcm) of gas in 2020, of which 7.7 bcm went to Israel, 0.3 bcm to neighbouring Egypt and 0.2 bcm to Jordan, according to data from Israeli energy company Delek (DLEKG.TA), which holds a stake in the field.The San Ramon, California-based company holds a 39.66% interest in the Leviathan field. It produced an average of 7.3 bcm in 2020, according to the Delek data."}