{"text": "CHICAGO Chicagos mayor issued a month-long stay-at-home advisory on Thursday, and Detroits public schools called a halt to in-person instruction to curb the spread of the coronavirus as more than a dozen U.S. states reported a doubling of new COVID-19 cases in the last two weeks.The two Midwestern cities became the latest in a growing number of states and metropolitan areas - including New York, California and Iowa - moving this week to re-impose public health restrictions that had been eased in recent months.The measures were driven by surging numbers of daily infections, rising hospitalizations and ominous spikes in the rate of COVID-19 diagnostic tests coming back positive. The onset of winter, with people more likely to congregate indoors, will only worsen the trends, experts say.California on Thursday became the second state, after Texas, to see its tally of confirmed infections to date climb above 1 million.While hopeful a vaccine might soon become available for front-line medical professionals and the most vulnerable, public health experts worry a wintertime surge will overwhelm hospitals in much of the country.Dr. Jeff Pothof, an emergency medicine physician, said record numbers of COVID-19 patients were already straining resources at University of Wisconsin Health in Madison.The real barrier, though, is still staffing, Pothof told Reuters. Weve been able to scrape together teams, but a lot of it is really offering bonuses and getting people who are already working too hard to work even harder.MORTALITY RATE LOWER, BUT DEATHS RISINGOffering a glimmer of hope, a leading medical research institute reported that the expected mortality rate for coronavirus infections has dropped by nearly a third since April due to advances in therapeutic treatments.However, computer modeling suggests the daily number of COVID-19 deaths in the United States will rise to 2,200 in mid-January, with a cumulative 439,000 lives lost by March 1, nearly double the current toll, according to the University of Washingtons Institute for Health Metrics and Evaluation.Chicago Mayor Lori Lightfoot issued an advisory calling upon residents to stay at home without visitors for the next 30 days, including during Thanksgiving festivities in late November.The third-largest city in the United States could see 1,000 more COVID-19 deaths by the end of 2020 unless residents modify their behavior, Lightfoot said.Lightfoot set a 10-person limit on gatherings, including indoor and outdoor events, and ordered out-of-state travelers to quarantine for 14 days or submit a negative coronavirus test.None of us can keep maintaining the status quo in the face of this very stark reality, the mayor told reporters, noting the average number of new cases has jumped from 500 to 1,900 per day over the last month and the citys positivity test rate tripled to 15% from 5%.Michigan Governor Gretchen Whitmer likewise urged residents to avoid mingling with other households over the Thanksgiving holiday.We are in the worst part of this pandemic to date, Whitmer told a briefing. This is the moment that medical experts have been warning us about and dreading since the beginning.The Detroit public school district, the largest in Michigan, said it would suspend face-to-face instruction from Friday until at least Jan. 11, switching to online classes.MIDWEST LEADING LATEST SURGEA Reuters tally of figures reported by U.S. public health agencies showed coronavirus cases more than doubling in 13 states in the past two weeks, most of them in the Midwest, led by Iowa, Minnesota, Michigan and Illinois.Three other Farm Belt states - Kansas, Nebraska and Indiana - also made the list, underscoring the degree to which the virus has spread into rural areas long spared from the worst of the pandemic.That pattern was evident in other regions of the country as well, such as the South. In North Carolina, nearly twice as many new cases have been reported since September in rural counties as in urban and suburban areas, with rural infections accounting for most COVID-19 deaths statewide, the state Health and Human Services Department said.Total COVID-19 cases across the United States hit an all-time daily high for a third straight day on Thursday, reaching at least 160,000, and crossing the 100,000 mark for a ninth consecutive day, Reuters data showed.The number of people hospitalized with the virus surged to at least 66,500 by late Thursday, the highest ever for a single day during the pandemic, increasing by more than 40% in the past two weeks. The death toll rose by at least 1,170 to a total of 242,979.With many months ahead before an effective vaccine can be administered to the general public, medical experts urged strict adherence to well-known virus mitigation measures such as wearing a face covering, frequent hand-washing and maintaining safe social distances.Now we need to double down on the public health measures as were waiting for the vaccine, Dr. Anthony Fauci, the nations leading infectious disease specialist, told a forum hosted by the National Cathedral in Washington. He has said he expects vaccines to reach ordinary citizens by May or June of 2021."}