{"text": "SANTIAGO, Nov 12 Chilean regulators have accused Albemarle, the worlds largest lithium producer, of underpaying royalties by $11 million and vowed to take the U.S.-based miner to international arbitration over what they called a breach of its contract with the government.Corfo, which oversees Albemarles contract for lithium mining in Chiles Salar de Atacama, told lawmakers the miner had misinterpreted the part of their agreement that outlines the basis for royalty payments, favoring a too-low commission on its sales.For (Corfo) it is unacceptable that Albemarle pretends to alter what was negotiated and agreed upon by the two parties, said Corfo vice-president Pablo Terrazas in an Oct. 14 letter to lawmakers viewed by Reuters. He said the disagreement represented a breach of the 2016 contract that increased Albemarles quota to extract lithium.Albemarle rejected those claims in a statement to Reuters on Wednesday, saying Corfos call for arbitration was unnecessary. Albemarle said it has met its royalty obligations and the contract makes clear such disputes can be settled without arbitration.We do not understand Corfos insistence on international arbitration, which is a process that will take years and will mean an enormous expense...for the State, Albemarle said.The latest spat comes two months after Albemarle locked horns with Chilean nuclear agency CCHEN over reserves data. CCHEN has demanded additional information on reserves held by Albemarle at Atacama, details regulators say they need to assure the miner can sustain increased output. The two are still discussing the matter, Albemarle told Reuters.Albemarle has been pushing to expand its production in Chile. Marketwatchers expect demand for the white metal to triple by 2025 as automakers produce more electric vehicles (EVs).The coronavirus pandemic and falling prices, however, have set many producers back, forcing them to shelve projects, cut costs and temporarily tamp down output. (Reporting by Dave Sherwood; Editing by David Gregorio)"}