{"text": "The discovery of the oldest known human burial site, a child's grave in a Kenyan cave, sheds new light on the emotional life of early Homo sapiens, the head of archaeology for the east African country's museums said on Wednesday.Scientists announced last week that they had found the site, dating to around 78,000 years ago, where a youngster they have nicknamed 'Mtoto' or 'child' in Swahili was buried in a cave called Panga ya Saidi near the Kenyan coast.  read more \"It's significant ... because it's for the first time that we're beginning to get a feel of the cognitive and also the emotional abilities at this point in time,\" Emmanuel Ndiema told Reuters in an interview.Previous archaeological discoveries helped researchers understand other aspects of how early humans lived, such as their technological advances, how they sustained themselves and how they related to their environment, he said.\"We are beginning to understand people having some emotional attachment to the dead that they can be able to intentionally bury them. We are also seeing cognitive abilities, abstract thinking,\" said Ndiema.Mtoto was placed in a shallow grave under the sheltered overhang of the cave, head resting on a pillow and the upper part of the body carefully wrapped in a shroud.The child, whose gender remains unclear, is thought to have died aged about 2-1/2 to 3 years old.The body was placed in a flexed position, lying on the right side, with knees drawn toward the chest, according to the researchers who published their findings last week.Mtoto was part of a hunter-gatherer culture, with remains of various antelope species and other prey found at the site, an upland setting in a tropical forest. Also found were stone tools for scraping and boring holes, and stone points that could be used as part of a spear.Ndiema said the discovery also shows early Homo sapiens lived in different parts of what is now Kenya, contradicting a long-standing narrative that suggested early humans only settled in the Great Rift Valley, further west from the coastal area."}