{"text": "* Shanghai shares fall 0.6%, blue-chips down 0.7%* A-shares uptrend tails off as investors take profits globally* New bank loans fall more than expectedHONG KONG, Aug 12 Chinese shares fell for a second straight session on Wednesday after global market sentiment soured on the prospect of a swift U.S. stimulus boost and as domestic data showed softer growth in bank lending.** The Shanghai Composite index closed down 0.6% at 3,319.27. The blue-chip CSI300 index fell 0.7%. ** The smaller Shenzhen index lost 1.3%, the start-up board ChiNext Composite index fell almost 2% and Shanghais tech-focused STAR50 index dropped 2.2%.** The Chinese market tracked Asian peers and pulled back in early trade on uncertainties around the U.S. stimulus package. The regional sell-off ran out of steam in late session, helping Chinese shares limit their losses.** We have seen profit-taking across the board, with a huge pull-back in tech stocks worldwide. That is affecting sentiment here, said Alex Wong, director at Ample Finance Group. There has been a good run and people are willing to take some profit off the table.** Chinese banks extended 992.7 billion yuan ($142.82 billion) in new yuan loans in July, down sharply from 1.81 trillion yuan in June and falling short of analysts expectations, data from Peoples Bank of China (PBOC) on Tuesday showed.** Broad credit and liquidity growth quickened slightly. A stronger-than-expected rebound in activity in the second quarter has reduced the urgency for the PBOC to ease policy further, Reuters previously learnt.** Recent lending numbers show the recent policy direction remains steady, limiting expectations of further loosening, Dongguan Securities analysts wrote in a note.** The yuan was 0.05% weaker at 6.9501 per U.S. dollar at 0716 GMT.** The Shanghai stock index is up 8.8% this year and the CSI300 has risen 13.5%. Shanghai stocks are up 0.3% this month. ** About 37.83 billion shares were traded on the Shanghai exchange, less than the previous sessions 40.05 billion."}