{"text": "SHANGHAI, Aug 12 Chinas securities watchdog has tightened scrutiny on a popular derivative product dubbed Snowball, three sources told Reuters, as regulators seek to rein in risks in an opaque, $60 billion market.Snowball, which offers a risky bet on stock market volatility and delivers double-digit, annualised returns barring a market tumble, has gained popularity among yield-hungry investors.The China Securities Regulatory Commission (CSRC) recently sent a notice to brokerages, urging them to strengthen their risk controls on Snowball products and to fully disclose the related risks to investors, said a source with direct knowledge of the matter.Snowball products are often marketed as a type of fixed-income products, and investors are not fully aware of the risks. This worries regulators, a source said.The CSRC did not respond immediately to a request for comment.Brokerages which design Snowball products using options and complicated models have also been urged to simplify the products, said another source.The CSRCs guidance comes amid growing concerns over Chinas economic slowdown which has put downward pressure on the stock market. The small-cap CSI500 Index, the underlying index of many Snowball products, has already climbed 11.4% this year to 5-1/2-year-highs.A Snowball product being marketed by China Industrial Securities Co allows investors to make an annualised return of 12.85%, if its underlying index, the CSI500, fluctuates within a set range, according to a snapshot of the product prospectus seen by Reuters.But if the index falls more than 25%, investors would suffer losses.Some rival products offer annualised returns of as high as 20%. The benchmark Shanghai Composite Index has gained 1.49% so far this year.You make money in a volatile market. You make money in a bullish market. But if you buy the product at the start of a bear market, you lose, Wang Yichao, managing director of Guotai Yuanxin Asset Management Co, told a roadshow on Snowball on Thursday.Chinese brokerages sold a total of 469.6 billion yuan worth of Snowball derivative products in the first half of 2021, according to the Securities Association of China. The outstanding size of such products stood at 385.8 billion yuan at the end of June."}