{"text": "    SHANGHAI, Aug 12 China's yuan weakened on\nWednesday as the dollar firmed, but it remained confined to a\ntight range as market players awaited the outcome of trade\ndiscussions between senior U.S. and Chinese officials this\nweekend. \n    Spot yuan opened at 6.9524 per dollar after the\nPeople's Bank of China set the fixing for the currency's daily\ntrading band at 6.9597 per dollar, firmer than the\nprevious fix of 6.9711. \n    By midday, the unit was changing hands at 6.9525 per dollar,\n62 pips weaker than Tuesday's late session close, while the\nglobal dollar index, which measures the greenback against\nglobal peers, rose to 93.853 from the previous close of 93.691.\n    Top trade envoys from Beijing and Washington are set to meet\nover videolink on Aug. 15 for a high-level review of the Phase 1\ntrade deal between their countries.\n    The talks will take place amid rising tensions between the\nUnited States and China. \n    On Tuesday, U.S. President Donald Trump said that his\nrelationship with Chinese President Xi Jinping had soured due to\nthe COVID-19 pandemic, though a top White House economic adviser\nsaid that the trade deal remains in \"fine\" shape.\n\n    \"The news flow has been pretty stable this week. It's\npossible that the two sides want to have a good atmosphere for\nthe trade review this weekend, there probably won't be major\nissues,\" said a trader at a foreign bank.\n    He expected the yuan to track fluctuations in the U.S.\ndollar index in the near term. Smooth trade talks between\nWashington and Beijing could boost the currency, but any moves\nwould likely be limited, he said.\n    The offshore yuan weakened 70 pips to 6.9495 per\ndollar.\n    Some market watchers continue to see upside for the yuan.\nAnalysts at China Construction Bank said in note that U.S.\nfederal fund futures pointed to extremely low U.S. rates\nextending into next year, while China's economic recovery has\nleft room for the PBOC to adopt more flexible monetary policy.\n    \"In the near term, the renminbi's spread advantage will\ncontinue,\" they said.\n    On Wednesday, the spread of Chinese 10-year treasury bonds\nover their U.S. equivalents was at 232 basis points, about 25\nbasis points off record highs touched in July.\n\n    \n    The yuan market at 4:09AM GMT: \n    \n    ONSHORE SPOT:\n Item               Current  Previous  Change\n PBOC midpoint      6.9597   6.9711    0.16%\n                                       \n Spot yuan          6.9525   6.9463    -0.09%\n                                       \n Divergence from    -0.10%             \n midpoint*                             \n Spot change YTD                       0.15%\n Spot change since 2005                19.04%\n revaluation                           \n \n    Key indexes:\n     \n Item            Current     Previous  Change\n                                       \n Thomson         92.16       92.01     0.2\n Reuters/HKEX                          \n CNH index                             \n Dollar index    93.853      93.691    0.2\n \n    \n    \n*Divergence of the dollar/yuan exchange rate. Negative number\nindicates that spot yuan is trading stronger than the midpoint.\nThe People's Bank of China (PBOC) allows the exchange rate to\nrise or fall 2% from official midpoint rate it sets each\nmorning.\n\n    OFFSHORE CNH MARKET   \n  \n Instrument            Current   Difference\n                                 from onshore\n Offshore spot yuan    6.9495    0.04%\n        *                        \n Offshore              7.1002    -1.98%\n non-deliverable                 \n forwards                        \n               **                \n \n*Premium for offshore spot over onshore\n**Figure reflects difference from PBOC's official midpoint,\nsince non-deliverable forwards are settled against the midpoint.\n. \n    \n\n (Reporting by Andrew Galbraith and Xiao Han; Editing by Kim\nCoghill)\n  "}