{"text": "SINGAPORE Chinese stocks led Asian markets higher on Monday as investors bet on a steady recovery for the worlds no. 2 economy, though caution about the fate of U.S. stimulus kept the dollar firm and a central bank policy tweak unwound some of the yuans gains.If capital is moving on relative growth rates, then China is looking quite attractive, said Chris Weston, head of research brokerage Pepperstone in Melbourne. Equities are cheap, yields advantageous and the outlook solid, he said.From a virus perspective as well, were seeing concerns in Europe, while China is considered a quasi-safe haven.China has returned from an eight day Mid-Autumn festival with investors encouraged by a robust rebound in tourism and ebbing coronavirus cases.Qingdao city said on Monday it will conduct COVID-19 tests for the entire population of more than 9 million people over five days after small number of new cases.Elsewhere, in the U.S. midwest, infections are at record levels and the World Health Organization is urging fresh curbs for Europe.Coronavirus aid plans in the United States are also in disarray, with the Trump administration on Sunday calling on Congress to pass a stripped-down relief bill while talks on a more comprehensive proposal were again at an impasse.The economic fallout of COVID-19 has accelerated the relative decline of the U.S. as the worlds economic engine, said ANZ chief economist Richard Yetsenga. It is also increasing the centrality of Asia - and particularly, of China.YUAN WOBBLESThe Peoples Bank of China has scrapped a requirement for banks to hold a reserve of yuan forward contracts, removing a guard against depreciation.Traders said that suggested authorities were discomfited by recent gains in the currency. However the lack of an aggressively weaker setting of the onshore trading band cooled some of those concerns and the yuan pared losses a little.We continue to expect a stronger yuan on the back of our expectation of solid Chinese growth and favourable interest rate differentials between China and the U.S., Goldman Sachs analysts said in a note, with a 12-month yuan forecast at 6.50.In commodity markets, oil prices were back under pressure after the resolution of an oilworkers strike in Norway and the resumption of production after a storm in the Gulf of Mexico.The U.S. bond market is closed on Monday for Columbus Day."}