{"text": "SHANGHAI, March 12 China shares posted a weekly loss on Friday as a conservative 2021 economic growth target sparked fears Beijing could tighten policy to rein in lofty valuations, though infrastructure firms helped benchmark stock indexes eke out gains for the day.** The blue-chip CSI300 index rose 0.4% to 5,146.38, while the Shanghai Composite Index added 0.5%to 3,453.08.** The CSI300 infrastructure jumped 3.2%, thanks in part to low valuations after underperforming the market for a long time.** Helping sentiment further, a retreat in U.S. bond yields overnight eased global concerns about rising inflation.** Risk appetite could pick up again, as the U.S. yield rally has lost momentum for now, Yan Kaiwen, an analyst with China Fortune Securities, noted in a report.** For the week, CSI300 lost 2.2% and SSEC shed 1.4%.** Last Friday, China set a modest annual economic growth target, at above 6%, which was significantly below the consensus of analysts, who had expected growth could beat 8% this year.** Chinese Premier Li Keqiang defended the governments target for more than 6% economic growth this year, saying it was not low, and policies would not be dramatically loosened to chase higher growth.** A lower economic growth target gives China room to rein in frothiness in the market even as inflation fears grow, said analysts.** Once high-flying sectors with lofty valuations had been the hardest hit in recent weeks.** For the week, the CSI300 consumer staples index dropped 3.2%, while the CSI300 healthcare index slumped 4%, extending a steep correction since mid-February.** Investors also watched developments around Sino-U.S. relations.** The United States on Thursday condemned Chinese moves to change Hong Kongs electoral system and forecast difficult talks with Beijings top diplomats next week.** Shares of Huawei suppliers retreated as the U.S. administration added new limits on these companies. (Reporting by Luoyan Liu and Andrew Galbraith; Editing by Subhranshu Sahu)"}