{"text": "    SHANGHAI, Jan 12 China's yuan edged up against\nthe U.S. dollar on Tuesday on demand for cash ahead of next\nmonth's Lunar New Year holiday, even as expectations for huge\nfiscal stimulus in the United States pushed yields higher and\nsupported the greenback.\n    \"In the near term the dollar-yuan pair will tend to be\nrangebound. We need to keep an eye on the flow situation.\nRecently when the dollar-yuan has rebounded we've seen some\ndollar selling,\" said a trader at a Chinese bank. \n    A second trader at a Chinese bank said there was\nconsiderable demand for yuan before the week-long Spring\nFestival holiday, which begins on Feb. 11, which would limit the\nyuan's reversal.\n    Before the market open, the People's Bank of China\n set the midpoint of the yuan's daily trading band\n at 6.4823 per dollar, its weakest in a week.\n    Onshore spot yuan opened at 6.4770 per dollar and\nwas changing hands at 6.4712 at midday, 81 pips stronger than\nthe previous late session close. The offshore yuan\nfirmed to 6.4695 per dollar.\n    Broader yuan gains were capped by a more robust dollar. The\ndollar index stood at 90.560 on Tuesday, up 0.1% for the\nday and 1.5% higher than a nearly three-year low touched last\nweek.\n    President-elect Joe Biden, who takes office on Jan. 20 with\nhis Democratic party in control of both houses of Congress, has\npromised \"trillions\" in extra pandemic-relief spending, boosting\nhopes for a recovery in the world's largest economy.\n\n    The promise helped to push U.S. yields even higher after the\nbenchmark 10-year yield rose above 1% last week for\nthe first time since March. It stood at 1.1495% on Tuesday.\n    Ming Ming, an analyst at CITIC Securities, said if the rise\nin U.S. rates on the fiscal boost expectations is accompanied by\na global rebound, the spread between Chinese and U.S. rates is\nmore likely to remain wide, which should support the yuan.\n    \"But considering that a fundamental recovery of the U.S.\neconomy has not yet appeared, the epidemic is continuing\noverseas and facing uncertainty domestically, there may not be a\ncoordinated global recovery,\" he said.\n    \"In this situation, the impact of a rising dollar and U.S.\nyields is more likely to be seen in the weakening of emerging\nmarket country's exchange rates, affecting the performance of\nrisk assets...and narrowing the China-U.S. spread.\"\n\n    The yuan market at 4:05AM GMT: \n    \n    ONSHORE SPOT:\n Item               Current  Previous  Change\n PBOC midpoint      6.4823   6.4764    -0.09%\n                                       \n Spot yuan          6.4712   6.4793    0.13%\n                                       \n Divergence from    -0.17%             \n midpoint*                             \n Spot change YTD                       0.88%\n Spot change since 2005                27.90%\n revaluation                           \n \n    Key indexes:\n     \n Item            Current     Previous  Change\n                                       \n Thomson         96.15       95.93     0.2\n Reuters/HKEX                          \n CNH index                             \n Dollar index    90.566      90.475    0.1\n \n*Divergence of the dollar/yuan exchange rate. Negative number\nindicates that spot yuan is trading stronger than the midpoint.\nThe People's Bank of China (PBOC) allows the exchange rate to\nrise or fall 2% from official midpoint rate it sets each\nmorning.\n\n    OFFSHORE CNH MARKET   \n  \n Instrument            Current   Difference\n                                 from onshore\n Offshore spot yuan    6.4695    0.03%\n        *                        \n Offshore              6.6025    -1.82%\n non-deliverable                 \n forwards                        \n               **                \n \n*Premium for offshore spot over onshore\n**Figure reflects difference from PBOC's official midpoint,\nsince non-deliverable forwards are settled against the midpoint.\n. \n    \n    \n\n (Reporting by Andrew Galbraith and Jindong Zhang; Editing by\nJacqueline Wong)\n  "}