{"text": "BEIJING The Chinese city of Langfang near Beijing went into lockdown on Tuesday as new coronavirus infections raised worries about a second wave in a country that has mostly contained COVID-19.The number of new cases in mainland China reported on Tuesday remained a small fraction of those seen at the height of the outbreak in early 2020. However, authorities are implementing strict curbs whenever new cases emerge.The National Health Commission reported 55 new cases on Tuesday, down from 103 on Monday. Hebei province, which surrounds Beijing, accounted for 40 of the 42 locally transmitted infections.In a village in the south of Beijing that shares a border with Hebei, residents were stopping vehicles and asking to see health-tracking codes on mobile phones.We have to be careful as were near Guan, where COVID cases were reported today, said a volunteer security officer surnamed Wang.At a highway checkpoint, police in protective gowns ordered a car entering Beijing to return to Hebei after the driver was unable to show proof of a negative coronavirus test.Chinas state planning agency said it expected travel during next months Lunar New Year period to be markedly down on normal years, with a bigger share of people choosing cars over other transport. Many provinces have urged migrant workers to stay put for the festival.HOME QUARANTINELangfang, southeast of Beijing, said its 4.9 million residents would be put under home quarantine for seven days and tested for the virus.The government in Beijing said a World Health Organization team investigating the origin of the coronavirus would arrive on Thursday in the city of Wuhan, where the virus emerged in late 2019, after a delay that Beijing has called a misunderstanding.Shijiazhuang, Hebeis capital, has been hardest hit in the latest surge and has already placed its 11 million people under lockdown. The province has shut sections of highway and is ordering vehicles to turn back.A new guideline from the Beijing Center for Disease Prevention and Control recommended that taxi and ride-hailing operators suspend car-pooling services, and that drivers should get weekly DNA tests and be vaccinated in order to work, the ruling Communist Party-backed Beijing Daily reported.As of Jan. 9, China had administered more than 9 million vaccine doses.Across the country, the number of new asymptomatic cases rose to 81 from 76 the previous day. China does not classify asymptomatic cases as confirmed coronavirus infections.The total number of confirmed cases reported in mainland China stands at 87,591, with an official death toll of 4,634."}