{"text": "SHANGHAI/BEIJING, March 12 Regulators have tightened the screws on foreign exchange transactions in one of Chinas main export hubs by restricting conversions of exporters dollar earnings, people familiar with the matter said, as authorities seek to rein in a surging yuan.China has long held a tight grip on its currency due to concerns that excessive volatility could affect capital flows and harm the economy. Unlike other large economies, Beijing does not allow fully unrestricted cross-border money transfers, and foreign currency cannot be freely converted into yuan.Since late November, the foreign exchange regulator in the coastal province of Zhejiang has asked commercial banks in the city of Yiwu to only accept customs declaration forms from within the previous year for conversion of dollar receipts into yuan, three banking sources said, on condition of anonymity.The previous rules for Yiwus exporters allowed them to simply present customs forms from any time period showing foreign currency receipts for quick conversion into yuan. Many exporters simply sat on their foreign earnings.But rapid yuan gains of nearly 10% since the second half of last year have led to a rush of conversions into the domestic currency as exporters seek to reduce foreign currency exposure risks.Many companies even purchased out-dated customs forms for conversion. The surging demand for conversions into yuan forced the FX regulator to plug the loophole, said one source, speaking on condition of anonymity.The State Administration of Foreign Exchange (SAFE), Chinas currency regulator, did not immediately respond to a request for comment.Regulators have introduced a slew of measures since late last year to trim capital inflows and allow more outflows. Analysts believe the moves signal concern with the pace of the yuans rise.The new Yiwu regulation appears to reinforce these concerns, as it effectively blocks the conversion of old earnings, helping to reduce demand for yuan in Yiwu. One source said the move suggested authorities are trying to stabilise the yuan.Yiwu, Chinas export capital for small commodities such as Christmas trees, souvenirs and toys, is often watched as a gauge of the health of the nations overall export sector.Official data showed that Yiwu exported 300.6 billion yuan ($46.34 billion) worth of goods in 2020, up 4.8% from a year earlier, equivalent to about 1.7% of the national exports last year."}