{"text": "BEIJING New bank loans in China rose more expected in March from the previous month due to strong corporate and household demand, as the central bank walks a tightrope between supporting the rapidly recovering economy and containing debt risks.Chinese banks extended 2.73 trillion yuan ($416.62 billion)in new yuan loans in March, up from 1.36 trillion yuan in February and exceeding analyst expectations of 2.45 trillion yuan, according to data released by the Peoples Bank of China (PBOC) on Monday.That pushed bank lending in the first quarter to a record high of 7.67 trillion yuan, according to Reuters calculations based on central bank data. It beat the previous peak of 7.1 trillion yuan in the first quarter of 2020, when policymakers began rolling out unprecedented measures to deal with the shock from the coronavirus crisis.The surge in loans has led to worries among authorities, with financial regulators telling banks to trim their loan books this year to guard against risks emerging from bubbles in domestic financial markets, sources told Reuters last month.Despite the March surge, growth in outstanding yuan loans eased to 12.6% from a year earlier compared with 12.9% in February. Analysts had expected 12.6% growth.I personally believe social financing is a more important gauge... its growth rate is at a relatively low level (for March). If it continues to slide, the contraction in credit looks pretty evident, said Hao Zhou, senior economist at Commerzbank.Growth of outstanding total social financing (TSF), a broad measure of credit and liquidity in the economy, slowed to 12.3% in March from a year earlier and from 13.3% in February.TSF includes off-balance sheet forms of financing that exist outside the conventional bank lending system, such as initial public offerings, loans from trust companies and bond sales.In March, TSF also missed expectations, when it rose to 3.34 trillion yuan from 1.71 trillion yuan in February. Analysts polled by Reuters had expected March TSF of 3.70 trillion yuan.Chinas credit trends are being closely watched by investors who are increasingly worried about policy tightening as Beijing looks to exit from emergency measures now that the worlds second-largest economy is quickly regaining momentum. The countrys blue-chip share index fell over 5% in March, its worst monthly performance in a year.Data last week showed inflation pressures are building, with a factory price gauge rising the most in nearly three years.The central bank has pledged to stabilise the countrys overall debt level which jumped last year due to stimulus measures, but has said it will avoid a sudden policy shift and will continue to support ailing small firms.Ruan Jianhong, head of the PBOCs statistics department, told a briefing on Monday that Chinas marco leverage ratio jumped 23.5 percentage points in 2020 to 279.4%, but the rise in debt levels has slowed since the second quarter as the economy recovered.The macro leverage ratio is a measurement of the debt held by Chinese central and local governments, households and companies divided by total gross domestic product (GDP).Policymakers are especially concerned about financial risks involving the countrys overheated property market, and have asked banks and local authorities to prevent business loans from flowing into real estate.Last year, the central bank rolled out a raft of measures including cuts in interest rates and reserve ratios to support the economy. But it has kept the benchmark lending rate, the loan prime rate, unchanged since May.We think that credit growth will slow further over the rest of the year, said analysts at Capital Economics, citing factors such as the PBOC directive to control lending for the rest of year and lower local government bond quotas.Theres typically around a six-month lag before shifts in credit growth show up in the wider economy: the credit slowdown will be a growing drag in the second half of the year.Broad M2 money supply in March grew 9.4% from a year earlier, also below estimates of 9.6% forecast in the Reuters poll. It rose 10.1% in February.($1 = 6.5528 Chinese yuan renminbi)"}