{"text": "BEIJING The Chinese Beidou navigation network will be complete this month when its final satellite goes into orbit, giving China greater independence from U.S.-owned GPS and heating up competition in a sector long dominated by the United States.The idea to develop Beidou, or the Big Dipper in Chinese, took shape in the 1990s as the military sought to reduce reliance on the Global Positioning System (GPS) run by the U.S. Air Force.When the first Beidou satellites were launched in 2000, coverage was limited to China. As use of mobile devices expanded, China in 2003 tried to join the Galileo satellite navigation project proposed by the European Union but later pulled out to focus on Beidou.In the age of the iPhone, the second generation of Beidou satellites went operational in 2012, covering the Asia-Pacific.China began deploying the third generation of satellites aimed at global coverage in 2015.The 35th and final Beidou-3 satellite will be launched this month - the day has yet to be announced - meaning Beidou has more satellites in its system than GPSs 31, and more than Galileo and Russias GLONASS.With estimated investment of $10 billion, Beidou keeps the communications network of the Chinese military secure, avoiding the risk of disruption to GPS in the extreme event of conflict.Weapons targeting and guidance also improves. When complete, Beidous location services are accurate down to 10 cm in the Asia-Pacific, compared with GPSs 30-cm range.Beidou was obviously designed a few decades after GPS, so it has had the benefit of learning from the GPS experience, said Andrew Dempster, director of the Australian Centre for Space Engineering Research.It has some signals that have higher bandwidth, giving better accuracy. It has fewer orbit planes for the satellites, making constellation maintenance easier.SPACE SILK ROADBeidou-related services such as port traffic monitoring and disaster mitigation have been exported to about 120 countries, state media reported.Many of those countries are involved in the Belt and Road initiative, spearheaded by President Xi Jinping to create a modern-day Silk Road of trade and investment.In a 2019 report, the U.S. congressional U.S.-China Economic and Security Review Commission warned that China promoted launch services, satellites and Beidou under its Space Silk Road to deepen reliance on China for space-based services, potentially at the expense of U.S. influence.Thailand and Pakistan were the first foreign countries to sign up for Beidous services, in 2013.Within China, more than 70% of mobile phones were Beidou-enabled as of 2019, state media reported, including models made by Huawei [HWT.UL], Oppo, Xiaomi, Vivo and Samsung.Millions of taxis, buses and trucks were also able to receive Beidou signals.Chinas satellite navigation sector may top 400 billion yuan ($57 billion) in value this year, state media said.Ahead of the Beidou-3 completion, satellite-related shares have soared.Beijing BDStar Navigation Co, which makes chips that receive Beidou signals, has surged 34.4% this year. Hwa Create leapt 52.3%, outpacing the 7.6% gain in the Shenzhen benchmark."}