{"text": "SHANGHAI, Jan 12 China stocks rebounded on Tuesday from their worst session in three weeks a day earlier, underpinned by gains in the consumer and aerospace sectors, while Hong Kong shares inched higher to hover near a one-year peak hit in the previous session.** At the midday break, the Shanghai Composite index was up 0.8% at 3,559.86, while Chinas blue-chip CSI300 index was up 1.1%.** The smaller Shenzhen index was up 0.74%, the start-up board ChiNext Composite index was higher by 1.14% and Shanghais tech-focused STAR50 index was up 0.6%.** However, gains were capped by continued worries over a pickup in coronavirus infections in northern China and tensions between Beijing and Washington.** China reported a drop in the number of new COVID-19 cases in the past 24 hours amid a flurry of new measures in Hebei province surrounding Beijing, ranging from home quarantines starting on Tuesday in one county and a lockdown of the provincial capital.** Despite high growth expectations in China, investors could not shake off the coronavirus resurgences around the world, analysts at DBS said in a note.** Chinese H-shares listed in Hong Kong rose 0.54% to 11,119.24, while the Hang Seng Index was up 0.46% at 28,037.51, not far from a high of 28,176.65 hit a day earlier, the loftiest level since Jan. 22, 2020.** Analysts said gains in Hong Kong stocks were supported by rising capital flows from mainland. Official data showed that investors on Monday bought the most Hong Kong stocks through the stock connect scheme since the programme was launched.** As U.S. investors dump shares in Chinese companies blacklisted by outgoing President Donald Trump, bargain hunters in China are taking the opposite side of that trade, wagering that a Joe Biden presidency will reverse the investment ban.** Separately, Wall Street firms in Hong Kong including Goldman Sachs and JPMorgan on Monday moved to reduce exposure to Chinese telecom companies named in a U.S. ban on investments in companies Washington considers linked to Chinas military.** Around the region, MSCIs Asia ex-Japan stock index was weaker by 0.45% while Japans Nikkei index was up 0.06%. (Reporting by Winni Zhou and Andrew Galbraith; Editing by Subhranshu Sahu)"}