{"text": "* SSEC down 2%, CSI300 down 2.2%, HSI down 0.2%, HSCE falls 0.6%* A-shares uptrend tails off as investors take profits* New bank loans fall more than expected; broad credit grows fasterHONG KONG, Aug 12 Chinese shares fell on Wednesday and were on course for their worst day in over two weeks due to souring global market sentiment and data showing softer growth in bank lending.** At the midday break, the Shanghai Composite index was down almost 2% at 3,273.75. The blue-chip CSI300 index fell 2.2%. Both are set to post their worst daily percentage fall since July 24. ** CSI300s financial sector sub-index fell 0.8%, the consumer staples sector was down 2.7% and the healthcare shares were 4.4% lower. ** In Hong Kong, Chinese H-shares fell 0.6% while the Hang Seng Index slipped 0.2% to 24,842.89. ** The smaller Shenzhen index lost 3%, the start-up board ChiNext Composite index dropped 3.7 and Shanghais tech-focused STAR50 index fell 4.3%.** We have seen profit-taking across the board, with a huge pull-back in tech stocks worldwide. That is affecting sentiment here, said Alex Wong, director at Ample Finance Group. There has been a good run and people are willing to take some profit off the table.** Asian stocks pulled back on uncertainties around the U.S. stimulus package, while Wall Street snapped a seven-day winning streak.** Chinese banks extended 992.7 billion yuan ($142.82 billion) in new yuan loans in July, down sharply from 1.81 trillion yuan in June and falling short of analysts expectations, data from Peoples Bank of China (PBOC) on Tuesday showed.** Broad credit and liquidity growth quickened slightly. A stronger-than-expected rebound in activity in the second quarter has reduced the urgency for the PBOC to ease policy further, Reuters previously learnt.** Recent lending numbers show the recent policy direction remains steady, limiting expectations of further loosening, Dongguan Securities analysts wrote in a note.** The yuan was 0.09% weaker at 6.9525 per U.S. dollar at 0408 GMT."}