{"text": "Alibabas , (9988.HK) $2.8 billion fine from the Chinese antitrust watchdog ought to worry U.S. rival Amazon.com (AMZN.O). Beijings case against Jack Mas e-commerce giant shows its possible to define the market and single out data usage in ways that American regulators havent yet managed to do, but could.Big U.S. technology firms have eluded regulators for several reasons. One is that in trying to pinpoint market abuse, watchdogs first have to agree what that market is. Even that isnt simple. Last year, Bezos told Congress that his company competes in the overall retail market, where it has less than 4% market share in the United States. But in e-commerce, it has 40% of sales, compared to No. 2 Walmart (WMT.N) with 7%, according to eMarketer.Chinas State Administration for Market Regulation set out its own agenda on Saturday. Alibabas peer group, it says, is online retail platforms, not business-to-consumer e-commerce as the company had argued. But the watchdog went out of its way to say that offline stores are different. It noted that physical stores are limited by their geographic location, often have higher operating costs and have less efficient means to match merchants with consumers.Data also played a key role in Chinas thinking  as it would in a sober U.S. assessment of Amazon. The SAMR said online platforms can use massive amounts of information gleaned from users to target customers and arrange personalized search results. It also pointed out that Alibaba is the largest public cloud-service provider in China, which helps its online retail business.Amazon has also been accused of using data to its advantage. Third-party merchants have complained that Amazon unfairly competes against them when the Seattle-based tech giant sells its own products using information gleaned from its platform. Its also the largest U.S. cloud provider. And Chinas arguments that network effects help Alibaba out could also be argued over its American rival.Fortunately for Bezos, theres one area where Chinese and U.S. watchdogs arent on the same page. The U.S. regime tends to focus narrowly on prices, and American courts have traditionally upheld consumer welfare as the goal of antitrust actions. In contrast, the SAMR noted the more fuzzy threat to social welfare. Ma may have also been a convenient target after his criticisms of Beijing. A government like Chinas can afford to be big-picture and creative in its approach. Thats harder to do in the United States  which might be Amazons saving grace.On Twitter https://twitter.com/GinaChonCONTEXT NEWS- Chinese e-commerce firm Alibaba said on April 12 that it will introduce measures aimed at lowering barriers to entry and business costs faced by merchants on its platforms.- It announced the move after China's State Administration for Market Regulation on April 10 said it had imposed an 18 billion yuan ($2.8 billion) fine on Alibaba after an anti-monopoly investigation found that it had abused its dominant market position since 2015.- For previous columns by the author, Reuters customers can click on"}