{"text": "BEIJING Improved global demand and a favorable base effect are likely to have kept Chinas exports buoyant in March, while higher oil prices will have been boosted its imports, a Reuters poll showed on Monday.Chinas trade surplus is expected to be $52.05 billion in March, following a surplus of $103.25 billion in the first two months of the year, according to a median forecast in a Reuters poll of 27 economists. The data will be released on Tuesday.Exports are expected to have risen 35.5% in March from a year earlier, according to the poll. The number was down from 60.6% jump in January-February, as the year-ago level suffered a deeper contraction as the the coronavirus outbreak in China passed through its peak.The rebound of overseas demand for Chinese goods continued with the recovery of global economy amid greater vaccination efforts. Surveys showed U.S. factory activity picked up in March amid strong growth in new orders, and the growth in Euro zone monthly factory activity was the fastest on record.Official and private manufacturing surveys in China pointed to riobust growth, with export orders returning to growth amid improving foreign demand.Imports likely rose 23.3% in March versus a year ago, the poll showed, slightly higher than the 22.2% gain in the first two months of the year.Import growth might have stayed solid in March on the back of more working days (this year relative to last year), healthy underlying domestic demand, and also higher oil prices, Goldman Sachs economists said in a note.However, many analysts believed exports could lose some momentum in the short term and the advantages of orders transferred from other countries due to coronavirus-related disruptions will begin to abate.The current strength of export growth is unsustainable and will unwind over the coming quarters as vaccinations allow a return to more normal global consumption patterns, said Julian Evans-Pritchard, Senior China Economist with Capital Economics.Other China watchers also noted the resurgent COVID-19 infections abroad and constraints in global trade have left some companies grappling with prolonged delivery timeframes and surging prices of raw materials.Makers of cars and electronic devices from televisions to smartphones are sounding alarm bells about a global shortage of chips, which is causing manufacturing delays as consumer demand bounces back from the coronavirus crisis."}