{"text": "Alibaba Group Holding Ltd (9988.HK)  does not expect any material impact from the antitrust crackdown in China that will push it to overhaul how it deals with merchants, its CEO said on Monday, after regulators fined the e-commerce giant $2.75 billion for abusing market dominance.U.S.-listed shares of Alibaba jumped 8.6% and were set for their best day since July last year as a key source of uncertainty for the company was removed, and on relief the fine and steps ordered were not more onerous.Alibaba has come under intense scrutiny since billionaire founder Jack Mas public criticism of the Chinese regulatory system in October. As part of \"comprehensive rectifications\" sought by regulators, Alibaba will make it easier for merchants to do business with it, Chief Executive Daniel Zhang told an online conference for media and analysts.Beijing wants Alibaba to stop requiring merchants to chose between doing business with it and rival platforms, a practice known as 'merchant exclusivity', which critics say helped it become China's largest e-commerce operation.Alibaba executives said despite Saturday's record 18 billion yuan ($2.75 billion) fine and measures ordered by regulators, they remain confident in the government's overall support of the company.\"They are affirming our business model,\" said Alibaba executive vice chairman Joe Tsai. \"We feel comfortable that there's nothing wrong with our fundamental business model as a platform company.\"Separately, Ant Financial, the fintech affiliate of Alibaba, will restructure as a financial holding company, Chinas central bank said on Monday. SHARES BOUNCEThe company stock was up about 8% in the afternoon trade in Hong Kong, adding $48.5 billion to its market value and putting it on course to post its biggest single-day gain in nearly three months.\"Now the penalty is determined, the market's uncertainty about Alibaba will be reduced,\" Everbright Sun Hung Kai analyst Kenny Ng said.\"Alibaba's stock price has lagged behind the overall emerging economy stocks for some time in the past. The implementation of this penalty is expected to allow Alibaba's stock price to regain market attention.\"Aside from imposing the fine, among the highest ever antitrust penalties globally, the State Administration for Market Regulation (SAMR) ordered Alibaba to make \"thorough rectifications\" to strengthen internal compliance and protect consumer rights.\"The required corrective measures will likely limit Alibaba's revenue growth as a further expansion in market share will be constrained,\" said Lina Choi, Senior Vice President at Moodys Investors Service.\"Investments to retain merchants and upgrade products and services will also reduce its profit margins.\"SAMR said it had determined Alibaba , which is also listed in New York, had prevented its merchants from using other online e-commerce platforms since 2015.The practice, which the SAMR has previously spelt out as illegal, violates China's antimonopoly law by hindering the free circulation of goods and infringing on the business interests of merchants, the regulator said.The probe comes as China bolsters SAMR with extra staff and a wider jurisdiction amid a crackdown on technology conglomerates, signalling a new era after years of laissez-faire approach.The agency has taken aim recently at China's large tech giants in particular, mirroring increased scrutiny of the sector in the United States and Europe.EXCLUSIVITY ISSUESAlibaba said it accepted the penalty and \"will ensure its compliance with determination\".Speaking with analysts on Monday, Tsai said that other than a review of the company's mergers and acquisitions, which the company's peers also face, it does not expect further investigation from the antitrust regulator.\"We are pleased we can put this matter behind us,\" he said.Tsai added the company \"doesn't rely on exclusivity\" to retain its merchants, adding such exclusivity arrangements in the past only covered a small number of Tmall flagship stores.Alibaba and its peers remain under review for mergers and acquisitions from the market regulator, Tsai told the briefing, adding he was not aware of any other anti-monopoly-related investigations.The fine is more than double the $975 million paid in China by Qualcomm, the world's biggest supplier of mobile phone chips, in 2015 for anticompetitive practices.\"The $2.75 billion fine against Alibaba should be viewed for what it is - a meaningful but affordable price to pay to start the process of reconciliation with the Beijing regime,\" said Franklin Chu, president of Sage Capital in Rye, New York.\"Alibaba remains an appealing and convenient way to invest in the rapidly growing Chinese economy,\" he said. \"Given the power of its various core business, the stock is undervalued by most conventional measures.\"($1 = 7.7780 Hong Kong dollars)"}