{"text": "China has imposed a sweeping restructuring on Jack Mas Ant Group, the fintech conglomerate whose record $37 billion IPO was derailed by regulators in November, underscoring Beijings determination to rein in its internet giants.The overhaul, in the works for several months, includes Ant turning itself into a financial holding firm, a move expected to curb its profitability and valuation by curtailing some of its freewheeling businesses.It comes two days after Mas Alibaba Group Holding Ltd , of which Ant is an affiliate, was hit with a record $2.75 billion antitrust penalty as China tightens controls on the booming platform economy.The overhaul, directed by China's central bank, subjects Ant to tougher regulatory oversight and capital requirements, and requires it to cut links between its hugely popular payments app Alipay and its other businesses - which had been viewed as a big advantage due to Alipay's vast trove of customer data.\"This restructure effectively splits Ant into a few independent businesses to stop Alipay from being a super app capable of controlling the day to day lives of the Chinese people,\" said Lightstream Research analyst Oshadhi Kumarasiri, who publishes on the Smartkamra platform.\"We believe it will limit Ant's growth prospects and also open up the market for competition.\"Ant, based in the eastern city of Hangzhou, was positioned as a tech firm in 2018 when it raised $14 billion at a valuation of about $150 billion in the worlds largest single fundraising. At its planned IPO pricing, that soared to about $315 billion.Sources told Reuters last month that some global investors valued Ant at over $200 billion based on its 2020 performance, offering a more sober estimate after the shelving of its IPO and expectations for its forced restructuring.New York-listed shares of e-commerce giant Alibaba were up 8% after Monday's announcement, tracking a similar gain for its Hong Kong shares earlier in the day, with investors cheering the end of uncertainty for Alibaba after the antitrust fine.'STRICTER THAN EXPECTED'Ant, which began as Alibaba's payments arm, sits on an enormous cache of consumer data. That is the backbone of China's internet platforms, with companies offering financial products from consumer loans to investment products via smartphones.Alipay has more than 730 million monthly users in China and handles more transactions a year than Mastercard or Visa.The People's Bank of China said that under a \"comprehensive and feasible restructuring plan,\" Ant would cut the \"improper\" linkage between Alipay, virtual credit card business Jiebei and consumer loan unit Huabei.The central bank also asked Ant to break its \"monopoly on information and strictly comply with the requirements of credit information business regulation.\"As part of the restructuring, Ant said it would set up a personal credit reporting company, which will comply with relevant laws and strengthen the protection of personal information, and effectively prevent the abuse of data.Ant will apply for a licence for the credit reporting company, it said.\"The restructuring plan is stricter than expected,\" said Dong Ximiao, chief analyst at Zhongguancun Internet Finance Institute, who said Ant would need at least 200 billion yuan ($31 billion) in registered capital to comply with the capital adequacy rule for financial holding companies.\"There's less uncertainty now as the restructuring plan finally lands, but we still need to wait and see how Ant implements all those requirements during the process.\"Reuters reported in February that Ant planned to spin off its consumer-credit data operations, as hiving off its treasure trove of data on more than 1 billion people was a key part of its business overhaul in response to the regulatory crackdown.Ants revamp comes against a backdrop of uncertainty over Mas empire that has extended to the billionaire himself, who disappeared from public view for three months before briefly emerging in January.The restructuring sets \"an example\" for financial regulation of the platform economy, the state-backed Economic Daily newspaper said in a Monday commentary.($1 = 6.5440 Chinese yuan renminbi)"}