{"text": "TOKYO For one minute this week, workers at the Fukushima nuclear station fell silent to mark the 10-year anniversary of a natural disaster that triggered the worst nuclear accident since Chernobyl.Then they went back to work tearing down the reactors melted down in the days after a tsunami on March 11, 2011.The job ranks as the most expensive and dangerous nuclear clean-up ever attempted. A decade in, an army of engineers, scientists and 5,000 workers are still mapping out a project many expect will not be completed in their lifetime.Naoaki Okuzumi, the head of research at Japans lead research institute on decommissioning, compares the work ahead to climbing a mountain range - without a map.The feeling we have is, you think the summits right there, but then you reach it and can see another summit, further beyond, Okuzumi told Reuters.Okuzumi and others need to find a way to remove and safely store 880 tonnes of highly radioactive uranium fuel along with a larger mass of concrete and metal into which fuel melted a decade ago during the accident.The robotic tools to do the job dont yet exist. There is no plan for where to put the radioactive material when it is removed.Japans government says the job could run 40 years. Outside experts say it could take twice as long, pushing completion near the close of the century.GRAPHIC: Fukushima's recovery from disasterhttps://graphics.reuters.com/JAPAN-DISASTER-NUCLEAR-ICEWALL/01006144292/JAPAN-DISASTER.jpgTepcos Fukushima Daiichi nuclear plant, which once had six reactors, was plunged into crisis by the tsunami that followed a magnitude 9.0 quake off the shore of northern Japan on March 11, 2011.The quake and tsunami flooded the back-up power generators at Fukushima, knocking out cooling systems. The reactors quickly overheated, setting off explosions as uranium cores melted down. The radioactive plumes that formed forced the evacuation of about 160,000 people.It wasnt until 2017 that engineers understood how complicated the clean-up would become. By that point, five specially designed robots had been dispatched through the dark, contaminated waters pumped in to cool the uranium. But radiation zapped their electronics.One robot developed by Toshiba Corp, nicknamed the little sunfish, a device about the size of a loaf of bread, provided an early glimpse of the chaotic damage around the cores.Kenji Matsuzaki, a robot technician at Toshiba who led development of the sunfish, had assumed that they would find melted fuel at the bottom of the reactors.But the sunfishs first video images showed a tumult of destruction, with overturned structures inside the reactor, clumps of unrecognizable brown debris and dangerously radioactive metal.I expected it to be broken, but I didnt expect it would be this bad, Matsuzaki said.The delivery of a robotic arm to start removing fuel, developed in a $16 million programme with the UKs Nuclear Decommissioning Authority, has been delayed until 2022. Tepco plans to use it to grab some debris from inside reactor 2 for testing and to help plan the main operation.The project has had some successes. About 2,000 spent fuel rods in reactors No. 3 and No. 4 - which could have caused another massive radiological release if they overheated - have been removed after giant frames and cranes were erected over the buildings.Radiation has been reduced in most of the Fukushima work site, about the size of New Yorks Central Park. In most areas of the plant, the 5,000 workers no longer need special protective equipment that had slowed work during Japans hot, humid summers.GRAPHIC: Japan earthquake and tsunamihttps://graphics.reuters.com/JAPAN-FUKUSHIMA/ANNIVERSARY/gjnvwzmqjpw/JAPAN-EARTHQUAKE-ANNIVERSARY.jpgBut the cleanup has been delayed by the buildup of contaminated water in tanks that crowd the site. The melted cores are kept cool by pumping water into damaged reactor vessels.The water is pumped out and treated. Storage tanks now hold enough radioactive water to fill more than 500 Olympic-sized swimming pools. Tepco expects it will max out its storage space next year.Most analysts expect the government to release the water into the ocean after further treatment. Fishing communities have lobbied against that and South Korea and China have objected to such a move.There still is no plan for where to put the radioactive debris from the reactors.Its no good just moving highly radioactive waste from inside the nuclear reactor to somewhere else in the plant, said Hiroshi Miyano, the head of the decommissioning committee of the Atomic Energy Society of Japan. Where will the waste go? Will it be pulverized? These are the questions that need to be asked."}