{"text": "SEOUL Big Hit Entertainment Co., the management label behind K-pop sensation BTS, debuted with a bang, but its dramatic crash after a pop on the first day of trading is causing South Korean regulators to seek safeguards for mom-and-pop investors.Riding on the success of scoring Koreas first-ever no. 1 hit on the main U.S. Billboard music chart in September, the management agency of BTS went public in October as one of the hottest listings in town.But the entertainment agencys listing has since been a subject of outcry from retail investors, as many sought refunds after a more than 52% crash from a peak of 351,000 won ($314.80) a share reached on the first trading day, Oct 15.The stock is now trading at 158,000 won a share, slightly above its initial public offering (IPO) price of 135,000 won per share.I used money I have been saving up for my wedding to buy Big Hit shares at around 300,000 won, 50 million won ($44,842.65) worth. Is there a way I can get that refunded if I show receipts and file for some kind of petition? wrote one of hundreds of investors discussing ways to get share purchases refunded at an investment forum on local portal Naver.South Koreas IPO market has similarities with a lottery. Retail investors can borrow as much as they can to subscribe for as many shares as they can. But because orders massively outnumber the amount of stock made available for retail investors, usually 20%, many end up buying only after the stock gets listed.Although BTS fans piled into Big Hits IPO, interest from institutional investors was a lot less frenzied. Some big investors, including STIC Investment Inc and Mainstone LLC, sold huge quantities of Big Hit shares on the first week of trading, data from the Financial Supervisory Service showed, causing some soul-searching among Korean regulators.Because of the massive backlash the regulators are under over Big Hits crash, one idea being floated among officials is to add safety nets for retail investors by applying the mandatory holding period to a larger number of institutional investors, said an official from the Korea Financial Investment Association, an industry body representing heavyweight institutional investors.But adding another layer of mandatory holding period for big investors would be a mistake, because it will seriously discourage those with big cash from jumping in, the official said, asking not to be named because of the sensitivity of the issue.Government officials at the Financial Supervisory Commission declined to comment.In South Korea, regulations require only the biggest shareholder and related parties to hold shares for at least six months.STIC and Mainstone werent subject to any mandatory holding period rules because they invested in Big Hit before the book-building process, a Korea Exchange official said.Bottom line is, regulators wont be able prevent sell-offs. But revision of IPOs could aim for strengthening mandatory holding period and increase allocation portions for mom-and-pop investors at the same time, said Choi Yoo-june, an analyst at Shinhan Investment Securities.($1 = 1,115.0100 won)"}