{"text": "Colonial Pipeline began to slowly restart the nations largest fuel pipeline network on Wednesday after a ransomware attack shut the line, triggering fuel shortages and panic buying in the southeastern United States.It will take several days for the 5,500 mile (8,850 km) pipeline to return to normal operations, Colonial said, even as motorists in southeastern states jammed stations seeking fuel. A return to ample supplies could take two weeks, analysts said.The cyberattack halted 2.5 million barrels per day of shipments of gasoline, diesel and jet fuel last Friday after the most disruptive cyberattack ever on U.S. energy infrastructure.Sources familiar with Colonials response said the company does not plan to pay the ransom demanded by hackers who encrypted data on the pipeline.Colonial said it was working with cybersecurity experts to investigate the attack and had taken additional security measures before beginning the restart. The company said its control center is handling the restart of the pipeline, which stretches from refineries on the U.S. Gulf Coast to consumers in Mid-Atlantic and Southeast states.The supply crunch sparked panic buying in the U.S. Southeast, bringing long lines and high prices at gas stations ahead of the peak summer driving season.Nearly 60% of gas stations in metro Atlanta were without gasoline, tracking firm GasBuddy said. Its survey showed 65% of stations in North Carolina and 43% in Georgia and South Carolina without fuel. Virginia also reported high outages.Our top priority right now is getting the fuel to the communities that need it, U.S. Transportation Secretary Pete Buttigieg told reporters.Fuel stocks in the U.S. Northeast will likely hit five-year lows this week as the restart slowly progresses, said S&P Global Platts analyst Richard Joswick. Full recovery \"will take a couple of weeks at least,\" he added.RISING TENSIONSAt a Citgo station in East Atlanta, Charles Williams, 66, a local musician, filled his wife's Mini Cooper after seeing people with large jerry cans loading up.\"I wouldn't say I know they're hoarding, but I don't know if they're helping,\" he said.Privately owned Colonial Pipeline opened portions of the line manually in Georgia, Maryland, New Jersey and the Carolinas. It also accepted 2 million barrels of fuel to begin efforts to \"substantially\" restore operations by week's end, the company has said.The average national gasoline price rose to above $3.00 a gallon, the highest since October 2014, the American Automobile Association said.Fuel industry representatives urged consumers to stop panic buying. They noted the country has plenty of gasoline supplies and said hoarding is creating shortages in areas not served by the pipeline.\"Retailers right now have sold several days worth of inventory within a few hours,\" said Rob Underwood, President of the Energy Marketers of America.Four southeastern states - Florida, North Carolina, Virginia and Georgia - joined federal regulators in relaxing driver and fuel restrictions to speed deliveries of supplies. Georgia suspended sales tax on gasoline until Saturday.The FBI has accused a shadowy criminal gang called DarkSide of the ransomware attack. The group, believed to be based in Russia or Eastern Europe, has not directly taken credit, but on Wednesday it claimed to have breached systems at three other companies, including an Illinois tech firm.Russias embassy in the United States rejected speculation that Moscow was behind the attack. On Monday, Biden said there was no evidence so far that Russia was responsible.REFINERS, AIRLINES REACTIt was not known how much money the hackers are seeking.Gulf Coast refiners that move fuel to market on the Colonial Pipeline have cut processing. Total SE (TOTF.PA) trimmed gasoline production at its Port Arthur, Texas, refinery, and Citgo Petroleum pared back at its Lake Charles, Louisiana, plant.Citgo said it was moving products from Lake Charles and \"exploring alternate supply methods into other impacted markets.\" Marathon Petroleum said it was \"making adjustments.\"Several airlines have been transporting fuel by truck or fueling planes at destinations rather than at East Coast origins. American Airlines (AAL.O) said it would resume on Thursday non-stop service on two long-haul flights out its Charlotte, North Carolina hub.Delta Air Lines (DAL.N) Chief Executive Ed Bastian said the airline has been told fuel supplies will be available hopefully by the end of the week and as long as those predictions come true hopefully well be OK."}