{"text": "FORT COLLINS, Colo. Severe drought in the northwestern U.S. Corn Belt and meager crop conditions have led to lower expectations for the U.S. corn and soybean harvests, but the trade has recently had a high miss rate on USDAs August projections and the analyst guesses this time have not allowed much room for error.On average, analysts believe the Department of Agriculture will peg U.S. corn yield at 177.6 bushels per acre on Thursday, below the trendline of 179.5 bpa. The average soybean guess is 50.4 bpa versus the trend of 50.8.In the last six Augusts, the trade estimates for both corn and soybean yield have been below USDAs forecast. On average in those six years, the trade was 3.4 bpa too low on corn yield and 1.8 bpa too low for soybeans.Not only have the August trade guesses been too light, but they often missed the predicted numbers entirely. USDAs August corn yield fell outside the range of estimates in five of the last seven years, and for soybeans that was true in five of the last six years.If both corn and soybean yields fall within the trade ranges on Thursday, it will be the first time for the August report since 2013.The probability of a complete miss might be higher this year as the 4.3-bpa range of guesses on corn yield is the narrowest in 20 years. This years analyst high is 180 bpa and the low is 175.7, though the recent average range for August corn yield is 6.7 bpa.The trade ideas for soybeans, which range from 49.3 bpa to 51.3, are the narrowest for August in four years. The range has averaged around 2.6 bpa in prior years.The August corn and soybean yields are formulated differently than in prior months, when they were trendline calculations from USDAs World Board. This months numbers will be primarily based on producer surveys conducted by USDAs statistics service, and the agency next month will add in field measurements.MORE CONTEXTIt has been uncommon in recent years for August corn and soybean yields to be lower than what was printed in July. That has not happened for soybeans since 2013 but it has occurred once since then for corn, in 2017.There is a tendency for August corn yield to be higher relative to the final yield, which has been the case in 11 of the past 15 years, including the last three.The trend is more mixed for soy, as the final yield has been lower than in August for four consecutive years now with an increasing margin. However, final soy yield was higher than in August in the six prior years.One of the reasons analysts question 179.5 bpa on corn is that it would be a record by 2.9 bpa. USDAs trendline yield has called for a new record before, though, including in 2020. Since 1993, there were four other instances: 2003, 2004, 2012 and 2014. New highs were ultimately set in 2003, 2004 and 2014.USDAs soybean trend yield is less controversial in this regard since a higher yield has been observed before, in 2016. Soybean yield was above 50 bpa in two other years, 2018 and 2020.DONT FORGETU.S. corn and soybean production will be the main attraction on Thursday, but there are other items to monitor. Lagging global export demand for corn and uncertainty around Chinas soybean import needs have recently pressured prices, and any reductions on those fronts could offset a possible supply loss if the U.S. harvest comes in smaller.Market participants believe some global wheat crops are doing worse than suggested by USDAs latest outlooks, particularly in top exporters Russia and Canada. Russian consultancies this month have estimated that harvest more than 5 million tonnes below USDAs current 85 million.Prolonged drought in Canada has pummeled crop conditions there, but USDAs Canadian wheat yield as of last month equaled the recent five-year average. Some analysts think Canadas fate could be similar to that of the United States, where the spring wheat crop is expected at a 33-year low.The trade is looking for U.S. spring wheat output to shrink further on Thursday. Canadas canola crop is another harvest to keep an eye on as USDAs latest yield estimate is just 3% below the five-year average.USDAs reports are due on Thursday at noon EDT (1600 GMT).The opinions expressed here are those of the author, a market analyst for Reuters. "}