{"text": "CHICAGO Employer retirement plans are not known for their flashy investments - a majority of 401(k) investors these days use target date funds that invest in broad, diversified equity and fixed income mutual funds that automatically rebalance to minimize risk as retirement approaches.That has been a healthy, if unexciting, trend. But in the years ahead, some plan sponsors may start spicing things up. Last week, the federal government opened the door for plan sponsors to add private equity funds to their 401(k) plans. Private equity funds invest in everything from buyouts of mature non-public companies to firms getting ready to go public - and even venture capital startups. Until now, these investments have been available only to wealthy and institutional investors.The private equity industry has been knocking on the 401(k) door for a number of years, and the attraction is not difficult to understand. Defined contribution plans represent a huge pool of investable funds, holding $8.9 trillion in assets at the end of 2019, according to the Investment Company Institute.Private equity proponents scored a win last week when the U.S. Department of Labor (DoL) issued a guidance letter outlining how private equity could be added to defined contribution plans under existing rules (reut.rs/2BTOymi). The letter could mark a turning point in a broader move to open up private equity investing to less affluent, individual investors.In the retail investing world, the U.S. Securities and Exchange Commission is reviewing its rules governing sales of private equity, including liberalization of the rules restricting these investments to accredited investors - those with net worth (excluding their primary residence) of $1 million or more, or annual income of at least $200,000 for single filers ($300,000 for joint filers) for the past two years.Private equity advocates argue that these funds can produce higher returns over time than the stock of publicly held companies, even net of fees.If you think of the stock market as a way for investors to harness the economic power of gross domestic product and capitalizing on that, a growing portion of that activity today is being held by private investors today as opposed to being in the public markets, said David OMeara, senior defined contribution strategist at consulting firm Willis Towers Watson.A SLICE OF THE INVESTMENT PIEBut the difference in returns among private equity funds can be huge. And unlike active mutual funds, where top performers do not outperform the market consistently over the long term, top private equity funds have greater persistence, because top managers get first look at the highest-quality investments, according to Fran Kinniry, global head of private investment at Vanguard. You need to have confidence that you can pick managers who are in the top third of performance, he said.If private equity does start popping up in workplace plans, it likely will have a slice of the investment pie in target date funds that will not exceed 15%, experts say.Among the three largest providers of target date funds - Vanguard, Fidelity Investments and T. Rowe Price - none are jumping on the bandwagon yet, although none have ruled it out for the future.Vanguard, which has long advised foundations and endowments on private equity investments, is now expanding its offerings to high net-worth clients, and next year will begin offering it to clients in its fast-growing Personal Advisor Services who meet the current - or revised - accredited investor standards, Kinniry said.One challenge for plan sponsors will be how to value private equity on a daily basis. In 401(k) plans, participants are able to check the value of their holdings at any time, but valuations of private equity investments are updated only periodically.Meanwhile, the DoL letter lays out some fiduciary hurdles that plan sponsors would have to leap, said Fred Reish, an attorney with Faegre Drinker who specializes in employee benefits. It says fiduciaries must have the expertise to be able to evaluate these products, or hire advisers or managers who do. And participants must be given information that they can understand and use to decide whether or not to be in that investment.Reish thinks those goals can be met by large, sophisticated 401(k) plans. But he does not expect to see private equity turning up in plans overnight, noting employers are a cautious bunch. They read all the headlines about other plan sponsors being sued for violations of their fiduciary duties, and it scares them to death.In recent years, many of those headlines have been generated by attorney Jerome Schlichter, senior partner at Schlichter Bogard & Denton. He has won more than $350 million in 401(k) excessive-fee cases for employees and retirees, and won judgments that required defendants to improve their plans - relief he values at more than $1.5 billion.This is fraught with peril both for employees and companies that choose to do this, Schlichter said. Theres a reason private equity investments have been limited to wealthy, sophisticated investors. This is grafting a product that wasnt designed to be in the retirement plan of an average investor into those retirement plans.(The opinions expressed here are those of the author, a columnist for Reuters.)"}