{"text": "(The opinions expressed here are those of the author, a columnist for Reuters.)LONDON, Jan 12 As unrest and violence spread across Kazakhstan here last week, authorities blocked access to multiple social media sites, prompting thousands of local users to download special applications to mask their location and maintain their access. On Jan. 5, authorities blocked internet access altogether.The effect was stark. ATMs ceased working, along with multiple other business functions including bitcoin mining. Kazakhstan is now the second largest generator of the cryptocurrency and its value fell as computing power suddenly went offline. With television channels in Kazakhstan broadcasting only entertainment programmes, most of the countrys 19 million population lost access to news.A decade after the \"Arab Spring here \" uprisings in which crowds mobilising through social media toppled authoritarian rulers in Tunisia and Egypt and conflicts erupted in Libya, Syria and Yemen, a growing number of governments are resorting to internet shutdowns to limit discontent and discussion of what is happening in times of crisis.In Ethiopia, access to the internet has been blocked for the northern Tigray here region since November 2020 when conflict erupted with the government in Addis Ababa. This has helped limit coverage of a conflict that now features drone strikes and the blocking of humanitarian aid deliveries.In Myanmar, access the internet was initially completely blocked following a military coup in February 2021. This was followed by the blocking of important social media sites, particularly Facebook which had previously been used by protest organisers.Other Asian and African countries are also increasingly turning to internet shutdowns as an initial reaction to political protests or demonstrations. The leaking of exam questions has been cited in the last year to justify internet shutdowns in several places, including Syria, Uganda and the Indian state of Rajasthan.AUTHORITARIAN TIDEAs governments grapple with public anger further fuelled by the rising cost of living and frustration with sometimes visibly corrupt elites, these tactics are a tool that uses blunt force  different to the more sophisticated surveillance used by China, and described by critics as intimidation, but part of a rising tide of authoritarianism.Different countries have adopted different tactics, and the length of internet stoppages has varied. In Myanmar, multi-day stoppages were soon replaced with 72 consecutive night-time-only shutdowns. Pro-democracy activists believed these were intended to disrupt the planning of protest activity that usually took place in hours of darkness while minimising the economic impact. Despite that, monitoring firm Top10VPN calculated the shutdowns cost Myanmars economy $2.78 billion in 2021, largely due to disruption to businesses.Such shutdowns can put international telecoms companies in an awkward position. In Myanmar, Norwegian operator Telenor here published a series of statements outlining the demands the new military junta was making on its operations in the country following last year's coup. Sources in Myanmar told Reuters authorities had demanded details of broadband users among other personal information.Facebook and Twitter remain blocked across Myanmar, accessible only through a Virtual Private Network (VPN) that obscures where a user is located. Myanmars military rulers have continued to temporarily block internet and phone services for townships in several regions where they now find themselves fighting opposition militias.Top10VPN put the economic cost of internet shutdowns around the world at about $5.5 billion in 2021, a 36% increase on the previous year and a measure of their growing popularity. The group reported 15 major outages in 21 countries, ranging from outright internet shutdowns - such as the one in Kazakhstan - to more targeted blocking of major social media platforms, most frequently Twitter followed by Facebook.RISING COSTMore than 486 million people were affected by internet shutdowns in 2021, 80% more than during 2020. Many of those were in the worlds two largest democracies, India and Nigeria, with a growing number of African countries embracing similar tactics.For 18 months to February 2021, India restricted internet access across the predominantly Muslim region of Kashmir by limiting it to 2G speeds, causing economic chaos. It also imposed a limited but near complete shutdown in parts of New Delhi in January 2021 after farmers protests.Nigeria blocked access to Twitter from June 2021 in a spat with the firm after it deleted a tweet from President Muhammadu Buhari which it said was in breach of the sites rules. Demand for VPN services rose more than 1,400 percent, prompting Nigerias attorney general to threaten to prosecute those still accessing Twitter by those means.Such actions appear to be increasingly common. Sudan imposed several internet shutdowns last October and November during protests against a military coup, while Uganda shut down social media platforms and messaging apps including WhatsApp during its presidential election. Burkina Faso shut down mobile internet access for more than a week in late November following protests after the shooting of seven civilians from a French military convoy passing through to Chad.For those who value freedom, that should be a concern. For most of this century, there has been an assumption that the internet would bring greater openness. Now, it seems that even access having to it is something a growing number of people may not be able to take for granted.*** Peter Apps is a writer on international affairs, globalisation, conflict and other issues. He is the founder and executive director of the Project for Study of the 21st Century; PS21, a non-national, non-partisan, non-ideological think tank. Paralysed by a war-zone car crash in 2006, he also blogs about his disability and other topics. He was previously a reporter for Reuters and continues to be paid by Thomson Reuters. Since 2016, he has been a member of the British Army Reserve and the UK Labour Party. (Editing by Timothy Heritage)"}