{"text": "FORT COLLINS, Colo. Speculators have been bullish Chicago corn since the end of August, the longest such streak in several years, but better weather for the U.S. corn crop and demand uncertainty have recently invited a few bears to the table.Money managers reduced their net long position in CBOT corn futures and options to 219,371 contracts through July 6 from 245,434 a week earlier. That is based on data released on Friday by the U.S. Commodity Futures Trading Commission.That is funds least optimistic corn view since October. They have been hesitant in recent months to place short bets in corn, but money managers added nearly 18,000 gross shorts in the week ended July 6, the most for any week in nearly a year. However, corn shorts remain at historically light levels.The U.S. Department of Agriculture published its June acreage survey within the four-day trading week ended July 6, and that report is known to cause extreme volatility. Lighter-than-expected U.S. corn plantings caused corn futures to jump the daily limit, though prices were limit-down on July 6 with a wetter forecast.Through Friday, CBOT corn futures had fallen 12% on the month as weather outlooks continued to show ample rains for much of the U.S. Corn Belt. China has been quiet on the U.S. export front and traders fear that the countrys import demand might not meet high expectations, especially with a strong harvest outlook.Trade estimates peg commodity funds as sellers of 22,500 corn futures over the last three sessions but buyers of 14,000 soybean futures. In that same period, November soybean futures gained more than 6% on December corn. November soybeans are down 5% on the month.Funds have been relatively heavy sellers of soybeans in the last two months, but the slight decline in U.S. plantings versus March intentions keeps pressure on an already-tight balance sheet. Through July 6, money managers added nearly 6,000 soy futures and options contracts to their net long, which rose to 82,180 contracts.Soybean oil futures are 17% off last months all-time highs, though the contract jumped 3% on Friday along with other global vegoils and remains near rarely seen levels. Money managers kept their net long unchanged through July 6 at 48,174 futures and options contracts, but they have sold at least 38,000 since the early June high.Soybean meal was the sole grain or oilseed contract that rose in the week ended July 6, and money managers increased their net long to 20,964 futures and options contracts from 15,813 a week earlier. Most-active futures dropped 1% in the last three sessions.Chicago wheat is the only grain or oilseed in which speculators hold bearish views. Through July 6, money managers flipped to a net short of 13,617 futures and options contracts from a net long of 774 in the prior week. Similar to corn, last weeks wheat move resulted predominantly from the addition of shorts.The seasonal tendency in grains and oilseeds is that open interest falls sharply at the end of June, though CBOT wheat open interest has dropped to the lowest point since September 2009. Corn open interest is a bit above average for the time of year and for soybeans it is closer to average.Kansas City wheat plunged nearly 7% through July 6, but money managers reduced their net long by fewer than 2,000 contracts to 20,880 futures and options contracts. They reduced their net long in Minneapolis wheat for a third consecutive week, to 8,826 contracts from 9,969 a week before.The opinions expressed here are those of the author, a market analyst for Reuters. "}