{"text": "LONDON Tesla intends to replace the traditional lead-acid auxiliary batteries in its Model S and X electric vehicles with lithium-ion alternatives in a revamp of the two models.Tesla Chief Executive Elon Musk dropped the teaser in an April interview on the automakers website, saying: We should have done it before now, but its great that were doing it now.It might seem another nail in the coffin for a metal that has been the dominant battery material for more than a century yet has been tarnished by its toxic past.But lead is far from dead.London Metal Exchange (LME) lead last week hit a three-year high of $2,344 a tonne with time-spreads roiled by tightness since the middle of May. It is currently trading just below that at $2,325.The rolling squeeze is partly technical but is founded on the post-lockdown resurgence of demand for lead-acid batteries as motorists return to the roads.Musks ambitions to engineer lead out of Tesla vehicles serves as a reminder that just about every vehicle on the road, whether electric or internal combustion engine, needs a lead-acid battery of some kind.The automotive supply chain may be stuttering because of the global microchip shortage, but the lead supply chain is finding it equally difficult to deliver to the right place at the right time.WHERES THE LEAD?The cash premium over the anchor LME three-month lead price flexed out to $35 a tonne in late June and at Thursdays close was still valued at a backwardation of $6.50.It has been the most severe squeeze on cash metal since February 2020 and like previous periods of tightness seems to be the result of a position clash between some of the markets bigger beasts.But the all-important backdrop has been the steady decline in LME warehouse inventory over the past couple of months.LME lead stocks have almost halved since the start of the year to 69,575 tonnes. Almost 30% of that is metal awaiting physical load-out. The remaining open inventory of 49,050 tonnes is at its lowest level since July last year.LME lead stocks have a history of sudden arrivals, which makes it all the more noticeable that nothing has been delivered onto warrant since May despite the high cash premium.But there may not be much out there. LME off-warrant stocks - metal that is being stored off-market with the potential to be warranted - were at a low 3,600 tonnes at the end of April, according to the most recent exchange report.Lead is particularly scarce in the United States. The country is fully dependent on imports for primary metal, which is the balancing mechanism for a supply chain that is 70% dominated by recycling.U.S. physical premiums are being assessed by Fastmarkets at a record high of 14.5-17.0 cents per lb ($320-375 a tonne) over LME cash prices, with imports hit by the broader disruption in the global shipping market.While parts of the global supply chain are showing signs of stress, extreme in the case of the U.S. market, metal continues to pile up in China.Stocks registered with the Shanghai Futures Exchange (ShFE) have ballooned by 87,000 tonnes since the start of January to 132,842 tonnes.If the current dynamics in the rest of the world persist, that metal will be needed, but there are no signs of it moving yet.In terms of refined lead trade with the rest of the world, China has been largely closed since the middle of last year.The net balance of refined metal imports and exports in the first five months of this year was an inflow of only 144 tonnes.BACK ON THE ROADThis dislocation of available lead stocks speaks to the disjointed nature of the global recovery from COVID-19.Chinas own stimulus-fuelled growth momentum is starting to fade. Automotive sales in May fell year on year for the first time in 13 months, with a further slowdown in June as the global chip shortage took its toll.Elsewhere, though, particularly in North America and Europe, people are gradually emerging from lockdown and taking to the road again, often only to find they need a replacement lead-acid battery for the car.Research house Wood Mackenzie expects demand for lead for replacement car batteries to rise 5.9% from 2020 to 6.5 million tonnes this year, back to pre-pandemic levels.Coupled with the stop-start recovery in new car production, lead demand is on a roll, up more than 11% in the first four months of 2021, according to the International Lead and Zinc Study Group.While Chinas trade in refined lead has been stagnant so far this year, exports of lead-acid batteries have been booming.Shipments of batteries for conventional internal combustion engines have doubled this year after contracting in the first part of 2020 as the world went into lockdown.OLD ECONOMY INDICATORLeads renaissance is a metallic echo of what is happening in the energy markets, where oil is also on the charge as the world starts to normalise.Like oil, lead is an obvious loser from the green energy transition, particularly if other automakers follow Teslas example and replace lead-acid batteries in the next generation of electric vehicles.But that day is still in the future and this old-economy metal will not go away any day soon - as U.S. lead buyers are finding out to their cost.The current market turmoil and physical dislocations will eventually resolve themselves, most obviously in the form of an export-friendly arbitrage window opening up with China.However, it serves as warning of the potential for future periods of turbulence in a metal that is broadly excluded from talk of the commodities supercycle and energy transition.Even assuming lead usage is facing long-term decline, the market will need to attract its share of investment in sustaining production in competition with more attractive greener metals.It may be an old-economy metal - trapped with oil in the confines of the internal combustion engine - but its recent price strength tells you that the old economy hasnt disappeared with the pandemic.The opinions expressed here are those of the author, a columnist for Reuters. "}