{"text": "(The author is editor-at-large for finance and markets at Reuters News. Any views expressed here are his own)LONDON, June 12 With no truly safe bets during a wild year for financial markets, theres now a hunt to cover all eventualities and Japans yen could offer a peculiar twin role.After a shocking start to the year, global equities are almost back to square one even though many economies are still only running at about 50% of pre-pandemic activity levels.The conundrum for multi-asset investors is quite acute. How do you guard against a relapse, but also ride a likely accelerating recovery as virus-driven lockdowns lift further across the world into the third quarter?Traditionally, portfolio managers have used government bonds as ballast to protect higher-risk conviction bets against economic or political shocks - assets that gain in bad times. Other risk-off stabilizers typically include gold or exposure to safe haven currencies such as the yen or Swiss franc - and theres also then a blend of sectoral rotations, switches from small to large-cap stocks or relative yield plays in credit.But inflation-adjusted sovereign bond yields across most developed economies have evaporated to near zero out to 10 years amid hyperactive central bank bond-buying and expectations central bankers will sit on yields for years to come to keep the accumulated government debt mountains sustainable.With a clear reluctance to push policy rates negative, or more negative in the case of Europe or Japan, the performance of government bonds as portfolio balancers weakens. Whats more, stepped-up intervention to keep yield curves flat undermines their predictive power on future growth and adds to the fog.Societe Generales team, for example, said this week they had stopped using U.S. government bonds for ballast.With the Fed already at zero and reluctant to go to negative rates, we can no longer use U.S. Treasuries as portfolio protection, which makes it difficult to protect the equity portion - except via the 10% yen exposure, wrote Alain Bokobza, Gaelle Blanchard and Sophie Huynh.But aside from just protection, Japans yen may provide one the few plays that gains from both ongoing recovery and fears of a second wave.Though its safety attributes are often debated, their origin goes back to the 1980s when markets feared massive Japanese investment overseas would be suddenly repatriated in the event of a domestic shock like a devastating earthquake and lift the yen in the process.More generally, the idea simply riffs off persistent Japanese current account surpluses over time and the assumption that scared money goes home. But whatever the evidence to back that argument, knee-jerk correlations in moments of global stress have tended to reinforce the idea over time.The yen and the U.S. dollar have jostled for the role of safe harbour during this shock, however.The yen initially surged almost 11% against the dollar over 12 trading days as the pandemic unfolded at the end of February.But over the following 10 days it was overtaken by an in-demand greenback as indebted companies everywhere scrambled for dollar cash and funding as economies shut down. The Fed then neutralized that move back to square one by stepping up its massive stimulus and opening dollar-swap lines around the world.With that Fed hose still pumping liquidity the picture is changing again. So far in June, however, the yen has risen - both with stocks hitting new highs all last week as well as their sharp reversal over recent days.BOTH SIDES OF THE COINWith global credit and funding stresses largely at bay for now, the pressure on the dollar is now building more generally.As the scale of Fed monetary support becomes clearer and outstrips all other central banks - a balance sheet expansion in excess of $3 trillion already is more than twice that of the European Central Bank or Bank of Japan - the dollar may well weaken further even if theres another wobble in the recovery.Novembers U.S. election complicates the dollar picture, with widely-watched prediction markets sites such as PredictIt indicating Democrat Joe Biden now has a 14-point lead over incumbent Donald Trump.The resulting political uncertainty, specifically in relation to regulations and taxes, is also likely to weigh on the U.S. currency, UBS chief investment officer Mark Haefele said this week. A weaker dollar is part of our view on how to position portfolios for the upside.Add to the equation that Japans economy has not been hit as hard as other major economies.Even though it expects deep contractions everywhere, the Organisation for Economic Cooperation and Development on Wednesday forecast Japans 6% drop in output this year would be the shallowest of the G7 economies. Even an adverse second-wave outcome would see Japan outperform the other six, the OECD said.Given nothing is truly a safe bet, there are challenges to the yen - the deterioration of U.S.-China relations and the hit to world trade and supply chains are negatives for export-dependent Japan.The Bank of Japan would also likely do all in its power to resist a sustained yen surge, even if that would probably stop short of the Swiss National Banks aggressive intervention to cap the francs frequent bouts of safety-driven appreciation.But for the remainder of 2020 at least, the yen direction may indeed offer something of a win-win scenario."}