{"text": "LONDON Portfolio managers took profits on their bullish petroleum positions after OPEC+ failed to reach agreement on increasing production and U.S. oil prices hit their highest level since late 2014.Hedge funds and other money managers cut their combined position in the six most important petroleum futures and options contracts by the equivalent of 63 million barrels to 877 million barrels in the week to July 6.Weekly net sales were the largest since the middle of March, based on records published by ICE Futures Europe and the U.S. Commodity Futures Trading Commission.(Chartbook: tmsnrt.rs/3yTSko1)Last week, fund managers were sellers of NYMEX and ICE WTI (-34 million barrels), Brent (-5 million), U.S. gasoline (-14 million), U.S. diesel (-4 million) and European gas oil (-6 million).For the most part, funds sold existing bullish long positions (which were reduced by -55 million barrels) rather than creating new bearish short ones (which increased by just +8 million).The distribution of position changes is consistent with profit-taking after front-month WTI futures hit a new cycle-high of nearly $77 per barrel when OPEC+ failed to agree on a output increase in August.But with crude prices already trading above long-term averages in real terms, a third wave of coronavirus infections in North America and Europe, and fund positions looking stretched, some managers locked in profits.NYMEX and ICE WTI, where three weeks earlier long positions had outnumbered shorts by a ratio of more than 14:1, the highest for seven years, was hit particularly hard.Even after the sales, however, the hedge fund community remains bullish, with the net long position across all six major contracts in the 80th percentile for all weeks since 2013.Combined long positions outnumber shorts by a ratio of more than 5.25:1, which is in the 70th percentile, and another sign most managers believe price risks remain tilted to the upside in the medium term.John Kemp is a Reuters market analyst. The views expressed are his own.Related columns:- U.S. petroleum inventories are becoming tight (Reuters, July 9)- Hedge funds await OPEC+ oil output decision (Reuters, July 5)- Falling U.S. crude stocks draw hedge fund attention (Reuters, June 28)"}