{"text": "FORT COLLINS, Colo. Speculators hugely bullish corn gamble that was set in motion late last year has paid off so far with recent outlooks suggesting global corn supplies could remain tight into 2022. Chicago corn futures last week hit contract highs in nearby and deferred months, further backing that thesis.But it seems that commodity funds may have found a ceiling on their corn bets, at least for now, because they sold the yellow grain even after the U.S. government revealed farmers plans for fewer 2021 acres than expected.In the four-session week ended April 6, money managers reduced their net long in CBOT corn futures and options by nearly 9,000 contracts to 386,619 contracts according to the U.S. Commodity Futures Trading Commission.Most of that move was funds removal of gross longs, but they have also been very uninterested in being short during such volatile times. Money managers gross shorts numbered just 26,475 contracts as of April 6, the fewest since October 2012.May corn futures rose nearly 3% during that week and December corn jumped almost 7% after the U.S. Department of Agriculture on March 31 pegged U.S. corn plantings at 91.1 million acres, below the range of estimates. Open interest was up 2% during the week ended April 6.USDA on Friday published its monthly supply and demand estimates, which painted a slightly smaller than expected corn stocks picture in the near term. Two days earlier, U.S. corn-based ethanol stocks were shown to have fallen well below average levels for the time of year, also supporting nearby corn.May corn surged 4.1% over the last three sessions, reaching a contract high of $5.95 per bushel on Friday. December corn was up 2.7% during the period and notched a high of $5.03-3/4 on Friday, the first time since 2014 that the contract in expiration year rose above $5 in the expiration year.Trade estimates suggest funds bought 50,000 corn futures contracts over the last three sessions. If those numbers are accurate and the buying continues on Monday and Tuesday, the next batch of CFTC data could potentially show money managers with record-long corn bets.However, that 400,000-contract mark has been elusive despite predictions placing funds corn long above that level a couple of times in recent months. Funds corn net long last topped 400,000 in January 2011, and the record is 429,189 futures and options contracts in September 2010.Including other reportable traders bets pushes the overall speculative corn position well past the 2010-11 levels, and that has been the case since late last year.SOYBEANS AND WHEATUSDA showed U.S. soybean acres for 2021 at 87.6 million, also well below trade predictions. May soybeans rose 3.8% in the week ended April 6, while November beans roared 7.2% higher, setting a contract high of $12.85 per bushel during the period.Money managers lifted their net long in CBOT soybean futures and options to 154,305 contracts during the week from 141,880 a week earlier, lighter buying than expected considering the acreage shock.May beans fell 1.1% and November beans 0.6% over the last three sessions, despite the extremely tight supply situation. USDA on Friday reduced Chinas soybean usage, supporting fears that African swine fever may be more rampant in the country than is being reported.Through April 6, money managers sold soybean oil for a sixth consecutive week, reducing their net long to 77,037 futures and options contracts from 80,840 in the previous week. They increased their net long in soybean meal by just over 3,000 contracts to 61,345 contracts.Improving U.S. and Russian crop ratings had been keeping wheat prices in check, though traders have been watching dry spring wheat planting conditions in the northern U.S. Plains and some unusually cold weather across the European continent. USDA on Friday increased Chinas wheat usage, sending global stocks below market expectations.In the week ended April 6, money managers cut their CBOT wheat net short nearly in half to 7,583 futures and options contracts. However, they reduced their net long in Kansas City wheat by more than 7,000 futures and options contracts to 14,510, their least optimistic since September.Funds move in Minneapolis wheat futures and options was the most dramatic, as they cut nearly 5,000 contracts from their position during the week, resulting in a net long of 5,483 contracts. The two-week selloff of nearly 10,000 spring wheat contracts is a record.Minneapolis wheat made a U-turn last week with May futures surging 7% over the last three sessions. CBOT May wheat rose 3.8% and K.C. wheat jumped 5.6%.The opinions expressed here are those of the author, a market analyst for Reuters. "}