{"text": "FORT COLLINS, Colo. Yield risks arise whenever Brazils heavily exported second corn crop is planted late, but this year the delays are the worst in a decade, and the pressure for favorable weather through the next several months is substantially higher than usual.Historically dry conditions in Brazil last year led to a slow soybean planting pace. Late soybean sowing alone does not always mean the corn crop will be planted just as late, but rains have hampered the bean harvest, worsening the delays for the second corn sowing that immediately follows.However, Brazils official statistics body, Conab, remains upbeat on the harvest prospects. The agency on Thursday increased the countrys total corn crop to 108.1 million tonnes from the previous forecast of 105.5 million.That included a jump of 2.7 million tonnes for the second corn crop, which is still being planted, to 82.8 million tonnes on both area and yield increases. Conab also lifted Brazils soy harvest by 1% to a record 135.1 million tonnes.But the No. 2 corn exporter still has many hurdles to clear to reach a bumper corn harvest. Consultancy AgRural estimated second corn planting as of a week ago at 54% versus 80% a year ago.MATO GROSSOFor Mato Grosso, which produces about 45% of Brazils second corn, the outcome primarily depends on the start of dry season, and in particular, rains in April and May.As of last Friday, the Center-West state had planted 73% of its second corn, well off the recent average for the date of 92%. That is a very similar pace to 2009 and 2011, years that had opposite yield outcomes, though it is notably slower than 2016s disastrous hot and dry harvest.Mato Grosso has a strong seasonal rain cycle and receives virtually no rain between June and August. That is generally favorable for the harvest occurring at that time, but it could be a death sentence for late crops because once the rain shuts off, it shuts off.Corn planting was late in 2011, but rainfall was at or above normal levels through April. However, most of Aprils rain fell in the first 10 days, and then May was among the driest on record. Despite normal to cooler temperatures during the season, Mato Grossos 2011 second corn yield dropped more than 15% from the long-term trend.The timing of 2009s planting was the same as 2011, but above-normal rainfall persisted the whole season, with near record accumulations observed in May and June. The lack of significant heat also added to the success of the 2009 crop, which produced sharply above-average yields.The 2009 and 2011 examples in Mato Grosso should be used with caution because todays planted corn area is more than three times larger. The 2015 crop featured the next-slowest planting effort, but mild temperatures and ample April and May rainfall secured the big yields.PARANANo. 2 corn producer Parana in the south observes rain more consistently throughout the year than its northern counterparts. However, the second corn planting pace is shockingly slow and there are no recent, comparable years available.As of Monday, the state reported corn planting at 43%, well below the five-year average of 82%. The next-closest year would be 2011, but several weeks of data are missing that year so the comparable pace cannot be confirmed.However, some 17% of Paranas corn crop was planted on Feb. 21, 2011, compared with about 10% on the same date this year. By March 21, 2011, progress had reached 87%, just a bit below average.Unsurprisingly, Paranas better outcomes were associated with ample rainfall during the growing season and a timely planting pace. May 2011 rainfall was among the lowest on record, and April and May 2018, another slow planting year, were also critically light on moisture. Second corn yields were poor in both of those years.Expansion of corn area in Parana has not been as sharp as that for Mato Grosso. Since 2011, Paranas second corn planting has jumped 35% to around 2.3 million hectares.SUPPLY SHORTAGESBrazils government is already concerned about tight domestic supplies over the next year. On Wednesday, the Agriculture Ministry noted that measures will be introduced, possibly in May, to boost next years summer crop.That first corn crop is the one that supplies local needs, and it used to represent the bulk of Brazils output. But now it accounts for less than a quarter as global corn demand has grown, and Brazils export capabilities have increased. Currency weakness has encouraged even more planting of the countrys second crop since it is attractive for Brazilian farmers to sell on the global export market.The expected harvest delays push the availability of the second crop even later, causing more concern for domestic supplies by mid-year.Conab on Thursday pegged Brazils 2020-21 first corn crop at 23.5 million tonnes, down slightly from the prior outlook. That is also notably down from the initial October outlook of 26.8 million tonnes and last years 25.7 million. Yields have fallen 14% since the October estimate.Conabs 82.8 million-tonne second crop forecast is up 8% since the initial outlook, primarily on an expected increase of plantings. That compares with last years harvest of 75.1 million tonnes.The opinions expressed here are those of the author, a market analyst for Reuters. "}