{"text": "LONDON If ultra-long 50-year bonds are going like hot cakes in Europe, the temptation to double up maturities and lock in the lowest borrowing rates in history for a century is pretty compelling.With Italian debt flying more than most this month on the prospect of former European Central Bank chief Mario Draghi becoming Italys new Prime Minister, some think a century bond is a no brainer now for Rome - even if less obvious for investors hoovering up any long-dated issue available.The ECB bid in this market is not going away soon as pandemic relief dominates - but may not always be there either. And Italy, with its famously fractious politics, is forecast to running a debt-to-GDP ratio close to 160% this year and next.Yet, Spains debut 50-year bond this week was 13 times oversubscribed for a sale of 5 billion euros - and with a yield of just 1.65%. So the demand for ultras is clearly still there in the current environment at least.Italys Treasury sold 50-year bonds for the first time in 2016 with a coupon of 2.8%. After a brief wobble this year the yield on that issue has returned toward record lows of about 1.7% hit at the start of the year and the country is widely expected to come back with a new 50-year sale soon.But Saxo Banks bond strategist Althea Spinozzi thinks Italy should make the most of the central bank and investor largesse and lock in for a century now. Why not? she wrote on Thursday.Estimating that in the current climate Italy could sell a 100-year bond with a rate of just 2.5%, Spinozzi reckoned that would be a percentage point lower than the average yield on 10-year Italian Treasury debt over the past 20 years - and about the same as the average yield on its 3-year debt over that time.The windfall from locking in these low rates is eye-catching. If yields stayed where they are today, she calculates that Italy could save some 41 billion euros in the course of this years planned 341 billion euros of debt refinancing.This is the right time for countries to expand bond issuance in ultra-long maturities to fund budget deficits while securing extremely low yields, said Spinozzi. An opportunity that we believe a country like Italy cannot ignore.TALE OF TWO CENTURIESThe case for the borrower is obvious then. But why would investors lend to Italy for a century at just 2.5% a year, with all the inherent risks and uncertainty?Well, the appetite for still-scarce ultra-long debt remains high from pension and insurance funds with long-term liabilities theyre required to match by law and facing sub-zero yields on safer German debt out to Berlins maximum tenor of 30 years.Long duration bonds - with high price sensitivity to interest rate changes - are much sought after as a diversifier in balanced portfolios.Despite greater volatility, high convexity of their price-yield relationship - which effectively means prices rise more when yields fall than they fall when rates rise - mean they especially appeal to defined benefit pension funds hedging against plunges in the discount rates used to calculate their liabilities.Thats certainly true of prior European forays into century bonds. Investors who snapped up AA+-rated Austrias first 100-year bond four years ago would have doubled their money in price terms with a coupon of 2.1% - aping the seemingly racier Nasdaq index of U.S. tech stocks in dollar terms.And when Austria returned with a new century bond last year it cost it less than 1% and was still 10 times oversubcribed.But Italy is not Austria - at least not for credit rating firms badging it as BBB credit.And the volatility of long duration has already been amply illustrated this year as recovery and reflation trades pushed up core bond yields around the world.A 20 basis point rise in the yield on that 2117 Austria bond so far this year equates to a 12% drop in its price. That still leaves 100-year Austrian yields below last years new issue at 0.8% - but the scale of the burn from any normalisation of underlining borrowing costs is clear.A 100-year bond from Italy would be pretty punchy, said Gareth Hill, fund manager at Royal London Asset Management. It would be a very good test of investor appetite - but it might be a step too far.Given the sudden political calm, pandemic-related needs and firm ECB commitment, Italy may want to seize the moment.If it does, investors can only hope its more like the Austrian version than the ill-fated Argentina foray into century bonds in 2017 - a bond that collapsed in price since and was eventually exchanged at a fraction of its face value during last years chaotic debt restructuring.The author is editor-at-large for finance and markets at Reuters News. Any views expressed here are his own. "}