{"text": "FORT COLLINS, Colo. Market analysts predict both U.S. and Brazilian agencies on Wednesday will slash Brazils corn crop due to relentless dry weather in some key areas, though the expected cuts might not be big enough as May is forecast to be very light on the moisture.A smaller second corn harvest, the one Brazil most heavily exports, could drive even more business to the United States at a time when record purchases from China are anchoring the U.S. export program, a trend that is seen continuing into next year.Brazils increase in plantings of second corn, or safrinha, amid favorable prices was expected to offset some of the potential yield limitations from the later sowing, but the weather is not cooperating. The late start for safrinha means that ample rainfall is important this month, and the prospects do not look great.TOO DRY FOR TOO LONGIn No. 2 producer Parana, only 25% of the second corn is considered in good condition this week, down from 28% a week earlier and 76% a month earlier. That follows the driest April in more than 20 years, very poor timing since about half the corn moved through pollination last month.About 40% of Paranas corn still needs to pollinate and the near-term forecast is sparse, though some showers are possible on Wednesday. However, outlooks as of Tuesday suggested May rainfall is very likely to come in at less than half of the southern states monthly average.Paranas 2021 safrinha harvest seems on track to be worse than that of 2018, perhaps the closest example year. The 2018 crop was planted late and April rainfall was historically low. May rains doubled Aprils total, but they were still well below normal, and corn yields fell by nearly a quarter from typical levels.Three years ago, some 43% of Paranas corn was rated as good, 44% was average and 13% bad. This week, 45% is average and 30% is bad. Only 7% had been bad three weeks earlier.Mato Grosso do Sul and Goias, the next-largest producers, also faced late planting and have been grappling with dryness. Earlier this month, Mato Grosso do Suls agriculture body rated 13% of the second corn in good condition, though only 4% was bad and 83% was average. One must use caution when comparing ratings among states since the criteria might vary.Even top producer Mato Grosso has not had the storybook season farmers there were hoping for after marketing their crops much more aggressively and earlier than normal. The heaviest production regions of the state have received mostly adequate rainfall though other parts have been drier, but now the forecasts are bare.The states statistic agency, Imea, earlier this month reduced expected corn yield by 1% from the prior forecast, and that would be off 7% from last year. Imea cites the later planting, dryness in some areas and the May rainfall outlook that is nearly bone-dry.EXPORT DIVERSION?Both the U.S. Department of Agriculture and Brazils Conab have predicted Brazils total corn crop at a record 109 million tonnes, though the agencies on Wednesday will publish new and presumably lower outlooks. Analysts peg USDA at 103 million tonnes with a low estimate of 100 million, which would be below last years 102 million.However, some outlooks have drifted below 100 million tonnes given the recent and expected dryness. Consultancy AgRural on Monday estimated the total crop at 95.5 million tonnes, the smallest crop in three years.The anticipated shortfalls in Brazil increase the chances for U.S. exporters to gain even more business on top of their banner season or potentially for the upcoming one. As far as Wednesdays report is concerned, the impact on projected U.S. exports will depend on the Brazilian crop estimate.But China is the other factor for U.S. exports due to some recent cancellations for the 2020-21 year. Within the last week, China cancelled a total of 420,000 tonnes of old-crop corn, slightly less than 2% of its total standing commitments at the end of last month.That volume alone could very easily be replaced by Brazils losses, though it is unknown how many more U.S. cargoes China might push to 2021-22, which starts on Sept. 1. Brazil does not export significant amounts of corn to China, so extra U.S. business would likely be from other buyers.Within the last three trading days, USDA has confirmed a total of 3.06 million tonnes of U.S. corn sold to China for shipment in 2021-22, the countrys first new-crop purchases. It is unclear if overall Chinese corn demand is still as strong as market watchers thought or if the timing is simply pushed forward.The opinions expressed here are those of the author, a market analyst for Reuters. "}