{"text": "(The opinions expressed here are those of the author, a columnist for Reuters)* Money manager positioning on CME copper:LONDON, Oct 12 Fund managers have trimmed their exposure to copper after a mini price crash over the first two days of the month.This looks to be no more than a blow-off of speculative froth accumulated on coppers long march higher from the COVID-19 lows in March.Overall commitment to coppers bull narrative seems largely unshaken, with money manager long positioning on the CME High-Grade copper contract still elevated and bears conspicuous by their absence.Market optics and spreads have been dented by the late-September dump of 95,000 tonnes into London Metal Exchange (LME) warehouses.But funds show every sign of keeping the faith with Doctor Coppers broader prognosis that China is already fully recovered from the deadly coronavirus and the rest of the world is starting to follow.MINI COVID CRASHMoney managers were net long of CME copper to the tune of 69,806 contracts as of last Tuesday (Oct. 6), according to the latest Commitments of Traders Report.Net length has been cut by 20% over the last two weeks, which included an early-month price crash triggered by news that President Donald Trump had tested positive for COVID-19.The LME three-month contract slumped by over $400 to $6,269 per tonne over the first two days of October.Such price violence would itself have caused some shift of positioning among funds, given many that populate the CME copper space are algorithmic number-crunchers.But algos can also now read the news and are primed to react to the sort of headline frenzy that followed the confirmation of presidential infection.They will also have read the LMEs daily stock reports, showing the arrival of 95,350 tonnes of copper over three trading days (Sept. 28-30). Registered inventory jumped from 73,625 to 165,600 tonnes.The combination of micro and macro hits to market sentiment has dampened but not extinguished previous bullish exuberance.Outright long positions on the CME have fallen by 15% to 93,723 contracts over the last two reported weeks, but thats still a big collective bet on higher prices. Youd have to go back to the second quarter of 2018 to find a more bullish landscape.Also worth noting is that outright short positions have rippled only gently higher and at 23,917 contracts are still extremely low by any historical yardstick. Bears remain few and far between.LME broker Marex Spectron, which runs its own assessments of speculative positioning, thinks funds are less committed on the London market, holding long positions equivalent to 6.8% of open interest. Thats down from a high of 18% in July but still more bullish than any other LME-traded metal.It helps that the copper price has bounced back from its early-October swoon. LME copper is currently trading around $6,770, back within sight of the year-to-date high of $6,877.50 recorded on Sept 21.RECOVERY NOW...It also helps that London time-spreads are re-tightening, cash-to-three-months ending last week valued at a $4.50 backwardation.That suggests the market isnt expecting last months big deliveries onto LME warrant to stay around too long.Moreover, much higher tonnages are heading every month towards China. The country imported 489,000 tonnes of refined copper in August.Cumulative imports have surged by 39% to 3.0 million tonnes so far this year, meaning the worlds largest buyer has binged on an extra 850,000 tonnes relative to 2019.Some of that extra metal has gone to swell domestic inventories, both commercial and possibly strategic.But the core driver has been Chinas extraordinarily rapid industrial recovery from widespread lockdown in the first quarter.Chinas demand recovery is now complete across the various metals end use sectors, according to analysts at Citi. (Mapping the ex-China demand recovery, Oct. 8, 2020).Citi estimates that Chinas copper usage in August was up 6.6% year-on-year, with the year-to-date decline now running at just 4.0%.There looks to be more to come with Chinas State Grid announcing plans to spend more than 6 trillion yuan ($896 billion) over 2021-2025.The countrys biggest electricity company is also one of the worlds largest copper buyers....RECOVERY TOMORROWThe key question, posed by Citi, is how fast the rest of the world follows China. The bank assesses the COVID-19 hit on copper usage outside China at a much harder year-to-date 11%.August usage was still 8.8% below last year, evidence that recovery is proving a very stop-start process, particularly in emerging markets, Citi writes.Offsetting such doubts, though, is rising excitement that the European Union is going down the Chinese recovery route with plans for a massive green industrial stimulus package.Faster build-out of renewable energy infrastructure and rising electric vehicle penetration could boost copper demand by 675,000-1,050,000 tonnes between 2019 and 2023, according to Goldman Sachs.That compares with an estimated 300,000-tonne increase in copper intensity between 2015 and 2019 and represents a notable acceleration, Goldman said. (Deficit expansion set to drive copper higher in 2021, Oct. 1, 2020)There is also the prospect of the United States unleashing the same sort of spending spree in the event of a Joe Biden presidential victory at the November elections.A Blue-wave Biden win would herald a promised $2 trillion green infrastructure package, justifying a 5-7% increase in base metal prices, with copper likely outperforming the rest of the sector, according to JP Morgan. (Metals Weekly, Oct. 12, 2020).Goldman Sachs has just raised its 3-, 6- and 12-month forecasts by $1,000 per tonne across the board to $7,000, $7,250 and $7,500 respectively.The bank forecasts the copper market will experience a 421,000-tonne supply shortfall next year, the largest refined copper deficit in over 15 years, which should drive an acute level of market tightness.The bull chorus is singing.Fund managers and their algos appear to be listening."}