{"text": "LONDON The United States $1 trillion infrastructure package is undoubtedly good news for industrial metals.More money for upgrading highways, railways and power grid systems will mean more demand for steel, copper and aluminium.But when it comes to battery metals and critical minerals, the bipartisan bill is as much about boosting domestic supply as demand.A total $6 billion is earmarked for battery materials processing and manufacturing projects with another $140 million allocated for a rare earths demonstration plant, part of a broader investment drive across the full length of the metallic supply chain.The Biden Administration understands that without investing in domestic critical metals production capacity, it will struggle to deliver on its dual commitments to build back greener and Buy American while doing so.RARE EARTHSThe United States reliance on imports of rare earth compounds remains almost total with 80% of shipments coming from China last year, according to the United States Geological Survey (USGS).While the Department of Energy is already channeling funds into research and development spanning the materials spectrum from primary processing to recycling, the infrastructure bill hardens the commitment with a $140 million grant to build a facility to demonstrate the commercial feasibility of a full-scale integrated rare earth element extraction and separation facility and refinery.The project, to be coordinated with an academic partner, will specifically provide environmental benefits through use of feedstock derived from acid mine drainage, mine waste, or other deleterious material, more on which later.Rare earths are just one item on the United States long list of vulnerable critical mineral supply chains.The bill also allocates $100 million per year through 2024 in grants for developing, processing and recycling critical minerals.A minimum 30% will be set aside for recycling projects. Any project based in the United States will be prioritised and none will be allowed to export to a foreign entity of concern.BATTERY METALSElectric vehicle (EV) fans were under-whelmed by the $7.5 billion allocated in the infrastructure bill for EV charging. A group of U.S. House Democrats is already pushing for a big lift in the $3.5 trillion budget blueprint.However, the direction of electric travel is clear.President Biden earlier this month signed an executive order with the aim that half of all U.S new vehicle sales should be electric by 2030.The question is whether the country will have enough lithium, nickel and cobalt to make the batteries needed to power those vehicles.The infrastructure bill is the U.S. governments answer with allocations of $3 billion each for battery materials processing and battery manufacturing projects.Grants in each case will be for either demonstration plants, full commercial facilities or the retrofitting of existing facilities in the United States.No surprise that the conditions for qualifying for a grant include U.S. ownership, North American intellectual property rights and a commitment not to use battery material supplied by or originating from a foreign entity of concern.Interestingly, a new nickel refinery turned out to be top of the critical minerals wish list in the Biden Administrations 100-day supply chain review.If there are opportunities for the U.S. to target one part of the battery supply chain, this would likely be the most critical to provide short- and medium-term supply chain stability, the report said.The United States has limited mine capacity and no processing capacity for a metal that is expected to experience strong demand growth from the battery sector.The infrastructure bill seems intended to kick-start a domestic supply response, centred around the mineral processing link in the supply chain.PERMITTING PROBLEMSIdeally, of course, a U.S.-funded nickel or other battery metal refining facility would process U.S.-mined ore.However, getting new mines up and running on U.S. soil can be a slow and tortuous task given the complexity of the permitting processes. Too slow if the country is going to get even close to generating enough metals for the coming green revolution.The Federal permitting process has been identified as an impediment to mineral production and the mineral security of the United States, the infrastructure bill notes, calling for the introduction of performance metrics for approving critical mineral mines.Environmental opposition to green metal mining projects is also a big problem and not just in the United States. A planned mega lithium project in Serbia is already running into fierce opposition from local pressure groups.It remains to be seen just how fast Federal permitting can be fast-tracked given the growing push-back against dirty mining.TOTAL MININGThere is a potential way of bridging this green-green divide.One of the mining sectors big legacy problems is old tailings and waste dumps, often seeping into local water supplies.The heightened profile of critical minerals over the last couple of years is occasioning a collective re-think of what exactly is mine waste.Mine economics are often determined by a primary host mineral. Some by-products such as gold are valuable and worth processing. Many, though, end up in the tailings.Companies such as Rio Tinto are now going back to re-examine what theyve been throwing away. In the case of the companys Canadian titanium business, they found scandium, designated a critical mineral by both the United States and Europe.A relatively modest $6 million investment will produce three tonnes per year of scandium oxide - around 20% of the global market - without the need for any additional mining.This trend towards whole-concept or total mining is picked up in the infrastructure bill.The USGS is tasked with completing within 10 years a comprehensive survey of national minerals resources, using a whole ore body approach rather than a single commodity approach, to emphasize all of the recoverable critical minerals in a given surface or subsurface deposit.The bill also calls for the USGS to map and collect data for areas containing mine waste to increase understanding of above-ground critical mineral resources in previously disturbed areas.Its precisely such waste that will feed the proposed new rare earths processing plant.Building new mines will remain a headache for critical minerals planners everywhere so going back to the stuff already mined makes a lot of sense.If it helps clean up mine tailings at the same time, it could be a win-win for greens of every persuasion.The opinions expressed here are those of the author, a columnist for Reuters. "}