{"text": "Hedge funds have cut their position in petroleum for the second time in three weeks in response to a resurgence of coronavirus infections and the likely postponement of a resumption to airlines' international passenger flights.Money managers sold the equivalent of 35 million barrels in the six most important petroleum futures and options contracts in the week to April 6 (https://tmsnrt.rs/2PYE4JJ).The combined position has been cut to 799 million barrels, from a peak of 913 million barrels on March 16, according to records published by ICE Futures Europe and the U.S. Commodity Futures Trading Commission.In the most recent week, portfolio managers sold Brent (-20 million barrels), NYMEX and ICE WTI (-19 million) and European gasoil (-1 million) but were small buyers of U.S. gasoline (+1 million) and U.S. diesel (+3 million).The pattern is consistent with continuing coronavirus infections and strict travel controls, which are now likely to push any major resumption of international passenger aviation back from mid-year until the fourth quarter.Continued weakness in jet fuel consumption will delay the recovery of refineries crude processing to pre-epidemic levels and put crude consumption on a weaker trajectory in the second and third quarters.The decision by producer group OPEC+ to start raising crude output from May, as well as indications that U.S. shale production will start to increase from the second quarter, have also curbed bullish sentiment.The hedge fund community is still relatively bullish on the outlook for oil prices for the remainder of the year: the combined position across all six contracts is in the 75th percentile for all weeks since the start of 2013.Even after recent sales, bullish long positions outnumber bearish short ones by a ratio of 5.2:1, which is in the 71st percentile for all weeks over the same period.But fund managers are slightly less bullish than in February and March, when positions and the long-short ratio peaked in the 81st to 83rd percentiles.Related columns:- Funds book profits after sharp fall in oil prices (Reuters, April 4)  read more - U.S. oil production to start rising in second quarter (Reuters, April 1) - Oil prices hit by wave of hedge fund profit-taking (Reuters, March 29)  read more - Frothy oil market deflates as virus fears return (Reuters, March 23)  read more "}