{"text": "LONDON Global investors are obsessing about borrowing costs, discount rates and inflation risks as the world emerges from the shocking pandemic - but they are also starting to pore over coming corporate tax hikes that could reverse a decades-long decline.Few governments struggling to vaccinate populations and reopen economies are likely to raid companies just yet. Many are still offering tax holidays or credits as ballooning government debts are bridging the gap in revenues as well as funding public supports and new spending stimulus.But as Britain showed last week with a planned 7 percentage point corporate tax rise to 25% in 2023, the taxman is coming.Although no timeline is set, U.S. President Joe Biden has promised to at least partly reverse predecessor Donald Trumps business tax cuts and lift corporate income tax 7 points to 28%. Biden has also injected new momentum into plans for global taxation of digital and e-commerce giants, most of whom benefitted disproportionately from pandemic lockdowns.At a G20 meeting two weeks ago, Treasury Secretary Janet Yellen dropped a Trump administration proposal to let big firms opt out, raising hopes of meeting a Summer deadline for almost 140 countries to modernize outdated rules on taxing cross-border commerce and a global minimum corporate tax rate.If a greener, fairer and more indebted world is the post-COVID legacy, as many investors insist, then higher corporate taxes that have been falling for decades are likely to be part of that mix too.The average corporate tax rate across the developed world is now just two thirds of what it was 20 years ago. Government debt as a share of output in advanced economies has risen more than 50% over the same period.According to Organisation for Economic Cooperation and Development data, total U.S. tax on corporate profits in 2019 was below 1% of gross domestic product and less than 4% of all taxation - both the lowest in at least 55 years and the lowest in the G20. The equivalent UK stats were the lowest in 25 years.Barclays analysts reckon median effective corporate tax rates for FTSE 350 companies in Britain and S&P500 firms across the Atlantic were 19% and 20% respectively - below the 22% OECD average and 5 percentage points below eurozone averages.Following years of pro-business policies and falling corporate tax rates, the trend may be about to reverse, wrote Emmanuel Caus equity strategy team at Barclays, flagging tax a medium-term threat to earnings.Graphic: OECD chart on corporate profits tax as a % of GDP -https://fingfx.thomsonreuters.com/gfx/mkt/bdwpkmddbpm/OECD.PNGTURNING POINTCau estimates the 2023 UK corporate tax hike amounts to about a 6% earnings headwind for the widest sweep of the large domestically-exposed listed British companies. FTSE100 firms with greater overseas income - where effective tax rates that account for different incomes, deductions and allowances were already as high as 23% - would likely take a smaller 3% hit.Although a super deduction between now and March 2023 will ease effective tax rates near term, that will not overlap with the higher headline rate when it comes and there the latter may have to be absorbed one-for-one into earnings.Berenberg economist Kallum Pickering questioned whether the politics of Brexit and Conservative party re-election will ever see the headline tax rise come to fruition. But, if it does, he reckoned it would lift effective tax rates more than headline reductions over the past 20 years cut them and could drag on an otherwise substantial post-pandemic rebound investment and productivity.It is a historical irony that, upon leaving the EU, the pro-Brexit UK government has chosen to adopt a more continental-style economic policy, he said.Cau at Barclays said a U.S. corporate tax hike may take more time but would likely have a similar impact on earnings as estimated for UK firms. Supporting that, he cited the 10% earnings upgrades that immediately followed the 8 point Trump tax cut in January 2018 - slightly more than a 1:1 relationship.Of course, different sectors will take different hits - not least due to the variety of effective tax rates experienced. And the relative weight of certain sectors in different economies partly explains differences in total tax takes as a result.IT and healthcare firms experience the lowest effective rates below 20%, while energy and industrials among the highest. As such, headline tax hikes may encourage the prevailing equity investment rotation from growth to beaten down real economy stocks as the recovery matures.With stock markets back at record highs overall, investors hardly seem fazed yet about the coming taxes. Massive government supports and investment spending and still historically super cheap borrowing rates all help with that.But perhaps the very lack of market anxiety - even its acceptance of new post-pandemic priorities and norms - just underlines an inevitable reversal of 40 years business tax cuts.Graphic: Barclays charts on falling corporate taxes over decades and effective rates -https://fingfx.thomsonreuters.com/gfx/mkt/qzjvqljjbpx/BARC1.PNGGraphic: Barclays chart on UK corporate tax plans -https://fingfx.thomsonreuters.com/gfx/mkt/qmyvmroodpr/BARC2.PNG"}