{"text": "FORT COLLINS, Colo. Most of the U.S. Crop Watch corn and soybean fields over the recorded plentiful rainfall last week, boosting conditions in some of the western locations. Early corn yield prospects are a bit more conservative in the west than in the east and are a bit below the year-ago expectations.The Kansas and North Dakota locations were the only two that did not receive rain last week, but all the others received at least one inch (25 mm). Four of the locations (Minnesota, Nebraska, western Iowa and western Illinois) picked up more than 3 inches over the last several days.Most of the Crop Watch corn fields have begun the pollination process, an early determinant of yield potential, and the rainy weather and milder temperatures are ideal for pollination. However, producers from eastern Iowa to Indiana say some heat would be helpful to move the crop along.Heat is unlikely for those areas in at least the next seven days and sufficient rainfall outlooks continue for most of the Midwest. Short-term forecasts are drier for the Plains, and above-normal temperatures are likely by the weekend and into next week for the Dakotas, where corn pollinates later than most states.The producers of Crop Watch, which follows 11 corn and 11 soybean fields across the Corn Belt on a weekly basis, were asked to give their first assessment of 2021 yield potential. Like conditions, this is scored on a 1-to-5 scale, with 3 being near average for the field, 1 well-below and 5 well-above average or record yield.For simplicity and easy comparisons with prior years, the cumulative yield scores are unweighted averages.YIELD AND CONDITIONSThe initial, 11-field corn yield potential comes in at 3.86, below the eight-field average of 4.03 in the same week a year ago. The 2021 score drops to 3.81 if removing the three new 2021 locations for a more direct comparison with 2020.The 11-field soybean yield score starts at 3.95 versus 4.03 in the same week in 2020. Averaging the original eight produces a similar score of 3.94. The 2020 U.S. corn and soybean crops were initially expected to set yield records, but a drought and extreme windstorm in August canceled those outcomes.The yield scores are somewhat split east-to-west for corn. Six of the 11 producers started corn potential at 4 or above, including both Iowa growers and those to the east. Eastern Iowa and Ohio assigned corn a 5, western Iowa and western Illinois went 4.5, and southeastern Illinois and Indiana start at 4.Corn in North Dakota carries the lowest yield outlook at 2, while recent dryness in South Dakota and Kansas start corn at 3. The Nebraska and Minnesota producers both assigned a 3.75 to their corn due to Fridays windstorm in Nebraska and early imperfections with weather in Minnesota.Yield scores for soybeans are a bit more mixed across the landscape and seven producers assigned scores of 4 or above. The North Dakota field scores a 2, and South Dakota a 3. The Kansas producer assigned a 3.5 to beans because despite the dryness, flowers, which precede pods, have been plentiful. The southeastern Illinois producer is not as impressed with early pod set as he hoped, and the field gets a 3.75.Elsewhere, producers have been pleased with soybean growth so far. The eastern Iowa and Ohio producers see a 5 potential for their soybeans, and the western Illinois and western Iowa growers rank their beans at 4.5. Nebraska comes in at 4.25 and Indiana and Minnesota both start at 4.The 11-field corn condition score rose slightly, to 4.16 from 4.14 a week earlier, as improvements in Minnesota, South Dakota and western Iowa offset declines in North Dakota and Nebraska. The drought has set crop development behind in North Dakota, and a strong windstorm knocked over 10-20% of the Nebraska field. The producer is waiting to see how much of that corn stands back up.(tmsnrt.rs/3wuUMiV)The soybean condition score rose to 4.23 from 4.14 last week on increases in South Dakota, western Iowa and western Illinois. None of the producers reduced soybean conditions this week.The following are the states and counties of the 2021 Crop Watch corn and soybean fields: Griggs, North Dakota; Kingsbury, South Dakota; Freeborn, Minnesota; Burt, Nebraska; Rice, Kansas; Audubon, Iowa; Cedar, Iowa; Warren, Illinois; Crawford, Illinois; Tippecanoe, Indiana; Fairfield, Ohio.Photos of the 22 Crop Watch fields can be tracked on Twitter by following @kannbwx.The opinions expressed here are those of the author, a market analyst for Reuters. "}