{"text": "LONDON Global investors have flipped from buy everything to peak everything in a matter of weeks - but these manic mood swings may even out soon.Stock markets appear to have run into the sand after several weeks of torrential inflows. By Bank of Americas reckoning the influx into world equity funds over the past five months exceeded that of the past 12 years combined.Fears of too much, too soon prompted many investment firms - including Deutsche Bank, Morgan Stanley and JPMorgan - to warn in recent weeks of a possible 5-10% correction ahead.This weeks tech-led shakeout - the second such wobble in less than 3 months - reinforced a whole host of those anxieties - everything from peak business sentiment, earnings and output growth to peak central bank largesse, excess liquidity and investment flows.The unfolding surge in economic activity as economies reopen may endure for another year or more. But annual or annualised rates of change may be cresting while related commodity price rebounds, supply bottlenecks and annual base effects keep hands wringing that peak inflation is yet to come - whether tolerated by central banks or not.Unlike Februarys sharp intake of breath, this weeks equity market gasp had little to do with rising interest rates or long-term borrowing costs per se. Implied yields on one of the widest measures of public and private sector bonds worldwide - the Bloomberg Barclays Multiverse - has barely budged for 2 months.And yet Morgan Stanley - a long-standing and accurate predictor a V-shaped equity market bounce since the pandemic shock last March - now posits that were already in a mid-cycle transition where flattish returns for 2021 as a whole are to be expected, with a 10-20% correction along the way.Citing corporate margin pressures from the sort of commodity and wage input price pressures nagging stock traders all month, it reckons nows the time to get more defensive. Its often better to travel than arrive from an investment perspective.History supports that. Deutsche last month flagged that Wall Streets S&P500 benchmark has dropped by a median 8.3% following 37 peaks in the U.S. Institute of Supply Managements (ISM) business sentiment index since World War Two.The retreat in ISM manufacturing and service sector indices for April - from 37-year and record highs respectively in March - most likely unnerved investors that the top of that cycle may now be in.And perhaps unsurprisingly, hedge funds - according to Bank of America - leaned heavily into the most recent record highs with registered net sales at a record over a 12-year dataset.Beyond the States, JPMorgans April global business survey indices hit a 14-year high. It said that was consistent with boomy 4% annualised world output growth - an expansion that it still forecasts will hit 6% for the second quarter as a whole, with input and output prices growth at its fastest in 12 years.CHEAPENINGSo, is that it? Has the great stock market discounting mechanism - as Morgan Stanley describes it - already discounted the entire post-pandemic recovery?Prior to this week MSCIs all-country stock index had risen almost 90% from the March nadir last year - some 22% above pre-pandemic highs.But not everyones convinced of peak markets just yet.David Lefkowitz at UBS Global Wealth Management points out that angst about historically expensive stock valuations may be overstated as earnings forecasts have clearly been underclubbed and even UBS own call of 31% profit growth for S&P500 firms for 2021 may now be too conservative.Lefkowitz, UBS equities chief for the Americas, said first quarter profit growth is running about 24% ahead of consensus forecasts and estimates for the next 12 months have been revised up by 16% since the start of the year - more than the 13% rise in stock prices to new records last week.Remarkably, that means 12-month forward Price/Earnings ratios have fallen this year both for the S&P500 and tech-heavy Nasdaq - and indeed for European benchmarks - despite the appearance of runaway markets and an investor scramble.Strong revenue growth is overwhelming the cost trends, Lefkowitz said in a blog, adding he retained a year-end 4,400 forecast for the S&P500 - now 7% higher than current levels.And then theres the return of stock buybacks. Precautionary cash held by many firms during the pandemic is being freed up again, with buybacks tending to come in advance of a rebound in dividend payouts and year-to-date U.S. buybacks of some $300 billion already more than twice a year ago.Neuberger Bermans multi-asset chief investment officer Erik Knutzen feels the pause will be temporary. There will be higher market peaks to climb.The author is editor-at-large for finance and markets at Reuters News. Any views expressed here are his own. "}