{"text": "LONDON Financial markets may be in the process of repricing the worlds most-traded exchange rate, with derivative contracts suggesting the euro could surge by as much as 6% against the dollar to $1.20 by year-end.After years in the doldrums, the single currency has already enjoyed a 6% rally since mid-March. Sweeping U.S. Federal Reserve policy easing has pummelled the dollar but, more importantly, the euro zone has finally opened the spending taps and taken a big step towards integration.On June 18-19, the European Union will debate a gamechanging 750-billion-euro recovery fund which calls for joint debt issuance and cash grants to poorer, coronavirus-stricken countries.Hurdles still remain, but many reckon the tide has turned in favour of the euro which had languished for over a year in a five-cent trading range versus the dollar.Some sort of symbolic step to (euro zone) fiscal union... is enough to reduce the risk premium that was affecting the euro, said Claire Dissaux, head of strategy at Millennium Global, a fund which helps clients manage FX exposure.Since May 18 when the recovery fund was first mooted, there has been a noticeable increase in demand for 6-12 month euro-dollar options with strike prices as high as $1.20, Refinitiv data shows. The strike price is the level at which the option holder can buy the asset when the contract expires.And more recently, demand has also picked up for one- to three-month expiry options at $1.1500-$1.1700 strikes, traders told Reuters.In the past three weeks, trading in euro calls has been as much as 50% higher than put volumes. Thats essentially a bullish sign -- call options allow holders to buy at a pre-arranged price, while puts confer the right to sell.Graphic: EUR risk reversals -https://fingfx.thomsonreuters.com/gfx/mkt/dgkplwybnvb/EUR%20risk%20reversals.JPGVALUATIONThere are plenty of downside risks for the long euro trade, above all if the bloc fails to quickly approve the recovery fund. The other risk is a dollar revival, caused by U.S. economic outperformance or another bout of risk aversion.Bar those, the euro is backed by valuations and positioning.A trade-weighted currency index tracked by the European Central Bank has the euro broadly at fair value, while the dollar is about 13% overvalued on a similar metric.Millenniums Dissaux pegs euro/dollar fair value at $1.26 on a purchasing power parity basis, levels last seen in 2014.Moreover, while hedge funds short euro bets melted away after the recovery fund proposal, real-money longer-term investors are still underweight, according to flows data from JPMorgan, the worlds biggest currency trader.The corporate sector, a net seller of euros for at least two years, has finally stopped selling the currency, JPM added.At UBS, another major currency market player, trading platforms show macro funds still largely overweight the dollar, said Adrian Boehler, global head of FX distribution at UBS.What we can say with confidence at this stage is that if this downward dollar trend becomes more entrenched, then current positioning is certainly no impediment to those moves accelerating, Boehler added.Graphic: EUR positions -https://fingfx.thomsonreuters.com/gfx/mkt/rlgvdkzjgpo/EUR%20positions.JPGGraphic: Euro option expiries -https://fingfx.thomsonreuters.com/gfx/mkt/qzjpqjznbvx/Euro%20option%20expiries.JPG"}