{"text": "WASHINGTON Top Democrats in the U.S. Congress on Thursday urged renewed negotiations over a multitrillion-dollar coronavirus aid proposal, but the top Republican immediately rejected their approach as too expensive, continuing a months-long impasse.House of Representatives Speaker Nancy Pelosi and Senate Democratic leader Chuck Schumer ticked off a litany of grim data about the spread of the coronavirus in the United States, with eight straight days of over 100,000 new coronavirus cases being reported each day.Its like the house is burning down and they just refuse to throw water on it, Pelosi said of Republicans.She and Schumer told a news conference that President-elect Joe Bidens victory strengthened the Democratic position, which is to spend at least $2.2 trillion on another round of coronavirus aid, on top of the $3 trillion Congress has approved since the pandemic began. Republican President Donald Trump has not conceded to Biden.Were willing to sit down and talk; they havent wanted to talk, Schumer said, referring to the post-election session of Congress that lasts until the end of the year.Senate Majority Leader Mitch McConnell, speaking to reporters in a hallway a few minutes later, said he preferred previous Republican proposals in the range of $500 billion, which he said would be aimed at the residual problems.I gather she (Pelosi) and the Democratic leader in the Senate still are looking at something dramatically larger. Thats not a place I think were willing to go, McConnell said.But I do think there needs to another package, the Republican said. Hopefully we can get past the impasse.A senior official in Trumps administration said it was leaving any negotiations about a coronavirus relief package to McConnell and Pelosi for the time being. But there was no sign such talks were imminent. Treasury Secretary Steven Mnuchin negotiated unsuccessfully with Pelosi for several weeks earlier in the fall.Pelosi and Schumer spoke with Biden on Thursday by phone and the three discussed the urgent need for the Congress to come together in the lame duck session on a bipartisan basis to pass more coronavirus relief, a statement from Bidens transition team said.The bill should include resources to fight the pandemic, relief for working families and small businesses, support for state and local governments, expanded unemployment insurance, and affordable healthcare for millions of families, the statement said.The Democratic-majority House in May approved an additional $3.4 trillion in coronavirus aid, but it went nowhere in McConnells Senate, where Schumers Democrats blocked less expensive Republican proposals from floor action.The longest-serving Republican in Congress, 87-year-old Representative Don Young, announced on Thursday that he had been infected with coronavirus, the latest of over 20 members of Congress to have been infected."}