{"text": "* Congo selects Kasulo as first site* Congos artisanal miners second largest source of cobalt* Traders had expected start of buying by nowLONDON, July 12 The Democratic Republic of Congo is expected to start buying cobalt from artisanal miners within eight weeks as it aims to become the only legal buyer from miners in the informal sector.The government is looking to capitalise on soaring demand for rechargeable lithium-ion batteries for electric vehicles and to curb illegal exports which strip the state of needed tax revenue. It is also aiming to end unsafe working practices and child labour.Artisanal miners extract cobalt by hand in precarious conditions, often working on illegal or only semi-regulated sites. Most of this material is bought by Chinese traders and sold on to refiners in China.The state buyer, Entreprise Generale du Cobalt (EGC), launched in March and announced a responsible sourcing standard.Under the new regulations, tunneling will be banned on EGC-approved sites, and pits are not to exceed 10 metres in depth. Miners are required to wear personal protective equipment and carry a site registration identity card.Supporting the EGC is non-governmental organisation Pact, with a brief to ensure safety, human rights and traceability of the cobalt produced by miners at artisanal sites.The EGC will be buying artisanal cobalt in four to eight weeks based on current knowledge and situation, Mickal Daudin, a deputy director at Pact, told Reuters.The selected site is Kasulo, he said.EGC confirmed it was aiming to buy artisanal cobalt from the Kasulo concession, which is currently operated by Congo Dongfang Mining (CDM), a unit of Chinas Zhejiang Huayou Cobalt .Congos artisanal miners are the second largest source of cobalt worldwide after the countrys industrial mines owned by companies such as Glencore and China Molybdenum .DRC produced around 100,000 tonnes of cobalt last year or about 71% of the global total, according to Darton Commodities review of the market.Artisanal and small-scale mining (ASM) volumes are believed to have fallen to around 7,000 tonnes in 2020, the review said.The cobalt market is following closely the progress of the EGC project as it would allow consumers to use artisanal cobalt, radically changing the landscape of the global market.Traders had expected EGC to begin buying artisanal cobalt months ago.Were already midway through the year and they still havent bought any, a cobalt trader said. The Chinese are still the only buyers of artisanal cobalt.CRU analyst Harry Fisher said ASM production is hard to predict, but estimates it could be between 10,000 and 12,000 tonnes this year.Commodities trader Trafigura last November agreed a five-year cobalt supply deal with EGC under which it will finance the creation of controlled artisanal mining zones, buying centres and logistics to trace supply. (Reporting by Pratima Desai; editing by Jason Neely)"}