{"text": "Mining companies and copper and cobalt buyers have been invited to a meeting in Kinshasa next week to discuss if there is a way to maintain waivers to an export ban that are meant to expire in September, the mining minister said on Thursday.Congo, Africas biggest copper producer, banned exports of copper and cobalt concentrates in 2013 to encourage miners to process and refine the ore within its borders.But the country does not have enough smelting capacity and has repeatedly issued waivers.A full-scale ban would lead to a drastic fall in Congos copper exports.It would also deliver a heavy blow to neighbouring Zambia, which processes Congolese copper and cobalt.There have been exemptions for certain reasons. Each time, we analyse the file with all the technical data. The applications are submitted with the justifications, mines minister Willy Kitobo told Reuters.These mining companies and the processors interested in purchasing these concentrates have been invited to Kinshasa on (August) 20th to see what can be done.In January, Chinas state-owned mining company CNMC launched Congos first large-scale smelter, the Lualaba Copper Smelter (LCS).The government joint venture is capable of processing 400,000 tonnes of copper concentrate and producing around 120,000 tonnes of copper blister per year.But even at full capacity, the LCS cannot process all Congos copper production. Congo produced 765,000 tonnes of copper concentrate in the first half of the year alone, the central bank said, up 13.4% year-on-year.Our initial take is that theyll fill Lualabas capacity and then issue waivers for the rest, said Indigo Ellis, head of Africa research at Verisk Maplecroft, a risk analytics company.But its not a sustainable option, the harm that itll cause for the industry and investment environment is negative.Congo Chamber of Mines president Louis Watum said he understands the government wants to boost beneficiation in-country, because of the revenue it generates, but said most mining companies cannot smelt in Congo because of inadequate electricity supply."}