{"text": "WASHINGTON The U.S. Environmental Protection Agency should strengthen its use of the federal Civil Rights Act to better to protect poor and minority communities from pollution and climate change, a top candidate to head the agency under the incoming administration of President-elect Joe Biden said.Heather McTeer Toney, a former regional EPA administrator under the Obama administration and senior director at the Moms Clean Air Force, is among a short-list of candidates being vetted for the post, according to sources close to Biden.McTeer Toney told Reuters in an interview late Wednesday that the agency should explore how to better use Title IV of the 1964 Civil Rights Act, which prohibits discrimination based on race, color or national origin in programs or activities which receive federal financial assistance.Its a problem that EPA has not been able to figure out, she said. We havent spent the time to dig into how to use it effectively, to make sure regulations are done in a way that is non-discriminatory.Minority and poor communities are disproportionately affected by climate change and pollution according to researchers, a fact that has come into focus since a series of killings of Black people by police in recent years sparked a movement against institutional racism throughout society.Biden and Vice President-elect Kamala Harris have put environmental justice issues at the center of their $2 trillion climate change plan, which calls for 40% of all clean energy investments to be in poor communities and for the EPA to overhaul its external civil rights compliance office.A 2016 report by the U.S. Commission on Civil Rights found that EPAs Office of Civil Rights had avoided pushing civil rights complaints alleging discrimination based on disparate impact for fear that the agency would lose such a case if challenged in court.McTeer Toney said the EPA can also work to collect more data to ensure the agency has a better understanding of the depth of environmental inequality and see how public health issues like the coronavirus are made worse by things like air pollution or not having clean water in communities.During President Donald Trumps administration, the agency has aggressively rolled back green protections to unfetter business, and downplayed concerns about climate change.McTeer Toney declined to comment on whether she was being vetted for EPA chief.It wont matter where I am, she said. I will be actively working to make sure the Biden-Harris climate plan is fulfilled, she said."}