{"text": "MADISON, Wisconsin Sixteen gallons of hand sanitizer sat in the foyer of the Alpha Epsilon Phi sorority house at the University of Wisconsin as house mother Karen Mullis reconfigured tables in the dining room to maintain social distancing.Upstairs, the sorority has moved beds 6 feet (2 metres) apart and rooms in the basement will be used to quarantine any house members who test positive for the novel coronavirus, which has killed over 163,000 people in the United States, the most in the world.Masks are mandatory and house guests prohibited.We have all of these rules but it is dependent on these kids taking it seriously, Mullis said. If the girls are not responsible, then this is not going to work.Only 17 of 38 members plan to live at the sorority house near the Madison, Wisconsin campus this fall. The rest will stay home or live in an apartment, Mullis said.The chapter is one of hundreds of fraternities and sororities grappling with how to persuade hundreds of thousands of young adults to follow safety protocols when in-person learning resumes at many universities in coming weeks.Public health officials say the danger for students will come when an asymptomatic person transmits the virus to dozens of housemates, who then could carry it into classrooms. The virus could then spread to faculty, staff and the wider community.The greatest governing engine on a college campus is not the administration, the police. Its student culture, its peer pressure, said Judson Horras, president of the American Interfraternity Conference, which represents 59 fraternities.For many of the more than 700,000 fraternity and sorority members in the United States, college social life revolves around their chapter houses, where they live, eat and study in close quarters with fellow members.The houses, emblazoned with each organizations Greek letters, are typically clustered in areas known as Greek row, which can be packed with students during raucous parties, after campus sporting events and in the week set aside for the recruitment of new chapter members.Some university officials have banned fraternity and sorority chapters from throwing parties this year; others have ordered the chapters to take precautions such as mandating masks; and officials are broadly hopeful that with a number of students taking classes online, and staying off campus, the atmosphere will naturally be more subdued.But the risks have already become apparent. At the University of Washington, dozens of students staying in fraternity and sorority houses over the summer break tested positive for COVID-19. Then, last week, a video went viral showing young people neither social distancing nor wearing masks at a crowded sorority party at the University of North Carolina.For years, college fraternities have been under scrutiny and criticism for alcohol-fueled parties, sexual assaults and dangerous hazing of potential new members.Three years after a student died following a hazing at Penn State, the schools interfraternity council president Nate Brodsky says the pandemic is an opportunity to change the perspective of the organizations.He said Penn State chapters will be closely monitored.We were hoping the virus didnt have to compromise our college experience, but it has, Brodsky said. The one thing that can stop people from partying is realizing they will be putting other peoples lives at risk.WEAR A MASK, EAT IN YOUR ROOMMany fraternity and sorority members will not be allowed to bring guests into their houses and will be required to social distance, wear a mask in common areas and take their own temperature each day, fraternity and sorority officials said.Chapters will also require members to eat meals in their own rooms or in small groups, set strict cleaning protocols and designate quarantine areas.Erik Johnson, interfraternity council president at the University of Washington, knows how quickly the virus can spread after a 155-case outbreak this summer on the campus Greek row.We really need to look beyond the Greek community here and look beyond our members ..., Johnson said.My concern truly is that a member of our community takes this home, infects their parents ... grandparents and then someone dies, he added.At Wake Forest University in North Carolina, Zach Skubic joined Sigma Pi fraternity last year as a freshman to meet new people and have some fun. These days, he is willing to squash any plans of throwing or attending a party, he said.Going to a party where people will not be able to maintain a six-foot distance is asking for trouble, said the 19-year-old. Its not safe."}