{"text": "LONDON Companies around the world will take on as much as $1 trillion of new debt in 2020, as they try to shore up their finances against the coronavirus, a new study of 900 top firms has estimated.The unprecedented increase will see total global corporate debt jump by 12% to around $9.3 trillion, adding to years of accumulation that has left the worlds most indebted firms owing as much as many medium-sized countries.Last year also saw a sharp 8% rise, driven by mergers and acquisitions, and by firms borrowing to fund share buybacks and dividends. But this years jump will be for an entirely different reason - preservation as the virus saps profits.COVID has changed everything, said Seth Meyer, a portfolio manager at Janus Henderson, the firm that compiled the analysis for a new corporate debt index. Now it is about conserving capital and building a fortified balance sheet.Companies tapped bond markets for $384 billion between January and May, and Meyer estimates that recent weeks have set a new record for debt issuance from riskier high yield firms with lower credit ratings.Lending markets had slammed shut for all but the most trusted firms in March, but have been opened up wide again by emergency corporate debt buying programmes from central banks like the U.S. Federal Reserve, the European Central Bank and Bank of Japan.Companies included in the new debt index already owe almost 40% more than they did in 2014, and growth in debt has comfortably outstripped growth in profits.Pre-tax profits for the same group of 900 companies have risen a collective 9.1% to $2.3 trillion. Gearing, a measure of debt relative to shareholder finance, hit a record 59% in 2019, while the proportion of profit devoted to servicing interest payments also rose to a new high.U.S. companies owe almost half of the worlds corporate debt at $3.9 trillion and have seen the fastest increase in the last five years of any major economy with the exception of Switzerland where there has been a wave of major M&A deals.Germany comes in at number two at $762 billion. It also has three of the worlds most indebted firms including the most indebted, Volkswagen, which with $192 billion of debt is not far behind countries like South Africa or Hungary, though it is inflated by its car finance arm.In contrast, a quarter of the companies in the new index have no debt at all, and some have vast cash reserves. The biggest of these stands at $104 billion and belongs to Googles owner Alphabet.Meyer said credit markets still had some way to go to get back to pre-COVID conditions and the ongoing threat of the virus, especially the recent surge in U.S. cases, remained investors central concern.It is all a recipe for a more challenged outlook than we thought two months ago, he said.(Graphic: Coronavirus bringing record deluge of corporate debt, )https://fingfx.thomsonreuters.com/gfx/mkt/xklvyzrqzpg/Pasted%20image%201594397162473.png(Graphic: Corporate debt, )https://fingfx.thomsonreuters.com/gfx/mkt/azgpordzgvd/Pasted%20image%201594590659461.png"}