{"text": "WASHINGTON The risk of COVID-19 hung over Mondays opening of Amy Coney Barretts U.S. Supreme Court confirmation hearings, with the Senate hearing room including the judges children and at least one lawmaker who tested positive for the disease.Republican President Donald Trump formally nominated Barrett at a packed Sept. 26 White House ceremony. Days later, he and a spate of advisers tested positive for the respiratory disease that has killed more than 214,000 people in the United States.Senator Kamala Harris, a Judiciary committee member and the vice presidential nominee on the Democratic ticket challenging Trump in the Nov. 3 election, said the hearing should have been postponed due to the recent spate of infections.Republican Senator Mike Lee, one of two Senate Judiciary Committee members to test positive, attended the hearing in person on Monday.I feel great! Lee, wearing a blue surgical mask, told reporters as he entered the hearing room on Monday, nine days after disclosing his positive test, which normally would prompt a 10- to 14-day quarantine.Lee took his mask off to deliver his opening statement, to the audience that included some of the oldest members of the Senate - as well as Barretts husband, children and siblings.Democrats and many public health experts have assailed Trump for his handling of a pandemic that has killed more people in the United States than any other country.Harris, who spoke via video linkup, said the panel had been reckless as Republicans strove to confirm Barrett before the election.This committee has ignored common sense requests to keep people safe  including not requiring testing for all members  despite a coronavirus outbreak among senators of this very committee, she said.Trumps nomination of Barrett to a vacancy created by the death last month of liberal icon Ruth Bader Ginsburg just weeks before the election enraged Democrats, still furious about Republicans refusal to consider a nominee from Democratic President Barack Obama some 10 months before the 2016 election.Senator Lindsey Graham, the committees Republican chairman and a close Trump ally, insisted that enough had been done.Weve set up a room in a fashion where we can safely do our business, he noted.Grahams Senate re-election debate was canceled on Friday after he refused to be tested for coronavirus. Opinion polls show that Graham is in a tight race to win a fourth term as a South Carolina senator.Graham said he had been tested a week before the debate, reiterating after Harris remarks that every safety precaution had been taken. Im not going to be told to be tested by political opponents. Im going to be tested as an individual when the CDC requires it, he said.The other Republican committee member to test positive after the Sept. 26 event, Thom Tillis, was not in the hearing room. He had announced that he would be among senators taking part remotely on Monday, but was expected to appear in person later in the week.Barrett was seen removing her mask at least once while Lee was speaking, as she took a sip of water.The vast hearing room in the Hart Senate Office Building is the largest in the sprawling Capitol complex, where 20,000 people work and thousands more visit on a normal, non-pandemic weekday.Barretts children were also at the Sept. 26 event.The Indiana private school they attend reported less than two weeks after the Rose Garden ceremony that at least two students and a teacher had tested positive.The Washington Post reported Barrett tested positive earlier this year but has since recovered, citing three officials familiar with her diagnosis. The White House has declined comment."}