{"text": "ABIDJAN/DAKAR Olivier Gore-Bi took out loans to ready his 12-acre cashew farm in Ivory Coast for harvest. He is now leaving some of his crop to rot after the COVID-19 pandemic accelerated a fall in prices in the worlds top cashew-farming region to unprofitable lows.In the first few months of a normal year, over 55% of all cashews would be harvested by farmers in West Africa, dried and shipped in raw form to Asian processors before being sold to consumers worldwide.But this year, the pandemic was hitting the sector just as West Africas cashew marketing season was meant to kick off.Prices for raw cashews, which were already under pressure from excess supply in the last few years, tumbled after processing slowed in Asia and border closures in March stopped major buyers flying to West Africa from Vietnam and India.With the majority of consumers outside the continent, the longer-term outlook for West Africas cashew sector will hinge on how key markets recover from the pandemic.Singapore-based Olam International, the worlds leading raw cashew nut trader, said epidemic-related global supply chain delays and reduced consumer demand had dampened the market.Olam Cashew President Amit Khirbat told Reuters that global prices are expected to stabilise at current levels for the foreseeable future as lockdown restrictions are lifted and demand gradually returns.But for farmers like Gore-Bi, This year is a catastrophe, he said by phone from the central Ivorian region of Marahoue where he cultivates the nuts that are eaten as snacks or used in curry dishes, and desserts.Ivory Coast saw international contracts fall to $900, some 35% lower than the start of the season, its cashew board told Reuters, citing a lack of buyers and slowdowns in Asia.Nobody is buying so its not worth tiring oneself with the harvest, Gore-Bi said. Four other Ivorian farmers said they felt the same.Gore-Bi stopped harvesting in late April after his cashews fetched only around 200 CFA francs ($0.34) per kg, less than half of what he was meant to receive as a state-guaranteed minimum.A dozen cashew farmers, local buyers or government and trade officials in Ivory Coast, Ghana, Guinea-Bissau, Senegal and Gambia told Reuters the COVID-19 crisis had disrupted the market, but the fallout varied across the region.Continental industry body the African Cashew Alliance (ACA) has warned that Africas raw cashew exports this year could fall up to 30% below 1.2 million tonnes exported last year, while output may be up to 10% below around 2 million tonnes produced in 2019 as disillusioned farmers leave some crops unharvested.Ivorian cashew board director Adama Coulibaly agreed output would be hit, but said it was too early to predict by how much. The countrys 2020 forecast has already fallen 10% to around 720,000 tonnes due to a lack of rain.Measures to contain the virus also hampered flows of harvested cashews in the region.A dusk-to-dawn curfew in Senegal shortened the time available to dry nuts. A new cashew cargo facility at Gambias airport idled due to the halt in air traffic and a regional lockdown in Ghana made it harder to deploy workers, according to officials and traders.Some West African rural communities, whose livelihoods depend on what they earn from cashews during the lean season, are feeling the pain.In the tiny coastal country of Guinea-Bissau, where cashews account for around 90% of export revenue and are the only source of income for 650,000 households, the government has given emergency funds to banks to support the sector.Some Bissau farmers are distilling extra rum from unsold nuts, according to the farmers association.But the situation is less gloomy elsewhere. Buying has picked up slightly in Ghana and production is expected to reach the forecast 140,000 tonnes, agricultural ministry official Anim Jerry Jacob told Reuters.In April, prices for farmers had fallen over 56% to 3.5 Ghanaian cedi ($0.6140) per kg, he said.Wayne Tilton, Africa director for Red River Foods, one of the largest cashew importers for the United States, said the crisiss impact on Ghanas cashew sector had been less bad than he had feared. Ghanaian farmers are receiving higher prices at the tail end of this season than at the same time last year, he said.The crisis has warped dynamics on the consumer end in unprecedented ways. The mass cancellation of weddings in India meant demand plummeted for the cashew-based sweets traditionally offered as gifts, said Dhruv Dalmia, whose familys business exports nuts from West Africa.Conversely, U.S. cashew imports for consumption jumped 18% year-on-year in January-April, trade data shows. Panic-buying is credited for the welcome boost, but the trend is expected to reverse in the second half of 2020 given the surge in unemployment to 30 million people.Are they going to be running out and buying cashews? Probably not, Tilton said.Red River Foods forward U.S. sales for the third quarter are lower than in the same period of 2019, he said, without giving exact figures."}