{"text": "CHICAGO Chicago brokers and traders worry the novel coronavirus will kill more of the citys once famous shout-and-gesture trading pits.McGathey Commodities President Virginia McGathey, who trades in grain options pits, said her income dropped about 90% since the shutdown. Her customers are executing orders for themselves, instead of coming to her, because she can no longer offer an advantage of being on the floor.The powers that be, in my opinion, were moving to try to get the floor closed, McGathey said.A CME spokeswoman declined to comment on whether the company intends to shut any trading pits permanently.Open-outcry trading was a raucous tradition in which traders jostled and screamed to execute orders in pits packed with people. CME closed most futures pits in 2015 due to the rise of computerized trading, although more than 20 products like Eurodollar and grain options were still traded in pits.The Eurodollar options pit will reopen on Aug. 10 with a reconfiguration to allow for social distancing, while all others will stay closed until Chicago and Illinois move into the final stages of their economic reopening plans, CME said. That will not occur until there is a COVID-19 vaccine, a treatment that ensures adequate healthcare capacity or a sustained period without new cases of the virus, according to the state.CME must be cautious about reopening pits because social distancing is impossible, Chief Executive Terry Duffy told investors last month.The London Metal Exchanges open outcry trading floor may also remain closed for many more months because it cannot reopen under social distancing restrictions.CME has a rule that it will keep pits alive as long as they account for 30% of total trading volume. Eurodollar options are the only product that meets the threshold, Duffy said.Floor brokers said health risks appear lower in the grain pits because they are less crowded than Eurodollars.CMEs shutdown has pushed customers away from complex options trades the pits specialize in, the brokers said. The company said all strategies from the floor are being used electronically.Agricultural brokerage Futures International will likely scale back its presence on the floor when and if CME reopens pits because floor employees have transitioned well to working in an office, President Gary Sandlund said.The longer that we go without a trading floor, people adapt and get comfortable with a new way of getting things done, Sandlund said.Sadly its likely that its the end of a 180-year era."}