{"text": "The number of COVID-19 cases in eastern Europe surpassed 10 million on Friday, according to Reuters tally, as countries across the region aim to increase vaccine procurements from multiple suppliers to accelerate inoculation programmes.Countries in eastern Europe have reported more than 10.02 million cases and 214,691 deaths since the pandemic started. However, daily average new cases in the region have declined by about 31% in past 30 days as compared with the previous 30 days, according to a Reuters analysis. (Graphic: tmsnrt.rs/34pvUyi)Russia has the most cases in the region and became the first European country to surpass 4 million on Monday. The country has also reported the most deaths in Eastern Europe at about 79,194, according to a Reuters tally.Graphic: Eastern Europe COVID-19 cases and deaths per capita -https://graphics.reuters.com/HEALTH-CORONAVIRUS/CASES-PERCAPITA/dgkvlzxmjvb/chart.pngIn Eastern Europe, seven nations including Russia, Poland, Czech Republic, Romania, Hungary, Slovakia and Bulgaria have administered about 4.5 million COVID-19 vaccine doses, according to the data from their respective health ministries.Russia has administered at least a million doses of COVID-19 vaccines so far. Assuming every person needs two doses, thats enough to have vaccinated about 0.3% of the countrys population, according to a Reuters analysis.In a pandemic that has killed more than 750,000 people in Europe alone, the delay in shipments announced by vaccine makers AstraZeneca PLC and Pfizer Inc has put in jeopardy the European Unions summer target of vaccinating 70% of adults.To cope with the shortage in vaccine supplies, many countries in eastern Europe have started looking for other vaccine providers from countries like China and Russia.Hungary will start vaccinating people suffering no chronic diseases with Russias Sputnik V vaccine soon, becoming the first EU member country to use it, while Czech Prime Minister Andrej Babis said on Wednesday that the country would wait for European Medicines Agencys (EMA) approval of the Russian vaccine.Ukraine, which has registered more than 1.2 million coronavirus cases and 24,058 deaths, has already agreed to buy some vaccines from China and expects to get at least 8 million doses under the global COVAX programme for poorer countries.The country has also secured 12 million COVID vaccines from the Serum Institute of India developed by AstraZeneca and Novavax.Graphic: Vaccination in Eastern Europe -https://graphics.reuters.com/HEALTH-CORONAVIRUS/nmopazjndva/chart.png"}