{"text": "Most CEOs on a call to discuss a new push against U.S. state voting restrictions said in a poll they will reassess donating to candidates who fail to support voting rights, while many will consider holding back investments in states that restrict voting access, according to people familiar with the matter.Some business executives are putting together a new statement calling for the protection of U.S. voting rights, the latest corporate backlash against moves by Republican politicians to change election rules in Georgia and other states, the sources said.About 100 chief executive officers, investors, lawyers and corporate directors participated in a private Zoom call on Saturday organized by Yale professor Jeffrey Sonnenfeld to discuss a new response to Georgia's election law and voting restrictions contemplated by other states such as Texas and Arizona, according to the sources.All CEOs who participated in a poll during the call agreed they will re-evaluate political donations to candidates based on their track records on voting rights, while 48% said they might reconsider or reduce investments in states that restrict access to voting. Some one-quarter of CEOs refrained from voting on several questions in the poll.Georgias decision last month to strengthen identification requirements for absentee ballots and make it a misdemeanor to offer food and water to voters waiting in line, among other changes, prompted many U.S. companies, including Delta Air Lines Inc (DAL.N) and Coca-Cola Co (KO.N), to issue statements criticizing the law.Major League Baseball pulled this years All-Star Game from Atlanta to protest the restrictions.Republican officials, including U.S. Senate Minority Leader Mitch McConnell and Texas Governor Greg Abbott, criticized the companies for their response, accusing them of wading too much into politics.Georgia Republican Governor Brian Kemp says the law is another step to making our elections fair and secure.But the measure has been slammed by Democratic President Joe Biden and faces legal challenges from civil rights groups that contend it is aimed at suppressing voting among Blacks and other racial minorities in a state that went for Biden in last November's election and elected two Democratic U.S. senators in January.Former President Donald Trump and his Republican allies have made baseless allegations that he lost the November election because of widespread voter fraud, claims that multiple courts across the country rejected.On the invitation-only call, former American Express Co (AXP.N) Chief Executive Kenneth Chenault and Merck & Co (MRK.N) CEO Kenneth Frazier said they were looking to gather support to back a new statement pushing back against the wave of new restrictive voting-rights bills, one of the sources said.Some participants in the call signed up to the new statement during the call.Participants noted that the proposed laws disproportionately targeted low-income areas, and that any civil unrest or attack on U.S. democracy could derail potential economic growth.We as business leaders should be much stronger on not allowing people to undermine the 2020 election. The integrity of the system is integral, Reid Hoffman, co-founder of professional networking site LinkedIn, said on the call."}