{"text": " (In paragraph three, corrects quote from Ryan Brecht)\n    * Loonie touches a two-week high at 1.2512\n    * Canada adds 259,000 jobs in February\n    * Price of U.S. oil falls 0.5%\n    * Canada's 10-year yield climbs to a 14-month high at 1.552%\n\n    By Fergal Smith\n    TORONTO, March 12 The Canadian dollar\nstrengthened to a two-week high against its broadly stronger\nU.S. counterpart on Friday, after domestic jobs data supported\nthe view that the Bank of Canada would reduce its bond purchases\nas soon as next month.\n    Canada added 259,000 jobs in February, beating estimates of\na 75,000 increase, driven by the reopening of businesses as\nCOVID-19 lockdowns put in place in December and January were\neased, data from Statistics Canada data showed.             \n    \"There remains a long way to go before the employment\nbackdrop returns to its pre-pandemic state,\" said Ryan Brecht, a\nsenior economist at Action Economics. \"That being said, another\nfirm jobs report for March would likely boost market\nexpectations of a taper as soon as the April announcement.\"\n    The central bank is buying C$4 billion of bonds per week to\nsupport the economy. On Wednesday, it signaled it would reduce\nthe pace of purchases as it continues to gain confidence in the\nstrength of the recovery.             \n    The Canadian dollar        was trading 0.1% higher at 1.2513\nto the greenback, or 79.92 U.S. cents, having touched its\nstrongest since Feb. 25 at 1.2512. For the week, the loonie was\non track to gain 1.1%.\n    The safe-haven U.S. dollar        rallied against a basket\nof major currencies as a fresh spike in U.S. Treasury yields\nsparked a risk-off move in global currency markets.             \n    The price of oil, one of Canada's major exports,\nconsolidated its recent gains. U.S. crude        prices were\ndown 0.5% at $65.70 a barrel.\n    Canadian government bond yields were higher across a steeper\ncurve. The 10-year             climbed 10.8 basis points to\n1.552%, its highest since January last year.\n\n (Reporting by Fergal Smith\nEditing by Nick Zieminski)\n  "}