{"text": " (Corrects currency conversion in the 2nd paragraph)\n    SHANGHAI, July 12 China's yuan rebounded from a\n2-1/2-month low against the dollar on Monday as the market\nawaited second-quarter growth data for more clues on policy\ndirection, after the central bank cut reserve requirements to\nprop up the economy.\n    The yuan had softened to its weakest level since late April\non Friday after the People's Bank of China (PBOC) cut the amount\nof cash that banks must hold as reserves, releasing around 1\ntrillion yuan ($154.5 bln) in long-term liquidity to underpin a\npost-COVID economic recovery that is starting to lose momentum.\n\n    While the move was flagged a few days earlier, the size of\nthe cut was larger than expected, raising some concerns ahead of\nthe release of June activity data and Q2 gross domestic product\n(GDP) figures on Thursday. However, most analysts did not think\nthe cut in itself signalled a shift to an easier policy stance. \n    \"Last week's cut in the RRR suggests the economy is slowing\nmore than desired and so there are downside risks to this week's\nreal sector data,\" Win Thin, global head of currency strategy at\nBrown Brothers Harriman, said in a note.\n    \"We also suspect the PBOC will tolerate a weaker yuan, which\nwould be a natural by-product of its easing stance.\"\n    Prior to the market opening, the PBOC set the midpoint rate\n at a more than two-week low of 6.4785 per dollar, 30\npips weaker than the previous fix of 6.4755.\n    Traders and analysts said Monday's midpoint fixing came in\nmuch weaker than their forecasts, and it was 46 pips weaker than\nReuters' estimate of 6.4739 per dollar.\n    However, the spot yuan didn't follow the weakening trend.\nThe onshore yuan opened at 6.4760 per dollar and was\nchanging hands at 6.4743 at midday, 48 pips stronger than the\nprevious late session close.\n    Ken Cheung, chief Asian FX strategist at Mizuho Bank, said\ninstead of gauging impact on the market from higher liquidity\nagainst the backdrop of the RRR cut, markets should pay more\nattention to this week's data as evidence for the health of the\nbroader economy.\n    \"If the upcoming China hard data for June and Q2 GDP\njustified PBOC's concern, a re-pricing of China growth slowing\ntowards its annual target at around 6% will likely push the RMB\nto above the 6.5 handle,\" Cheung said.\n    \"Such case could open the door for PBOC's further easing and\npose downside pressure on the RMB.\" \n    Though China's decision to pump more liquidity into the\nfinancial system has dragged bond yields lower, many traders\nsaid its interest rate advantage over most major economies\npersisted and should continue to attract foreign capital\ninflows, supporting the yuan.\n    The yield gap between China's 10-year government bonds\n and their U.S. counterpart stood at 163\nbasis points on Monday morning, the narrowest level since July\n1, according to Refinitiv data.\n    China's primary interbank money rates fell while treasury\nfutures rose on Monday morning, following the RRR cut. The\nbenchmark 10-year government bond futures for September delivery\n gained 0.27% by midday. \n    The global dollar index rose to 92.193 at midday from\nthe previous close of 92.147, while the offshore yuan\nwas trading at 6.478 per dollar. \n    \n    The yuan market at 0402 GMT: \n    \n    ONSHORE SPOT:\n Item               Current  Previous  Change\n PBOC midpoint      6.4785   6.4755    -0.05%\n                                       \n Spot yuan          6.4743   6.4791    0.07%\n                                       \n Divergence from    -0.06%             \n midpoint*                             \n Spot change YTD                       0.83%\n Spot change since 2005                27.84%\n revaluation                           \n \n    Key indexes:\n     \n Item            Current     Previous  Change\n                                       \n Thomson         98.16       98.06     0.1\n Reuters/HKEX                          \n CNH index                             \n Dollar index    92.193      92.147    0.1\n \n    \n    \n*Divergence of the dollar/yuan exchange rate. Negative number\nindicates that spot yuan is trading stronger than the midpoint.\nThe People's Bank of China (PBOC) allows the exchange rate to\nrise or fall 2% from official midpoint rate it sets each\nmorning.\n\n    OFFSHORE CNH MARKET   \n  \n Instrument            Current   Difference\n                                 from onshore\n Offshore spot yuan    6.478     -0.06%\n        *                        \n Offshore              6.6422    -2.46%\n non-deliverable                 \n forwards                        \n               **                \n \n*Premium for offshore spot over onshore\n**Figure reflects difference from PBOC's official midpoint,\nsince non-deliverable forwards are settled against the midpoint.\n. \n    \n    \n\n (Reporting by Winni Zhou and Andrew Galbraith; Editing by Kim\nCoghill)\n  "}