{"text": "(Corrects Fridays story to say Bunds headed for their best week since late February, not March in first paragraph)* Euro zone periphery govt bond yields tmsnrt.rs/2ii2BqrLONDON, June 12 Euro zone bond yields inched down on Friday, with safe-haven Bunds heading for their best week since late February and Italys risk premium set for its biggest weekly jump in nearly two months.Higher and lower-rated sovereign yields fell together for a second straight session after a sell-off in equities on Thursday that saw three major U.S. stock indexes fall more than 5% had pulled them lower.The weeks moves overturned patterns in May and earlier June, where Southern European borrowing costs fell while safe-haven German yields rose, on optimism from a potential EU recovery fund and additional European Central Bank stimulus.Safe-haven yields fell particularly sharply on Thursday in a blow to risk sentiment that was attributed to concerns around rising coronavirus cases, particularly in the United States, as well as a dovish U.S. Federal Reserve. Chunky bond sales earlier in the week had put pressure on Southern European debt.Germanys 10-year yield was set for its first weekly fall since early May and its biggest since late February, down 18 basis points this week.It was down 3 basis points on Friday to -0.45%, the lowest in two weeks.Meanwhile, the risk premium Italy pays for 10-year debt on top of Germanys was set for its biggest rise in eight weeks at 185 bps, up around 18 bps this week as Southern European bond markets sold off heavily, struggling to absorb chunky bond sales.The 10-year yield was last down 3 bps to 1.42%.But Rabobank strategists told clients that a potential second wave and the Feds bleak economic outlook were unlikely to be the only factors driving market turnaround.Wed argue that the market has been willing to look through such negative factors for some weeks. Instead yesterdays moves may have been as much about some investors deciding to take some money off the table simply due to the recent stellar performance of equities and this snowballing over the course of the day, they wrote.Banks in the euro zone will repay 214 billion euros ($241.65 billion) of ECB funding early, the ECB said on Friday, probably to roll the cash into a new facility at even more favourable terms.Fitch is due to review Spains A- credit rating later on Friday. While the rating holds a stable outlook, analysts note Fitch has been more hawkish than its peers. 10 of its 11 sovereign rating reviews in the euro area since April have resulted in either outlook or rating downgrades - such as Italy - according to Commerzbank. ($1 = 0.8856 euros) (Reporting by Elizabeth Howcroft and Yoruk Bahceli Editing by Larry King, Frances Kerry and Giles Elgood)"}