{"text": "African-American country singer Charley Pride, whose No. 1 country hits included All I Have to Offer You (Is Me) and Kiss an Angel Good Mornin, died on Saturday at age 86 of complications from COVID-19, according to his website.Pride, who died in Dallas, was not the first Black artist to make important contributions to country music, but he was a trailblazer who emerged during a time of division and rancor. Between 1967 and 1987, Pride delivered 52 Top 10 country hits, won Grammy awards and became RCA Records top-selling country artist, according to the website.Were not color blind yet, but weve advanced a few paces along the path and I like to think Ive contributed something to that process, Pride wrote in his memoir.The Mississippi native picked cotton, served in the U.S. Army and played baseball in the Negro league before moving to Nashville, becoming the first Black country star. He joined the Country Music Hall of Fame in 2000, Rolling Stone magazine said.Im so heartbroken that one of my dearest and oldest friends, Charley Pride, has passed away, country music star Dolly Parton said on Twitter. Its even worse to know that he passed away from COVID-19. What a horrible, horrible virus. Charley, we will always love you.Prides final performance came on Nov. 11, 2020, when he sang his hit Kiss An Angel Good Mornin during the Country Music Association Award show at Nashvilles Music City Center.Pride was born in Sledge, Mississippi, on March 18, 1934 to a sharecropper. After enlisting in the Army, he worked at a Missouri smelting plant. Pride then played for the Memphis Red Sox and Birmingham Black Barons in the Negro League before heading in 1963 to Nashville where he made demonstration recordings.Four years later, Prides recording of Just Between You and Me broke into countrys Top Ten. He went on to win the Country Music Associations Entertainer of the Year award in 1971, its top male vocalist prize in 1971 and 1972 and a Lifetime Achievement Award in 2020.Charley Pride will always be a legend in Country music. He will truly be missed but will always be remembered for his great music, wonderful personality and his big heart, country music star Reba McEntire said on Twitter."}