{"text": "The following is a roundup of some of the latest scientific studies on the novel coronavirus and efforts to find treatments and vaccines for COVID-19, the illness caused by the virus.COVID-19 antibodies last at least three monthsPeople infected with COVID-19 develop antibodies targeting the new coronavirus that last for at least three months, according to two reports published on Thursday in Science Immunology. The two studies, together involving nearly 750 patients, both point to immunoglobulin G (IgG) antibodies, which start showing up well after an infection begins, as the longest-lasting. Researchers found IgG antibodies with two targets - a spike protein on the virus that helps it infect cells, and a part of the spike called the receptor binding domain (RBD) - lasted more than 100 days. While the protective effect of COVID-19 antibodies is not completely clear, Jen Gommerman of the University of Toronto, coauthor of the study, said her team also found levels of so-called neutralizing antibodies, which inactivate the virus, \"appeared to be very stable.\" The other study, from Harvard Medical School, reported similar findings. This means that a properly designed vaccine \"should elicit a durable antibody response that has the potential to neutralize the virus,\" Gommerman said. Her group also found that antibodies in saliva correlated with antibodies in blood, but at this point the saliva tests are not sensitive enough to replace blood tests. (bit.ly/2GSo5Id; bit.ly/33NEOFE)COVID-19 symptoms linger for months for manyThree months after becoming ill, many COVID-19 patients still have symptoms, two studies confirm, and the more severe the initial infections, the higher the odds of persistent problems. In Spain, doctors checked back with 108 patients, including 44 who had been severely ill. At 12 weeks after diagnosis, 76% still reported after-effects, with 40% reporting three or more coronavirus-related health issues, doctors said in a paper posted on Thursday on medRxiv ahead of peer review. The most common complaints were shortness of breath, physical weakness, cough, chest pain, palpitations, and psychological and cognitive disorders. In a similar study of 233 U.S. COVID-19 patients - eight of whom had been severely ill - one in four still had symptoms 90 days after first feeling ill. Rates were higher for patients who had been sicker: 59.4% at 30 days and 40.6% at 90 days. \"But even for very mild and initially asymptomatic cases, 14.3% have complications persist for 30 days or longer,\" the authors reported on Sunday on medRxiv. In the U.S. study, the most common persistent symptoms were impaired smell and taste, difficulty concentrating, shortness of breath, memory loss, confusion, headache, heart palpitations, chest pain, pain with deep breaths, dizziness, and rapid heartbeat. (bit.ly/3iPD2rN; bit.ly/2SKk0IK)Remdesivir cut COVID-19 recovery time by 5 daysCoronavirus rarely travels from mother to newbornTransmission of the new coronavirus from mothers to newborns is rare, doctors from New York-Presbyterian/Columbia University Irving Medical Center reported on Monday in JAMA Pediatrics. They studied 101 babies born to 100 mothers with COVID-19, including 10 whose mothers had been severely ill. Almost all of the babies tested negative for the virus, while tests in two newborns had indeterminate results. If these two indeterminate results are considered positive, the overall incidence of transmission was 2.0%. Even with a 2% transmission rate, \"none of our babies exhibited clinical symptoms of COVID-19, either during their newborn nursery stay or during ... the first few weeks of life,\" coauthor Dr. Dani Dumitriu told Reuters Health by email. Roughly 90% of the newborns were breastfed at least partially. \"As the country heads into what looks like a second wave of the COVID-19 pandemic, it is important to know that separation of affected mothers from their newborns may not be warranted, and direct breastfeeding appears to be safe,\" study coauthor Dr. Melissa Stockwell said. (bit.ly/354AwJB)Open here in an external browser for a Reuters graphic on vaccines and treatments in development."}