{"text": "LONDON The COVID-19 pandemic in Britain is retreating and the reproduction R number, which measures transmission rates, has dropped below 1 for the first time since July, adding to hopes that some lockdown restrictions could be eased next month.Estimates published on Friday showed that the COVID-19 R number for Britain is now between 0.7 and 0.9, a slight drop from last weeks estimate of 0.7 and 1.0, and dipping under one for the first time in over six months.The prevalence of COVID-19 infections in England was also shown to be dropping in separate data released on Friday. The Office for National Statistics said that about one in 80 people were infected in the week ended Feb.6, compared to one in 65 people the previous week.England has been in lockdown since Jan. 5, with schools shut for most children. Government ministers have said that any easing of restrictions will depend on data over the coming weeks, with an announcement expected on Feb.22.Britains speedy roll out of vaccines could also help convince the government to lift lockdown measures, although there are concerns about the effectiveness of the vaccine on new variants of the virus.Over 13 million people have had a first shot of the vaccine and the government is on track to meet its target to give a first dose to all those in vulnerable groups by next week.The health ministry said on Friday it was confident that the pandemic is shrinking across all NHS England regions, although it warned that the prevalence of the virus remained high and called on people to follow the rules to stay at home.The number of new infections across Britain is shrinking by between 5% and 2% every day, it added.With the R number estimated to be between 0.7 and 0.9, that means that every 10 people infected will go on to infect between 7 and 9 other people.Government data shows that over the last seven days, the number of people testing positive for COVID-19 has dropped by 29%, and the number of deaths from the virus and patients admitted to hospital with the virus has also fallen."}