{"text": "(Adds quotes from minister Jobet, SONAMI chief Hernandez, context)SANTIAGO, April 12 Chile Mining Minister Juan Carlos Jobet said on Monday the countrys center-right government would oppose a bill to hike royalties on copper and lithium miners currently under consideration by lawmakers, blasting it as unconstitutional.The legislation, introduced by left-leaning lawmakers, is aimed at raising funds they say are urgently needed to help underwrite social programs and stimulus amid the coronavirus pandemic. The bill gained momentum as copper prices have soared this year.Our government will not support that idea, said Jobet at the annual CRU World Copper Conference and CESCO Week, calling the motion unconstitutional. Chilean law stipulates new taxes must originate from the executive branch.We believe the best way to increase government revenue from mining is to increase production and improve competitiveness.The controversial bill comes at a tumultuous time for miners in the worlds top copper producer. Chile is launching into a two-year process to overhaul its dictatorship-era constitution, a central demand of violent riots that overwhelmed the country in 2019. Social, environmental and tax issues are all on the table.Jobet told the conference in an online presentation that Chiles government would nonetheless soon roll out a parallel, wide-ranging national mining policy, the product, he said, of more consultation with more than 3,000 stakeholders over two years.We plan to present this policy during the third quarter of this year, Jobet said.Diego Hernandez, president of Chiles National Mining Society (Sonami), told the conference in a separate presentation that regulatory stability should be a top priority in these times of change.With a panorama like the one we have today with all these elections, with all these changes that citizens want, the issue of legal certainty is in question, Hernandez said. It does not help to make investment decisions.The long-time top mining executive said it was up to industry to convince Chileans not to dramatically change the rules of the game for miners, a task he called very difficult in a scenario like the current one."}