{"text": "HAVANA Communist-run Cubas decision to open more of its economy to small private businesses and individual initiative has sparked praise among many analysts and entrepreneurs but also frustration among some.The measure announced last weekend expanded activities where small business were permitted to more than 2,000, from 127 previously.Authorities said they would reduce the steps needed to open a business and allow individuals to engage in related activities, for example running a bed and breakfast along with providing transport from the airport and serving meals.But many activities, from running an art gallery to operating tours, remain out of bounds, and funding and supplies are difficult to obtain.The easing of restraints on private enterprise are part of a wider series of measures by the government of President Miguel Diaz-Canel aimed at creating jobs and better linking the private sector with state companies.Other recent changes include a currency devaluation and cuts in subsidies. Experts say the reforms are forcing greater efficiencies and opening the way for state companies to subcontract work out to the private sector.The opening to private enterprise represents a philosophical sea-change since the first handful of small enterprises were begrudgingly allowed in 1993, after the fall of the Soviet Union, Cuban economist Ricardo Torres said.But he cautioned that private businesses still face many obstacles.The economy is in crisis, including for established businesses, and it is becoming ever more difficult to adapt and survive, he said. He added that state banks remained loath to grant start-up credit and authorities had yet to honor a promise to grant to small- and medium-sized businesses legal status instead of making them register as self-employed.But this measure will help drive recovery and must be seen as linked to others being taken by the government to overcome the crisis, he said.Cubas private sector is composed mainly of small businesses. Employees are legally classified as self-employed, a hangover from decades of demonization of private business.The islands economy, which remains largely in state hands, has stagnated for years. It contracted by 11% last year as a tough U.S. sanctions, together with a deep pandemic-sparked tourism slump, compounded local inefficiencies.The government reported that at the close of 2020 there were more than 600,000 people in the sector - some 13% of the labor force - compared with around 150,000 a decade ago. An estimated 40% depend mainly on the tourism industry and are jobless or just scraping by.Cubans deal with a constant scarcity of even basic goods, and endless lines to obtain them. That also applies to entrepreneurs, who have little access to wholesale markets.A draft list released Wednesday of the activities that remain off-limits to private initiative included journalism, defense, heavy industry, health, and education - as might be expected in a one-party system. But the banned list also includes sectors like private video theaters, scuba diving businesses, architecture, and engineering, drawing protests on social media.The final list and regulations will likely be published by the end of the month, the government said.For Beyond Roots, a store and brand specializing in Afro-Cuban products with 24 employees, the measure opens up all our creative and productive potential to greatly expand the range of products we offer, said Adriana Heredia Sanchez, an economist and its co-founder.Still, Heredia said the limits on private cultural activities could crimp its hopes to organize tourism activities around traditional Afro-Cuban cuisine, music and dance.Right now we are reviewing the entire list of what people cant do and it seems this includes carrying out activities similar to a travel agency or as tour operators, which could be a big setback, she said."}