{"text": "HAVANA Cuba accused Washington of stoking illegal migration by not processing visas in Havana and making it relatively easy for Cubans to claim asylum, in the wake of a spate of ill-fated clandestine attempts to reach U.S. shores by boat.The fate of a group of Cubans risking their lives to reach the United States illegally by boat has gripped people on both sides of the Florida Straits after a vessel capsized near the Bahamas a week ago, leaving some people floating in the water for more than 14 hours.While a Royal Bahamas Defence Force ship has rescued 12 people and recovered one body, several others have not yet been found, including women and two children, the Cuban foreign ministry said in a statement late on Thursday.Thousands of Cubans used to attempt to emigrate to the United States by boat per year until former U.S. President Barack Obama in 2017 ended a measure granting automatic residence to Cubans who reached U.S. soil, though he left in place some other exceptions to usual migration rules.Since then, the numbers have dropped but still hover around several hundred per year.The U.S. Coast Guard has intercepted 87 people of Cuban origin in the Caribbean in the first six months of the 2021 fiscal year which began on Oct. 1, a spokesman told Reuters. That is an increase on the 49 registered in the full 2020 fiscal year, although this was impacted by the pandemic, and compares with 314 in 2019, the spokesman said.Among the factors that constitute incentives for irregular migration are the suspension of the processing and granting of immigrant and non-immigrant visas at the United States Consulate in Havana, the Cuban foreign ministry said in its statement.A U.S. State Department official said in response to the statement that it had designated the U.S. embassy in Guyana as the primary site to process immigrant visas for residents of Cuba. The United States was committed to supporting safe, orderly, and humane migration from Cuba, the official said.The administration of former U.S. President Donald Trump drew the U.S. embassy in Havana down to skeletal staffing after a series of unexplained health incidents among its diplomats, moving consular services for Cubans to third countries.Trumps successor, President Joe Biden, vowed during his campaign to reverse some Trump policy shifts that have inflicted harm on the Cuban people. But hopes he might move quickly restore consular services were dampened when the White House said this week a broad Cuba policy shift is not among Bidens top priorities.Nonetheless, the perception Biden will be more tolerant than Trump towards undocumented migrants, as well as Cubas deepening economic crisis, are likely also boosting illegal migration this year, said Jorge Duany, director of the Cuban Research Institute at Florida International University.Under a 1966 act, it is also easier for Cubans than migrants from many other places to gain political asylum and a green card that grants permanent residency.Following the capsizing of the boat off the Bahamas, distraught relatives of the missing pled on Miami television channels for authorities to shed light on the situation, in images widely shared on social media in Cuba.I am desperate because these children who were like my children have disappeared, said Niurka Caballero, whose two- and four-year-old great niece and nephew were on the boat with their mother.Cuba at least found the boat and has said it will continue the search, Caballero told Reuters by telephone from the northern coastal town of Caibarien. We still have some hope."}