{"text": "NEW YORK A senior aide to New York Governor Andrew Cuomo apologized to state lawmakers this week for the governors office withholding requested data showing the death toll in nursing homes from COVID-19, according to transcripts of the conversation published by local media.The aide, Melissa DeRosa, told Democratic lawmakers in a call on Wednesday that Cuomos office feared the death toll information would be used against us by federal prosecutors, according to the New York Post, which first reported the call.\"And basically we froze,\" DeRosa said, the Post reported here. The comments came about two weeks after New York Attorney General Letitia James published a report saying the true death toll of nursing home residents between March and August last year may be twice as high as the 6,400 officially reported.Angered by what they perceive as a cover-up, Democratic and Republican lawmakers have said they are reconsidering their decision to grant Cuomo emergency powers last year to contend with the novel coronavirus pandemic.This is a betrayal of the public trust, Andrew Gounardes, a Democratic state senator, wrote on Twitter. There needs to be full accountability for what happened.Cuomo rebuffed efforts by state lawmakers last summer to force greater disclosure over the number of nursing home residents who died after contracting COVID-19.Nursing home residents who were taken to hospitals were not counted in the states break-out of nursing home deaths, which lawmakers viewed as masking the true extent of the crisis.Around the same time, the U.S. Department of Justice also began seeking data on deaths of nursing home residents. The department was then overseen by President Donald Trump, a Republican with whom Cuomo frequently sparred, with Cuomo faulting the president for not being transparent with the public over the worsening pandemic.In a statement on Friday, DeRosa said her office decided the federal request must be the priority before turning to the request by state lawmakers.As I said on a call with legislators, we could not fulfill their request as quickly as anyone would have liked, her statement said.Cuomos administration also unsuccessfully sought to withhold the data when it was requested through transparency laws by the Empire Center, a conservative think tank.A judge ordered the disclosure of the numbers this month, and the state has released data showing that thousands more nursing home residents than was previously known died from COVID-19, even if their deaths occurred after being transferred to a hospital."}