{"text": "The Stuttgart-based company founded by Carl Benz, who patented the first gasoline-powered car in 1886, is accelerating plans to shift the carmaker beyond combustion-engine vehicles, a step which will result in job losses.The next five years we will become a smaller company, Kaellenius told a Reuters Events broadcast on Thursday. We will have a fundamental change in the industrial footprint on the powertrain side, he said.Jobs will disappear because it takes less time to build an electric car than a conventional gasoline or diesel version.Thats because an electric cars battery and motor have only 200 components, compared with at least 1,400 parts found in a combustion engine and transmission, according to analysts at ING.The shift away from fossil fuel requires the carmaker to double down on efficiency so it can free up resources to build electric and self-driving cars, Kallenius said.We are hiring a lot of new software engineers, experts in battery chemistry, electrification, he explained.Making Daimler smaller also fits with a new era where luxury no longer defines itself through opulence and excess but also through sustainability and efficiency.There is no doubt in our minds that the footprint that this produce leaves on this Earth needs to be smaller. That is part of the modern luxury promise, Kaellenius said.Mercedes-Benz is tapping engineering expertise from its Formula One team to build the EQXX, an electric vehicle which aims to be the most efficient vehicle capable of taking passengers from Stuttgart, Germany, to Marseille, France, on a single charge.It is a pre-development project to introduce new technologies, Kaellenius said.Daimler also wants to offer customers new digital services so it can make money with new, recurring sources of revenue such as assisted driving functionalities and infotainment services when it unveils a new vehicle car operating system in 2024.Think about it like an iPhone, Kallenius said, explaining that with new software updates, new services and functions can be included. You can add to it, he said. Thats the beauty of it.To invest in digital tech, Daimler plans to tap growth in China, potentially by building new models in the market where Mercedes-Benz sees the biggest growth potential over the next 10 years.If we have individual models which reach a critical mass in China ... thats possible, Kaellenius said, adding that no decision has been made to localise production of new models.It depends on how the market develops, he said."}