{"text": "The kingpin or kingpins of the world's biggest illicit credit card marketplace have retired after making an estimated fortune of over $1 billion in cryptocurrency, according to research by blockchain analysis firm Elliptic shared with Reuters. The \"Joker's Stash\" marketplace, where stolen credit cards and identity data traded hands for bitcoin and other digital coins, ceased operations this month, Elliptic said on Friday, in what it called a rare example of such a site bowing out on its own terms.   Criminal use of cryptocurrencies has long worried regulators, with U.S. Treasury Secretary Janet Yellen and European Central Bank President Christine Lagarde calling last month for tighter oversight.  read more While terrorist financing and money laundering are top of law-enforcement concerns, narcotics, fraud, scams and ransomware are among the chief areas of illegal use of digital currencies, according to Elliptic co-founder Tom Robinson. Joker's Stash was launched in 2014, with its anonymous founder \"JokerStash\" - which could be one or more people - posting messages in both Russian and English, Elliptic said. It was available on the regular web and via the darknet, which hosts marketplaces selling contraband.     The darknet, or darkweb, is a part of the internet that isn't visible to regular search engines, and requires a form of browser that hides a user's identity to access.Elliptic, whose clients include law-enforcement agencies and financial firms, estimates that JokerStash raked in more than $1 billion in profits in cryptocurrencies over the years, at current prices. Bitcoin has soared from just over $300 in 2014 to hit a record $49,000 on Friday, pulling up other coins in its wake.The blockchain firm reached the over $1 billion figure by analysing the marketplace's revenue and the fees it charged, and said it was at the lower end of its estimates. In December, Interpol and the FBI seized the domain names used by the site, but it continued operating via the darknet, Elliptic said. Cyber-security firm Digital Shadows also said in December that the darknet site remained live after the seizure.Interpol did not respond to a request for comment. The FBI could not be reached outside regular business hours. Trading illegal credit cards is \"a billion-dollar business,\" said Robinson. \"It's also providing a means of cashing out other types of cyber-criminality.\"    On Jan. 15. Joker's Stash posted a message announcing it would close permanently on Feb. 15. In fact it went offline on Feb. 3, Elliptic said. \"Joker goes on a well-deserved retirement,\" said the message, which Reuters saw a screenshot of. \"It's time for us to leave forever.\" Accompanying it was a picture of the 1862 painting \"Staczyk\" by Polish artist Jan Matejko, which depicts a court jester sitting forlornly in a bedroom as a party goes on in the background."}