{"text": "An announcement by the Taliban that they would cease fire for three days for the Muslim holiday of Eid al-Fitr has been met by many Afghans with little but despair, just days after a bombing that killed at least 80 people, most of them schoolgirls.The insurgents said late on Sunday they were offering the pause in fighting so Afghans could celebrate Eid in peace. The truce is meant to come into force on Thursday morning, at a critical moment with U.S. forces in the process of withdrawing after 20 years.But many Afghans described the short holiday pause in fighting as a fruitless gesture. The Taliban observed a similar truce last year.\"If a ceasefire had been declared some days ago, perhaps these schoolgirls would have been alive and celebrating Eid with their families,\" said Shah Wali, a Kabul shopkeeper, referring to Saturday's bomb attack on a girls school mainly attended by Shi'ite Muslim members of the Hazara ethnic minority.  read more \"It is a good and appropriate action, but not only on the three days of Eid... we want a permanent ceasefire,\" he told Reuters.The Taliban have condemned Saturday's bombing, which U.S. officials suspect may have been the work of a rival militant group, such as Islamic State.University student Shugufa Azaryoon, 22, said she did not welcome the ceasefire at all. Previous ceasefires had been used by Taliban fighters only to regroup and launch attacks after Eid, she said.PERMANENT CEASEFIRE HASHTAGThe Afghan government wants the Taliban to agree to a more comprehensive ceasefire to promote political talks. The Taliban say they want to lay down their arms, but cannot do so permanently until a political settlement is reached.Meanwhile, the hashtag \"AfghansWantPermanentCeasefire\" trended in Afghanistan on Facebook and Twitter in the lead up to Eid, which marks the end of the Ramadan holy fasting month.Facebook user Sadaf Jamali wrote: \"I kill people in Ramadan, I dont kill people in Eid, but after Eid I will (kill) them again...This is Talibans logic #AfghansWantPermanentCeasefire\".Taliban spokesman Zabihullah Mujahid told Reuters that the social media trend was an \"emotional thing\" and that the group \"respected\" these emotions.\"But a ceasefire is something bigger than emotion, it is related to the larger issue of our country,\" he said, adding that there would be no permanent ceasefire until the insurgent group's goal of restoring an Islamic government is achieved.A day before the ceasefire was to begin, Taliban insurgents launched an offensive and took control of a key district located an hour's drive from the capital Kabul.  read more Washington, which is pulling its remaining troops out of Afghanistan over the next four months, had long said its withdrawal was conditional on the Taliban reducing violence, but now says it is leaving no matter what.U.S. special envoy Zalmay Khalilzad welcomed the announcement of the three-day ceasefire, but said on Twitter that \"Afghans deserve much more: a political settlement & a permanent ceasefire.\"Government employee Saifullah Khan said the three-day ceasefire did not leave enough time to travel to spend the holiday with his family, who live in a village two-days' journey away.\"I wish they had announced a longer ceasefire,\" he said. \"Like hundreds of thousands of other Afghans I have to wait for a real and permanent ceasefire...only a miracle can make this possible.\""}