{"text": "MELBOURNE The Australian Opens last day of crowds before a five-day lockdown ended with irate fans ejected from Rod Laver Arena late on Friday, and an injury-hampered Novak Djokovic rallying to claim victory in front of empty seats.It was a surreal finish to a roller-coaster day five, with Djokovic digging deep to complete a courageous 7-6(1) 6-4 3-6 4-6 6-2 win over American Taylor Fritz after his title defence appeared doomed due to an apparent side strain.Fans were advised well in advance that they would need to leave the arena at 11:30pm, half an hour before Melbourne entered a snap lockdown at midnight on Friday to contain a fresh outbreak of COVID-19.Play was suspended in the fourth set of Djokovics match to have fans clear out but many left slowly and grudgingly. Some booed and shouted for refunds on their tickets.Djokovic ended up completing victory some 20 minutes after midnight and his roars of triumph echoed around the arena.He was proud to survive but unsure whether he could continue his bid for a record-extending ninth title at Melbourne Park.I know its a tear, definitely, I dont know if Ill manage to recover from that in two days, he said on court.FIVE-SET THRILLERThe action on day five reached a crescendo earlier at John Cain Arena, where U.S. Open champion Dominic Thiem came back to win a five-set thriller against home hero Nick Kyrgios.As fans roared Kyrgios to a two-set lead in the atmosphere of a football match, police on horse-back dispersed several hundred anti-lockdown protesters directly outside the stadium.State Premier Daniel Andrews earlier announced the lockdown measures after the highly transmissible strain of COVID-19 linked to Britain infected 13 people in Melbourne.Australian Open tournament director Craig Tiley said players will enter a biosecure bubble from Saturday morning similar to ones that have operated at tournaments around the world for much of the last 12 months. []Theyve been doing this all year, Tiley told reporters at Melbourne Park, promising refunds for ticket-buyers.The last five days have been a unique experience for them and the next five will be back to what they know.NOT IDEALAndrews earlier said the Australian Open would be treated like any other professional sporting event in the state until the lockdown ended on Wednesday night.Large and small professional sport events... will function essentially as a workplace but they will not function as an entertainment event, because there will be no crowds, he said.Serena Williams was out on court winning her third round match when the announcement was made.Its not ideal, the 23-times Grand Slam champion said. Its been really fun to have the crowd back, especially here. But, you know what, at the end of the day we have to do whats best. Hopefully it will be all right.Melbourne endured a strict 112-day lockdown last year when it brought cases down from over 700 a day to zero, and authorities are sensitive to even small outbreaks.The tournament, one of the sports four Grand Slams, was delayed by three weeks and only went ahead after more than 1,000 players and support staff underwent 14 days of quarantine.Crowds at Melbourne Park were capped at 30,000 per day at the start of the event - around 50% of the usual attendance.Organisers would have been hoping for bumper crowds at the weekend and Tiley conceded that there would be a further financial impact from lost ticket sales which might have clawed back some of the A$40 million spent on quarantine costs."}