{"text": "U.S. census data used once a decade to redraw legislative districts will not be made available until September, officials said on Friday, a delay that could make it difficult for states to finish new maps in time for the 2022 congressional elections.In announcing a new release date of Sept. 30, the Census Bureau cited lingering delays caused by the coronavirus pandemic, which forced the bureau to shut down many of its data collection operations last spring as lockdowns swept the country.The bureau had previously set a target of July, which was already months later than the data is typically provided to states.Every 10 years, states employ the fresh census data to draw the lines for members of the U.S. House of Representatives as well as thousands of state legislative offices.Some good-government groups have expressed concern that the compressed timeline could make it easier for lawmakers to engage in gerrymandering, the process by which maps are deliberately skewed to benefit one political party over another.If new maps are drawn late in 2021, that would leave little time for legal challenges to work their way through the courts before filing deadlines for elections. In Illinois and Texas, two states where one party holds unilateral power to redraw legislative boundaries, candidates must file before years end to run for office in 2022.Youre starting to bump redistricting up against the election cycle, said Michael Li, a redistricting expert at New York Universitys Brennan Center for Justice. Theres less time to challenge maps. That puts a lot of pressure on civil rights groups.The only two states that have legislative elections in 2021, Virginia and New Jersey, will be forced to use existing maps as a result of the postponement.This was a census like no other, Kathleen Styles, a Census Bureau official, said on a call with reporters on Friday. COVID-19 was definitely the driving factor in our schedule here.The state-level population figures that determine whether states will gain or lose U.S. House seats will be available in April, but the more specific data needed to draw maps will be delayed.Democrats hold a slim 10-seat majority in the House, and some analysts have said that a combination of reapportionment and gerrymandering could be enough to swing the majority. Texas and Florida, two states that are controlled by Republicans and have seen aggressive gerrymanders in previous cycles, are expected to gain three seats and two seats, respectively.A Brennan Center analysis issued on Thursday found that Republicans would have sole control over the drawing of 181 congressional seats, compared with only 49 for Democrats.The delay also may force states to pass legislation extending redistricting deadlines or turn to the courts to seek extensions. Half of U.S. states have either a constitutional or statutory deadline calling for new maps in 2021, according to the National Conference of State Legislatures."}