{"text": "Delivery Heros (DHER.DE) plans to return home to Berlin set off a food fight on Wednesday as rivals Just Eat Takeaway (TKWY.AS) and Uber Eats announced their own product launches in Germany.Delivery Hero, whose operations span more than 50 countries, will start in June with the soft launch in Berlin of its foodpanda brand, promising delivery times as short as seven minutes to customers who order on its smartphone app.It will follow in August with a broader rollout across German cities of restaurant meal delivery and quick commerce served by its own network of local warehouses and shops.\"We might have a product good enough for challenging for number one (spot) in the very long term  that's our logic,\" Chief Executive Officer Niklas Oestberg said in an interview.Delivery Hero's return home brought an abrupt end to a truce struck in late 2018, when Oestberg sold Delivery Hero's German operations to Takeaway.com - its Dutch competitor now known as Just Eat Takeaway (JET) - for $1.1 billion.JET CEO Jitse Groen hit back immediately.\"Competition makes us stronger,\" he said in a tweet that sparked a testy exchange between the two bosses. \"We have defeated them in Holland, the UK, Poland, Ireland and Germany, and will gladly do so again.\"JET's local food delivery brand Lieferando said it was upgrading into a \"super-app\" through which its 12 million users in Germany could order from supermarket partners.  read more Uber Eats, the food delivery arm of U.S. ride hailing giant Uber (UBER.N) that announced in April it would enter Germany, said its food delivery app was going live in central Berlin.RENEWED COMPETITIONInvestors were less upbeat about the prospect of a second bout of cut-throat competition in an industry where only dominant players can hope to turn a profit. JET shares fell by more than 4%, while Delivery Hero shed nearly 3%. Delivery Hero's homecoming coincides with a boom in rapid delivery, that also pits it against fast-growing startups, such as Berlin-based Gorillas, that are attracting venture capital. It is already active in the quick commerce market, running 600 of its own Dmarts - or delivery-only supermarkets - and processing more than 400,000 orders a day worldwide last month.But margins in Delivery Hero's quick commerce division are deep in the red. Oestberg said he could see a way to compete against supermarket chains with higher overheads.His goal was for Delivery Hero's Berlin-based team to come up with the best product to win over customers, rather than splurging cash on promotions to buy market share.If the feedback I hear is very positive, then we can always scale, we can always put in more money behind it, Oestberg said."}