{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2BqrLONDON, June 12 Southern European government bond yields rose on Friday as investors sold off riskier assets after market hopes for an economic recovery were quashed by fears of a second wave of COVID-19.Throughout May and the start of June, demand for riskier southern European government bonds rose and demand for safer German debt declined as markets rallied on optimism that there would be an economic recovery.But the optimism is bullish sentiment in European government bond markets collapsed on Friday, following a sell-off in equities on Thursday that saw three major U.S. stock indexes fall more than 5%.About half a dozen U.S. states are grappling with a rising number of coronavirus patients filling hospital beds, fanning concerns that re-opening the U.S. economy may spark a second wave of infections.The fact that, during the risk-off move, the risk premium that Italian government bonds (BTPs) pay did not dramatically increase, shows that the European Central Banks asset purchases are supporting the riskier debt, Commerzbank rates strategists wrote in a note to clients.The relative resilience of the periphery is telling with 10y BTP spreads widening just 2bp in the risk-off rally, underlining the ECB support, they said.Italys 10-year government bond yield was up around 3 basis points at 1.47% at 0640 GMT, while Portugal and Spains 10-year government yields were up less than 1 basis point .The spread between Italian and German 10-year government yield spreads widened by around 2 basis points and is heading for its biggest weekly increase in 8 weeks.Demand for safer German government debt increased, with Germanys 10-year yield edging down at -0.42%. The yield has fallen around 15 bps this week and is set for its biggest weekly drop since late February.Investors were waiting for more information about the proposed EU-wide coronavirus recovery fund.The lack of substance about the EU recovery fund emerging from the Eurogroup is a clear indication that the views are still very far apart at this stage, Commerzbank strategists wrote.Czech Republic, Hungary, Poland and Slovakia edged towards backing the EUs plan when they met on Thursday, but said it should not favour larger, richer states or hurt smaller ones that managed the outbreak well.European industrial production data for April is due at 0900 GMT. (Reporting by Elizabeth Howcroft, editing by Larry King)"}