{"text": "WILMINGTON, Del. Kamala Harris made her campaign-trail debut as Joe Bidens Democratic running mate on Wednesday, delivering a strong rebuke of President Donald Trumps leadership and highlighting the historic significance of her new role.Harris said Biden, the former vice president under President Barack Obama, had recognized the critical moment being faced by the country by picking her to be the first Black woman and Asian American on a major-party U.S. presidential ticket.Today, he takes his place in the ongoing story of Americas march toward equality and justice as the only person who served alongside the first Black president, and has chosen the first Black woman as his running mate, said Harris, a U.S. senator from California.Nearly nine out of 10 Democrats approved of Harris as Bidens pick, according to a Reuters/Ipsos poll released on Wednesday.Forced by the coronavirus pandemic to stage a more subdued launch than would be expected from a typical presidential campaign, the new running mates managed to display a personal connection that dates back to Harris friendship with Bidens son Beau, who died of cancer in 2015.Harris said she had long admired Bidens commitment to his family and country, and she described him as ready to meet the challenges created by Trumps failures in handling the pandemic and its economic consequences, as well as racial unrest.This is a moment of real consequence for America, she said. Everything we care about  our economy, our health, our kids, the kind of country we live in  its all on the line.America is crying out for leadership, yet we have a president who cares more about himself than the people who elected him, a president who is making every challenge we face even more difficult to solve, Harris said.The speech, delivered in a Delaware high school gymnasium near Bidens home, featured no cheering crowds. The two candidates wore masks as they arrived and kept their social distance on a stage flanked by state flags.The joint appearance came just days before Biden will formally accept the Democratic presidential nomination at next weeks party convention, which will take place largely as a virtual event due to COVID-19.The Republican convention, where Trump is set to be nominated to seek a second four-year term, follows a week later and kicks off a 10-week sprint to Election Day on Nov. 3.STUFF OF PRESIDENTSIn choosing Harris, Biden selected a former rival for the nomination whose most memorable campaign moment came during a televised debate when she criticized his past position on using busing to integrate schools and talked about its effect on her as a little girl.Biden on Wednesday said her addition to the ticket sent a powerful message to girls across America.This morning, all across the nation, little girls woke up - especially little black and brown girls, who so often feel overlooked and undervalued in their communities - today, just maybe, theyre seeing themselves in the first time in a new way. As the stuff of presidents, and vice presidents, Biden said.In recent months, as unrest has convulsed many U.S. cities following the May police killing of George Floyd, a Black man, in Minneapolis, Harris has been a prominent voice calling for change. She has marched alongside protesters and pushed legislation to reform policing practices.Some activists have said her work in the Senate had helped temper concerns about her past as a prosecutor in California and could build enthusiasm among some of the partys liberal voters for the more centrist Biden.Harris is the daughter of immigrants, her mother from India and her father from Jamaica. On Wednesday, Harris recalled her parents involvement in the U.S. civil rights movement, and her friendship with Beau Biden, who was attorney general of Delaware when Harris was attorney general in California. She stressed that, like Biden, my family means everything to me.Harris, 55, was announced as Bidens choice on Tuesday after a selection process that drew extra scrutiny thanks to Bidens age. The 77-year-old would be the oldest president ever if he wins, raising speculation that he would not seek re-election in 2024.At a joint fundraiser with Harris later on Wednesday, Biden said his campaign had raised $26 million and had 150,000 new contributors in the 24 hours since he revealed his pick.Trump told reporters at a White House news conference that he had watched some of the Biden-Harris rollout event and was surprised his Democratic opponent had chosen someone who failed in her own presidential bid.Harris thanked Joe Biden and his wife Jill for welcoming her into their extended family, specifically mentioning the former second lady, who described Harris attacks on Biden during the primary debate as a punch to the gut.She said Joe Biden had proven his empathy and connection with those who are suffering.Hes someone whose first response when things get tough is never to think about himself, but to take care of everybody else, Harris said."}