{"text": "A famous Finland victory in their first game at the finals of a major tournament was eclipsed by near-tragedy when Denmark midfielder Christian Eriksen collapsed during their Euro 2020 match andrequired emergency medical treatment on the pitch.The Finns went on to win their Group B opener 1-0 thanks to a Joel Pohjanpalo goal, but the game will go down in history as the night the collpase of one of Denmark's greatest playmakers threw the footballing world into shock for over an hour.Having dominated the game for the opening 42 minutes, the 29-year-old collapsed as Denmark took an innocuous throw-in, sinking to the ground with his eyes open.His team mates Joakim Maehle, Thomas Delaney and Martin Braithwaite beckoned for assistance and Eriksen was given CPR by a medical team as the Danes formed a ring around him before he was carried off on a stretcher and both teams left the pitch.  read more The game was stopped for a prolonged period, the crowd's stunned silence only breaking when it was revealed that Eriksen, who plays for Inter Milan, had been transported to hospital.The Finnish fans began chanting \"Christian\" and the Danes responded with \"Eriksen\" as the 16,000 in attendance waited for more news, and to see if the game would be resumed.Further good news that Eriksen was conscious and communicating was announced to jubilation in the stadium, but when the idea of restarting the game was floated it came form a most unlikely source - Eriksen himself.  read more \"We have been in contact with him, and the players have spoken with Christian. That's the good news. He is doing well and they are playing the match for Christian,\" Danish FA director Peter Mueller said.DANES AFFECTEDThe players returned to the pitch and went through their warm-up drills for a second time but the Danes were clearly affected by the trauma of Eriksen's collapse, with some wiping away tears and many hugs being exchanged.Pohjanpalo popped up against the run of play to head the winner on the hour mark with his side's only attempt of the game before celebrating in a restrained fashion on the side of the field where Eriksen had collapsed.Pierre Emil Hojbjerg missed a penalty for Denmark but it was a night when football did not matter, with Eriksen being treated at a hospital about one kilometre away.\"There are players in there who are completely emotionally finished... they are holding each other. It was a traumatic experience,\" Denmark coach Kasper Hjulmand told reporters, struggling to hold back tears.\"I said that, no matter what, everything was OK. We had to allow ourselves to show joy and aggression, to make room for the emotions. You cannot play a football match at this level without being aggressive. It cannot be done,\" he added.Hjulmand revealed that team captain Simon Kjaer, who is a close friend of Eriksen's, had to be withdrawn from the game after the restart.\"Simon was deeply, deeply affected. Deeply affected. He was in doubt whether he could continue and gave it a shot, but it could not be done,\" the coach explained.For the Finns it was a bittersweet moment that puts them in a good position to qualify for the knockout stage, but it mattered little after the final whistle.\"Today we're all winners as long as the healing process is well underway ... everything else is a bonus and less important, our thoughts are all there,\" goalkeeper Lucas Hradecky said.\"It was grim in the locker room and we were all thinking 'What will happen now?' and hoping everything will be fine. It was a really hard day,\" added the Finland player."}