{"text": "Denmark midfielder Christian Eriksen was rushed to hospital after collapsing during his sides Euro 2020 opening match with Finland and being given CPR on the pitch on Saturday, with soccer officials later saying the player was stable and awake.Eriksen collapsed suddenly in the 42nd minute of the match while running near the left touchline after a Denmark throw-in.As a hush fell over the 16,000-strong crowd, his teammates gathered around him and one appeared to stick his fingers in Eriksen's mouth to clear his airway or check he hadn't swallowed his tongue.As medics arrived on the scene and pumped Eriksen's chest, his teammates formed a ring around him. Danish broadcaster DR cut the live TV feed, instead showing aerial footage of the stadium.The 29-year-old was taken to the nearby Rigshospitalet, where he regained conciousness.\"We have been in contact with him and the players have spoken to Christian,\" said Peter Moller of the Danish Football Association.Applause broke out in the Parken stadium among both Danish and Finnish fans, when it was announced that Eriksen had regained conciousness.\"He is doing well and they are playing the match for Christian,\" Moller said.The game was initially suspended but resumed an hour and 45 minutes later, Finland claiming a 1-0 victory when striker Joel Pohjanpalo headed in on the hour with his sides only attempt of the game.A visibly drained Denmark coach Kasper Hjulmand said after the match that the players were given the option to finish the game on Saturday evening or on Sunday.\"It was more manageable to go in again and honestly just get it over with,\" Hjulmand said.Several players, including captain Simon Kjaer, were too overwhelmed by emotions to finish the game, he said.\"I completely understand that you can't play a soccer match at this level, after watching one of your best friends fight for his life,\" Hjulmand said.Later in the day, Belgian striker Romelu Lukaku, a teammate of Eriksen at soccer club Inter Milan in Italy, ran to a TV camera and shouted \"Chris, Chris, I love you\" after scoring in his side's opening match against Russian.People gathered outside bars in central Copenhagen, many in tears, while Eriksen's condition remained unclear.The crowd at the Parken stadium in Copenhagen sang the Danish national anthem and chanted Christian Eriksen while they waited for news, until word finally came through that the player had regained consciousness."}