{"text": "BERLIN Deutsche Telekom raised its full-year guidance on Thursday after forecast-beating results that CEO Tim Hoettges said demonstrated that the market is undervaluing the growth story at the transatlantic telecoms group.Another set of strong results from its T-Mobile unit has driven up shares in the recently merged U.S. business, eroding the residual value the market puts on the groups European operations spanning a dozen countries.After subtracting its 43% stake in the U.S. carrier - worth $67 billion at Wednesdays closing price - the value of the non-U.S. business has shrunk to $18 billion.Hoettges told reporters that Deutsche Telekoms shares had been dragged down by its struggling rivals and a desolate European market, adding that it was the only European player showing significant growth.The good will show through in the end and will be reflected in our share price, he said.Deutsche Telekom shares rose 0.5% to 15.05 euros in morning trade, bringing this years gains to 4%. T-Mobile shares, meanwhile, have jumped 60%, fuelled by enthusiasm over strong execution of its $23 billion takeover of Sprint.Hoettges emphasised Deutsches lead over its competitors in rolling out its German 5G network, adding that geopolitical risks from its reliance on Chinese vendor Huawei are manageable.DE-RISKINGHe said it is hoped that a proposed IT security law being considered in Berlin will create legal clarity soon on assessing the suitability of foreign vendors.Deutsche Telekom also plans to de-risk by supporting new open technology standards for network gear.We are taking steps to reduce our dependence on Asian suppliers, Hoettges said.The group raised its forecast for 2020 core profit to 35 billion euros ($41.2 billion) after a 49.6% rise in the third quarter. Profit rose 10% on an organic basis after adjusting for the U.S. merger.Despite the telecoms strength, Deutsches troubled IT services unit, T-Systems, has seen incoming orders decline by 25% during the coronavirus crisis.Finance chief Christian Illek said that reduced IT spending by the automotive and airline industries would necessitate additional restructuring at T-Systems on top of its ongoing three-year turnaround plan.There were also headwinds from a weaker dollar and lower roaming revenue, while merger-related costs in the United States dented cashflow. Group net debt rose to 124.5 billion euros in the quarter after the extension of a U.S. leasing deal.Illek said leverage including leases was still on track for a target range of 2.25 to 2.75 times within three years, down from 2.9 times.Deutsche management also confirmed plans to propose an unchanged annual divided of 0.60 euros."}