{"text": "MILAN (Reuters) -Italian diagnostics firm DiaSorin has agreed to buy U.S. rival Luminex Corp for $1.8 billion in a move that could boost its molecular business and offset a potential drop in demand for COVID-19 tests as the pandemic is brought under control.The pandemic has fuelled rapid growth at Diasorins molecular division, which in 2020 accounted for 29% of sales. But as the rollout of COVID-19 vaccines progresses, some analysts have raised concern about a possible drop in demand for COVID-19 molecular tests once the emergency is over.We believe this opportunity will ... help DiaSorin to address the COVID cliff... even in future years when demand for COVID-19 tests has largely vanished, a Milan-based analyst said of the Luminex deal.DiaSorin shares were up 8.5% at 1100 GMT.Texas-based Luminex is a leader in so-called multiplex diagnostics, which can detect multiple illnesses or viruses from a simple sample. Its the industrys fastest-growing segment.Luminex perfectly fits with our strategy to grow our positioning in the molecular diagnostics space, to broaden our presence in the U.S. and to create additional value through Life Science offerings, Diasorin Chief Executive Carlo Rosa said.The deal, which grows DiaSorins footprint in the key U.S. market, follows a similar acquisition by diagnostics rival Roche, which bought GenMark Diagnostics in a $1.8 billion deal to fill a testing portfolio gap.Broker Jefferies said the Luminex deal was reasonably priced at 17.5 times expected 2021 core profit, broadly in line with current trading multiples for global diagnostics peers.Under the terms of the agreement unveiled on Sunday evening, Luminex shareholders will receive $37 in cash for each share, compared with Fridays closing price of $32.95.DiaSorin said that represented a premium of 23% when calculated versus the unaffected closing price on Feb. 24, a day before rumours emerged about a potential sale.Shares in the U.S. firm are up 42.5% this year.DiaSorin had flagged the potential acquisition earlier this year, with Rosa saying in March the group had the ambition to grow and was waiting for an opportunity to materialise.Luminex will be merged with a newly formed U.S. subsidiary of DiaSorin. The combined group would have had 2020 revenues of around $1.5 billion.DiaSorin said it would fund the deal through a mix of cash and external financing and guided for an immediate positive impact on its earnings per share."}