{"text": "MELBOURNE Top seed Novak Djokovic survived a major injury scare as he battled past American Taylor Fritz 7-6(1) 6-4 3-6 4-6 6-2 to reach the fourth round of the Australian Open on Friday.The eight-time champion looked in serious trouble when an injury sustained to his right side after a slip at 1-1 in the third set, having built a two-set lead, left him grimacing in pain and requiring treatment off court.Fritz, the 27th seed, took the third set and was leading in the fourth when the match had another strange twist as play was halted while the crowd were removed in line with a new five-day COVID-19 lockdown starting at midnight in Melbourne.When play resumed in virtual silence on Rod Laver Arena after the boisterous atmosphere that had riled Djokovic earlier, Fritz went on to level the match.But the stoppage appeared to help Djokovic who, despite still struggling physically, dominated the fifth set, reeling off the last four games with his trademark baseline accuracy.The Serb roared into the night sky like a man possessed after claiming his 78th, and possibly strangest, match win at the tournament he has dominated in the past decade.Whether he can carry on is a major doubt though as he only has a two-day window to recover from what he described as a tear before facing Canadian 14th seed Milos Raonic on Sunday.I dont have a great experience with tears in terms of continuing so its in the clouds whether I step out on the court in two days, hopefully God willing I can play, 17-time Grand Slam champion Djokovic said shortly after walking off court.The way it felt when I got the first medical timeout I was debating in my head whether to retire from the match because I couldnt move, I couldnt rotate, return serve, the only thing I could do was serve which got me out of trouble.CROWD PROBLEMUntil the moment he suffered the injury Djokovics main problem had been the crowd, who offered raucous backing to Fritz and his bid to reach a first Grand Slam fourth round.Djokovic lost focus when serving at 5-3 in the first set, showing his irritation with the fans, but he regained his composure to play an exquisite tiebreak.He then took the second set in routine fashion before everything started to spiral out of his control.Im proud but a bit worried as I dont know whats going on. I think its a tear. I had a kind of weird feeling on one of the returns and I knew right away that something not great was happening and that was confirmed by the ATP physio, he said.Mentally and emotionally I feel great, its a huge relief to pull this one through in the conditions that I find myself in. It was one of a kind and one of the best moments of my career in these kind of circumstances.Fritz, who had gone five sets with compatriot Reilly Opelka on Wednesday, will look back at a missed opportunity having looked the more likely winner at one stage.I expected that if he was really, really injured he wouldnt have kept playing, Fritz said. I knew that he would come back strong in the fifth. But, you know, its tough."}