{"text": "MELBOURNE Defending champion Novak Djokovic faces a fitness battle to continue in the Australian Open after suffering what he described as a muscle tear during a five-set win over Taylor Fritz on Friday.The 33-year-old, seeking a record-extending ninth title in Melbourne, was cruising after winning the opening two sets of his third-round clash but a slip at 1-1 in the third set almost derailed his progress.Djokovic disappeared off Rod Laver Arena for treatment and needed further attention during the third set.His hopes looked forlorn when Fritz won sets three and four but the 17-time Grand Slam winner showed great resolve to dominate the decider with some superbly accurate serving and groundstrokes.His 7-6(1) 6-4 3-6 4-6 6-2 win was his 78th career match victory at the Australian Open but whether or not he can go for number 79 against Milos Raonic on Sunday is doubtful.Right now Im -- well, I know its a tear, definitely, of the muscle, Djokovic said of the issue on his right side and which he said left him unable to move or rotate initially.So I dont know if Ill manage to recover from that in less than two days. I dont know Im going to step out on to the court or not. I am just very proud of this achievement tonight. Lets see what happens.Djokovic was helped by a break in play midway through the fourth set, at around 11.30pm local time, when the fans inside the Rod Laver Arena were told to leave to comply with Melbournes new five-day COVID-19 lockdown which was due to start at midnight.Although he still lost the fourth set he was able to move more freely in the fifth set in which he dropped only five points on his serve and struck 13 winners.Djokovic had been riled by the boisterous crowd earlier in the match but after a short break in play to allow disgruntled fans to head for the exits, he revelled in the calm atmosphere.I was just going for my shots. I was hitting two first serves, and it worked, he said.Obviously with the bad news that we got today, everybody knew that midnight is going to be the deadline. In a way its unfortunate for the crowd that we didnt finish the match with them seeing the end. They were enjoying it, certainly.Maybe a bit too loud at certain moments."}