{"text": "The 200-fold increase in the value of dogecoin over the past year is clearly a case of rabid speculation. Rival cryptocurrency bitcoin has merely quintupled over the same period. But in the long arc of financial history, theres no reason either is sillier than the other.The digital currency represented online by a cheeky Shiba Inu has some high-profile boosters, including Tesla (TSLA.O) boss Elon Musk and rap artist Snoop Dogg. That aside, reasons to be skeptical about the currencys soaring price are plentiful. Dogecoin lacks the main feature of money: large numbers of people saving, trading and transacting with it. Opportunities to spend dogecoin are scant, beyond a future moon mission by Musks SpaceX and tickets to see the Dallas Mavericks play basketball.Perhaps because it was created as a joke, dogecoin also has other rough edges. The developer community that tends its code is small, partly because it lacks bitcoins scale and claims of changing the world or ethereums usefulness in validating online contracts. Without developers, dogecoin is now far behind its original template, bitcoin, which has been updated multiple times to be more reliable, faster and easier to use.Dogecoin is also theoretically more vulnerable to saboteurs. The chief worry for a cryptocurrency is a so-called 51% attack, where a bad actor becomes the dominant miner and can doctor the record, spending currency twice over. Thats easier to do for the smallish $63 billion stock of doge than, say, $500 billion ethereum. Unlike bitcoin, dogecoins supply is uncapped too  it expands at a rate of around 5 billion doge per year, forever.These arent terminal obstacles. If the canine crypto  or any other coin  garnered enough attention and support, developers and users might come. Already, dogecoin is being added to exchanges like Gemini that previously eschewed it. The code could catch up somewhat, at a push. And in theory the unappealing aspects of dogecoins DNA could be rewritten.The odds are still against dogecoin becoming a future global currency. What the recent hype does, though, is serve as a reminder that crypto is young, and supremacy is still up for grabs. Bitcoin has 12 years of history, but in monetary terms thats a blip. Theres still room for an underdog.Follow @johnsfoley on TwitterCONTEXT NEWS- Dogecoin, the digital currency created as a parody of bitcoin, was trading at over $0.50 on the evening of May 11, almost 10 times its price at the end of March.- Elon Musk, chief executive of electric-car maker Tesla, asked Twitter users earlier that day if his company should accept dogecoin as payment.- The currency had fallen around one-third from an all-time high after Musk, appearing on U.S. television show Saturday Night Live on May 8, agreed that dogecoin was a hustle.- Dogecoin, begun in 2013 by two developers who later distanced themselves from the cryptocurrency, is worth some 200 times its value a year ago in dollar terms, according to Coinbase."}