{"text": "NEW YORK The dollar rose on Friday following a fresh spike in Treasury yields as the prospect of economies emerging from year-long coronavirus lockdowns reignited inflation fears.Market participants have grown wary in recent weeks that massive fiscal stimulus and pent-up consumer demand could lead to a jump in inflation as expanding vaccination campaigns bring an end to lockdowns.Data on Friday showed U.S. producer prices (PPI) had their largest annual gain in nearly 2-1/2 years, though considerable slack in the labor market could make it harder for businesses to pass the higher costs on to consumers.The U.S. economy is set to get a massive shot in the arm after President Joe Biden signed a $1.9 trillion stimulus bill into law on Thursday and urged U.S. states to make all adults eligible for a coronavirus vaccine by May 1.A selloff in Treasuries overnight continued into the U.S. session, with the yield on the benchmark 10-year note hitting a fresh one-year high of 1.6420%, helped by optimism around U.S. economic prospects.The dollar was up 0.25% at 91.668 against a basket of six major currencies, leaving it on track to end the week slightly lower.The greenback hit an intraday high of 92.506 when yields surged on Tuesday, which was its strongest since November, but recorded three straight days of losses as yields stabilized.Bond yields have been in a very strong uptrend and with the PPI numbers somewhat higher than consensus, thats contributing to the rise, said Kathy Lien, managing director at BK Asset Management.Thats widely positive for the dollar, as the greenback has been taking its cues from yields and these new highs are really encouraging more demand for the greenback, especially at a time when you have the ECB accelerating bond purchases and being a little bit more dovish, she said.The European Central Bank said on Thursday that it would increase the pace of its money printing to prevent a rise in euro zone bond yields in support of the economic recovery.Although the euro was down 0.3% at $1.19505, it was set for a small weekly gain.Traders will be looking to the U.S. Federal Reserves policy meeting next week for any comments about rising yields.They are also keen for any information on the upcoming expiry of the Feds temporary easing of the supplementary leverage ratio (SLR), which seems to be part of the reason behind the sell-off in Treasuries, said Erik Bregar, director and head of FX strategy at the Exchange Bank of Canada.The SLR directs large banks to hold more capital against their assets. Last April, the Fed eased the rules by exempting certain investments, including Treasuries, from a key leverage calculation in an effort to improve market liquidity as the economy cratered due to coronavirus shutdowns. So far there has been no word from the Fed on a possible extension.Primary dealers are shedding bonds because this exemption might not get renewed at the end of March, Bregar said.Riskier currencies gave back some recent gains on Friday. The Australian dollar - which is seen as a liquid proxy for risk appetite - fell by 0.35% to 0.77595 versus the U.S. dollar.The New Zealand dollar was down 0.68% against the greenback at 0.7178. The Norwegian crown lost out to both the euro and dollar.Dollar-yen was up around 0.52%, changing hands at 109.050, close to the 109.235 reached on Tuesday, which had been the yens weakest since June 2020.Elsewhere, bitcoin dropped 1.1% to $57,150.97, having come close to, but not exceeded, its recent record high of $58,354.14."}