{"text": "The dollar held four days of gains against major peers on Tuesday as the prospect of massive fiscal stimulus pushed U.S. yields higher.President-elect Joe Biden, who takes office on Jan. 20 with his Democratic party in control of both Houses, has promised \"trillions\" in extra pandemic-relief spending.The dollar index has rebounded from a nearly three-year low reached last week as the benchmark 10-year U.S. Treasury yield topped 1% for the first time since March and rose as high as 1.148% overnight.The support from rising yields has so far trumped worries that the extra spending could trigger faster inflation, which ordinarily would make the greenback less attractive.Many analysts expect the U.S. currency to resume the decline that saw the dollar index lose close to 7% in 2020 amid better risk sentiment stimulus spending and vaccine rollouts brighten the global economic outlook.\"It's complicated because higher U.S. yields are giving the dollar a bounce, but stimulus could support U.S. equities, and the dollar would remain weak,\" said Osamu Takashima, head of G10 FX strategy at Citigroup Global Markets Japan in Tokyo.\"In the medium-term, we remain bearish on the dollar. Dollar assets look expensive.\"Speculators in the FX market are extremely bearish on the dollar, U.S. Commodity Futures Trading Commission data released on Friday showed.The dollar index  was little changed at 90.514 in early Asian trading, having risen as high as 90.73 overnight for the first time since Dec. 21. It dipped to 89.206 on Jan. 6, a level not seen since March 2018.The greenback slipped 0.1% to 104.175 yen, after rising to a one-month high of 104.40 on Monday.The euro was largely steady at $1.2151 after slipping to 1.21320 in the previous session for the first time since Dec. 21.Meanwhile, bitcoin was trading below $35,000 as its red-hot rally has faltered since it soared to an all-time high of $42,000 on Jan. 8. read more ========================================================Currency bid prices at 9:40AM (040 GMT)All spots Tokyo spots Europe spots Volatilities Tokyo Forex market info from BOJ "}