{"text": "NEW YORK The dollar fell from a one-week high on Wednesday, as political squabbling over a stimulus package for the U.S. economy halted its recent rebound.The greenback, however, rose to a three-week peak against the yen, climbing for a fourth straight session. The dollar/yen pair typically moves in tandem with U.S. Treasury yields, with the 10-year advancing to a one-month high earlier in the session.Stronger-than-expected U.S. CPI numbers, meanwhile, briefly lifted the dollar against a basket of currencies.Data showed the U.S. consumer price index rose 0.6% last month after rebounding 0.6% in June. Excluding the volatile food and energy components, the CPI jumped 0.6% last month. That was the largest gain since January 1991 and followed a 0.2% rise in June.But the markets focus was on the U.S. stimulus package. Investors are watching for signs a political impasse in Washington over a further rescue package for the pandemic-hit economy can be overcome.U.S. Treasury Secretary Steven Mnuchin said on Wednesday the White House and top Democrats in Congress may not be able to reach a deal on coronavirus aid, in the fifth day without talks, with the stalemate blocking relief to tens of millions of Americans.U.S. House of Representatives Speaker Nancy Pelosi described the two sides as miles apart with a chasm between them.Certainly that (stalemate) has weighed on growth prospects for the U.S., said Karl Schamotta, chief market strategist at Cambridge Global Payments in Toronto. Markets have had to downgrade expectations with respect to the size of the stimulus package that will be hammered out.In afternoon trading, the dollar index, which has held above a two-year low hit last Thursday, was down 0.3% against a basket of currencies at 93.418 , after shedding gains made in Asian trading.Against the yen, the dollar rose 0.4% to 106.86 yen.Improved U.S. debt yields have pressured the yen by luring investment from zero-yielding Japan.The euro was up 0.4% at $1.1790. Since the beginning of July, the euro has gained 5.4% versus the dollar.Euro/dollar is clearly following interest rate differentials and on a three-month basis the euro is now trading in positive territory relative to the dollar, if you look at the cross-currency basis swap, said Cambridges Schamotta.Sterling was down 0.1% at $1.3028, amid data showing the British economy had entered a deep recession, as signs of a recovery in June provided some support for the currency.The New Zealand dollar was flat at US$0.6576, after the countrys central bank held rates, but surprised markets by extending its bond-buying program and putting slightly more emphasis on the possibility of negative rates."}