{"text": "LONDON The dollar slipped on Monday towards a three-week low as Treasury yields traded near recent lows and traders awaited crucial U.S. inflation and retail sales data in coming days.Elsewhere, it was a quiet start to a data-heavy week for foreign exchange markets. The euro climbed back above $1.19 while the British pound rebounded from a two-month low.The dollars performance has been tied to U.S. Treasury yields for most of 2021, after concern about rising inflation in the United States and a stimulus-fuelled economic rebound triggered a jump in Treasury yields in February.A fall in U.S. yields last week triggered the worst week for the dollar in 2021. With yields inching lower on Monday, it was back under pressure.Federal Reserve Chairman Jerome Powell said in a U.S. media interview released on Sunday that the U.S. economy was at an inflection point and looked set for a strong rebound in the coming months, but he also warned of risks stemming from a hasty re-opening.Investors are now waiting for U.S. March inflation data due on Tuesday.We are set to see the first evidence of the much anticipated surge in inflation that is widely expected through the coming months as base effects from a year ago begin to take effect as the sharp declines post-COVID start to fall out of the annual calculations, MUFG analysts said.They said the dollars fortunes could well remain linked to 10-year yields.The benchmark 10-year Treasury yield was at 1.664% after dropping to as low as 1.6170% last week. It had surged to a more than a one-year high of 1.7760% on March 30.The dollar index, which measures the U.S. currency against a basket of currencies, weakened 0.2% to 92.03. The euro initially dropped but later recovered and was up 0.1% to $1.1915.Bitcoin traded above $60,000, closing the gap to its record high.Against the pound the dollar initially gained before reversing course. The British currency was last up 0.5% at $1.3763 after briefly touching a two-month low of $1.3669 as traders cheered the latest phase of the governments economic re-opening plan.The dollar fell 0.3% to 109.33 yen versus the Japanese currency.U.S. dollar net short positions have fallen to their lowest in nearly three years, according to data published on Friday.ING analysts noted that speculators had cut their net short dollar positions for the 12th consecutive week, which could prove a headwind for further dollar gains.At this stage, the dollar has lost all its positioning advantage, having a neutral speculative positioning, which suggests we should no longer see dollar rallies against most G10 currencies exacerbated by the unwinding of USD shorts, they wrote."}