{"text": "NEW YORK The dollar held steady on Thursday as investors were cautious over expectations about a COVID-19 vaccine that is unlikely to avert a grim winter in the United States and Europe as the pandemics latest wave intensifies.The dollar index was up 0.01% in New York, after having rebounded a little in London from lows during Asia trading.The latest U.S. weekly jobless claims report did not budge the dollar when it came out on Thursday morning. The report showed the pace of decline in claims had slowed to 709,000 compared with 757,000 the prior week and forecasts for 735,000 claims.The markets found no new direction from assorted comments by central bankers from the U.S., Europe and Britain at mid-day on a panel. They welcomed the encouraging results in vaccine trials but stressed that the economic outlook remains uncertain.There is a nervous calm in the capital markets today, said Marc Chandler, chief market strategist at Bannockburn Global Forex.While prices are not charting a new direction, nervousness stems from the outlook for the coronavirus pandemic, central banks future interest rate policies and the transition from last weeks U.S. presidential elections, Chandler said.The questions come amid possibly shifting views about the U.S. dollars role as a safe haven or as a ticket to gains from a strengthening global economy, he said.U.S. Treasury yields slumped, in line with Europe, weighed down by the rise in coronavirus cases around the world and data showing inflation going nowhere in the United States. In early afternoon trading, U.S. benchmark 10-year yields were down from earlier this week to 0.885% but still up from Fridays 0.82%.The euro is trying to find its feet after the vaccine-related storm of activity at the start of the week, and after the U.S. election news, said Jane Foley, head of FX strategy at Rabobank.The euro, Chandler noted, has been trading between $1.16 and $1.20 since late July. Being in the middle of a range makes nobody happy. Bulls nor bears can be happy, he said.Europe is grappling with surging infections and new COVID-19 restrictions, with Germanys economic advisers trimming next years growth outlook. In the United States, cases continue to hit record levels.The dollars strength in the past week has for now put the brakes on a long drop for the greenback, which had shed about 10% against a basket of currencies between March and the announcement of progress on Pfizer Incs COVID-19 vaccine on Monday.Along with the virus, Republican U.S. President Donald Trumps refusal to concede defeat to Democrat Joe Biden in last weeks election is also beginning to jangle investors nerves.The Canadian currency should do well in coming months, Erik Nelson of Wells Fargo Securities wrote on Thursday. In its favor, Nelson said, is an economy that is on relatively stable footing. And, it should benefit from higher oil prices supported by vaccine hopes."}