{"text": "The dollar dipped slightly on Monday as traders awaited highly anticipated U.S. inflation and retail sales data in coming days, and as the Treasury Department saw solid demand for new sales of three-year and 10-year notes.The dollar has rebounded this year as U.S. Treasury yields rise on expectations of faster economic growth and higher inflation.U.S. consumer price data for March due on Tuesday is a major economic focus. Investors are betting that price pressures will increase due to increased fiscal and monetary stimulus and as businesses reopen from COVID-19 related closures.Comparisons with last year are also likely to be strong, due to a drop in inflation a year ago when businesses closed due to the spread of the virus.\"With U.S. data expected to come in strong this week, we believe the dollars rise can continue,\" analysts at Brown Brothers Harriman said in a report on Monday.Retail sales data for March is due on Thursday.The dollar index  fell 0.04% against a basket of currencies to 92.164. It is holding above a three-week low of 91.995 reached on Thursday.The euro  was little changed on the day at $1.1900.Treasury yields dipped from session highs but were higher on the day before the Treasury will sell 30-year bonds on Tuesday, and after Monday's auctions saw good demand.Federal Reserve Chairman Jerome Powell said on Sunday that the U.S. economy was at \"an inflection point\" and looked set for a strong rebound in the coming months, but he also warned of risks stemming from a hasty reopening.  read more Boston Fed President Eric Rosengren also said on Monday that the U.S. economy could see a significant rebound this year thanks to accommodative monetary and fiscal policy, though the labor market still has much room for improvement. Bitcoin  chopped around the $60,000 level on Monday and is holding just below a record high of $61,782 reached last month.Sterling  rose 0.22% to $1.3724 as traders cheered the latest phase of the British government's economic reopening plan.The dollar fell 0.19% to 109.44 yen  versus the Japanese currency.U.S. dollar net short positions have fallen to their lowest in nearly three years, according to data published on Friday. ING analysts noted that speculators had cut their net short dollar positions for the 12th consecutive week, which could prove a headwind for further dollar gains.\"At this stage, the dollar has lost all its positioning 'advantage,' having a neutral speculative positioning, which suggests we should no longer see dollar rallies against most G10 currencies exacerbated by the unwinding of USD shorts,\" they wrote.========================================================Currency bid prices at 3:19PM (1919 GMT)"}