{"text": "The dollar headed for its first losing week in three as new signs of weakness in the U.S. jobs market dented investor expectations about the pace of a pandemic recovery.Bitcoin was on course for its best week since the start of the year after surging to a fresh record near $49,000 following news Thursday that BNY Mellon had become the latest firm to embrace cryptocurrencies.  read more The dollar remained on the back foot on Friday, pinned near two-week lows, after the release of weaker-than-expected weekly U.S. jobless claims data the previous day.  read more That added to recent concerns that the dollar's previous rally had priced in too fast a pace of rebound for the U.S. economy.The dollar index  was little changed at 90.423 in holiday-thinned trade due to Chinese new year, on track to fall 0.6% in a week that took it to the lowest since Jan. 27 at 90.249.There has been a divergence in views among traders this year over just how U.S. President Joe Biden's planned $1.9 trillion fiscal stimulus package will affect the dollar.Some see it as bolstering the currency as it should speed a U.S. recovery relative to other countries, while others view it is a major driver in a global reflation narrative that should lift riskier assets at the dollar's expense.\"The U.S. economy will outperform most thanks to fiscal stimulus and faster vaccine deployment, but ongoing reflationary fiscal and monetary policy will leave DXY on a sustained medium term bear trend,\" Westpac strategists wrote of the dollar index in a client note.The euro  was little changed at $1.21275, consolidating for a third day near that level as it headed for a 0.6% weekly advance.The dollar was mostly flat at 104.77 yen , down 0.6% from the end of last week.Bitcoin  surged toward a 23% weekly advance, its biggest since the period ended Jan. 3, after hitting a new record high of $48.696.84 on Thursday.========================================================Currency bid prices at 2341 GMTAll spots Tokyo spots Europe spots Volatilities Tokyo Forex market info from BOJ "}