{"text": "NEW YORK The U.S. dollar rose against the safe-haven Japanese yen and Swiss franc on Friday as stocks on Wall Street rallied from their worst one-day performance in three months, while the euro dropped against the greenback, erasing early gains.The yen fell against the dollar for the first time in five sessions, while the Swiss franc declined, as Wall Street rallied to claw back some of the sharp losses suffered in the prior session.Going into next week, investors are bracing for a number of key events, including discussions on the European Union recovery fund, Brexit negotiations, Bank of England and Swedish National Bank meetings. Federal Reserve Chair Jerome Powells semi-annual testimony to the Senate banking committee is also scheduled next week.There has been a paring back of bearish bets on the dollar, said Joe Manimbo, senior market analyst, at Western Union Business Solutions in Washington.The Fed catalyzed that with its cautious outlook this week and now the market is looking ahead to next week where it will be really full of Fed speak, especially the Fed chairman testifying on Capitol Hill so Fed caution back at the forefront, that has helped the dollar stabilize.Hopes of a post-COVID global recovery, the easing of U.S.-China trade tensions and the prospect of capped long-term yields in the United States had weighed on the dollar, pushing it lower against most major currencies, before it strengthened.In afternoon trading, the dollar rose 0.6% against the yen to 107.455 yen. That said, the dollar still posted its worst weekly performance against the yen since late March.Against the Swiss franc, the dollar surged 1.2% to 0.9551 franc.The euro fell 0.6% to $1.1228 , sliding from $1.1422, the three-month high it reached on Wednesday.The dollar index, meanwhile, climbed 0.5% to 97.33, after earlier hitting a one-week high.The British pound weakened on data showing Britains economy shrank by a record 20.4% in April from March as the country spent the month in a tight coronavirus lockdown. Investors saw the number as likely the bottom of the crash before what is expected to be a long and slow recovery.Sterling was last down 0.9% at $1.2487 and was slightly lower versus the euro. In the afternoon session, the euro rose 0.2% to 89.92 pence.The dollar showed little reaction to U.S. economic data on import prices and consumer sentiment released on Friday."}