{"text": "The dollar languished near 2-1/2-week lows against major peers on Monday as a decline in Treasury yields restrained the U.S. currency.Both the greenback and bond yields are taking something of a breather after scaling multi-month peaks at the end of last month, powered by bets that an accelerating U.S. recovery from the pandemic will lift inflation faster than Federal Reserve policymakers anticipate.While the Fed's repeated insistence that near-term price pressures will prove transitory has somewhat soothed investors, the dollar firmed on Friday following stronger-than-expected producer price data, taking the edge off the currency's worst week this year.The dollar index , which tracks the greenback against a basket of six rivals, was little changed at 92.193 early in the Asian session, following a 0.9% slump last week. It dipped below 92 on Thursday for the first time since March 23.The benchmark 10-year Treasury yield  was at 1.6745% after dropping as low as 1.6170% last week. It had surged to a more than one-year high of 1.7760% on March 30.\"Key for the near-term outlook will be whether yields continue to consolidate around these levels, or march higher,\" which would support the dollar, National Australia Bank strategist Tapas Strickland wrote in a client note.\"The broader thematic of a rapid rebound in the U.S. economy on the back of an impressive vaccine rollout continues.\"Data on Friday showed the largest annual gain in 9-1/2 years for U.S. producer prices, backing expectations for higher inflation as the economy reopens amid an improved public health environment and massive government funding.  read more U.S. consumer price data will be released Tuesday.Fed Chair Jerome Powell speaks on Wednesday at the Economic Club of Washington. In an interview on Sunday on CBS's \"60 Minutes,\" Powell said the U.S. economy is at an \"inflection point\" with expectations that growth and hiring will pick up speed in the months ahead, but he also warned of risks stemming from a hasty reopening.  read more Against the euro , the dollar hovered near the lowest since March 23 at $1.1901. It bought 109.66 yen , close to  a two-week low below 109 reached on Thursday.\"USD has some upside potential this week,\" Commonwealth Bank of Australia strategist Kimberley Mundy wrote in a report.\"Strong U.S. economic data will highlight the divergence between the U.S.s fast economic recovery and the more stunted recoveries in other developed economies.\"The dollar can lift back toward 110 yen, while the euro has scope to retrace most of that recent gains from its almost five-month low near $1.17, she said.In cryptocurrencies, bitcoin  traded near $60,000 after rising as high as $61,222.22 over the weekend, closing the gap to the record peak of $61,781.83 set one month ago. ========================================================Currency bid prices at 050 GMTAll spotsTokyo spotsEurope spotsVolatilitiesTokyo Forex market info from BOJ"}