{"text": "NEW YORK The U.S. dollar slipped against a basket of currencies on Tuesday, as its recent rally, driven by a spike in U.S. Treasury yields, appeared to run out of steam.Traders in the forex market exhibited a strong appetite for riskier currencies such as the Australian and the New Zealand dollars, putting pressure on the safe-haven U.S. currency.The dollar had hit a more than 2-1/2-year low in January after sliding for months as the U.S. Federal Reserves interest rate cuts and strong investor demand for riskier assets has sapped demand for the safe-haven U.S. currency.The dollar index, which measures the greenback against a basket of currencies, was 0.44% lower at 90.074. It was the first daily decline for the index in four sessions.New lockdown measures across Europe to fight a second COVID-19 wave are feeding worries of a double-dip recession, in the region, said Minh Trang, senior FX trader at Silicon Valley Bank.That, combined with the rise in U.S. yields, has helped boost the dollar in recent days, said Trang.U.S. Treasury yields traded lower on Tuesday as strong demand for the Treasury Departments $38 billion sale of benchmark 10-year notes had traders covering short positions, which reversed an early rise in yields.The support from rising yields has so far trumped worries that the extra spending in the United States could trigger a faster rise in inflation. But many analysts expect the dollar to resume its decline as stimulus spending and vaccine rollouts brighten the global economic outlook.Most emerging market currencies rose on Tuesday, including the offshore yuan, Mexican peso and South African rand.With risk sentiment improving, riskier developed market currencies advanced with the Australian dollar rising 1% and New Zealand dollar gaining 0.9%.Sterling jumped against the euro and the dollar on Tuesday as comments from the Bank of Englands governor on the viability of negative interest rates dampened some expectations of sub-zero rates in Britain.Bitcoin was down about 3% at $34,384, a day after it fell 7% in a highly volatile session. The cryptocurrencys rally has faltered since it soared to a record high of $42,000 on Jan. 8, and it was on pace for it fourth straight session of losses."}