{"text": "The U.S. dollar climbed from a near one-week low on Friday as bond yields inched higher, but it looked set for its first weekly fall in three against a basket of its major rivals as riskier currencies drew support from calmer market sentiment.    The dollar index against six major currencies rose 0.2% to 91.58  after hitting 91.364 overnight for the first time since March 4. It has dropped around 0.6% this week, retreating from a more-than-three-month high reached on Tuesday.The euro  traded at about $1.1965, holding firm  after the European Central Bank, as widely expected, said on Thursday it would accelerate its emergency bond purchases over the next quarter.  read more     The dollar index has firmed more than 1.6% this year as it tracked benchmark 10-year Treasury yields  from below 1% to as high as 1.625% at the end of last week. On Friday, the yield stood at around 1.55%.Focus next week will be on the U.S. Federal Reserve's policy meeting after Chair Jerome Powell refrained from raising concerns about higher bond yields earlier this month.\"The real dollar story still awaits the Fed to play its card,\" said Stephen Innes, chief global markets strategist at Axi.\"Will the Fed continue to walk the dovish talk? Or will it walk back from its dovish commitments when and if it becomes clear that the fiscal- and vaccine-led recovery is kicking into full gear? It is the line that separates the dollar bulls from bears over the next 6-to-12 months.\"The safe-harbour Swiss franc  eased to 0.9267 against the dollar after sliding to over a seven-month low earlier this week, while the yen  fell 0.2% to 108.71.The Bank of Japan may tweak a three-tier deposit system at next week's policy review to exempt a larger portion of reserves from negative interest rates, sources told Reuters. [nL1N2L93FL]The commodity-linked Australian and New Zealand dollars retreated from near one-week highs, but were still on track to post their first weekly gains in three as improving economic data lifted metals prices.The Aussie  traded at $0.77780 after hitting its highest since March 4 overnight. New Zealand's kiwi  changed hands at $0.7215 having climbed to near a one-week high of $0.7240 overnight.The oil-linked Canadian dollar  was slightly lower at C$1.25 after rising for three straight sessions.Cryptocurrency bitcoin  last traded at $57,150.49, up more than 12% for the week. It topped $58,000 earlier on Friday, approaching a record high of $58,354.14 hit on Feb. 21. ========================================================Currency bid prices at 0403 GMTAll spots Tokyo spots Europe spots Volatilities Tokyo Forex market info from BOJ "}