{"text": "New York The dollar index was little changed near three-week lows on Monday as optimism over the possibility of a COVID-19 relief bill was curbed by concern over the pandemic, while Chinas yuan fell after the Peoples Bank of China (PBOC) changed its reserve requirements policy.On Sunday, the Trump administration called on Congress to pass a stripped-down coronavirus relief bill using leftover funds from an expired small-business loan program, as negotiations on a broader package continue to run into roadblocks. A White House spokeswoman said on Monday that Senate Republicans will go along with what Trump wants in legislation.The greenback has held within a range of about 2% over the past three weeks as talks have gone back and forth. The dollar had its biggest loss in six weeks on Friday amid rising hopes a fiscal stimulus package would be agreed to stem the economic fallout from COVID-19. More stimulus is seen as negative for the dollar.The dollar just retains this soft underbelly on expectations that sooner or later there will be some stimulus out of Washington, said Joe Manimbo, senior market analyst at Western Union Business Solutions in Washington DC.At the same time, if you look at some of the election developments, the polls are trending in a way that is reducing worries about a contested outcome, that is more risk positive and therefore dollar negative.Opinion polls show Biden with a substantial lead nationally, but the advantage is smaller in some of the states that may decide the election outcome.The offshore yuan fell 0.76% against the dollar after Chinas central bank said on Saturday it would lower the reserve requirement ratio for financial institutions when conducting some foreign exchange forwards trading, a move seen as a bid to curb recent yuan appreciation.The yuan had reached a more than 17-month high on Friday in offshore trade and has gained nearly 8% against the dollar since late May. But on Monday the offshore yuan was on track for its biggest daily decline against the dollar since March.The PBOCs move to end the requirement for banks to set aside cash to cover yuan forward transactions would make it easier to short the yuan, said RBCs head of Asia FX, Alvin Tan.The move was also cited by analysts as a reason for weakness in the China-sensitive Australian dollar, which was down about 0.4%.The dollar index fell 0.059%.The euro was down 0.18% to $1.18105. In Europe, the World Health Organization has urged governments to restrict activity to combat a rapid rise in COVID-19 infections.The Japanese yen weakened 0.24% versus the greenback at 105.36 per dollar after Bank of Japan Governor Haruhiko Kuroda stressed his readiness to take additional monetary easing steps.The pound held above $1.30, strengthening after Prime Minister Boris Johnson set out on Monday a three-tier system of local lockdown measures in England. Sterling was last trading at $1.3065, up 0.15% on the day."}