{"text": "The U.S. dollar was higher on Wednesday, though well within recent ranges, after inflation data showed a surge in consumer prices in April.The dollar index , which measures the U.S. currency against a basket of rivals, was last up 0.61% on the day to 90.760. But the move on Wednesday was relatively muted despite the big jump in April inflation - up 4.2% year over year, the fastest rise since 2008.Rising prices typically strengthen the dollar because the market believes the Federal Reserve will raise interest rates to quell inflation. But the reaction in the currency market was fairly contained because Fed Chair Jerome Powell has pledged to keep rates anchored while also allowing inflation to run higher for a period.\"It's not a huge move. The dollar has basically been weakening since May of last year, ever since the pandemic. The move today only puts us back to where we were a few weeks ago,\" said Randy Frederick, vice president of trading and derivatives, Schwab Center for Financial Research.Still, interest rate expectations have been pulled forward slightly - the eurodollar is now fully pricing in a Fed hike between March and June of 2023. There is an 80% chance of a hike in December 2022.The Labor Department report on Wednesday showed U.S. consumer prices increased more than expected as booming demand in the reopening economy pushed against supply constraints. The consumer price index jumped 0.8% last month versus the 0.2% forecast by economists polled by Reuters.  read more The Fed has argued that while inflation is rising, it is likely temporary and will dip again by the end of the year.\"A lot of this near-term inflation is the result of all sorts of strange anomalies that have been created by the pandemic,\" said Frederick.Mazen Issa, senior foreign exchange strategist at TD Securities, said that in addition to base-year effects, which Issa believes will peak in May, \"The surge in prices you see in the CPI report are also a reflection of reopening pressures. Those should be transitory in nature. The old adage of - one data point doesn't make a trend - applies here.\"The rising dollar left the euro  0.60% weaker at $1.208. The single currency on Tuesday had hit a 2-1/2 month high. The Japanese yen  was 0.87% weaker on the day at 109.58 and the British pound  was down 0.60% to $1.406.In the digital space, cryptocurrency ether  was last down 2.72%, having backed off a record level of $4,380.64 set earlier in the day."}