{"text": "The dollar headed for its first losing week in three as new signs of weakness in the U.S. jobs market dented investor expectations about the pace of economic recovery from the  pandemic.Bitcoin hit a new all-time high of $49,000 on Friday after BNY Mellon became the latest firm to embrace cryptocurrencies, saying it will form a new unit to help clients hold, transfer and issue digital assets.  read more \"With names like BONY getting in, its going to lay the groundwork for even more mainstream adoption of bitcoin,\" said Jeffrey Wang, head of Americas at crypto finance service provider Amber Group.\"Medium term, the momentum is very strong and the market is going to want to test $50,000.\"The dollar remained on the back foot on Friday in Asia, pinned near two-week lows, after the release of weaker-than-expected weekly U.S. jobless claims data the previous day.  read more That added to recent concerns that the dollar's previous rally had priced in too fast a pace of rebound for the U.S. economy.The dollar index  edged up less than 0.1% to 90.49 in holiday-thinned trade due to the Lunar New Year, and was on track to fall 0.6% for the week.There has been a divergence in views among traders this year over just how U.S. President Joe Biden's planned $1.9 trillion fiscal stimulus package will affect the dollar.Some see it as bolstering the currency as it should speed a U.S. recovery relative to other countries, while others reckoned it would feed a global reflation narrative that should lift riskier assets at the dollar's expense.\"The U.S. economy will outperform most thanks to fiscal stimulus and faster vaccine deployment, but ongoing reflationary fiscal and monetary policy will leave DXY on a sustained medium term bear trend,\" Westpac strategists wrote of the dollar index in a client note.The euro  slipped less than 0.1% to $1.2122, consolidating for a third day near that level as it headed for a 0.6% weekly advance.The dollar was mostly flat at 104.795 yen , down 0.5% from the end of last week.Bitcoin  last traded 1.7% weaker at $47,170 after trading at a record high of exactly $49,000.00 on Bitstamp.The world's most popular cryptocurrency is on course for a nearly 22% weekly advance, its biggest since the period ended Jan. 3.========================================================Currency bid prices at 2:11PM (511 GMT)All spots Tokyo spots Europe spots Volatilities Tokyo Forex market info from BOJ "}