{"text": "The U.S. dollar held its recent gains on Tuesday after a spike in U.S. Treasury yields lifted demand for the U.S. currency.The dollar has been one of the biggest losers in the past 10 months as ultra-dovish policy from the Federal Reserve encouraged investors to dump the currency for alternative currencies. It hit more than two-and-a-half-year lows versus the euro earlier this month.But expectations for a wave of spending under an incoming Joe Biden administration have pushed Treasury yields higher, with the 10-year yield reaching a 10-month high on Tuesday.Not only have markets brought forward bets on Fed interest rate increases to 2023, many also reckon it could start withdrawing -- or tapering -- asset purchases earlier. They got no relief from Fed officials, with Atlanta Fed President Raphael Bostic declaring himself \"open\" to tapering in late 2021.The dollar index, which measures it against a basket of currencies, was last at 90.489 , unchanged on the day. It has bounced off lows of 89.206 clocked up last week. Against the euro, the dollar stood still at $1.2153 .The support from rising yields has so far trumped worries that the extra spending could trigger faster inflation. But many analysts expect the dollar to resume its decline as stimulus spending and vaccine rollouts brighten the global economic outlook.ING analysts said several Fed officials due to speak later on Tuesday were likely to pour cold water on any suggestion of slowing monetary stimulus support.\"Any policy-related comments should  in our view  go in the direction of ruling out any unwinding of monetary stimulus in the foreseeable future,\" they said. \"With the Feds rate expectations firmly at the bottom, any further rise in US yields will remain a function of rising inflation expectations or term premium, which leaves us confident on our bearish-dollar call.\"Osamu Takashima, head of G10 FX strategy at Citigroup Global Markets Japan in Tokyo, said that he remained bearish on the dollar, with dollar assets looking \"expensive\".Elsewhere, with equity markets back in a bullish mood, riskier currencies such as the Australian and New Zealand dollars rose. Both gained about 0.3% <AUD=D3 .Bitcoin  stabilised at $36,500 after Monday's huge drop. The world's biggest cryptocurrency's rally has faltered since it soared to a record high of $42,000 on Jan. 8. "}