{"text": "When the U.S. government began shipping COVID-19 vaccines in December, state health providers could not administer shots fast enough to keep pace with deliveries and millions of doses sat waiting for arms.Two months later, the situation has reversed. Supply constraints are slowing ambitious vaccination programs, as massive sites capable of putting shots into thousands of arms daily in states including New York, California, Florida and Texas, as well as hospitals and pharmacies, beg for more doses.Nearly a dozen state and local officials told Reuters they could vaccinate up to four times more people, but federal vaccine shipments remain frustratingly small.Two months into the vaccine rollout, most states have received enough doses to vaccinate fewer than 10% of their residents. With deliveries based on population, most states receive fewer than a 100,000 doses per week of the Pfizer Inc/BioNTech SE and Moderna Inc vaccines that both require two shots.States and localities have gotten themselves together ... and they can handle a lot more doses, said Claire Hannan, director of the Association of Immunization Managers, a trade group for local public health departments. They just need more supply.Health officials say the stakes are higher than ever as more contagious variants of the coronavirus spread.The Biden administration has said it will continue to increase dose allocations and remains on track to make shots available to all Americans by late summer.Despite the frustration, the United States is a global leader in vaccinations, with around 66 million doses shipped and nearly 45 million shots administered.SLOW RAMP UPWeekly dose shipments have increased to 11 million from 8.6 million since Biden took control of the White House Jan. 20, and may increase to around 13 million by the end of the month. Officials said they cannot project out more than three weeks but are working to improve supply visibility.At that pace, the administration could hit its goal of distributing 100 million shots in its first 100 days nearly a month ahead of schedule, and hit a target of 150 million shots without any increase in weekly dose allocations.Some experts said the United States has the potential to distribute 220 million doses or more by the end of March. Pfizer and Moderna have contracts to deliver those shots, and a third vaccine from Johnson & Johnson could be authorized by the end of this month or early March.Biden promised to help states ramp up vaccinations with an assist from the military and government agencies after his predecessor largely left them to their own devices.Federal data shows that vaccines shipped have consistently exceeded shots given by around 20 million doses for over a month. White House officials said the discrepancy was largely due to states holding back doses to ensure people get their second shot on schedule.The Biden administration has helped set up two mass vaccination sites in California and is urging Congress to provide funds for more. It has also started shipping vaccines directly to 6,500 pharmacies around the country and will launch a similar program next week with community health centers.WISH WE COULD DO MOREState and local officials told Reuters what is holding them back now is not lack of distribution sites but dose shortages.States and counties have set up dozens of mass vaccination centers  publicly-operated facilities that can give shots to 1,000 or more people per day  mostly near major cities such as Boston, Los Angeles and New York, according to state officials and a review of public information.One county official said he recently helped open two mass vaccination centers near Seattle that could boost daily inoculations from about 1,000 per day to as much as 6,000, if only they had more vaccine.All of our sites are hampered by a lack of vaccines, said Mark Del Beccaro, assistant deputy chief of coronavirus testing and immunization programs for King County, where Seattle is located.Some local officials said they need federal funding to maintain vaccination capabilities. King County currently only has funding to keep sites going through March, Del Beccaro said.Hospitals and pharmacies are facing similar constraints, according to officials from half a dozen states.I wish we could do more, said Steve Hoffart, owner of Magnolia Pharmacy outside Houston, adding that he has not received vaccine shipments since January.Hoffart said he fields some 15 emails a day from people seeking shots. I try to keep patients hopeful."}