{"text": "U.S. stocks climbed on Monday as investors looked to Washington to unveil more fiscal stimulus to aid the economy and hoped that Wall Streets largest banks would post decent quarterly earnings later this week.Optimism that more U.S. stimulus was in the offing came in spite of indications that talks in Washington had stalled again, leading the Trump administration to call on Congress to pass a less ambitious coronavirus relief bill.U.S. President Donald Trump on Friday had offered a $1.8 trillion coronavirus relief package after urging his team on Twitter to go big in negotiations with the Democrats to reach a deal.Edward Moya, a senior market analyst at OANDA, a currency broker, said despite the uncertainty of stimulus negotiations, investors were hopeful that banks would announce earnings that suggest the economy is not faring as badly as some feared.If the consumer is not as weak as we thought, we might still have decent holiday spending, Moya said.The S&P 500 rose 36 points, or 1.05%, to 3,513.26, while the Dow Jones Industrial Average rose 179 points, or 0.63%, to 28,763.12. The Nasdaq Composite added 177 points, or 1.53%, to 11,760.87.Global stocks had hit five-week highs on Monday led by Chinas post-holiday surge as investors bet on a steady recovery for the worlds No. 2 economy, while hopes for stimulus offset worries about rising COVID-19 cases in Europe.MSCIs gauge of stocks across the globe climbed 1.09% to 590.97, while European stocks rose 0.76% to 373.16.The U.S. dollar was sluggish after suffering its biggest loss in six weeks on Friday, buffeted by the on-again, off-again stimulus talks. [USD/] The U.S. dollar index was down 0.05% at 93.069.The Chinese yuan was off 0.8%, on track for its worst single day drop since March, hitting the China-sensitive Australian dollar.The Peoples Bank of China has scrapped a requirement for banks to hold a reserve of yuan forward contracts, removing a guard against depreciation.The euro edged 0.1% lower to $1.1814 and the yen firmed to 105.27 per dollar.Gold, which zoomed higher last week on a weaker dollar and hopes of more U.S. stimulus, paused its ascent on Monday. It was down 0.3% at $1,923.56 per ounce.Oil prices also slipped after a force majeure at Libyas largest oilfield lifted, a Norwegian strike affecting production ended and U.S. producers began restoring output after Hurricane Delta.Brent crude fell $1.09, or 2.5%, to $41.76 a barrel and U.S. West Texas Intermediate was down $1.15, or 2.8%, at $39.45.JPMorgan and Citigroup will kick off the third-quarter earnings season on Tuesday, followed by Goldman Sachs, Bank of America and Wells Fargo on Wednesday and Morgan Stanley on Thursday.Analyst data from Refinitiv showed Citigroup and Wells Fargo could report that net income has slid 60%, while JPMorgan and Bank of America are expected to post drops of 30%. Investment banks Goldman Sachs Group Inc and Morgan Stanley are expected to do better by announcing more modest declines of between 5% and 10%.The U.S. bond market is closed on Monday for Columbus Day."}