{"text": "FRANKFURT European Central Bank policymakers sparred over the impact of a $1.9 trillion euro U.S. pandemic relief bill on the euro zone economy and the broader outlook for the bloc when they met this week and increased the pace of stimulus, five sources told Reuters.The ECB decided on Thursday to accelerate money-printing to keep a lid on euro zone borrowing costs, signalling to sceptical markets that it is determined to lay the foundation for a solid economic recovery.But the meeting was fractious, particularly at Wednesdays informal session, the sources said, with governors from richer and manufacturing-heavy countries striking a decisively more optimistic tone on the prospect for vaccines and the economys ability to adapt.A major topic of discussion was the likely impact of the largest economic stimulus measures in American history, for which President Joe Biden secured final approval on Wednesday, on the euro zone economy.Some policymakers warned that a wave of direct payments to American households was likely to push up inflation expectations and bond yields in the worlds largest economy, dragging up euro zone borrowing costs in its wake, the sources said.This, combined with the comparatively smaller and slower Next Generation package agreed by the European Union, meant that the euro zone risked falling further behind the U.S. recovery and the ECB should step on the accelerator.Biden just came in, the bill has already passed, and the checks going to be in the mail next week, one source said. Look at us in the meantime. Weve been talking for a year and still nothing will be paid out until maybe October.An ECB spokesman declined to comment.But more conservative policymakers argued that greater disposable income for U.S. families would translate into larger spending on euro zone imports, benefiting the euro zone economy and lessening the need for ECB largesse.The U.S. stimulus package had not yet been approved when the ECB finalised its economic forecasts, which put economic growth and inflation this year at 4% and 1.5%, respectively.But it is expected to supercharge the U.S. economic recovery, with $400 billion for direct payments to most Americans, $350 billion in aid to state and local governments, among other measures.Policy hawks also took a more optimistic view on the blocs growth profile, arguing that the economy had adjusted better to lockdowns than many estimate and that its rebound will be rapid once curbs are lifted.So far only nine EU countries have ratified the European Unions 750 billion fiscal support package in their national parliaments, and the first payouts are unlikely before July at the earliest or, more likely, after the summer break."}