{"text": "PRAGUE Chinas global economic power makes the communist country in some ways a more difficult foe to counter than the Soviet Union during the Cold War, U.S. Secretary of State Mike Pompeo said on a visit to the Czech Republic on Wednesday.Pompeo called on countries around Europe to rally against the Chinese Communist Party (CCP), which he said leverages its economic might to exert its influence around the world.Whats happening now isnt Cold War 2.0, Pompeo said in a speech to the Czech Senate. The challenge of resisting the CCP threat is in some ways much more difficult.The CCP is already enmeshed in our economies, in our politics, in our societies in ways the Soviet Union never was.The Cold War reference came after Chinas ambassador to London last month warned that the United States was picking a fight with Beijing ahead of the U.S. presidential election in November.U.S.-China ties have quickly deteriorated this year over a range of issues including Beijings handling of the coronavirus; telecoms-equipment maker Huawei; Chinas territorial claims in the South China Sea; and the clampdown on Hong Kong.Pompeos visit to the Czech Republic, part of the Soviet bloc until the 1989 democratic Velvet Revolution, marked the first stop on a swing through the region to discuss cyber and energy security.He used the occasion to swipe at both Russian and Chinese influence and lauded officials in the central European nation of 10.7 million who took on Beijing over the past year.He cited the Czech Republics efforts to set security standards for the development of 5G telecommunications networks after a government watchdog warned about using equipment made by Chinas Huawei.Pompeo and Prime Minister Andrej Babis signed a declaration on 5G security in May, but the country has not made an outright decision to ban Huawei technology. Its President Milos Zeman has been promoting closer ties with China.Pompeo also acknowledged the chairman of the Czech Senate Milan Vystrcil, who followed through on a plan by his deceased predecessor to visit Taiwan at the end of this month, a trip that has angered China.Pompeo said some nations in Europe would take longer to wake up to the threats, but there was a positive momentum.The tide has turned (in the United States), just as I see it turned here in Europe as well. The West is winning, dont let anyone tell you about the decline of he West, he said.It will take all of us... here in Prague, in Poland, in Portugal. We have the obligation to speak clearly and plainly to our people, and without fear. We must confront complex questions... and we must do so together, he said."}