{"text": "A deal with the special purpose acquisition company, or SPAC, became a reality when it was able to arrange an additional $525 million from institutional investors like Fidelity Management & Research Company upon the closing of the $240 million acquisition, allowing Nikola to achieve its fundraising goal, he said in a telephone interview.Nikolas SPAC merger has been a catalyst for the industry as electric carmakers and other auto technology startups scramble to lock in the necessary funds to survive and develop their vehicles even as global demand for EVs slowly grows, according to interviews with 20 industry officials.When we embarked on our Series D (fundraising round) we didnt think a year later wed be a public company, but based on the market conditions we pivoted, Brady said. It worked out perfectly for us. We ended up at exactly the same place.Nikola previously had eyed an IPO in late 2021 or even 2022, and if not for the SPAC deal it would likely still be private and slowing product development plans to conserve cash given the freeze in the capital markets caused by the coronavirus pandemic, Brady said.Nikolas success - shares are up more than 320% since the deal was announced - has emboldened other startups to consider a SPAC merger to raise much-needed cash as public market investors chase Tesla-like returns. However, the trend also worries industry executives that some of these deals could fail, casting a pall over the sector.A SPAC is a shell company that raises money through an IPO to buy an operating company, typically within two years.SPACs TO THE RESCUESome of those companies have struggled for many years and now theyre looking at SPACs as a kind of savior, Nikolas Brady said.EV startups Fisker Inc and Lordstown Motors Corp ran into similar problems raising funds privately before cutting SPAC deals to go public, industry officials said.Lordstown turned to a SPAC when efforts to raise $500 million privately froze as COVID-19 spread across America, Lordstown Chief Executive Steve Burns said.We thought wed do the private (financing) and then the more conventional IPO, but COVID kind of messed that up, Burns told Reuters. It went from super-high interest to everybody pushed the pause button.Without his SPAC, Burns would have had to delay plans, which include launching the electric Endurance pickup truck next year at Lordstowns Ohio plant and following that with other trucks and SUVs.Fisker CEO Henrik Fisker said private fundraising in the capital-intensive auto sector was not enough.Ultimately, when youre talking about billions of dollars, you have to go to the public markets, he told Reuters last month.Other EV companies approached by SPACs include electric delivery van startup Arrival, Lucid Motors, EV charging network ChargePoint Inc, Bollinger Motors, Canoo, Karma Automotive and VIA Motors International Inc, according to dealmakers and industry executives.Lucid, which raised $1 billion from Saudi Arabias Public Investment Fund in 2018 and is planning to start production of its first EV in early 2021, intends to go public eventually and doing it with a SPAC is an option, CEO Peter Rawlinson told Reuters.Karmas acting chief financial officer, Leo Lin, said the companys plan has always been to go public and SPACs are one option as it seeks to raise at least $300 million. ChargePoint CEO Pasquale Romano said the company plans ultimately to go public but its fundraising allows time to weigh all options.VIA did not respond to a request for comment and the others declined to comment.Another major factor is private investors get quicker access to their investments through the ability to cash out quickly with a SPAC, in some cases as fast as two or three months later, industry officials said.TESLA ENVYPeople are looking for the next Tesla, said Tony Posawatz, a former GM executive who led the development of the Chevrolet Volt plug-in hybrid car and headed the former Fisker Automotive. He is now a Lucid board member.Others with SPAC deals include Velodyne Lidar Inc, online used-car marketplace Shift Technologies Inc and electric truck powertrain maker Hyliion Inc, and Reuters has reported that electric bus maker Proterra Inc was in talks for such a deal.SPACs are giving these firms access to capital faster than a typical initial public offering, especially in a sector where building a vehicle costs billions of dollars, industry officials said.But companies better move quickly to take advantage, one SPAC executive said. It would behoove companies to try and strike while the irons hot, said the executive, who asked not to be identified. When you have access to capital, take it.Were sitting on what I think is a massive bubble. Theres going to be a bubble pop, said one EV executive who has not taken the SPAC approach to fund raising and asked not to be identified. Its going to put a cloud over the space."}