{"text": "Ellen DeGeneres, one of America's best-known talk show hosts, said on Wednesday she will end her daytime show in 2022, saying that after 19 years it was time to do something different.DeGeneres, 63, told her virtual audience that the show had been \"the greatest experience of my life\" and thanked her fans for watching. But she said she needed \"to take a break from talking.\"\"My instinct told me it's time. As a comedian, I've always understood the importance of timing,\" she said.\"Recently, I had a dream that a bird, a beautiful bird with bright red feathers, came to my window and whispered, 'You can still do stuff on Netflix.' And that was the sign I was looking for,\" she quipped.\"The Ellen DeGeneres Show,\" produced by AT&T Inc's (T.N) Warner Bros and syndicated to TV stations, has won more than 60 Emmy awards.But audiences have fallen in the past six months following an internal inquiry into media reports of a toxic work environment behind the scenes. Three top producers exited the production in 2020, and DeGeneres apologized, promising \"a new chapter.\"She told The Hollywood Reporter on Wednesday that public attacks during that time \"destroyed me\" but did not influence her decision to end the show. That choice, she said, was made when she extended her contract for three years in 2019.DeGeneres started her career in stand-up comedy in her New Orleans hometown before moving to television, starring in the comedy \"Ellen\" in the mid-1990s.In 1997, both she and her TV character came out as a lesbian long before gay people were accepted in mainstream America. \"Ellen\" was canceled a year later, but DeGeneres returned to television in 2003 with her daytime show.An advocate for animals, gay rights and anti-bullying campaigns, DeGeneres became known for promoting kindness and compassion on her light-hearted show.DeGeneres told The Hollywood Reporter that her future plans are uncertain. She said she is open to movie roles and wants to be more involved in environmental conservation efforts.In addition to her talk show, the comedian voiced the forgetful Pacific blue tang fish in the animated movies Finding Nemo and Finding Dory, and twice hosted the annual Oscars ceremony."}