{"text": "    * Brazil's privatization secretary resigns\n    * Do not expect Brazil real to recover until next year -\nanalyst\n    * Mexican central bank policy decision awaited on Thursday\n    * Colombia peso slips as country tops 400,000 coronavirus\ncases\n\n (Updates prices)\n    By Shreyashi Sanyal and Susan Mathew\n    Aug 12 Brazil's real fell on Wednesday, weighed\nby political uncertainty, while currencies of Mexico and Chile\nfirmed as the dollar weakened on a stalemate over U.S.\ncoronavirus relief aid.\n    The real slumped 0.7%. Economy Minister Paulo Guedes\non Tuesday said Brazil's privatization secretary, Salim Mattar,\nhad stepped down, unhappy with the slow pace of privatizations\nso far. Guedes also announced the resignation of the secretary\nfor de-bureaucratization, Paulo Uebel.\n    That brought the number of Guedes' secretaries who have left\nthe government in recent months to four. Last week Guedes had\nannounced that Brazil would announce three or four large\nprivatizations within the next 30-60 days.\n    Data showed Brazil's retail sales ended the first half of\nthe year on a strong footing, surging back to pre-crisis levels\nas the easing of lockdown measures continued.\n    Investors have cheered signs of a recent pick-up in economic\nactivity in Latin America's biggest economy but are now cautious\non the real amid surging COVID-19 cases, a dovish central bank\nand worsening ties between the United States and China.\n    \"We do not expect the BRL to recover until next year, when\nthe crisis has subsided and the markets price out the corona\nrisk,\" said FX analysts at Commerzbank.\n    Coronavirus cases continued to climb in South America, with\nColombia topping 400,000 confirmed cases on Tuesday, as deaths\nclimb toward 13,500. The Colombian peso fell 0.3% against\nthe dollar. \n    The dollar slid as U.S. Treasury Secretary Steven Mnuchin\nsaid the White House and top Democrats may not be able to reach\na deal on coronavirus aid, in a fifth day without talks.\n\n    The Mexican peso rose 0.4%. Investors await a central\nbank policy decision on Thursday with a 50 basis point cut in\nits key lending rate priced in.  \n    Chile's currency firmed as the country's plans to\ncautiously lift its lockdown on Santiago's central business\ndistrict and adjoining Central Station on Monday.\n    Among stocks indexes, Argentina's Merval sank 3.5%\nto post its worst day in six weeks, while Brazil's Bovespa\n slid 0.7%. \n    Argentina will formally submit its amended debt\nrestructuring offer to the U.S. securities regulator as early as\nThursday, two sources said, after an initial agreement was\nreached with creditors earlier this month to restructure around\n$65 billion in foreign debt.\n    Most other regional stock indexes were flat to higher.\n    \n    Key Latin American stock indexes and currencies at 1919 GMT:\n  Stock indexes           Latest   Daily %\n                                   change\n MSCI Emerging Markets    1094.31     0.28\n                                   \n MSCI LatAm               1996.08    -0.69\n                                   \n Brazil Bovespa         101459.00     -0.7\n                                   \n Mexico IPC              38707.48     0.01\n                                   \n Chile IPSA               4031.14     0.77\n                                   \n Argentina MerVal        49207.11   -3.513\n                                   \n Colombia COLCAP          1139.21     0.42\n                                   \n                                          \n      Currencies          Latest   Daily %\n                                   change\n Brazil real               5.4497    -0.66\n                                   \n Mexico peso              22.3398     0.21\n                                   \n Chile peso                 792.5     0.00\n                                   \n Colombia peso               3755    -0.62\n                                   \n Peru sol                  3.5658    -0.17\n                                   \n Argentina peso           73.0400    -0.05\n (interbank)                       \n                                   \n \n (Reporting by Shreyashi Sanyal in Bengaluru; \nEditing by Bernadette Baum and Leslie Adler)\n  "}