{"text": "    * Iron ore, copper and oil prices rise\n    * Latam stocks at 2-month high\n\n (Writes through with Latam, updates prices)\n    By Susan Mathew and Ambar Warrick\n    Jan 12 Most Latin American currencies rose on\nWednesday as hopes of more stimulus in China drove up commodity\nprices, while the dollar slumped after U.S. inflation data came\nin as expected. \n    Brazil's real added 0.8%, while Mexico's peso\nfirmed 0.2%. Iron ore, oil and copper prices rose as weak\nChinese inflation data kept the door open for more liquidity\nmeasures by the PBOC. \n    Chile's peso rose 0.6% to a near two-month high,\nwhile Colombia's peso hit a one-month peak. \n    The dollar slipped as data showed a 7.0% annual increase in\nU.S. inflation, the largest in nearly four decades and cementing\nexpectations of an interest rate hike in\nMarch.\n    The greenback extended losses logged after Fed Chair Jerome\nPowell on Tuesday stuck to a previously signaled stance on\nmonetary policy. \n    Analysts were broadly of the opinion that the Fed will hike\nin March. \n    \"Wednesday's CPI report doesn't change anything for the\nFederal Reserve's policy plans and it has already told the\nmarkets that it expects a tight labor market, rising wages and\nlow unemployment to continue,\" said George Ball, chairman of\ninvestment firm Sanders Morris Harris. \n    Interest rate hikes in Latin America are also on the cards\nthis year, after inflation surged through 2021. \n    Brazil's central bank has taken the necessary steps to\nensure inflation targets are met for 2022, 2023 and 2024, its\nchief Roberto Campos Neto said on Tuesday, reaffirming it is\nappropriate to advance the process of monetary tightening\nsignificantly into restrictive territory.\n    Brazil's monetary policy committee has been the most\naggressive in the world, raising the policy rate by 725 basis\npoints last year. \n    COVID-19 worries continued. The Pan American Health\nOrganization the rate of infections in the Americas, caused by\nthe Omicron variant, had reached unprecedented levels.\n\n    Data from the Institute of International Finance showed net\ncapital flows to emerging markets rose last month from November\nbut fell more than 75% year-on-year, with China the main\nrecipient as investors fear other economies will continue to\nunderperform due to the pandemic.\n    Latam shares surged after the U.S. inflation reading, with\nMSCI's index of regional stocks up 2.5% at a\ntwo-month high. \n    Shares of troubled Mexican airline Aeromexico\njumped nearly 5% after its creditors overwhelmingly approved the\ncompany's restructuring plan as part of its efforts to emerge\nfrom bankruptcy. \n    The stock tumbled more than 50% last month and has made wild\nswings since, after a tender offer valued it at a fraction of\nits market capitalization.  \n    \n    Key Latin American stock indexes and currencies:\n    \n                              Latest      Daily % change\n MSCI Emerging Markets         1268.61                 2.06\n                                        \n MSCI LatAm                    2187.08                 2.48\n                                        \n Brazil Bovespa              105312.07                 1.48\n                                        \n Mexico IPC                   53935.81                 1.65\n                                        \n Chile IPSA                    4484.96                 2.05\n                                        \n Argentina MerVal             84978.89                0.327\n                                        \n Colombia COLCAP               1446.86                 1.71 Currencies             Latest      Daily % change\n Brazil real                    5.5350                 0.80\n                                        \n Mexico peso                   20.3379                 0.18\n                                        \n Chile peso                     823.03                 0.56\n                                        \n Colombia peso                 3970.51                 0.44\n Peru sol                       3.8896                 0.18\n                                        \n Argentina peso               103.6600                -0.09\n (interbank)                            \n                                        \n \n (Reporting by Susan Mathew in Bengaluru; Editing by Kirsten\nDonovan and John Stonestreet)\n  "}