{"text": "* South Africa extends COVID-19 measures* EM stocks recover from last weeks losses* Delta COVID variant could weigh on EMFX- AnalystJuly 12 South Africas rand tumbled on Monday as violence broke out after the jailing of former President Jacob Zuma, while most emerging market stocks and currencies appeared to have stabilized after losses last week.The rand sank more than 1% to a low of 14.3658 to the dollar, leading losses across emerging market currencies. Violence over Zumas 15-month prison term spread to Johannesburg over the weekend, resulting in property damage and road closures.Zuma, who was given the sentence for defying a court order to cooperate with an inquiry into corruption during his tenure, is set to challenge it during a hearing on Monday.South African stocks fell 0.6%. The rand is still the top performing emerging market currency this year, trading more than 2% higher.South Africa extended tight COVID-19 restrictions by another 14 days as it grapples with a damaging third wave of COVID-19 infections, particularly of the more contagious Delta variant. The move could upset an otherwise steady economic recovery in the country.Broader emerging market currencies traded steady after logging losses last week. MSCIs index of currencies rose 0.1%, recovering from a 0.4% loss last week.But concerns over the rapid spread of the Delta variant are likely to cap any gains this week, with upcoming U.S. inflation data also expected to curb sentiment.Investors also digesting the implications of a reserve requirement rate (RRR) cut in China from last week, which analysts say could imply a slowing economic recovery.EM FX came under great pressure last week as broad risk off sentiment hit global markets... The Chinese RRR cut helped risk sentiment recover on Friday, but this is likely to remain short-lived if the delta variant continues to spread, analysts at Brown Brothers Harriman wrote in a note.Commodity-linked currencies extended their losses as the spread of the Delta variant threatened to weigh on demand.Russias rouble lost 0.6% as oil prices dipped, while softer gold and base metal prices weighed on the rand. The rouble had lagged its peers in Europe, the Middle East and Africa last week, falling 1.7%.Emerging market stocks recovered slightly from steep losses last week, with MSCIs index of stocks rising about 0.5%.For GRAPHIC on emerging market FX performance in 2021, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance in 2021, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see"}