{"text": "    * Mexico c.bank cuts interest rates, says outlook uncertain\n    * Chilean peso rises, Colombian peso falls against dollar\n    * Brazil economic activity fell 4.05% in 2020 - c.bank index\n\n    By Shreyashi Sanyal and Shashank Nayar\n    Feb 12 The Mexican peso led declines among Latin\nAmerican currencies on Friday after Mexico's central bank cut\ninterest rates for the first time since September, while\nBrazil's real underperformed its peers for the week amid\nuncertainty over public accounts.\n    The peso shed 0.7% against the U.S. dollar, a day\nafter Mexico's central bank cut its benchmark policy rate by 25\nbasis points to 4%. \n    Its five board members, who were unanimous on the decision,\nflagged uncertainty over the economic outlook and global efforts\nto tackle the COVID-19 pandemic.\n    \"The decision was only relevant as it might presume a\nclearly more dovish approach on the part of Banxico,\" said\nUlrich Leuchtmann, head of FX and commodity research at\nCommerzbank. \n    \"The fact that the remaining 'hawks' on the board also\nagreed to a rate cut had probably not been expected by anyone.\"\n    The Brazilian real dropped 0.3%, among the\nonly Latin American currencies set to record losses for the\nweek. \n    Brazil will extend pandemic emergency cash transfers to the\npoor and vulnerable, Economy Minister Paulo Guedes said on\nThursday, but added that the payments must come with\ncompensating cost-cutting measures to avoid damage to public\nfinances.\n    Economic activity in Brazil fell 4.05% last year, a central\nbank index showed, with the economic blow from the COVID-19\npandemic for the year as a whole softened by an eighth\nconsecutive month of growth in December.\n    Markets were also hopeful that President Joe Biden's planned\nfiscal package will be passed by lawmakers soon.    \n    The Chilean peso edged higher against the dollar,\nwhile Colombia's peso dipped. \n    Emerging market currencies were subdued on Friday as the\ndollar index ticked up following lower volumes in Asia\ndue to the Lunar New Year.\n    Elsewhere in Latin America, data showed oil output from the\nVaca Muerta region in Patagonia, which stalled during the\ncoronavirus pandemic, hit a record high in December as producers\nrevved up wells with an eye on rebounding prices and a new\nexport market.\n    The region holds the world's fourth-largest shale oil\nreserves. \n    \n    Key Latin American stock indexes and currencies at 1425 GMT:\n         Stock indexes                   Latest      Daily\n                                                       %\n                                                     change\n MSCI Emerging Markets                      1426.09   -0.13\n MSCI LatAm                                 2382.26   -1.02\n Brazil Bovespa                           118437.10   -0.72\n Mexico IPC                                    0.00       0\n Chile IPSA                                 4558.62    0.23\n Argentina MerVal                          51727.19   0.141\n Colombia COLCAP                            1367.79       0\n                                                           \n            Currencies                   Latest      Daily\n                                                       %\n                                                     change\n Brazil real                                 5.3938   -0.13\n Mexico peso                                20.0697   -0.63\n Chile peso                                   724.2    0.00\n Colombia peso                              3535.63   -0.31\n Peru sol                                    3.6428   -0.08\n Argentina peso (interbank)                 88.5400   -0.10\n                                                     \n Argentina peso (parallel)                      146    3.42\n                                                     \n \n (Reporting by Shashank Nayar and Shreyashi Sanyal in Bengaluru;\nEditing by Jan Harvey)\n  "}