{"text": "Feb 12 The Russian rouble led declines among emerging market currencies on Friday, following strong gains earlier in the week, while regional stocks hovered near record highs on optimism around more U.S. stimulus.The rouble dropped 0.4% to the dollar, as Russia warned that it was ready to sever ties with the European Union if the bloc hits it with painful economic sanctions.Russias central bank meeting later in the day, is also on investors radar. It is expected to keep interest rates unchanged with inflation well above the 4% target.The CBR (Central Bank of Russia) is very cautious and therefore unlikely to cut rates when inflation is accelerating, let alone overshooting to well above the 4% inflation target, said Tatha Ghose, an analyst at Commerzbank.Policymakers have noted that the acceleration is driven by temporary factors and is likely to reverse during H2 2021. Still, a part of the overshoot is owing to a weaker-than-expected exchange rate in recent months, which could continue because of political developments.South Africas rand fell 0.1% a day after President Cyril Ramaphosas state of the nation address failed to detail any new reforms.Ramaphosa said the country, hit hard by a second wave of COVID-19, would undertake a massive vaccination program and had secured millions of doses of Johnson & Johnson and Pfizer Inc vaccines.Medium-term concerns about vaccines not being effective against emerging COVID-19 variants could challenge the positive narrative for EM assets, said Christian Keller, head of economics research at Barclays.The rand is on course to gain for a second consecutive week, benefiting from recent weakness in the dollar as investors bet on more U.S. fiscal stimulus to stimulate economic growth.The administration of U.S. President Joe Biden is pushing for a $1.9 trillion pandemic relief package to speed up a recovery in the worlds largest economy.That helped an index of emerging market stocks hover near all-time highs and put them on track for a second straight week of gains. However, with much of Asia closed for the for Lunar New Year holidays, trading volumes were thinner than usual.The Turkish lira was flat as data showed industrial output climbed 9% year-on-year in December, expanding for a seventh straight month.Most central European currencies weakened against the euro, with the Hungarian forint leading declines.For GRAPHIC on emerging market FX performance in 2021, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance in 2021, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see"}