{"text": "    * Brazil inflation ends 2020 above target, highest in 4\nyears\n    * Mexico industrial output beats expectations in November\n    * Chilean peso continues to weaken on lower copper prices\n\n    By Shreyashi Sanyal\n    Jan 12 A gauge for Latin American currencies\nrose for the first time in 2021 on Tuesday, as hopes of recovery\nwere buoyed by improving economic data from Brazil and Mexico,\nwhile a recent rally in the dollar cooled. \n    The MSCI's index for Latin American currencies\n rose 0.5%, with Mexico's peso leading the\nadvance. \n    The peso rose 0.6% against the dollar a day after data\nshowed the Mexican manufacturing sector's recovery from the\npandemic slump had slowed in November but was stronger than\nforecast. \n    Mexico's currency recently came under pressure from lower\noil prices, which has also hurt crude-exporter Colombia's peso.\n\n    Official figures from Brazil showed annual inflation ended\nlast year at 4.5%, comfortably above the central bank's year-end\ntarget as food prices rose the most in nearly two decades. \n    The Brazilian real gained 0.5%, after sliding\nto a two-month low against the dollar on Monday. However, a\ngrowing consensus shows that the tides of economic growth,\ninterest rates and commodity prices are turning in the\ncurrency's favor.\n    \"Brazil has lagged while Mexico has outperformed and\npositioning has diverged, with Mexico at the highest allocation\nin three years and Brazil at the lowest. Further out, Brazil\nfaces clear fiscal issues, yet this should not stop Brazil\nperforming well in early 2021,\" strategists at Morgan Stanley\nwrote in a client note. \n    However, Morgan Stanley cut its outlook for emerging market\ncurrencies overall to neutral from \"bullish\", citing higher U.S.\nyields and little improvement in fundamentals.\n    A recovery also ensued in emerging market currencies in\nEurope on Tuesday, after steep losses last week to a rebounding\ndollar, while stocks held near record highs as increased\nliquidity and low lending rates boosted demand for equities.\n    Emerging market assets have been under pressure in the last\nweek from continued dollar strength and higher yields, which are\nseen as a negative.\n    The Chilean peso was among the few currencies which\nwere lower on Tuesday, falling 0.7%, pressured by weakening\ncopper prices. \n    Shanghai copper fell to a one-week low, hit by demand\nconcerns amid new curbs to fight a resurgence of coronavirus\ncases in China, the world's biggest metals consumer.\n\n    Key Latin American stock indexes and currencies at 1344 GMT:\n    \n        Stock indexes                 Latest   Daily %\n                                               change\n MSCI Emerging Markets                1353.04     0.25\n MSCI LatAm                           2486.05     0.65\n Brazil Bovespa                     123439.20     0.15\n Mexico IPC                              0.00        0\n Chile IPSA                           4584.94     0.71\n Argentina MerVal                        0.00        0\n Colombia COLCAP                      1453.12        0\n                                                      \n            Currencies                Latest   Daily %\n                                               change\n Brazil real                           5.4757     0.46\n Mexico peso                          19.9613     0.49\n Chile peso                               724    -0.66\n Colombia peso                        3490.43     0.05\n Peru sol                              3.5997     0.33\n Argentina peso (interbank)           85.4600    -0.09\n                                               \n Argentina peso (parallel)                155     3.87\n                                               \n \n\n (Reporting by Shreyashi Sanyal in Bengaluru)\n  "}