{"text": "* EMEA FX muted amid U.S. inflation jitters* Turkish inflation concerns rise ahead of rate decision* MSCI EM stocks index tumbles* Alibaba surges after shrugging off regulatory woes (Adds details, updates prices)April 12 Currencies in emerging markets recovered from initial losses, but traded flat on Monday as focus turned to U.S. inflation data due later in the week, while investors pulled out of equities ahead of the corporate earnings season.The MSCIs index of emerging market currencies was muted after falling as much as 0.2%, with the U.S. dollar and Treasury yields retreating as investors awaited inflation data due on Tuesday.Investors feared that a bigger-than-expected spike in inflation could spark another rally in the greenback.But dollar bulls were also on the fence, given that any signs of a pullback in inflation could hurt hopes of early tapering by the Federal Reserve, and make the greenback less attractive.Most EM currencies are trading lower this year amid growing bets on early policy tightening by the Fed, with inflation being one of the key factors to watch. Retail sales data is also due this week.The lira traded flat after leading early losses across Europe, the Middle East and Africa (EMEA). Data showed a higher-than-expected Turkish current account deficit in February, while the unemployment rate also rose.Inflation expectations for the country have jumped in recent weeks on doubts over whether the central bank will keep policy tight, amid constant pressure from the government to reduce interest rates.The lira has been trading consistently lower after the ouster of four central bank heads in two years cast doubts over its credibility.It does not really matter whether the base rate is cut immediately, a few months later, or not at all, analysts at Commerzbank said.As long as there is no credible prospect of the Central Bank of Turkey fully and freely hiking interest rates in order to bring inflation rapidly back towards target, the outlook for the lira remains the same.Morgan Stanley expects the lira to lose 15% to 20% of its value if the central bank cuts rates at a meeting this week.The MSCIs index of emerging market stocks tumbled 0.9% on Monday amid uncertainty ahead of the first-quarter earnings season.But shares of Alibaba surged after the Chinese e-commerce behemoth said it does not expect any material impact from the antitrust crackdown in China. Regulators fined the firm $2.75 billion for abusing market dominance.In Latin America, Ecuadors government bonds were expected to react very positively after banker Guillermo Lasso defied the polls and won a presidential election on promises to revive the economy.For GRAPHIC on emerging market FX performance in 2021, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance in 2021, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see (Reporting by Ambar Warrick in Bengaluru, Editing by Sherry Jacob-Phillips)"}