{"text": "    * Graphic: World FX rates tmsnrt.rs/2egbfVh\n    * Graphic: Foreign flows into Asian stocks tmsnrt.rs/3f2vwbA\n    * Taiwan stocks mark worst session since March 19, 2020\n    * Taiwan finmin steps in to calm equity markets\n    * Philippine c.bank keeps rates at record low\n\n    By Rashmi Ashok\n    May 12 Taiwan stocks closed 4% lower on\nWednesday and clocked their worst day in more than a year as\nauthorities mulled tighter restrictions to tackle COVID-19\ncases, while other Asian equities fell on concerns of growing\nU.S. inflationary pressure.\n    Equities in Taipei pulled back from early losses of\nnearly 8.6% while the Taiwan dollar recovered to hold\nsteady after the country's deputy finance minister stepped in to\ncall for calm, saying the stock market's fundamentals were\nsound. \n    Risk appetite took a beating after health authorities said\nthey may raise the country's COVID-19 alert level in \"coming\ndays\", which would mean closure of non-essential businesses,\nafter a cluster of six new cases with no clear infection source\nwas found.\n    Even a small number of cases poses a huge challenge for the\nisland that has kept a tight lid on community outbreaks.\n    As of April-end, Taiwan stocks rose more than 100% from\ntheir lowest levels in March last year, buoyed by strong demand\nfor the country's chips and electronics exports as the\nwork-from-home shift boosted demand for home electronics.\n    The Philippine central bank kept its benchmark interest\nrates unchanged at a record low, as widely expected, in a bid to\nsupport economic recovery amid a recent spike in COVID-19 cases.\n Shares closed 1.4% lower at six-month low prior to the\ndecision.\n    Currencies and stocks in export-focused nations fell most,\nwith shares in Seoul slipping 1.5% and the won\n weakening 0.5%. Thai equities lost 0.8% and\nthe Thai baht weakened 0.3%.\n   Despite various U.S. Federal Reserve officials reiterating a\nfirmly dovish policy stance, investors worried that higher\ninflation from a spike in commodity prices could force the Fed\nto raise interest rates. U.S. inflation data due later in the\nday also added to nerves.\n    \"Markets are calling the Fed's bluff, fearing that it may\nneed to hike rates more quickly and aggressively than expected.\nThe U.S. CPI release will be a big focus for more clues,\" said\nMitul Kotecha, chief EM Asia and Europe strategist at TD\nSecurities.\n    \"Should the Fed hint at an earlier taper, it would likely\nput pressure on Asian markets, with a likely firmer dollar\nweighing on Asian FX and higher U.S. yields pressurising Asian\nlocal currency bonds and equities,\" Kotecha said.\n    Indonesian markets were closed for the Eid festival. Markets\nin India, Malaysia and Singapore will also be on holiday on\nThursday for the festival.\n    \n    HIGHLIGHTS:\n    ** Thailand's 10-year government bond yields are down 1.5\nbasis points at 1.67% \n    ** In the Philippines, top index losers are Megaworld Corp\n, which dropped 5.37%, and Metro Pacific Investments\nCorp that fell 4.46% \n    ** Top losers on FTSE Bursa Malaysia Kl Index\ninclude Telekom Malaysia Bhd, down 2.42%, and Sime\nDarby Plantation Bhd that slipped 2.36%\n    \n   \n  Asia stock indexes and                              \n currencies at   0808 GMT                        \n COUNTRY  FX RIC        FX     FX  INDE  STOCKS  STOCK\n                     DAILY  YTD %     X   DAILY  S YTD\n                         %                    %      %\n Japan               -0.16  -5.09  <.N2   -1.61   2.56\n                                   25>           \n China    <CNY=CFX   -0.24  +1.31  <.SS    0.61  -0.30\n          S>                       EC>           \n India               -0.15  -0.52  <.NS   -0.52   5.66\n                                   EI>           \n Malaysi             -0.19  -2.52  <.KL    0.31  -2.75\n a                                 SE>           \n Philipp             +0.10  +0.46  <.PS   -1.43  -12.6\n ines                              I>                5\n S.Korea  <KRW=KFT   -0.45  -3.42  <.KS   -1.49  10.03\n          C>                       11>           \n Singapo             -0.20  -0.53  <.ST   -0.70   9.79\n re                                I>            \n Taiwan              -0.01  +1.89  <.TW   -4.11   7.94\n                                   II>           \n Thailan             -0.26  -3.88  <.SE   -0.79   8.08\n d                                 TI>           \n \n\n (Editing by Sherry Jacob-Phillips)\n  "}