{"text": "* Chinese stocks biggest boost to MSCI EM stocks index* Turkey current account deficit widens in Aug* Yield-hungry investors looking to equities- AnalystOct 12 Turkeys lira led losses in emerging market currencies on Monday, while equity-friendly policies from Beijing saw Chinese stocks pushing the developing-world stocks benchmark to a near nine-month high.The MSCIs index of emerging market stocks jumped about 1% to its highest since late January, with Chinese stocks providing the most support after Beijing flagged more measures to invite investment into the country.In EMEA (Europe, Middle East and Africa), Turkish stocks added 0.5%, while those in South Africa rose 0.4%.In the current market environment, market participants hungry for yield have almost nowhere else to go than to the stock market, Milan Cutkovic, market analyst at Axi wrote in a note.On the other hand, the Chinese yuan came off a 17-month high after the central bank cut its foreign exchange forward reserve requirements for financial institutions.The yuan has been strengthening quickly since May ... the Peoples Bank of China made the regulation change to slow yuan appreciation as an overly strong currency will be harmful for the economic recovery, Hao Zhou, FX & EM analyst at Commerzbank, wrote in a note.Among other currencies, Turkeys lira led losses in EMEA, sinking about 0.6% after the countrys current account deficit widened more than expected in August.The currency was less than 1% off a lifetime low, as perceived fiscal weakness and geopolitical tensions around Turkey sapped capital inflows.Turkeys central bank also raised the remuneration rate on the lira in a bid to return to normal after extreme measures taken during the height of the coronavirus crisis.Russias rouble fell 0.4% in tandem with oil prices, as U.S. producers restored output after Hurricane Delta. The currency had outperformed most of its EMEA peers last week with a 1.8% rise.Uncertainty over U.S. stimulus measures and the presidential election spurred some safe-haven demand for the dollar. A risk-off environment may set in ahead of the U.S. elections, which are less than a month away.For GRAPHIC on emerging market FX performance in 2020, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance in 2020, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see (Reporting by Ambar Warrick in Bengaluru; Editing by Mark Potter)"}