{"text": "    * Asian stock markets: tmsnrt.rs/2zpUAr4\n    * Philippine benchmark eyes worst week in six\n    * Indonesia's trade surplus likely widened in Feb- poll\n\n    By Shruti Sonal\n    March 12 Most emerging Asian stocks climbed on\nFriday and were set for strong weekly gains as U.S. stimulus and\neasing bond yields helped lift the mood, although Philippine\nstocks struggled on concerns over the country's economic\nrecovery.\n    Global markets received a boost after U.S. President Joe\nBiden signed a $1.9 trillion stimulus bill into law and as a\ndovish European Central Bank meeting triggered a retreat in bond\nyields.\n    The Jakarta benchmark added over 1% and was poised\nfor its sixth straight weekly gain, while Seoul closed\n1.4% higher for its biggest weekly jump in five. India\nand Singapore also eyed gains of over 2% for the week.\n    A Reuters poll showed Indonesia's trade surplus likely\nwidened in February from a month earlier on the back of higher\ncommodity prices.\n    Recovery concerns have weighed on Philippine equities\n, which barely budged on Friday and were on track for\ntheir biggest weekly drop since January. \n    The country, which has the second-highest number of COVID-19\ncases and deaths in Southeast Asia, recorded its biggest daily\nrise in COVID-19 cases in nearly six months on Thursday.\n\n    Further denting sentiment, the country's trade deficit came\nin at $2.42 billion in January, the widest in 12 months,\ngovernment data showed.\n    \"The ongoing slump in imports suggests that growth pains for\nthe Philippines will be around for some time,\" ING economist\nNicholas Mapa said.\n    Tourism-reliant Thai shares fell 0.7% after the\ncountry delayed the use of AstraZeneca's COVID-19 vaccine,\nciting safety concerns following reports of blood clots in some\nvaccinated people in Europe.\n    Overall, regional currencies were mixed after U.S. dollar\nclimbed from a near one-week low as bond yields inched higher,\nbut looked set for its first weekly fall in three. \n    The Taiwan dollar, South Korean won and\nthe Indonesian rupiah gained between 0.2% and 0.3%. On\nthe other hand, the Thai baht and the Singapore dollar\n weakened 0.6% and 0.4% respectively. \n    \n    Highlights:\n    \n    ** Thailand's 10-year government bond yields are up 11 basis\npoints at 1.8%\n    ** Top gainers on the Jakarta stock index include\nZebra Nusantara Tbk PT, Sejahteraraya Anugrahjaya Tbk\nPT, Royalindo Investa Wijaya PT \n    \n    \n  Asia stock indexes and                                \n currencies at   0742 GMT                         \n COUNTRY  FX RIC        FX     FX  INDEX  STOCKS  STOCKS\n                     DAILY  YTD %          DAILY   YTD %\n                         %                     %  \n Japan               -0.47  -5.28  <.N22   1.73    8.28\n                                   5>             \n China    <CNY=CFX   -0.07  +0.45  <.SSE    0.47   -0.58\n          S>                       C>             \n India               +0.23  +0.45  <.NSE    0.24    8.80\n                                   I>             \n Indones             +0.17  -2.30  <.JKS    1.39    6.23\n ia                                E>             \n Malaysi             -0.19  -2.26  <.KLS   -0.73   -0.59\n a                                 E>             \n Philipp             +0.03  -0.93  <.PSI    0.14   -5.76\n ines                              >              \n S.Korea  <KRW=KFT   +0.19  -4.20  <.KS1    1.35    6.30\n          C>                       1>             \n Singapo             -0.40  -1.78  <.STI   -0.35    8.83\n re                                >              \n Taiwan              +0.31  +1.17  <.TWI    0.47   10.34\n                                   I>             \n Thailan             -0.55  -2.44  <.SET   -0.66    7.96\n d                                 I>             \n \n    \n (Reporting by Shruti Sonal in Bengaluru; Editing by Anil\nD'Silva)\n  "}