{"text": "    * Do not expect Brazil real to recover until next year -\nanalyst\n    * Bovespa up after retail sales surge back to pre-crisis\nlevels \n    * Mexican central bank policy decision awaited on Thursday\n    * Colombia peso slips as country tops 400,000 coronavirus\ncases\n\n    By Shreyashi Sanyal\n    Aug 12 Most Latin American currencies traded in\ntight ranges on Wednesday, as investors questioned the\nlikelihood of fresh stimulus in the United States, while the\nBrazilian real fell on growing doubts over its pace of recovery\nthis year. \n    The real fell 0.7% and has mostly remained weak since\nthe Brazilian central bank cut interest rates one week ago.  \n    Investors have cheered signs of a recent pick up in economic\nactivity in Latin America's biggest economy but are now cautious\non the real amid surging COVID-19 cases, a dovish central bank\nand worsening ties between the United States and China.   \n    \"The Banco Central do Brasil (BCB) has shown itself to be\nmore dovish and has introduced forward guidance. Not only does\nthis leave the back door open for further monetary easing, it\nalso dampens expectations of rate hikes in the coming year,\"\nsaid FX analysts at Commerzbank. \n    \"We do not expect the BRL to recover until next year, when\nthe crisis has subsided and the markets price out the corona\nrisk.\"\n    Even as Brazil amasses a record debt that has evoked\nmemories of crises past in South America's largest economy, some\neconomists say rock-bottom interest rates and low foreign debt\nmean the government can continue to spend its way out of\nrecession.\n    Most currencies in the region made sideways moves, with\ninvestors focusing on offshore events after U.S. Treasury\nSecretary Steven Mnuchin said the White House and top Democrats\nmay not be able to reach a deal on coronavirus aid, in a fifth\nday without talks on the stalemate.\n    Coronavirus cases continued to surge in South America, with\nColombia topping 400,000 confirmed coronavirus cases on Tuesday,\nas deaths climb toward 13,500 and intensive care units in the\ncapital Bogota remain near capacity. The Colombian peso\nfell 0.3% against the dollar. \n    Mexico's peso was subdued with investors awaiting a\ncentral bank policy decision on Thursday. Markets are pricing in\na 50 basis point cut in its key lending rate.  \n    Among stocks indexes, Brazil's Bovespa rose 0.8%\nafter data showed retail sales ended the first half of the year\non a strong footing, surging back to pre-crisis levels as the\neasing of lockdown measures continued across the country.\n\n    Shares in Brazilian software firm Linx SA fell\n4%, a day after card processor StoneCo said it would buy Linx in\na $1.12 billion deal that will transform it into an integrated\nsoftware and payments provider.\n    Key Latin American stock indexes and currencies at 1426 GMT:\n    \n        Stock indexes                   Latest      Daily %\n                                                    change\n MSCI Emerging Markets                     1092.09     0.08\n MSCI LatAm                                2004.38    -0.27\n Brazil Bovespa                          102321.69     0.14\n Mexico IPC                               38818.04      0.3\n Chile IPSA                                4031.30     0.78\n Argentina MerVal                         50312.54   -1.345\n Colombia COLCAP                           1138.04     0.32\n                                                           \n            Currencies                  Latest      Daily %\n                                                    change\n Brazil real                                5.4630    -0.90\n Mexico peso                               22.3737     0.05\n Chile peso                                  793.8    -0.16\n Colombia peso                             3746.74    -0.40\n Peru sol                                   3.5618    -0.06\n Argentina peso (interbank)                73.0400    -0.05\n                                                    \n Argentina peso (parallel)                     128     2.34\n                                                    \n \n\n (Reporting by Shreyashi Sanyal in Bengaluru; \nEditing by Bernadette Baum)\n  "}