{"text": "    * Mexico's central bank unexpectedly holds rates steady  \n    * Weak oil prices pressure Mexican, Colombian pesos\n    * Latam stocks tumble for second day \n    * Peruvian sol falls to fresh 18-year low\n\n (Updates prices throughout, adds comments)\n    By Shreyashi Sanyal\n    Nov 12 The Mexican peso pared back some declines\non Thursday after the Bank of Mexico unexpectedly held interest\nrates steady in its latest meeting, while other Latin American\ncurrencies continued to fall by afternoon trading. \n    The peso trimmed some losses after falling nearly 1%\nearlier in the session as Banxico, as the Bank of Mexico is\nknown, kept its benchmark interest rate unchanged at 4.25%\ndespite expectations of a 25-basis-point cut to 4.0%.\n\n    \"The communications accompanying the Mexican central bank's\ndecision to leave its policy rate unchanged at 4.25% today\nsuggests that there may still be scope for one more cut in the\neasing cycle,\" said William Jackson, chief emerging markets\neconomist at Capital Economics. \n    \"With the peso rallying and the economy weak, the argument\nfor more policy support will remain strong.\"\n    The currency is among the best performing Latin American\nunits this year, having benefited recently from expectations of\nbetter trade ties with the United States after Joe Biden won the\npresidential election.\n    Mexico's currency and Colombia's peso were also hurt\nby weakness in the oil market after the International Energy\nAgency raised doubts about a quick post-COVID-19 pickup in\ndemand.\n    Brazil's real gave back most of its gains from\nearlier in the session even as data showed services activity\nrose more than expected in September, suggesting that certain\nfacets of Latin America's largest economy were picking up from\nthe pandemic.\n    Economy Minister Paulo Guedes said Brazil's economy could\ngrow as fast as 4% next year, accelerating its recovery from the\ndepths of the pandemic as job creation and private sector\ninvestment continue to gather pace.\n    While regional currencies and stocks benefited from optimism\nover coronavirus vaccine news on Monday, uncertainty over the\nvaccine's availability, as well as continued signs of the\npandemic's economic impact prompted some unwinding in risk\nappetite.\n    The MSCI's index of regional stocks tumbled\n3%, while its currencies counterpart fell 1%.  \n    Peru's sol fell to another 18-year low as the\ncountry's new Cabinet took shape on Wednesday after the ouster\nof centrist President Martn Vizcarra on Monday plunged the\ncountry into turmoil.\n    Argentina's central bank said it will raise its benchmark\nLeliq interest rate to 38% from the previous level of 36%,\nfollowing a recent series of cuts. The bank will also raise the\novernight reverse repo rate and the seven-day reverse repo rate.\n\n    \n    Key Latin American stock indexes and currencies: \n    \n         Stock indexes                  Latest   Daily %\n                                                 change\n MSCI Emerging Markets                  1180.72     0.16\n MSCI LatAm                             2047.29    -3.11\n Brazil Bovespa                       102059.70    -2.62\n Mexico IPC                            40276.28    -1.43\n Chile IPSA                             3916.50    -1.58\n Argentina MerVal                      49648.11   -3.474\n Colombia COLCAP                        1202.34    -1.45\n                                                        \n             Currencies                 Latest   Daily %\n                                                 change\n Brazil real                             5.4772     0.01\n Mexico peso                            20.6497    -0.90\n Chile peso                               759.9    -0.83\n Colombia peso                          3634.27    -0.01\n Peru sol                                3.6397    -0.49\n Argentina peso (interbank)             79.5600    -0.08\n                                                 \n Argentina peso (parallel)                  163    -0.61\n                                                 \n \n (Reporting by Ambar Warrick and Shreyashi Sanyal in Bengaluru;\nEditing by Angus MacSwan)\n  "}