{"text": "    * Graphic: World FX rates tmsnrt.rs/2egbfVh\n    * Graphic: Foreign flows into Asian stocks tmsnrt.rs/3lKhL5I\n    * Taiwan dollar hits strongest level since June 2011\n    * Indonesian stocks at near 1-month high\n    * Malaysian shares fall on rising COVID-19 cases \n\n    By Shriya Ramakrishnan\n    Oct 12 Most Asian currencies inched lower on\nMonday after a policy tweak by China's central bank pulled back\nsome of the yuan's gains, while stock markets across the region\nrose as investors latched on to hopes a deal for U.S. stimulus\nwould be reached.\n    An over 2% gain in Chinese shares also lent support\nto regional equity markets. Indonesia shares rose up to\n1% on easing of coronavirus curbs in the capital city of Jakarta\nfor the next two weeks. \n    The rupiah dipped slightly, ahead of Bank Indonesia's\nmeeting on Tuesday where it is widely expected to keep benchmark\nrates steady at 4.00%, especially after concerns over the\ncentral bank's independence have kept the currency under\npressure.\n    Market participants also barely reacted to protests over a\nnew jobs law in Indonesia, which economists say could improve\nthe nation's investment climate. But protesters say the law\nundermines labour rights and weakens environmental protections.\n    A pullback in the yuan from a 17-month high kept\na lid on gains for most Asian currencies after the People's Bank\nof China cut foreign exchange forward reserve requirements, seen\nas aimed at tempering the yuan's recent strength. \n     \"We believe the authorities are comfortable about the\noverall flow picture, expecting that a removal of the policy\ntool should not reverse the downtrend by USD-RMB,\" analysts at\nHSBC Research wrote in a client note.\n    The Singapore dollar, Malaysian ringgit and\nPhilippine peso traded flat to lower during the day,\nwhile the Taiwan dollar once again outperformed with\ngains of more than 1% to reach its highest since June 2011.  \n    The Taiwan dollar, Asia's top performing currency so far\nthis year, has benefited from stronger exports, helped by demand\nfor laptops and tablets to support the work-from-home trend\nduring the pandemic.\n    \"Better COVID-19 management compared to peers in Asia and\nthe CBC (Taiwan's central bank) taking a hands-off approach to\nthe currency strengthening has enabled the trend to sustain,\"\nsaid Jingyi Pan, market strategist at trading firm IG Asia.\n    Malaysian stocks drifted lower, weighed down by\nconcerns over a sharp spike in coronavirus infections over the\nweekend.\n    While Malaysia has so far kept a major contagion at bay,\nseveral new infections have been traced in the wake of last\nmonth's election in Sabah state, prompting authorities to impose\ntargeted lockdowns to curb the outbreak. \n    \n    HIGHLIGHTS:\n    ** Malaysia's 10-year benchmark yield is up 0.1\nbasis points at 2.711%\n    ** Top gainers on the Jakarta stock index include\nCitra Tubindo Tbk PT up 24.66% at 2730 rupiah, Bank\nPermata Tbk PT up  24.56% at 2460 rupiah\n    ** Top losers on FTSE Bursa Malaysia Kl Index\ninclude Sime Darby Plantation Bhd down 3.1% at 5\nringgit; Sime Darby Bhd down 2.85% at 2.39 ringgit;\nCIMB Group Holdings Bhd down 2.22% at 3.09 ringgit\n    \n    \n    \n  Asia stock indexes and                                       \n currencies at   0707 GMT                                \n COUNTRY   FX RIC          FX     FX       INDEX  STOCK  STOCKS\n                        DAILY  YTD %                  S   YTD %\n                            %                     DAILY  \n                                                      %  \n Japan                  +0.13  +3.00              -0.26   -0.41\n China                  -0.30  +3.72               2.62   10.09\n India                  -0.07  -2.46               0.09   -2.00\n Indonesi               -0.10  -5.51               0.83  -19.11\n a                                                       \n Malaysia               +0.00  -1.11              -0.79   -4.44\n Philippi               -0.16  +4.59               0.09  -24.03\n nes                                                     \n S.Korea                +0.57  +0.84               0.49    9.38\n Singapor               -0.07  -0.69               0.40  -21.09\n e                                                       \n Taiwan                 +1.25  +5.24               0.53    7.99\n Thailand               -0.03  -3.70               0.80  -19.15\n \n\n\n (Reporting by Shriya Ramakrishnan in Bengaluru; Editing by\nKrishna Chandra Eluri)\n  "}