{"text": "    * Mexican central bank hikes key interest rate to 4.5%\n    * Colombia government to sign $5.39 bln in road contracts  \n    * Fiscal, political concerns weigh on Brazilian real\n    * Latam equities take a breather, Brazil stocks slide \n\n (Adds comments, bullets, details; Updates prices throughout)\n    By Shreyashi Sanyal\n    Aug 12 The Colombian peso jumped more than 2% on\nThursday, rising for the third straight day, as the country's\ngovernment said it will sign contracts for new road projects,\nwhile Mexico's peso dipped even as its central bank hiked its\nkey lending rate.\n    Colombia's currency jumped 2.17% to 3,855 against the\ndollar, clocking its best day since June 2020. Transport\nMinister Angela Maria Orozco told Reuters that the government\nwill sign contracts for road projects worth 21.3 trillion pesos\n($5.39 billion) before its term ends next year.\n    Analysts consider Colombia's poor highways and delays to\nmodernize them as one of the main factors reducing the\ncompetitiveness of the country's economy and its international\ntrade.\n    A recent rise in oil prices have also boosted the crude\nexporter's currency. \n    \"We do find select value in the corporate sectors in Peru,\nBrazil, Colombia and Mexico,\" Shamaila Khan, head of emerging\nmarket debt at AllianceBernstein, told the Reuters Global\nMarkets Forum. \n    \"We favor select commodity credits in these countries that\nare benefiting from higher commodity prices.\"\n    Mexico's peso fell 0.1% even as the Bank of Mexico\nraised its key interest rate by 25 basis points to 4.5%, as\nexpected. Its governing board expressed concern about\nabove-target inflation and inflation expectations.\n    Peru's sol firmed up to 0.4% before treading water,\nstill dangerously close to all-time lows. Credit Suisse expects\nthe Peruvian central bank to hold the rate unchanged at 0.25%,\nadding that the bank may prepare markets for a hawkish turn. \n    Brazil's real fell 0.6%. Sticking to his hawkish\nstance, central bank chief Roberto Campos Neto said all measures\nwill be taken to tackle inflation and that markets have started\nto see the impact of fiscal concerns.\n    Electricity prices are also a concern as severe drought hits\nhydropower production. This could constrain medium- and\nlong-term GDP growth to an extent, Citi Research strategists\nsaid. \n    Chile's peso slipped 0.5% after two unions at\nCodelco's Andina copper mine said on Wednesday they would walk\noff the job in less than 24 hours after rejecting the latest\ncontract offer from the state-owned miner.  \n    Latam stocks tracked a global fall in equities, with Sao\nPaulo's Bovespa hit by disappointing earnings. \n    Conglomerate Ultrapar fell on a surprise loss,\nwhile financial exchange operator B3 and meatpacker\nJBS dropped despite strong results.\n \n    In El Salvador, spreads on dollar-denominated bonds hit\ntheir highest level since November, with some investors seeing\nan opportunity as yields flash double-digits across the curve.\n\n    Key Latin American stock indexes and currencies at 1909 GMT:\n    \n          Stock indexes                   Latest    Daily %\n                                                    change\n MSCI Emerging Markets                     1290.05    -0.58\n MSCI LatAm                                2482.24    -0.86\n Brazil Bovespa                          121003.24    -0.86\n Mexico IPC                               51091.67    -0.43\n Chile IPSA                                4380.08     0.21\n Argentina MerVal                         69015.76   -0.661\n Colombia COLCAP                           1253.79     0.57\n                                                           \n              Currencies                  Latest    Daily %\n                                                    change\n Brazil real                                5.2516    -0.62\n Mexico peso                               19.9383    -0.12\n Chile peso                                  775.1    -0.57\n Colombia peso                                3855     2.16\n Peru sol                                   4.0793     0.13\n Argentina peso (interbank)                97.0700    -0.02\n                                                    \n Argentina peso (parallel)                   175.5     1.42\n                                                    \n \n    \n\n (Reporting by Shreyashi Sanyal and Susan Mathew in Bengaluru;\nEditing by Sonya Hepinstall)\n  "}