{"text": "    * India shares fall nearly 4%, rupee lowest since Aug. 2020\n    * S. Korean won, Thai baht weaken 0.5% each\n    * Thai shares tumble as virus cases spike\n\n    By Sameer Manekar\n    April 12 India's rupee on Monday plunged below\n75 against the U.S. dollar for the first time in eight months\namid a rapid increase in second-wave of coronavirus cases, while\nconcerns over rising U.S. bond yields hurt broader emerging\nAsian markets.\n    Weighing on the region's markets were expectations of a\nfurther rise in U.S. yields on a likely strong reading for U.S.\nconsumer inflation for March, on the heels of a\nmore-than-expected rise in U.S. producer prices.\n\n    The rupee weakened as much as 0.5% to 75.138, its\nlowest since August last year, before recovering to 74.870, as\nrecord cases and a possible lockdown in the western state of\nMaharashtra, home to Mumbai, hurt sentiment.\n    \"Growth differential between the United States and India,\nwhich is driven by improving performance in the U.S. and\ndeteriorating COVID-19 situation and inflation in India, is\nleading the rupee lower,\" Arnob Biswas, FX research head at SMC\nGlobal Securities said.\n    Shares in Mumbai tanked as much as 3.7%, marking\ntheir worst session in more than six weeks.\n    In Singapore, stocks declined for the fifth straight\nsession ahead of the central bank's monetary policy decision on\nWednesday.\n    The Monetary Authority of Singapore (MAS) is seen keeping\nits exchange-rate based policy settings unchanged, a Reuters\npoll showed, while a separate poll determined the trade-reliant\neconomy is expected to contract slightly in the first quarter.\n\n    Prakash Sakpal, an analyst at Dutch bank ING, was more\nbullish in his view of Singapore's economy.\n    \"We expect Singapore to be among the first few Asian\neconomies reporting positive GDP growth in 1Q, albeit mildly\npositive,\" he said, adding that an electronics-led export surge\nwas leading the city-state out of last year's record slump.\n    South Korea's won weakened 0.5% and Indonesia's\nrupiah, which backs some of the highest-yielding debt in\nemerging markets, fell to its lowest level since Nov. 3.\n    Equities in Malaysia lost up to more than half a\npercent, while shares in Thailand, which reported its\nbiggest daily jump in new COVID-19 cases for a second day in a\nrow, declined as much as 1.5%.\n    Through the week, first-quarter economic performance of\nChina, Asia's growth powerhouse, as well as corporate earnings\nin the United States will also be in focus.\n    \n    HIGHLIGHTS:\n    ** Indonesian 10-year benchmark yields rise 5.9 basis points\nto 6.512%\n    ** South Korean battery makers climb after dispute\nsettlement over EV battery technology\n    ** Tata Motors and Indusind Bank among\ntop losers in the Nifty 50 index\n    \n      Asia stock indexes and                      \n      currencies at 0653 GMT                    \n COUNTRY   FX RIC     FX     FX    INDE  STOCK  STOCK\n                    DAILY   YTD %   X      S    S YTD\n                      %                  DAILY    %\n                                           %    \n  Japan             +0.11   -5.74  <.N2  -0.77  7.63\n                                   25>          \n  China   <CNY=CFX  +0.03   -0.35  <.SS  -1.18  -1.81\n             S>                    EC>          \n  India             -0.14   -2.37  <.NS  -3.47  2.42\n                                   EI>          \n Indones            -0.27   -3.84  <.JK  -1.92  -0.43\n   ia                              SE>          \n Malaysi            -0.05   -2.78  <.KL  -0.37  -1.29\n    a                              SE>          \n Philipp            +0.00   -1.09  <.PS  -0.41  -8.70\n  ines                              I>          \n S.Korea  <KRW=KFT  -0.33   -3.44  <.KS  0.12   9.12\n             C>                    11>          \n Singapo            -0.06   -1.58  <.ST  -0.62  11.28\n   re                               I>          \n Taiwan             -0.08   +0.08  <.TW  0.03   14.44\n                                   II>          \n Thailan            -0.41   -5.04  <.SE  -1.11  6.88\n    d                              TI>          \n \n (Reporting by Sameer Manekar in Bengaluru; Editing by Shailesh\nKuber)\n  "}