{"text": "    * Graphic: World FX rates tmsnrt.rs/2egbfVh\n    * Graphic: Foreign flows into Asian stocks tmsnrt.rs/3lKhL5I\n    * Yuan falls after PBOC removes reserves for forward trading\n    * Rising COVID-19 cases weigh on Malaysian stocks\n    * Indonesian stocks gain on easing of coronavirus curbs\n\n    By Shriya Ramakrishnan\n    Oct 12 Most Asian currencies struggled for\ntraction on Monday as China's yuan pulled back from a 17-month\nhigh after a policy tweak by the central bank, while stock\nmarkets rose on hopes for a new U.S. stimulus package.\n    Over the weekend, the People's Bank of China (PBOC) lowered\nthe reserve requirement ratio for financial institutions when\nconducting some foreign exchange forwards trading to zero from\n20%, effectively lowering the cost of shorting the Chinese\ncurrency.\n    The PBOC move reflects \"the Chinese authorities' concerns\nwith the raging yuan strength,\" said Jingyi Pan, market\nstrategist at trading firm IG Asia.\n    \"That said, this had not been viewed as a significant curb\nor attempt to reverse the current stronger yuan trend that\nremains supported by fundamentals,\" Pan added. \n    The Singapore dollar, Malaysian ringgit and\nThai baht hovered near unchanged levels to lower during\nthe day, while the Taiwan dollar once again stood out\nwith gains of more than 1%.\n    The South Korean won advanced 0.4% in tandem with\ngains in the stock market after data showed overseas\nsales of semiconductors, the nation's top export item, jumped\n11.2% for the first 10 days of October.\n    Stock markets in the region were broadly higher, even as\nnegotiations on U.S. fiscal stimulus ran into resistance, with\nthe Democrats dismissing the Trump administration's proposal to\npass a stripped-down coronavirus relief bill as inadequate.\n\n    \"The fact of the matter remains one where the market\ncontinues to judge the passage for the phase four stimulus to be\nexpected down the road, even if politics does get in the way for\nthe time being,\" IG's Pan said.\n    Indonesian stocks climbed as much as 1% to their\nhighest level in nearly a month, as Jakarta Governor Anies\nBaswedan announced the capital city will kick off a two-week\n'transitional' period of eased coronavirus curbs.\n    Markets barely reacted to protests over a controversial jobs\nlaw that could cut red tape and boost investment for Indonesia's\ncoronavirus-hit economy. Protesters say the law undermines\nlabour rights and weakens environmental protections.\n\n    \"Although the new labour laws could depress economic\nperformance in the short term, in the medium to longer run it\nwill indeed jack up investments and bolster economic growth,\"\nsaid Anthony Kevin, macro economist at Mirae Asset Sekuritas\nIndonesia.\n    Malaysian stocks were down more than 1%, hurt by\nconcerns over a sharp spike in coronavirus infections over the\npast few weeks.\n    \n    HIGHLIGHTS:\n    ** Indonesian 10-year benchmark yields are down\n1 basis point at 6.889%\n    ** Top losers on FTSE Bursa Malaysia Kl Index\ninclude PETRONAS Chemicals Group Bhd down 1.66% at\n5.92 ringgit; CIMB Group Holdings Bhd down 1.58% at\n3.11 ringgit\n    ** Top gainers on the Singapore STI include\nComfortdelgro Corporation Ltd up 1.38% at S$1.47,\nKeppel Corporation Ltd up 1.34% at S$4.55\n    \n    \n  Asia stock indexes and                                     \n currencies at   0407 GMT                              \n COUNTRY   FX RIC          FX     FX     INDEX  STOCK  STOCKS\n                        DAILY  YTD %                S   YTD %\n                            %                   DAILY  \n                                                    %  \n Japan                  +0.11  +2.98            -0.32   -0.48\n China                  -0.40  +3.61             2.27    9.71\n India                   0.00  -2.39             0.71   -1.39\n Indonesi               -0.10  -5.51             0.81  -19.13\n a                                                     \n Malaysia               -0.02  -1.14            -0.91   -4.55\n Philippi               -0.02  +4.74            -0.28  -24.32\n nes                                                   \n S.Korea                +0.40  +0.67             0.47    9.35\n Singapor               -0.12  -0.73             0.64  -20.90\n e                                                     \n Taiwan                 +1.15  +5.13             0.29    7.73\n Thailand               -0.06  -3.73             0.45  -19.43\n \n\n\n (Reporting by Shriya Ramakrishnan in Bengaluru\nEditing by Shri Navaratnam)\n  "}