{"text": "    * Brazil inflation ends 2020 above target, highest in four\nyears\n    * Mexico industrial output beats expectations in November\n    * Chilean peso continues to weaken on lower copper prices\n\n (Updates prices throughout, adds background)\n    By Shreyashi Sanyal\n    Jan 12 A gauge for Latin American currencies\nrose for the first time in 2021 on Tuesday, with Brazil's real\nleading the charge as hopes of recovery were buoyed by improving\neconomic data and a recent rally in the dollar cooled. \n    The MSCI's index for Latin American currencies\n rose 2.08%, on track for its best day since late\nJuly 2020.  \n    The Brazilian real gained over 3%, after\nsliding to a two-month low against the dollar on Monday. A\ngrowing consensus shows that the tides of economic growth,\ninterest rates and commodity prices are turning in the\ncurrency's favor.\n    \"Brazil has lagged while Mexico has outperformed and\npositioning has diverged, with Mexico at the highest allocation\nin three years and Brazil at the lowest. Further out, Brazil\nfaces clear fiscal issues, yet this should not stop Brazil\nperforming well in early 2021,\" strategists at Morgan Stanley\nwrote in a client note. \n    However, Morgan Stanley cut its outlook for emerging market\ncurrencies overall to neutral from \"bullish,\" citing higher U.S.\nyields and little improvement in fundamentals.\n    Official figures from Brazil showed annual inflation ended\nlast year at 4.5%, comfortably above the central bank's year-end\ntarget as food prices rose the most in nearly two decades.\n\n    Brazil's Central Bank Monetary Policy Director Bruno Serra\nsaid it was natural to imagine that the \"extraordinary stimulus\"\nthat the Central Bank is granting to the economy via monetary\npolicy will be removed from the scene in any moment. \n    Mexico's peso rose 1.1% against the dollar a day\nafter data showed the Mexican manufacturing sector's recovery\nfrom the pandemic slump had slowed in November but was stronger\nthan forecast. \n    Mexico's currency recently came under pressure from lower\noil prices, which has also hurt crude-exporter Colombia's peso\n. \n    A recovery also ensued in emerging market currencies in\nEurope on Tuesday, after steep losses last week to a rebounding\ndollar, while stocks held near record highs as increased\nliquidity and low lending rates boosted demand for equities.\n    Emerging market assets have been under pressure in the last\nweek from continued dollar strength and higher yields, which are\nseen as a negative.\n    The Chilean peso was among the few currencies which\nwere lower on Tuesday, falling 0.8%, pressured by weakening\ncopper prices. \n    Shanghai copper fell to a one-week low, hit by demand\nconcerns amid new curbs to fight a resurgence of coronavirus\ncases in China, the world's biggest metals consumer.\n\n    Key Latin American stock indexes and currencies at 1918 GMT:\n    \n         Stock indexes                 Latest   Daily %\n                                                change\n MSCI Emerging Markets                 1356.60     0.52\n MSCI LatAm                            2525.19     2.24\n Brazil Bovespa                      123984.39     0.59\n Mexico IPC                           46039.52    -0.77\n Chile IPSA                            4599.70     1.04\n Argentina MerVal                     51100.24     0.26\n Colombia COLCAP                       1457.77     0.32\n                                                       \n            Currencies                 Latest   Daily %\n                                                change\n Brazil real                            5.3361     3.09\n Mexico peso                           19.8290     1.16\n Chile peso                              725.2    -0.83\n Colombia peso                         3474.75     0.50\n Peru sol                               3.6097     0.06\n Argentina peso (interbank)            85.4600    -0.09\n                                                \n Argentina peso (parallel)                 155     2.58\n                                                \n \n     \n\n (Reporting by Shreyashi Sanyal in Bengaluru; editing by\nJonathan Oatis)\n  "}