{"text": "    * Singapore dollar weakens 0.15%\n    * U.S. CPI growth slows in July\n    * Philippine c.bank seen holding key rate - Reuters poll\n    * Thai markets closed for public holiday\n\n    By Sameer Manekar\n    Aug 12 Asian currencies were largely subdued on\nThursday, with South Korean won hitting a 10-month low, as\nrising coronavirus infections cast a shadow over the region's\neconomies.\n    South Korea's won weakened 0.3% to hit its lowest\nsince October, easing for a fourth straight session as the\ncountry battled to contain its worst coronavirus outbreak, due\nto the emergence of the highly infectious Delta variant.\n\n    Singapore dollar slipped 0.15%, while equities\nadvanced half a percent, a day after losing 0.9% and the country\nhiking its annual growth forecast.\n    Declines among emerging Asia currencies came despite broad\nweakness in the U.S. dollar after data showed a slight\nmoderation in U.S. consumer prices for July. \n    The U.S. dollar index slipped off its four-month\npeak, while 10-year treasury yields ticked higher on\nThursday after slipping in the previous session.\n    That eased concerns that the U.S. Federal Reserve would\nimminently signal a scaling back of bond purchases and begin\nlifting rates from near zero, comforting some of the\nrisk-sensitive Asian markets, however, only for the time being.\n    \"It is premature to draw conclusions about where inflation\nwill settle once more of the 'transitory' aspects fade given\nfiscal stimulus layering on monetary accommodation,\" said\nVenkateswaran Lavanya, an analyst at Mizuho Bank.\n    \"So, it stands to reason that U.S. Treasury yields and U.S.\ndollar being contained after recent pick-up is not to be\nmistaken for a sustained capitulation; certainly not on account\nof one CPI data point.\"\n    In Philippines, equities fell nearly a percent as the\ncountry reeled under the pressure of rising cases of the Delta\nvariant of the coronavirus as well as movement restrictions in\nthe Manila metropolis.\n    However, the peso showed some resilience,\nstrengthening 0.2% ahead of the central bank meeting later in\nthe day where the Bangko Sentral ng Pilipinas (BSP) is expected\nto hold its key interest rate at record-low of 2%, a Reuters\npoll showed.\n    Analysts at Dutch bank ING expect BSP to hold the key rate\nsteady, but added that \"a possible reduction in the reserve\nrequirement is now likely to help shore up liquidity support\".\n    Elsewhere, Jakarta's benchmark index gained half a\npercent after losing 0.6% earlier in the day, while Malaysian\nshares recovered initial losses to trade flat.\n    Markets in Thailand, were closed for a\npublic holiday.\n    \n    HIGHLIGHTS:    \n    ** Indonesian 10-year benchmark yields rise 1.1 basis points\nto 6.355%\n    ** Taiwan dollar appreciates 0.2%\n    ** Thai c.bank eyes credit market to help kick-start economy\n\n    \n    \n  Asia stock indexes and                            \n currencies at   0346 GMT                      \n COUNTRY  FX RIC        FX    FX  INDE  STOCK  STOCK\n                     DAILY   YTD     X      S  S YTD\n                         %     %        DAILY      %\n                                            %  \n Japan               +0.03  -6.4  <.N2  0.20   2.49\n                               6  25>          \n China    <CNY=CFX   +0.03  +0.8  <.SS  -0.12   1.59\n          S>                   0  EC>          \n India               +0.00  -1.8  <.NS   0.00  16.45\n                               4  EI>          \n Indones             +0.00  -2.3  <.JK   0.45   2.29\n ia                            6  SE>          \n Malaysi             +0.09  -5.0  <.KL  -0.02  -7.56\n a                             5  SE>          \n Philipp             +0.13  -4.6  <.PS  -1.03  -7.59\n ines                          6  I>           \n S.Korea  <KRW=KFT   -0.16  -6.2  <.KS   0.08  12.17\n          C>                   2  11>          \n Singapo             -0.09  -2.6  <.ST   0.38  12.25\n re                            4  I>           \n Taiwan              +0.18  +2.4  <.TW  -0.27  16.62\n                               7  II>          \n Thailan             +0.00  -10.  <.SE  -0.64   5.75\n d                            14  TI>          \n \n\n    \n (Reporting by Sameer Manekar in Bengaluru; Editing by Simon\nCameron-Moore)\n  "}