{"text": "* Russian economy likely shrank 3%-4% in Q3- C.bank* Turkish lira retreats from Wednesday rally* Most EMEA stocks fallNov 12 The rouble traded slightly positive on strength in the oil market on Thursday ahead of third-quarter Russian GDP data, while Turkeys lira and other emerging market currencies retreated from recent COVID-19 vaccine driven gains.Russias economy is likely to have shrunk by 3%-4% in annual terms in the third quarter, after an 8% contraction in the previous three months, the central bank said on Wednesday.A spike in infections, prompting partial curbs on social activity, coupled with tensions ahead of the U.S. elections had caused large capital outflows from Russia in October.A ... return to the 70-75 range is possible if at least part of the October capital outflow proves one-off and related to U.S. elections and upcoming changes in taxation, Dmitry Dolgin, chief economist, Russia, at ING, said.Russias finance ministry is also selling sovereign Eurobonds denominated in euros this week, tapping the global debt market for the first time since 2019.Turkeys lira fell about 0.5% after surging more than 4% on Wednesday. A major shake-up of the countrys financial leaders, coupled with fresh measures to rein in volatility had recently spurred buying into the lira, which has underperformed other emerging market currencies this year.Markets were also anticipating an interest rate hike in the near term by the Turkish central bank.Turkish stocks rose nearly 1%, while most other bourses in Europe, Middle East and Africa retreated slightly. The MSCIs index of emerging market stocks rose 0.2%, taking some support from Asian stocks.South Africas rand was a touch weaker ahead of third-quarter unemployment data due later.Central European currencies retreated slightly against the euro. For GRAPHIC on emerging market FX performance in 2020, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance in 2020, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see (Reporting by Ambar Warrick in Bengaluru; Editing by Alexander Smith)"}