{"text": "    * Real down nearly over 6% over past 8 sessions\n    * Chilean economic growth seen surging\n    * Mexican peso lags\n\n (Updates prices)\n    By Ambar Warrick and Susan Mathew\n    July 12 Brazil's real rallied strongly on Monday\non expectations of an economic recovery this year, leading gains\nacross Latin American currencies, but a surge in global cases of\nthe Delta COVID-19 variant prompted caution. \n    The real rose 1.5% after tumbling 6.3% over the past\neight sessions, in the wake of serious graft allegations related\nto vaccine procurement against the government. \n    The sponsor of Brazil's planned income tax reform said on\nMonday that Brazilians would pay 20 billion reais ($3.85\nbillion) less in taxes under a bill he plans to present on\nTuesday.\n    \"Brazil has seen a genuine fall in risk premia as growth,\ninflation and tax revenues have all surprised positively\nreducing fiscal risk premia, whilst at the same time the\n(central bank) has been turning more hawkish. ... This should\nkeep BRL well supported versus peers,\" said FX strategists at\nJPMorgan.\n    But they warned that political tensions could raise the\nreal's risk premium. More broadly, Latam currencies will\nstruggle to appreciate against the dollar by year-end, they\nsaid.\n    Chile's peso rose 0.6% as a central bank survey of\nanalysts showed the economy is expected to expand by 16.5% in\nJune and by 11.9% in the third quarter. Meanwhile, the\ngovernment on Monday revised upwards its projection for 2021\neconomic growth to 7.5% from 6%.\n    But despite expectations of a strong rebound, concerns over\nthe drafting of the country's new constitution have held back\nChilean assets in recent months.\n    Mexico's peso lagged, trading flat against a dollar\nthat gained momentum as a surge in COVID-19 cases and its\ninfectious Delta variant raised questions about the pace and\nprogress of economic growth.\n    JPM strategists said the peso's weakness against the dollar\nshould be contained this year. They expect three more rate hikes\nin Mexico this year and a continued spillover of U.S. fiscal\nstimulus via the current account and manufacturing sector. \n    Among stocks, Brazilian oil major Petrobras\n rose despite falling crude prices. The company said\non Monday it expected to recover $1.274 billion on reaching an\nagreement regarding the Itapu field.\n    In Argentina, the securities regulator tightened rules on\nsome bond trades on Monday, lowering a weekly limit on trading\nof local and international bonds amid a wider clampdown on\nalternative channels used to access foreign exchange.    \n    \n    Key Latin American stock indexes and currencies:\n \n   Stock indexes           Latest    Daily %\n                                     change\n MSCI Emerging Markets      1327.23     0.69\n                                     \n MSCI LatAm                 2569.57      2.3\n                                     \n Brazil Bovespa           127719.50     1.83\n                                     \n Mexico IPC                49819.55      0.1\n                                     \n Chile IPSA                 4231.78    -0.38\n                                     \n Argentina MerVal          63791.61    2.277\n                                     \n Colombia COLCAP            1298.93     0.46\n                                     \n                                            \n      Currencies           Latest    Daily %\n                                     change\n Brazil real                 5.1812     1.48\n                                     \n Mexico peso                19.8690    -0.10\n                                     \n Chile peso                   742.8     0.74\n                                     \n Colombia peso               3818.1     0.23\n                                     \n Peru sol                    3.9539     0.12\n                                     \n Argentina peso             96.0900    -0.10\n (interbank)                         \n                                     \n   \n\n    \n (Reporting by Ambar Warrick; Editing by Andrea Ricci and\nRichard Chang)\n  "}