{"text": "Aug 12 Chinas weak lending numbers and increased business scrutiny, political tensions in Poland, and central bank decisions in Turkey, Mexico and Peru headlined emerging market moves on Thursday. The MSCIs index of emerging market stocks fell 0.4% as Chinese shares slipped with scrutiny on the online insurance sector being the latest in a series of crackdowns. Online insurer ZhongAn tumbled 11.4%.Combined with rising COVID-19 cases, worries outweighed a positive handover from Wall Street where data showing slowing U.S. inflation growth assuaged fears about a rush to taper monetary stimulus.As this dented the dollar, riskier currencies caught a break with an index of EM currencies looking to snap a four-session losing streak.The Chinese yuan flitted between minor gains and losses and markets speculated if the fall in new bank loans to nine-month lows warranted an easing in monetary policy.A ROCK AND A HARD PLACETurkeys lira was up 0.4% ahead of the 1100 GMT central bank decision. While President Tayyip Erdogan has called for a cut in interest rates, inflation has risen to 18.95%, just shy of the key interest rate at 19%.Analysts expect the bank to stay on hold for at least this meeting as well.We are approaching the end game, where we would either witness rate cuts in the coming months, or another direct intervention from the president, said Tatha Ghose, an FX and Em analyst at Commerzbank.The lira is the worst performing EM currency so far this year, down 13%, thanks largely to Erdogans interference in monetary policy - replacing a hawkish central bank chief earlier in the year.The polish zloty was little changed. The currency had fallen on Wednesday after the countrys prime minister dismissed the head of a junior coalition partner from the government, creating uncertainty over the future of the administration.Meanwhile, lawmakers advanced a bill on Wednesday that the opposition in Warsaw says aims to silence a U.S.-owned news channel critical of the government, leading to a swift denunciation from the United States.South Africas rand fell 0.2%. The outlook for the currency has turned cautious amid protests and a new finance minister attempting to revive the economy.Capital Economics, meanwhile, is downbeat about prospects for commodity currencies.The prices of most commodities have faltered recently and we expect them to decline further over the next few years  primarily due to slower growth in China, said Jonathan Petersen, a market economist at Capital Economics, adding that higher U.S. Treasury yields will also weigh.For GRAPHIC on emerging market FX performance in 2021, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance in 2021, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see"}