{"text": "    * India shares down 3%, rupee lowest since August\n    * South Korean won, Thai baht weaken 0.5% each\n    * Shares in Singapore, Malaysia, Indonesia slip\n    * Indonesian rupiah at its lowest since November\n\n    By Sameer Manekar\n    April 12 Asian currencies weakened and equities\ndeclined on Monday, with South Korean won, Indian rupee and Thai\nbaht falling the most, as expectations of more robust economic\ndata from the United States is expected to push U.S. yields\nhigher.\n    South Korea's won weakened 0.5% and Indian rupee\n hit its lowest level since Aug. 4. Equities in\nSingapore and Malaysia lost more than half a\npercent, while Indian shares plunged as much as 3% amid\nsurge in coronavirus cases.\n    Investors await U.S. consumer inflation data for March on\nTuesday, where a likely jump on the back of massive stimulus\nspending is expected to push U.S. Treasury yields higher.\n\n    Bouts of positive data signalling a rapid economic recovery\nin the United States, which some analysts have said will outpace\nother developed markets, have supported the U.S. dollar this\nyear and dented the appeal of its emerging market counterparts.\n    \"Emerging markets currencies will be caught in the\ncross-fire between inflation and yield-seeking behaviour in a\nhigher debt world paradoxically inundated with cheap capital,\"\nMasayuki Tsunashima, an analyst at Mizuho Bank said in a note.\n    In Singapore, stocks declined for the fifth straight session\nahead of the central bank's monetary policy decision on\nWednesday.\n    The Monetary Authority of Singapore (MAS) is seen keeping\nits exchange-rate based policy settings unchanged, a Reuters\npoll showed. MAS lets the local dollar rise or fall against the\ncurrencies of its main trading partners within an undisclosed\nband.\n    Singapore's trade-reliant economy is expected to contract\nonly slightly in the first quarter as activity continues to\nrecover from a pandemic-induced shock, a separate Reuters poll\nshowed.\n    Singapore is also facing some political uncertainty after\nthe city-state's deputy prime minister unexpectedly stepped\naside as the designated successor to current premier Lee Hsien\nLoong.\n    Indonesia's rupiah, which backs some of the\nhighest-yielding debt in emerging markets, fell to its lowest\nlevel since Nov. 3, with 10-year benchmark yields\njumping nearly a percent.\n    Retail sales in Indonesia fell 18.1% in February from the\nsame month a year earlier, a central bank survey showed.\n\n    The benchmark stock index in Jakarta slid as much as 0.9%,\nwhile shares in Kuala Lumpur fell 0.5%. Shares in Thailand\n lost as much as 1.5% as a surge in coronavirus cases\nweighed on sentiment.\n    Through the week, first-quarter economic performance of\nChina, Asia's growth powerhouse, as well as corporate earnings\nin the United States will also be in focus.\n    \n    HIGHLIGHTS:\n    ** Indonesian 10-year benchmark yields rise 6.2 basis points\nto 6.515%\n    ** South Korean battery makers climb after dispute\nsettlement over EV battery technology\n    ** Financials and consumer firms top losers in the Jakarta\nindex\n    \n    \n      Asia stock indexes and                      \n      currencies at 0438 GMT                    \n COUNTRY   FX RIC     FX     FX    INDE  STOCK  STOCK\n                    DAILY   YTD %   X      S    S YTD\n                      %                  DAILY    %\n                                           %    \n  Japan             +0.09   -5.76  <.N2  -0.53  7.90\n                                   25>          \n  China   <CNY=CFX  -0.03   -0.41  <.SS  -0.81  -1.45\n             S>                    EC>          \n  India             -0.24   -2.47  <.NS  -2.30  3.66\n                                   EI>          \n Indones            -0.27   -3.84  <.JK  -1.34  0.17\n   ia                              SE>          \n Malaysi            -0.05   -2.78  <.KL  -0.39  -1.30\n    a                              SE>          \n Philipp            -0.06   -1.15  <.PS  -0.17  -8.48\n  ines                              I>          \n S.Korea  <KRW=KFT  -0.41   -3.52  <.KS  0.06   9.05\n             C>                    11>          \n Singapo            -0.08   -1.60  <.ST  -0.41  11.53\n   re                               I>          \n Taiwan             -0.07   +0.10  <.TW  0.14   14.56\n                                   II>          \n Thailan            -0.44   -5.07  <.SE  -1.26  6.71\n    d                              TI>          \n \n (Reporting by Sameer Manekar in Bengaluru; Editing by Simon\nCameron-Moore)\n  "}