{"text": "    * Bullish bets raised on Asian emerging currencies - Reuters\npoll\n    * India Oct CPI due later in the day\n    * Philippine stock markets closed as typhoon lashes Luzon\nisland\n\n    By Anushka Trivedi\n    Nov 12Most of emerging Asian currencies and\nstock markets settled back  in cautious trade on Thursday after\nthe initial burst of optimism over headway in a coronavirus\nvaccine trial.\n    Indonesia, South Korea and Singapore\nequities slipped between 0.3% to 0.6% after raking in gains\nearlier this week on U.S. drugmaker Pfizer reporting 90%\nefficacy in its late-stage coronavirus vaccine\ntrial.\n    Regional currencies traded sideways, with most drifting\nlower against a broadly stronger greenback, although the\nTaiwanese dollar remained an outlier, jumping over 1%\nfor a second straight day.\n    \"Asia markets are seen trading mixed after the initial\neuphoria cooled and with the region returning to the\nwait-and-see mode,\" said Jingyi Pan, a Singapore-based market\nstrategist with financial services firm IG.\n    Concerns about distribution of the vaccine were at the\nforefront, especially in highly populated countries like India\nand Indonesia, which lack infrastructure required to carry out\nsuch a large-scale operation.\n    \"Challenges remains on the time horizon, manufacturing\ncapacity, deliver and storage of the vaccine even if it is\nproven safe and effective,\" Margaret Yang, a strategist at\nDailyFX said in a note. \n    \"Many developing countries may risk a shortage of funds, and\na lack of cold-chain logistics to facilitate the mass\ndistribution of the vaccine,\" she added. \n    The Indonesian rupiah underperformed its peers as it\nfell 0.4%, marking its worst session in almost two-weeks.\n    Investors went long on all trade-linked currencies after Joe\nBiden's victory in the U.S. presidential election, a Reuters\npoll found, with the rupiah benefiting especially since a drop\nin Treasury yields raised Indonesia's high-yielding bonds'\nappeal.   \n    However, sentiment towards the Indian rupee\nremained relatively weak due to suspicions that India's central\nbank was curbing its appreciation by buying dollars.\n\n    Traders were watching out for India's October inflation data\ndue later in the day, as it is expected to remain above the\ncentral bank's desired range, erasing chances of an\ninterest-rate cut in December.\n    Indian stocks were 0.2% lower in early morning\ntrade.    \n    Meanwhile, the Philippine stock markets were closed\ndue to a typhoon.    \n    \n    \n Asia stock indexes and currencies                                                  \n at 0442 GMT                                                            \n COUNTRY    FX RIC       FX DAILY %  FX YTD %    INDEX  STOCKS DAILY %  STOCKS YTD %\n Japan                        +0.15     +3.18                    -0.13          7.02\n China                        +0.19     +5.22                    -0.20          9.35\n India                        -0.03     -4.06                    -0.49          4.26\n Indonesia                    -0.42     -1.77                    -0.59        -13.05\n Malaysia                     -0.15     -1.06                     0.54         -0.64\n Philippin                    +0.12     +4.52                        -        -10.12\n es                                                                     \n S.Korea                      -0.39     +3.78                    -0.61         12.42\n Singapore                    +0.01     -0.33                    -0.37        -16.12\n Taiwan                       +1.10     +5.57                    -0.29         10.22\n Thailand                     +0.03     -1.16                    -0.88        -15.59\n \n\n (Reporting by Anushka Trivedi in Bengaluru; Editing by Simon\nCameron-Moore)\n  "}