{"text": "    * U.S. consumer prices post biggest gain in nearly 12 years\n    * Brazil's services activity falls in March, first in 10\nmonths\n    * Dollar gains after four sessions of decline\n\n    By Shashank Nayar\n    May 12 Most Latin American currencies fell on\nWednesday as a larger-than-expected jump in U.S. inflation\nraised concerns over early policy tightening, with Brazil's real\nset to snap a five-day winning streak on weak services data.\n    Treasury yields rose 3 basis points to 1.65% and the dollar\nstrengthened after U.S. consumer prices increased more than\nexpected in April, leading many to believe inflationary\npressures could spur the Federal Reserve into tightening policy\nearlier than signaled.\n    A weak U.S. labor market has kept the Fed's stance largely\ndovish. \n    \"We think that most EM currencies will fall a bit further\nover the rest of this year, in part because we forecast the\n10-year US Treasury yield to rise above 2%,\" said Jonas\nGoltermann, senior markets economist at Capital Economics. \n    \"As a result, we expect yield differentials to generally\nshift in favor of the dollar, and pressure on the currencies of\neconomies with weaker fiscal and external balance sheets to\nincrease.\"\n    Brazil's real fell 0.3% after gaining for five\nconsecutive sessions, as services activity fell in March for the\nfirst time in 10 months, meaning the sector shrank in the first\nquarter of the year back to below pre-pandemic\nlevels.\n    Furthermore, analysts believe the real's recent appreciation\nto be short lived due to fiscal concerns, inflation worries and\npressure from the coronavirus pandemic.\n     \"In view of the still very tense COVID situation in Brazil,\nit seems questionable whether the fiscal risk factors really are\nring-fenced after the budget for 2021 was passed with a spending\ncap,\" analysts at Commerzbank wrote in a note.\n    \"Against the background of the slow progress with the\nvaccinations the debate about further corona aid measures might\nresurface next month, if not before, putting BRL under\nconsiderable pressure.\"\n    The yield-sensitive Mexican peso fell 0.2% even as\nits industrial output rose 0.7% in March from February, the\ntenth consecutive monthly increase, official data\nshowed.\n    Commodity-focused currencies like the Colombian and Chilean\npeso eased 0.4% and 0.7%, respectively, despite a\njump in oil and copper prices.\n    The Peruvian sol rose 0.4% and was the only gainer\namong its Latin American peers. Opinion polls showed the gap\nclosing between socialist front-runner Pedro Castillo and the\nright-wing Keiko Fujimori ahead of June 6 presidential\nelections. \n    \n    Key Latin American stock indexes and currencies:\n    \n Stock indexes            Latest    Daily % change\n MSCI Emerging Markets      1319.5                  -0.72\n                                    \n MSCI LatAm                2503.08                  -1.08\n                                    \n Brazil Bovespa           121377.7                  -1.29\n                                 4  \n Mexico IPC               49425.05                  -0.46\n Chile IPSA                4530.45                  -0.23\n Argentina MerVal         -         -\n                                    \n Colombia COLCAP           1285.43                  -0.52\n                                    \n                                                         \n Currencies               Latest    Daily % change\n Brazil real                5.2283                  -0.14\n Mexico peso               20.0181                  -0.35\n Chile peso                  707.1                  -0.71\n Colombia peso             3723.27                  -0.37\n Peru sol                   3.6908                   0.35\n Argentina peso              93.98                  -0.02\n (interbank)                        \n \n\n (Reporting by Shashank Nayar in Bengaluru; Editing by Nick\nMacfie)\n  "}