{"text": "* MSCI EM stocks index near record high* Dollar strength pressures EM FX* Russian stocks at record high* Morgan Stanley no longer bullish on EM FX (Updates prices, analyst comments)Jan 12 Currencies in emerging European markets recovered on Tuesday, after recording steep losses last week to a rebounding dollar, while emerging market stocks held near record highs as increased liquidity and low lending rates boosted demand for equities.South Africas rand rose 1% after tumbling nearly 7% over the past six sessions, while Russias rouble added 0.7% but stuck to a trading range seen since late December.Recent strength in oil prices has helped mitigate some losses in the rouble, while the rand has been particularly hit by the discovery of a new coronavirus variant in the country.Spiking COVID-19 infection rates in EMEA, as well as a rise in U.S. yields on expectations of more debt issuance in the country, have recently pressured currencies in the region.Although investors have turned optimistic on the prospects for an economic recovery, continued dollar strength and high yields are expected to be negative for emerging markets this year.Morgan Stanley tempered its bullish view to a neutral stance on emerging market currencies in a recent note, citing higher U.S. yields and little improvement in emerging market fundamentals.EM assets have continued to trade well and we have now hit our forecasts for EM currencies and also EM sovereign credit, Morgan Stanley analysts wrote.Investors have also begun pricing in a possible U.S. interest rate increase by late 2022.The MSCIs index of emerging-market stocks rose 0.3% and held just below Mondays record high.Most EMEA markets rose, with Turkish stocks rising 0.5% to a near record high. Russian stocks hit a record peak, while most central European stocks also gained.Emerging market stocks had started the year on a strong note, tracking optimism over an eventual economic recovery through a vaccine programme and continued stimulus measures.For GRAPHIC on emerging market FX performance in 2021, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance in 2021, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see (Reporting by Ambar Warrick in Bengaluru; Editing by Larry King and Alex Richardson)"}