{"text": "    * Bullish bets raised on Asian emerging currencies - Reuters\npoll\n    * Palm oil shares boost Malaysia stock index\n    * Philippine stock markets closed due to typhoon\n    * Bank Indonesia sees room to ease rates -central bank\ngovernor\n\n    By Anushka Trivedi\n    Nov 11 Most of emerging Asian currencies and\nstock markets settled back in cautious trade on Thursday after\nthe initial burst of optimism over headway in a coronavirus\nvaccine trial.\n    Thai stocks led losses with a 1% drop, followed by\nIndonesia and Singapore, giving up some gains\nfrom a rally earlier this week that was powered by positive\ncoronavirus vaccine news from U.S. drug maker Pfizer Inc\n.\n    Most regional currencies drifted lower against a steady\ngreenback, although the Taiwanese dollar was an\noutlier, jumping more than 1% for a second straight day.\n    \"Challenges remain on the time horizon, manufacturing\ncapacity, delivery and storage of the vaccine even if it is\nproven safe and effective,\" DailyFX strategist Margaret Yang\nwrote in a note.\n    Concerns about distribution of the vaccine were at the\nforefront, especially in highly populated countries like India\nand Indonesia, which lack infrastructure required to carry out\nsuch a large-scale operation.\n    The Indonesian rupiah fell 0.5%, marking its worst\nsession in almost two-weeks, as its central bank said there was\nroom to ease rates to support economic growth.\n    The currency had firmed on the vaccine news and recent\ncapital inflows but investors are taking a pause ahead of the\ncentral bank meeting next week, Bank of Singapore FX analyst Moh\nSiong Sim said.\n    He said it was a \"close call\" whether Bank Indonesia would\nactually slash interest-rates since it has favoured stabilising\nrupiah in the past.      \n    Meanwhile, a Reuters poll showed investors went long on all\nAsian emerging currencies but sentiment towards the Indian rupee\n remained frail on suspicions that the country's central\nbank was curbing its appreciation by buying dollars.\n\n    Among equity markets, Malaysia's benchmark index\nrose 1% to be the sole gainer, lifted by palm oil producers as\nprices of the commodity climbed.\n    Meanwhile, the Philippine stock markets were closed\ndue to a typhoon. \n    \n    HIGHLIGHTS\n    \n    ** Thailand's 10-year government bond yields are down 2.5\nbasis points at 1.37%\n    ** Top gainers on Malaysia index: Genting Bhd\n, up 4%, and Genting Malaysia Bhd, up 2.6% \n    ** Top losers on Thailand's SETI include Thai Energy\nStorage Technology PCL 3K-BAT.BK, down 28.9%, and Apex\nDevelopment PCL, down 14.3%\n    \n    \n Asia stock indexes and currencies                                                      \n at 0730 GMT                                                               \n COUNTRY      FX RIC      FX DAILY %   FX YTD %     INDEX  STOCKS DAILY %   STOCKS YTD %\n Japan                         +0.14      +3.17                      0.68           7.88\n China                         +0.01      +5.04                     -0.11           9.46\n India                         -0.32      -4.34                     -0.34           4.42\n Indonesia                     -0.50      -1.84                     -0.90         -13.33\n Malaysia                      -0.15      -1.06                      0.95          -0.23\n Philippines                   +0.15      +4.55                         -         -10.12\n S.Korea                       -0.43      +3.73                     -0.41          12.65\n Singapore                     -0.09      -0.43                     -0.26         -16.03\n Taiwan                        +0.45      +4.89                     -0.30          10.21\n Thailand                      -0.13      -1.32                     -1.24         -15.90\n \n    \n\n (Reporting by Anushka Trivedi in Bengaluru; Editing by Anil\nD'Silva)\n  "}