{"text": "* Lira stumbles as investors await decisive c.bank action* EM stocks falter as U.S. stimulus talks stall* Russian rouble, S.African rand weaken against dollarAug 12 The Turkish lira resumed its sharp fall on Wednesday on investor worries of a full-blown currency crisis and as a firm dollar made it more vulnerable to a squeeze, while emerging market stocks fell on doubts over coronavirus aid in the United States.The lira weakened 1.7% to 7.32 against the greenback, as investors looked for more substantial moves from the Turkish central bank to stave off a meltdown in the currency amid concerns over depleted reserves and costly state FX interventions.The central banks decision to halt cheaper funding that had allowed primary dealers to borrow well below its policy rate helped support the lira in the previous session but the optimism did not carry through to Wednesday.Commerzbank FX analyst, Esther Reichelt, said these backdoor channels to stabilize the currency should be regarded as temporary.Credible and permanent interest rate hikes are necessary to control inflation and stabilize the Turkish lira. It is therefore probably only a matter of time before USD-TRY trades above 7.40.The dollar extended a bounce from last Friday against a basket of currencies as U.S.-China tensions ratcheted higher following President Donald Trumps ban on U.S. transactions with the Chna-based owners of video-sharing app TikTok and messaging app WeChat.The MSCIs index for emerging market stocks fell 0.2%, as a stalemate between the Republican White House and congressional Democrats over coronavirus relief entered a fourth day without talks on Tuesday, with each party blaming the other for intransigence.Most Asian markets declined, along with a rapid selling of gold. A fall in prices of the yellow metal also hurt miners in South Africa, which pushed the countrys main equity index 0.5% lower.South Africas Sasol extended declines with a 9% fall as it warned on Tuesday it will report an annual loss after a drop in oil and chemical prices and the impact of the coronavirus pandemic hit earnings.The rand eased against the dollar, as did Russias rouble.Unrest in Belarus also remained in focus, as Swedens foreign minister said she had been invited to an extraordinary European Union foreign affairs meeting on Friday to discuss potential sanctions on the country following Sundays presidential election there.Currencies in central and eastern Europe including Hungary , Poland, Romania and the Czech Republic, were mostly lower against the euro. For GRAPHIC on emerging market FX performance in 2020, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance in 2020, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see (Reporting by Shreyashi Sanyal in Bengaluru; editing by Emeia Sithole-Matarise)"}