{"text": "    * Chilean peso rises as copper surges to eight-year high \n    * Brazil economic activity fell 4.05% in 2020 - central bank\nindex\n\n (Updates prices)\n    By Susan Mathew\n    Feb 12 Latin American currencies erased early\nlosses to firm on Friday against a steady dollar, with Chile's\npeso leading gains as prices of its main export, copper, surged\nto eight-year peaks. \n    Chile's peso rose 0.7%, taking weekly gains to more\nthan 2% - its best week in two months. Copper prices rebounded\nas investors took advantage of a pullback to add to their\nbullish positions, betting demand will keep outpacing supply.\n\n    Mexico's peso was flat a day after the country's\ncentral bank cut interest rates for the first time since\nSeptember, by 25 basis points to 4%.\n    \"There was a dovish surprise in that the decision to cut ...\nwas unanimous,\" wrote Sacha Tihanyi, deputy head of emerging\nmarkets strategy at TD Securities. \n    \"We believe that Banxico is stating that so long as\ninflation expectations remain stable and there are no unexpected\nnear-term shocks to prices, the door remains open to further\neasing.\"\n    On the week, the peso looks to mark its second straight week\nin the black, with higher oil prices contributing to the\ncurrency's gain. Fellow crude exporter Colombia's peso\nsurged to three-week highs on Friday as oil prices rose, taking\nweekly gains to 1.7% - the best since the beginning of the\nyear. \n    The Brazilian real reversed early losses and was up\nmarginally, but is set to record losses for the week as worries\nremains of the government's finances. \n    Brazil will extend pandemic emergency cash transfers to the\npoor and vulnerable, Economy Minister Paulo Guedes said on\nThursday, but added that the payments must come with\ncompensating cost-cutting measures to avoid damage to public\nfinances.\n    Economic activity in Brazil fell 4.05% last year, a central\nbank index showed, with the economic blow from the COVID-19\npandemic for the year as a whole softened by an eighth\nconsecutive month of growth in December.\n    Markets were also hopeful that U.S. President Joe Biden's\nplanned coronavirus relief package will be passed by lawmakers\nsoon.    \n    Elsewhere in Latin America, data showed oil output from the\nVaca Muerta region in Patagonia, which stalled during the\ncoronavirus pandemic, hit a record high in December as producers\nrevved up wells with an eye on rebounding prices and a new\nexport market.\n    The region holds the world's fourth-largest shale oil\nreserves. \n    Stocks markets in the region were mixed, with Chilean stocks\n scaling three-week highs, while Brazil's Bovespa I\nindex fell 0.2%.\n    Key Latin American stock indexes and currencies:\n  Stock indexes           Latest   Daily %\n                                   change\n MSCI Emerging Markets    1429.59     0.12\n                                   \n MSCI LatAm               2408.60     0.08\n                                   \n Brazil Bovespa         119081.41    -0.18\n                                   \n Mexico IPC              44196.80     0.31\n                                   \n Chile IPSA               4599.71     1.13\n                                   \n Argentina MerVal        51357.62   -0.575\n                                   \n Colombia COLCAP          1363.09    -0.34\n                                   \n                                          \n      Currencies          Latest   Daily %\n                                   change\n Brazil real               5.3822     0.09\n                                   \n Mexico peso              19.9375     0.03\n                                   \n Chile peso                 721.9     0.32\n                                   \n Colombia peso             3494.5     0.86\n                                   \n Peru sol                  3.6437    -0.11\n                                   \n Argentina peso           88.5300    -0.09\n (interbank)                       \n                                   \n \n (Additional reporting by Shashank Nayar and Shreyashi Sanyal in\nBengaluru; Editing by Jan Harvey and Jonathan Oatis)\n  "}