{"text": "    * U.S. consumer prices post biggest gain in nearly 12 years\n    * Brazil services activity falls in March, first in 10\nmonths\n    * Dollar gains after four sessions of decline\n\n (Adds details, updates prices throughout)\n    By Shreyashi Sanyal and Shashank Nayar\n    May 12 Colombia's peso fell on Wednesday as\nanti-government protests entered their third week, while the\nBrazilian real led declines among Latin currencies as a\nlarger-than-expected jump in U.S. inflation lifted the dollar. \n    The peso fell 1.1% after union members, students,\npensioners and workers took to the streets of Colombia to march\nin anti-government protests, amid so-far fruitless talks.\n\n    The oil-exporters currency weakened despite a sharp rise in\ncrude prices, which were on track for eight-week highs on demand\nhopes.\n    Brazil's real fell 1.5% after gaining for five\nconsecutive sessions. Services activity fell in March for the\nfirst time in 10 months, meaning the sector shrank in the first\nquarter of the year back to below pre-pandemic\nlevels. \n    Treasury yields rose 3 basis points to 1.65% and the dollar\nstrengthened after U.S. consumer prices increased more than\nexpected in April, leading many to believe inflationary\npressures could spur the Federal Reserve into tightening policy\nearlier than signaled.\n    A weak U.S. labor market has kept the Fed's stance largely\ndovish. \n    \"We think that most EM currencies will fall a bit further\nover the rest of this year, in part because we forecast the\n10-year U.S. Treasury yield to rise above 2%,\" said Jonas\nGoltermann, senior markets economist at Capital Economics. \n    \"As a result, we expect yield differentials to generally\nshift in favor of the dollar, and pressure on the currencies of\neconomies with weaker fiscal and external balance sheets to\nincrease,\" Goltermann added. \n    The yield-sensitive Mexican peso fell 0.9% even as\nMexico's industrial output rose 0.7% in March from February, the\n10th consecutive monthly increase, official data\nshowed.\n    Copper producer Chile's peso eased 0.7% despite a\njump in oil and copper prices.\n    The Peruvian sol rose 0.3% and was the only gainer\namong its Latin American peers. Opinion polls showed the gap\nclosing between socialist front-runner Pedro Castillo and the\nright-wing Keiko Fujimori ahead of June 6 presidential\nelections. \n    \n    Key Latin American stock indexes and currencies at 1927: \n    \n         Stock indexes                  Latest    Daily %\n                                                  change\n MSCI Emerging Markets                   1311.55    -1.32\n MSCI LatAm                              2444.53     -3.4\n Brazil Bovespa                        119755.18    -2.61\n Mexico IPC                             48874.92    -1.57\n Chile IPSA                              4502.30    -0.85\n Argentina MerVal                       51218.29    0.243\n Colombia COLCAP                         1286.92     -0.4\n                                                         \n             Currencies                 Latest    Daily %\n                                                  change\n Brazil real                              5.3027    -1.50\n Mexico peso                             20.1628    -1.06\n Chile peso                                707.2    -0.72\n Colombia peso                           3747.88    -1.03\n Peru sol                                 3.7158    -0.32\n Argentina peso (interbank)              93.9800    -0.02\n                                                  \n Argentina peso (parallel)                   149     1.34\n                                                  \n \n\n (Reporting by Shreyashi Sanyal and Shashank Nayar in Bengaluru;\nEditing by Nick Macfie and Will Dunham)\n  "}