{"text": "    * Asian stock markets: tmsnrt.rs/2zpUAr4\n    * Philippines records highest daily rise in COVID-19 cases\nin\nnearly 6 months \n    * Indonesia poised to end higher for 6th week\n\n    By Shruti Sonal\n    March 12 Philippine shares slipped on Friday to\nbe on track for their worst week in six, as a spike in\ncoronavirus cases and a slump in monthly imports led to concerns\nover recovery in its economy. \n    The benchmark index shed 0.2% and eyed a weekly fall\nof over 2.5%, its biggest decline since the week ended January\n29. \n    The Philippine economy was among the fastest growing in the\nregion before the pandemic, but strict and lengthy restrictions\nand slow vaccine procurements have dampened the path to\nrecovery.\n    The country, which has the second-highest number of COVID-19\ncases and deaths in Southeast Asia, recorded its highest daily\nincrease in COVID-19 cases in nearly six months on Thursday.\n\n     Its trade deficit came in at $2.42 billion in January, the\nwidest in 12 months, with imports sliding 14.9%, and exports\nfalling 5.2% for their biggest decline in five months,\ngovernment data showed on Friday.\n    \"The ongoing slump in imports suggests that growth pains for\nthe Philippines will be around for some time\", said ING\neconomist Nicholas Mapa. \n    Authorities attempted to calm investors' nerves. President\nRodrigo Duterte said on Thursday the economy should be reopened\nsoon, while the central bank is not inclined to tighten monetary\npolicy at this time, its governor said.\n     Elsewhere, equities tracked broader market gains after U.S.\nPresident Joe Biden signed a $1.9 trillion stimulus bill into\nlaw, and as a retreat in bond yields overnight soothed global\nconcerns about accelerating inflation.\n    Shares in South Korea and Indonesia added\nabout 1% each, while Thailand climbed 0.5%. Jakarta's\nbenchmark was poised to end higher for a sixth straight week. \n    Most regional currencies strengthened against the dollar as\ncalming bond markets lifted investor sentiment and boosted\nappetite for riskier Asian currencies.\n    The Taiwan dollar, South Korean won and\nthe Indonesian rupiah gained between 0.1% and 0.3%.\n    Further soothing nerves about rising yields, the European\nCentral Bank said on Thursday it would accelerate money-printing\nto keep a lid on euro zone borrowing costs.\n    \n    Highlights:\n    \n    ** Indonesian 10-year benchmark yields are down 5.6 basis\npoints at 6.7%\n    ** Top gainers on the Jakarta stock index include\nZebra Nusantara Tbk PT, Trimegah Sekuritas Indonesia\nTbk PT, Cahaya Bintang Medan Tbk PT \n    ** Thai PM, cabinet cancel Friday's scheduled AstraZeneca\nvaccinations\n    \n    \n  Asia stock indexes and                                 \n currencies at   0345 GMT                          \n COUNTRY  FX RIC        FX     FX  INDEX   STOCKS  STOCKS\n                     DAILY  YTD %         DAILY %   YTD %\n                         %                         \n Japan               -0.20  -5.03  <.N22   1.18     7.70\n                                   5>              \n China    <CNY=CFX   +0.10  +0.62  <.SSE     0.38   -0.67\n          S>                       C>              \n India               +0.00  +0.22  <.NSE     0.00    8.53\n                                   I>              \n Indones             +0.14  -2.33  <.JKS     1.01    5.83\n ia                                E>              \n Malaysi             -0.27  -2.33  <.KLS    -0.55   -0.42\n a                                 E>              \n Philipp             +0.13  -0.83  <.PSI    -0.22   -6.10\n ines                              >               \n S.Korea  <KRW=KFT   +0.30  -4.09  <.KS1     1.21    6.15\n          C>                       1>              \n Singapo             -0.20  -1.58  <.STI     0.01    9.24\n re                                >               \n Taiwan              +0.45  +1.31  <.TWI     0.31   10.16\n                                   I>              \n Thailan             -0.36  -2.25  <.SET     0.25    8.94\n d                                 I>              \n \n    \n\n\n\n\n (Reporting by Shruti Sonal in Bengaluru; Editing by Muralikumar\nAnantharaman)\n  "}