{"text": "* MSCI EM stocks index down 0.4%, but up about 1% on week* Market backdrop still conducive to risk-taking in EM - Barclays* Lira, rand, Mexican peso all fall more than 1%* Fed meeting, Sino-U.S. talks eyed next weekMarch 12 Emerging markets currencies and stocks looked to end a volatile week on a sour note on Friday, with a dollar on the rise dousing risk appetite.MSCIs index of EM stocks fell 0.4% as a pick-up in U.S. bond yields pressured risk assets. Gains during Asian hours were erased with a 2.2% drop in Hong Kong shares leading declines.On the week, however, the EM index was up about 1%, recovering after a brief fall into correction territory, as U.S. Treasury yields had pulled back after tepid U.S. inflation data. But it was well short of the rally seen in world stocks , which are up 2.6% so far.The stabilisation of U.S. Treasury yields... has brought some relief to EM asset markets, even though concerns about the trajectory of UST yields and the recent outflows continue to dominate market sentiment, said Christian Keller at Barclays.We believe that the market backdrop is still conducive to risk-taking in EM, with the rise in oil and commodity prices a supportive factor.Barclays, citing Emerging Portfolio Fund Research data, also noted that the yields play had spurred sizeable outflows at both EM hard and local-currency bond funds in the week to March 10. However, these were more than offset by continued inflows into emerging equity funds, led by Asian stocks.Investors focus next week is likely to be on a U.S. Federal Reserve policy meeting, and the first high-level talks between Beijing and Washington since U.S. President Joe Biden took office. Frayed relations between the two economies had roiled markets and contributed to a downturn in global economic growth.Currencies of the developing world fell 0.1% as spiking yields saw the dollar inch back towards this years high.Turkeys lira, South Africas rand and Mexicos peso all fell more than 1%, with the lira also under pressure from Thursdays data showing dollarization among locals remains high ahead of a key central bank meeting next Thursday.Unlike the rand and the peso, which are on track for weekly gains of more than 2%, the lira has struggled to make any headway since last Friday.Expectations for both inflation and an interest rate rise ticked higher in a closely watched survey published on Friday, reinforcing market predictions that the central bank will tighten policy by about 50 basis points next week.Russia's rouble slipped from a three-week peak as oil prices fell, though the drop was less pronounced than elsewhere. For GRAPHIC on emerging market FX performance 2020, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance 2020, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see"}