{"text": "    * Graphic: World FX rates tmsnrt.rs/2egbfVh\n    * U.S. 10-year Treasury yields up, dollar gains \n    * Glove makers hit Malaysian shares \n    * China shares fall as much as 2.3% \n\n    By Nikhil Nainan\n    Aug 12 Emerging Asian currencies were flat to lower\nagainst a resurgent U.S. dollar on Wednesday, while heavy losses for\nMalaysian glove makers sent its stock market to a more than one-month\nlow.\n    The overall mood on stock markets was downbeat, with Chinese\nequities down around 1% after data showed a slowdown in money\nsupply and bank lending growth, clouding encouraging signals in the\npast week.\n    \"July's money and credit data were all below expectations,\"\nGoldman Sachs analysts said in a client note.\n    China was first to emerge from coronavirus lockdowns and its\neconomy has shown signs of getting back into gear, but investors are\nyet to be convinced that the path to recovery for it and other Asian\nmarkets is clear. \n    New Zealand, a country seen by many to have successfully\ncontained the outbreak early on, reimposed strict restrictions on\nWednesday after new COVID-19 cases were uncovered.\n    Asia's emerging currencies have been helped through the crisis by\na slide in the dollar as the U.S. Federal Reserve pumped billions of\nadditional dollars into the financial system and COVID-19 cases in\nthe United States rose.\n    That trend has reversed somewhat in the past week, however, and a\njump in U.S. Treasury yields overnight, ahead of a record $38 billion\nbond auction later on Wednesday, gave the greenback another boost.\n\n    \"The dollar short-squeeze seems to be ongoing still, and\nsentiments in Asia are a tad cautious ahead of the U.S.-China trade\npact review due around 15 Aug,\" Maybank analysts said in a note.\n    Indonesia's rupiah was the biggest loser in Asia's\nemerging currency space, down 0.4%. \n    After China, Malaysia was among the hardest hit markets\non the day with shares down 0.6%. \n    Malaysia's Top Glove Corp, the world's largest medical\nglove maker, and its local rival, Hartalega Holdings, fell\naround 8.9% and 7.5%, respectively, dragging the benchmark lower.\n    The glove makers, who have enjoyed a surge in demand during the\ncoronavirus crisis, have been under pressure of late over their\ntreatment of migrant workers.\n    Thailand was closed for a public holiday.    \n    \n    HIGHLIGHTS: \n    ** Top Glove Corp and Hartalega Holdings top\nlosers on Malaysia's benchmark \n    ** Indonesian 10-year benchmark yields down 3 basis points to\n6.76%    \n             Asia stock indexes and currencies at 0710 GMT\n COUNTRY      FX RIC       FX       FX      INDEX    STOCKS    STOCKS\n                           DAILY %  YTD %            DAILY %   YTD %\n Japan                       -0.26   +1.73               0.41   -3.44\n China                       -0.07   +0.17              -0.68    8.77\n India                       -0.01   -4.54              -0.17   -7.11\n Indonesia                   -0.48   -5.51               0.68  -17.05\n Malaysia                    -0.05   -2.53              -0.60   -2.10\n Philippines                 +0.02   +3.52               0.69  -23.29\n S.Korea                     +0.03   -2.44               0.57   10.68\n Singapore                   -0.07   -2.15               0.59  -20.60\n Taiwan                      +0.41   +2.36              -0.86    5.61\n \n (Reporting by Nikhil Kurian Nainan in Bengaluru; editing by Patrick\nGraham and Arun Koyyur)\n  "}