{"text": "    * Graphic: World FX rates tmsnrt.rs/2egbfVh\n    * Graphic: Foreign flows into Asian stocks tmsnrt.rs/3f2vwbA\n    * Taiwan stocks down 8.6%, FX down 0.2% on possible virus\ncurbs\n    * Philippine stocks at lowest since Oct 2020 \n    * Philippine c.bank set to keep rates unchanged at record\nlow\n    * Asian FX, stocks pressured as U.S. inflation views build\n\n    By Rashmi Ashok\n    May 12 Taiwan stocks slid more than 8% on\nWednesday and were headed for their worst day in over 26 years\nas authorities mulled tighter restrictions to tackle a rise in\ndomestic COVID-19 cases, while other Asian equities fell on\nconcerns over higher inflation. \n    Equities in Taipei tumbled 8.6% and the Taiwan\ndollar weakened 0.2% as health authorities said they\nmay raise the country's COVID-19 alert level in \"coming days\".\n\n    The possible restrictions, which would mean closure of\nnon-essential businesses, came after a cluster of six new cases\nwith no clear infection source was found on Tuesday, an unusual\noutbreak for the island that has kept a tight lid on community\noutbreaks.   \n    The equity rout prompted the country's deputy finance\nminister to call for calm, saying the stock market's\nfundamentals were sound. \n    Taiwan stocks had rallied more than 100% from lows in March\nlast year to end-April, buoyed by strong demand for the\ncountry's chips and electronics exports as the work-from-home\nshift boosted demand for home electronics. \n    Elsewhere, shares in Seoul slipped 1.7%, while Thai\nequities were off nearly 1%. Regional currencies were\nalso weaker, with export-focused units such as the won\n, the Singapore dollar and baht losing\nmost. \n    Despite various U.S. Federal Reserve officials reiterating a\nfirmly dovish policy stance, investors worried that higher\ninflation from a spike in commodity prices could force the Fed\nto raise interest rates. U.S. inflation data due later in the\nday also added to nerves. \n    \"Markets are calling the Fed's bluff, fearing that the Fed\nmay need to hike rates more quickly and aggressively than\nexpected. Today's U.S. CPI release will be a big focus for more\nclues,\" said Mitul Kotecha, chief EM Asia and Europe strategist\nat TD Securities.\n    \"Should the Fed hint at an earlier taper, it would likely\nput pressure on Asian markets, with a likely firmer dollar\nweighing on Asian FX and higher U.S. yields pressurising Asian\nlocal currency bonds and equities,\" Kotecha said.\n    While Asian central banks are less sensitive to U.S. rates\nthan previously, inflationary pressures in the region were\nstarting to build, he added.\n    The Philippine market slipped 1.5% to hit its lowest\nsince Oct. 30, 2020. The central bank is slated to announce its\nmonetary policy decision soon, where it is expected to keep\ninterest rates unchanged at a record low.\n    Indonesian markets were closed for the Eid festival.\n    \n    HIGHLIGHTS:\n    ** Taiwan Cement Corp and Asia Cement Corp\n were among top losers on the Taiwan Stock Index, down\nover 5% each\n    ** Malaysia's 10-year benchmark yield is up 0.5 basis points\nat 3.142%, while the 3-year benchmark yield is up 0.1 basis\npoints at 2.061% \n    ** In the Philippines, top index losers are Megaworld Corp\n, down 4.03%, and SM Prime Holdings Inc, down\n3.53% \n\n\n  Asia stock indexes and                              \n currencies at   0420 GMT                        \n COUNTRY  FX RIC        FX     FX  INDE  STOCKS  STOCK\n                     DAILY  YTD %     X   DAILY  S YTD\n                         %                    %      %\n Japan               -0.22  -5.15  <.N2   -1.88   2.29\n                                   25>           \n China    <CNY=CFX   -0.19  +1.36  <.SS   -0.01  -0.91\n          S>                       EC>           \n India               +0.00  -0.37  <.NS   -0.72   5.45\n                                   EI>           \n Malaysi             -0.27  -2.59  <.KL    0.26  -2.80\n a                                 SE>           \n Philipp             -0.01  +0.34  <.PS   -1.53  -12.7\n ines                              I>                4\n S.Korea  <KRW=KFT   -0.44  -3.41  <.KS   -1.97   9.49\n          C>                       11>           \n Singapo             -0.27  -0.60  <.ST   -0.63   9.87\n re                                I>            \n Taiwan              -0.17  +1.72  <.TW   -4.97   6.97\n                                   II>           \n Thailan             -0.45  -4.07  <.SE   -1.09   7.76\n d                                 TI>           \n \n\n (Reporting by Rashmi Ashok; editing by Richard Pullin)\n  "}