{"text": "    * Graphic: World FX rates tmsnrt.rs/2egbfVh\n    * U.S. 10-year Treasury yields up, dollar gains \n    * South Korean shares set for first drop in 7\n    * Glove makers hit Malaysian shares \n\n    By Nikhil Nainan\n    Aug 12 Emerging Asian currencies were flat to\nlower against a resurgent U.S. dollar on Wednesday, while heavy\nlosses for Malaysian glove makers sent its stock market to a\nmore than one-month low.\n    Often favoured for its safe-haven appeal, the greenback has\nstruggled this year as the U.S. Federal Reserve pumped billions\nof additional dollars into the financial system and COVID-19\ncases surged.\n    That trend has reversed somewhat in the past week and a jump\nin U.S. Treasury yields overnight, ahead of a record $38 billion\nbond auction later on Wednesday, gave the currency another boost\nacross the board.\n    In Asia, Indonesia's rupiah was the biggest loser,\ndown 0.4%. \n    \"The dollar short-squeeze seems to be ongoing still, and\nsentiments in Asia are a tad cautious ahead of the U.S.-China\ntrade pact review due around 15 Aug,\" Maybank analysts said in a\nnote.\n    The mood on stock markets was more gloomy, with Chinese\nequities down 1.7% following late losses on Wall Street\novernight, and Singapore and Taiwan down 0.5% and 0.8%,\nrespectively.\n    China was first to emerge from coronavirus lockdowns and has\nreported encouraging economic data in the past week, but\ninvestors are yet to be convinced the road to recovery is\nclear. \n    New Zealand, a country seen by many to have successfully\ncontained the outbreak early on, reimposed strict restrictions\non Wednesday after a clutch of new cases.\n    Outside China, Kuala Lumpur was the hardest hit\nmarket, with shares down almost 1%. \n    Top Glove Corp, the world's largest medical glove\nmaker, and its local rival, Hartalega Holdings, fell\naround 12% at one point, dragging broader shares to their lowest\nsince July 3.\n    The glove makers have been under pressure over their\ntreatment of migrant workers.\n    Thailand was closed for a public holiday.    \n    \n    HIGHLIGHTS: \n    ** Top losers on FTSE Bursa Malaysia Kl Index include\nHartalega Holdings down 7.65%, and Top Glove Corp\n down 5.64% \n    ** Indonesian 3-year benchmark yields up 9.1 basis points to\n5.331%    \n           Asia stock indexes and currencies at 0336 GMT\n COUNTRY      FX RIC      FX       FX     INDEX    STOCKS  STOCKS\n                          DAILY %  YTD %           DAILY   YTD %\n                                                   %       \n Japan                      -0.17  +1.83             0.17   -3.67\n China                      -0.07  +0.17            -1.74    7.61\n India                      +0.00  -4.53             0.00   -6.95\n Indonesia                  -0.41  -5.45             0.46  -17.23\n Malaysia                   -0.07  -2.55            -0.86   -2.36\n Philippines                -0.01  +3.49             0.47  -23.46\n S.Korea                    -0.06  -2.52            -0.15    9.89\n Singapore                  -0.10  -2.18            -0.46  -21.42\n Taiwan                     +0.40  +2.36            -0.75    5.73\n \n (Reporting by Nikhil Kurian Nainan in Bengaluru; Editing by Kim\nCoghill)\n  "}