{"text": "    * Malaysia shares fall as much as 1.6%\n    * Malaysia lockdown may shave 0.7% off 2021 growth- CGS-CIMB\n    * Rupiah falls as U.S. 10-year yields top 1%\n\n    By Nikhil Nainan\n    Jan 12 Malaysia led losses across Southeast\nAsian stock markets on Tuesday after a state of emergency was\ndeclared in the country to curb the spread of COVID-19, with\nbank stocks leading the decline.\n    Malaysia's main stock index declined as much as\n1.6%, falling sharply for a second straight session, while other\nAsian stock markets also tracked overnight losses on Wall\nStreet. South Korean shares were down more than 1%.\n    Malaysia's King Al-Sultan Abdullah declared a nationwide\nstate of emergency on Tuesday to curb the coronavirus, one day\nafter the country's prime minister announced a 14-day lockdown\nin the capital and five states.\n    CGS-CIMB Securities expects a fortnight of restrictions will\nshave 0.7% off Malaysia's 2021 growth forecast, estimating daily\neconomic losses of 750 million ringgit ($184.87 million).\n    \"Given the risk that the MCO (movement control order) may be\nextended... additional policy support may be needed to support\nthe economy,\" the brokerage said, adding the central bank may\ndiscuss a rate cut at its monetary policy meeting next week.\n    The ringgit weakened 0.2%, while other emerging\ncurrencies in Asia traded in tight ranges.\n    Indonesia's rupiah dipped 0.5% against the dollar,\nwhich tracked U.S. Treasury yields higher. Ten-year U.S. yields\ntopped 1% last week for the first time since March. \n    The rupiah is generally favoured by foreign investors\nseeking to tap Indonesia's high-yielding debt. \n    TD Securities expects short-term pressure to continue on the\nrupiah as U.S. yields rise and inflows into local bond markets\ntemporarily ease. \n    The Taiwanese dollar, which tends to move in wider\nranges, strengthened 1.8%. Taiwan's central bank has sent\ninspectors to domestic banks to investigate whether exporters\nare speculating in foreign currency as the Taiwan dollar soars\nagainst the U.S. dollar, Reuters reported on Monday.\n\n    ($1 = 4.0570 ringgit)\n    \n    HIGHLIGHTS:\n    ** Indonesian 3-year yields are up 9 basis points at 5.084%,\nwhile 10-year yields are up 4.5 basis points at 6.263%\n    ** Hong Leong Bank down 3.2%, CIMB Group Holdings\ndown 3% and Public Bank Bhd dropped 2.3% \n        Asia stock indexes and currencies at 0355 GMT      \n COUNTRY      FX          FX       FX     INDEX    STOCKS   STOCKS\n              RIC         DAILY %  YTD %           DAILY %  YTD %\n Japan                    -0.03    -0.99           0.00     2.54\n China                    +0.14    +0.90           0.80     2.50\n India                    +0.00    -0.43           -0.08    3.52\n Indonesia                -0.49    -0.78           0.30     7.07\n Malaysia                 -0.17    -0.91           -1.18    -1.79\n Philippines              +0.10    -0.10           -0.66    1.64\n S.Korea                  -0.20    -1.21           -1.81    7.59\n Singapore                +0.00    -0.74           -0.45    4.45\n Taiwan                   +1.75    +1.74           -0.60    4.96\n Thailand                 -0.10    -0.63           -0.22    5.78\n \n (Reporting by Nikhil Kurian Nainan in Bengaluru; Editing by Ana\nNicolaci da Costa)\n  "}