{"text": "    * Philippine peso remains under pressure\n    * China stocks lead regional rally\n    * Japan's Nikkei set for best day in nearly 3 weeks\n    * Graphic: World FX rates tmsnrt.rs/2RBWI5E\n    * Asian stock markets: tmsnrt.rs/2zpUAr4\n\n    By Shashwat Awasthi\n    July 12 Thailand's baht was stuck at a near\n15-month low on Monday while Malaysian stocks missed out on a\nbroader rally in Asian equities as investors fretted over rising\ncoronavirus cases and deaths in the two countries.\n    The baht gave up 0.3% and held near its weakest\nmark since April 2020 - a level it hit in the previous session -\nafter Thailand reported record COVID-19 cases over the weekend,\nincluding infections in medical workers who had received two\ndoses of China's Sinovac vaccine.\n    The currency is already the region's worst performer so far\nthis year as the pandemic weighs on the tourism-reliant economy\nand cases soar after a well-controlled first wave last year.\n    Malaysia's stock market dipped 0.3% and yields on\nits 10-year benchmark bonds rose 5 basis points\nafter two consecutive days of record virus cases.\n    \n    \n    With Indonesia and the Philippines also struggling to\ncontain the virus in recent months, a sustained economic\nrecovery remains a challenge for Southeast Asia.\n    \"A key realization is that for most of EM Asia (ex-China) a\nfuller and unfettered recovery from COVID will be delayed to\n2022,\" analysts at Mizuho bank said in a note, also pointing to\na lagging vaccine rollout.\n    \"Even with doubled down vaccine procurement or scaled up\ninoculation plans, a clear path does not emerge until 2022.\"\n    But most regional share markets rallied following China's\npolicy easing on Friday, while dealers awaited a slew of Chinese\ndata as well as inflation figures from the United States which\ncould direct the Federal Reserve's view on early tapering this\nweek.\n    Equities in China jumped 1%, setting the stage for\nTaiwan's benchmark bourse and South Korea's KOSPI\n to follow suit, while Japan's benchmark Nikkei average\n surged over 2%.\n    The Philippine peso, which has been under pressure\nfrom rising inflation and a burgeoning trade deficit, weakened\n0.2%, even as the central bank committed to a market-determined\nforeign exchange rate and an accommodative monetary policy to\nsupport the economy.\n    Stocks in Manila added 0.6% though, helped by upbeat\nregional sentiment and after coronavirus curbs in parts of the\nPhilippines were relaxed on Friday.    \n\n    HIGHLIGHTS:\n    ** Malaysia's 10-year benchmark yield is up 5.5 basis points\nat 3.249%.\n    ** Top gainers on the Jakarta stock index include Allo Bank\nIndonesia up 25%, Primarindo Asia Infrastructure\n up 18%, and Siloam International Hospitals\nup 14.78%.\n    ** Top losers on FTSE Bursa Malaysia include Mr DIY Group M\nBhd down 2.19%, Press Metal Aluminium down\n1.84%, and Genting Malaysia down 1.07%.\n    \n    \n      Asia stock indexes and                      \n      currencies at 0331 GMT                    \n COUNTRY   FX RIC     FX     FX    INDE  STOCK  STOCK\n                    DAILY   YTD %   X      S    S YTD\n                      %                  DAILY    %\n                                           %    \n  Japan             -0.01   -6.27  <.N2  2.29   4.14\n                                   25>          \n  China   <CNY=CFX  +0.09   +0.85  <.SS  1.00   2.48\n             S>                    EC>          \n  India             +0.00   -2.11  <.NS  0.00   12.22\n                                   EI>          \n Indones            +0.28   -3.07  <.JK  0.61   1.63\n   ia                              SE>          \n Malaysi            +0.00   -4.03  <.KL  -0.52  -7.03\n    a                              SE>          \n Philipp            -0.30   -4.23  <.PS  0.64   -3.66\n  ines                              I>          \n S.Korea  <KRW=KFT  +0.15   -5.33  <.KS  0.92   13.02\n             C>                    11>          \n Singapo            -0.06   -2.25  <.ST  0.36   10.51\n   re                               I>          \n Taiwan             +0.26   +1.68  <.TW  1.08   21.17\n                                   II>          \n Thailan            -0.12   -8.10  <.SE  -0.02  7.06\n    d                              TI>          \n      \n\n    \n (Reporting by Shashwat Awasthi; Editing by Ana Nicolaci da\nCosta)\n  "}