{"text": "    * MSCI Latam equity index to fall 6% for the week\n    * Most regional stocks gain for the day\n    * Regional currencies set for worst week in more than a\nmonth\n\n (Updates prices)\n    By Susan Mathew and Ambar Warrick\n    June 12 Brazilian stocks and the real slid in\ncatch-up trade on Friday, while most other Latin American\ncurrencies trended lower and were set for steep weekly losses as\nmarkets reassessed the prospect of a swift post-COVID 19\nrecovery. \n    The MSCI's index of regional currencies fell 1.4% and was\nset for its worst week since late-April. The index of regional\nequities was on track for a 6% weekly loss.\n    Latin American risk assets had come off three-month highs\nthis week as a rally ran out of steam, with dour comments from\nthe U.S. Federal Reserve exacerbating the sell-off on Thursday.\n    \"The impressive rally seen in recent weeks showed signs of\nstrain after the widespread profit-taking seen this week,\" wrote\nGustavo Rangel, Chief Economist, LATAM, at ING.\n    \"The correction may prove to be temporary, however, if signs\nof a recovery in economic activity consolidate and Covid-19\nhealth indicators remain under control, as the reopening in\nbusiness activities gains momentum.\" \n    Returning from a day's holiday, the real slipped\naround 2.6%, while Sao Paulo-listed stocks were set for\ntheir worst day in six weeks.\n    Most other regional bourses recovered as they tracked Wall\nStreet higher, but concerns remained as Latam becomes the latest\nepicenter of the novel coronavirus outbreak. Brazil is the\nsecond worst hit worldwide in terms of number of cases while\ndeaths in Mexico approached 16,000.\n    Next week investors will be looking forward to a meeting of\nthe Brazilian central bank, which is expected to cut rates\nfurther into record-low territory to support Latin America's\nlargest economy.\n     \"In Brazil, the Monetary Policy Committee is facing a\nbackdrop characterized by a sharp contraction of real activity\nand significant labor market deterioration, visibly below target\ninflation, and highly accommodative global monetary conditions.\nThis backdrop supports additional rate easing,\" Goldman Sachs\nanalysts wrote in a note.\n    The Mexican peso rose more than 1.5% after the\ncurrency plummeted on Thursday as worries over a prolonged\neconomic recovery were exacerbated by fears of a second wave of\nCOVID-19 infections in the United States, hitting oil prices.\n    Lockdowns to curb the virus have already hammered markets,\nwith Mexico facing its steepest recession in decades while\neconomic indicators in Brazil paint a dour picture. \n    \n    Latin American stock indexes and currencies:\n    \n    Stock indexes             Latest     Daily % change\n MSCI Emerging Markets          984.90             -0.87\n                                        \n MSCI LatAm                    1941.30             -2.68\n                                        \n Brazil Bovespa               91604.92             -3.25\n                                        \n Mexico IPC                   37370.19              1.47\n                                        \n Chile IPSA                    3976.31              0.81\n                                        \n Argentina MerVal             42831.46            -0.526\n                                        \n Colombia COLCAP               1150.19              2.55 Currencies             Latest     Daily % change\n Brazil real                    5.0714             -2.63\n                                        \n Mexico peso                   22.3780              1.60\n                                        \n Chile peso                      793.5             -0.78\n                                        \n Colombia peso                 3777.55             -0.38\n Peru sol                       3.4647             -0.17\n                                        \n Argentina peso                69.3700             -0.07\n (interbank)                            \n                                        \n \n    \n\n (Reporting by Susan Mathew in Bengaluru;\nEditing by Alistair Bell and Grant McCool)\n  "}