{"text": "    * Mexican peso falls for first time in four sessions \n    * Stock markets closed in Brazil, Chile, Colombia &\nArgentina \n    * Chilean, Colombian pesos muted in light trading\n\n (Updates prices throughout)\n    By Shreyashi Sanyal\n    Oct 12 Mexico's peso fell on Monday after data\npointed to slowing industrial recovery in the country, while\nother Latin American currencies were subdued in light trading as\nmajor markets in the region were shut. \n    The peso fell for the first time in four sessions,\nsliding 0.5% as industrial output rose 3.3% in August, less than\nhalf of July's figure, in Latin America's second largest\neconomy, according to the national statistics agency.\n\n    Mexican industry expanded less in August than in previous\nmonths as the country's recovery from a coronavirus shutdown\nslows.\n    The government unveiled a fiscal package last week of about\n$14 billion, which was seen as the first concrete sign of a\nrenewed readiness by corporate bosses to invest under President\nAndres Manuel Lopez Obrador.\n    Mexico's currency has benefited in the recent months from a\nsteady economic rebound in its main trading partner, the United\nStates. The peso is also expected to be sensitive to November's\nU.S. presidential vote.   \n    Analysts say a victory for Democrat Joe Biden could bode\nwell for emerging markets. \n    \"A Biden presidency will likely be seen as a favorable\noutcome given a less confrontational approach on tariffs, with\nthe primary beneficiaries like the Chinese yuan, Mexican peso\nand South African rand,\" said FX strategists at J.P. Morgan. \n    \"A Biden presidency with a split Congress is likely to be\nconsidered the most positive outcome.\"\n    Mexican equities fell after the main stock exchange\nsuspended operations before midday on Friday due to what it said\nwas an outage in the system used to process trading orders.\n\n    Shares of Grupo Aeromexico rose 7.5% to their\nhighest level in six weeks after news that the airline had\nreceived definitive approval for a financing plan as it works\nthrough bankruptcy proceedings in a U.S. court.\n    The Chilean peso fell 0.2%, while Colombia's peso\n was flat against the dollar. \n    An International Monetary Fund mission concluded a visit to\nArgentina on Sunday, after several days of preliminary talks\naimed at repaying about $44 billion owed by the cash-strapped\ngovernment to the fund, a government source said.\n    Stock markets in Brazil, Chile, Colombia and Argentina were\nclosed on Monday, due to public holidays in the regions. FX\nmarkets in Brazil and Argentina were shut.      \n    Key Latin American stock indexes and currencies 2030 GMT:\n    \n           Stock indexes                    Latest   Daily %\n                                                     change\n MSCI Emerging Markets                      1137.17     1.31\n MSCI LatAm                                 1919.34    -0.23\n Brazil Bovespa                                   -        -\n Mexico IPC                                38292.43    -0.48\n Chile IPSA                                       -        -\n Argentina MerVal                                 -        -\n Colombia COLCAP                                  -        -\n                                                            \n               Currencies                   Latest   Daily %\n                                                     change\n Brazil real                                      -        -\n Mexico peso                                21.1720    -0.15\n Chile peso                                   797.5     0.00\n Colombia peso                               3823.5     0.00\n Peru sol                                         -        -\n Argentina peso (interbank)                       -        -\n                                                     \n Argentina peso (parallel)                        -        -\n                                                     \n \n \n\n (Reporting by Shreyashi Sanyal in Bengaluru\nEditing by Marguerita Choy and Sonya Hepinstall)\n  "}