{"text": "* MSCI EM stocks index near record high* Dollar strength pressures EM FX* Russian stocks at record highJan 12 Currencies in Europe, the Middle East and Africa recovered from recent losses on Tuesday, while emerging-market stocks held near record highs as increased liquidity and low lending rates made a favourable environment for equities.A spike in U.S. yields -- on expectations of more debt issuance in the country -- pushed up the dollar and drove capital flows out of emerging markets, particularly from currencies and bonds.Continued dollar strength and high yields could eventually be negative for emerging markets. Investors have also begun pricing in a possible U.S. interest rate increase by as soon as late 2022.Turkeys lira rose 0.4% to the dollar after losing over 2% in the past three sessions. South Africas rand rose 0.3% after tumbling nearly 7% over the past six sessions.The rand was particularly hit by the discovery of a new coronavirus variant in the country. Spiking infection rates in EMEA have also pressured currencies with the prospect of more economic disruptions.The explosion in the budget and trade deficits means that more dollars are being printed and moved abroad. With President-elect Joe Biden pledged to provide more fiscal stimulus, meaning that the nations debt will increase, the dollar is likely to remain under selling interest in the first months 2021, Charalambos Pissouros, senior market analyst at JFD Group, wrote in a note.An eventual economic recovery this year, driven by a vaccine program and continued stimulus measures, is also expected to drive capital flows into emerging markets.On that expectation, stocks continued to gain, with the MSCIs index of emerging-market stocks holding below Mondays record high.Most EMEA markets rose, with Turkish stocks rising 0.7% to near a record high. Russian stocks hit a record peak. Most central European stocks gained, while regional currencies rose against the euro.Elsewhere, Angola secured three years of payment relief from Chinese creditors and expects to get more than $700 million in its next tranche of International Monetary Fund financing in the coming days, its finance minister said on Monday.For GRAPHIC on emerging market FX performance in 2021, see tmsnrt.rs/2egbfVh For GRAPHIC on MSCI emerging index performance in 2021, see tmsnrt.rs/2OusNdXFor TOP NEWS across emerging marketsFor CENTRAL EUROPE market report, seeFor TURKISH market report, seeFor RUSSIAN market report, see (Reporting by Ambar Warrick in Bengaluru, editing by Larry King)"}