{"text": "    * Weak oil prices pressure Mexican, Colombian pesos\n    * Latam stocks muted, Chile leads losses\n    * Peruvian sol stable, but trades near 18-year low\n    * Brazil's real rises on strong service-sector data\n\n    By Ambar Warrick\n    Nov 12 Mexico's peso dropped on Thursday ahead\nof an interest rate decision, while most other Latin American\nunits retreated amid tempered expectations for the availability\nof a coronavirus vaccine.  \n    The peso fell about 0.2%, and was also hurt by\nweakness in the oil market after the International Energy Agency\nraised doubts about a quick post-COVID-19 pickup in demand.\n\n    Still, the currency is among the best performing Latam units\nthis year, having benefited recently from expectations of better\ntrade ties with the United States after Joe Biden took the\npresidency. \n    Strength in the peso and higher inflation trends have split\ninvestor expectations for a rate cut later in the day. Mexico's\ncentral bank has also avoided the aggressive rate-cutting cycles\nadopted by its regional peers.\n    \"The recent MXN rally has contributed to muddle the waters\nsomewhat however, as it has intensified calls for a more dovish\npolicy outcome... we expect policymakers to weigh the slight\ndeterioration in inflation against the stronger FX dynamics,\"\nGustavo Rangel, chief economist, LATAM, at ING, wrote in a note.\n    \"Despite the positive vaccine news, the risk of financial\nmarket instability remains elevated with the resurgence of\nCovid-19 cases in the U.S. and Europe and the uncertain global\ngrowth outlook.\"\n    A Reuters poll expects Mexico's central bank to cut by 25\nbasis points to 4.0%. Ratings agency Fitch on Wednesday affirmed\nthe sovereign rating of Latin America's second-largest economy\nat BBB-. \n    Colombia's peso fell about 0.5%, as it also came\nunder pressure from weak oil prices.\n    Brazil's real bucked the trend, rising 0.4% after\ndata showed services activity rose more than expected in\nSeptember, suggesting that certain facets of Latin America's\nlargest economy were picking up from the pandemic.\n    The real was also boosted by positive comments from Economy\nMinister Paulo Guedes. \n    While regional currencies and stocks benefited from optimism\nover a vaccine earlier in the week, uncertainty over the\navailability of the vaccine, as well as continued signs of the\npandemic's economic impact prompted some unwinding in risk\nappetite.\n    Chilean stocks led losses across the region,\nfalling about 1%. The MSCI's index of regional stocks\n was largely unchanged.  \n     Peru's sol was stable, but trading close to 18-year\nlows as the country's new cabinet took shape on Wednesday after\nthe ouster of centrist President Martn Vizcarra on Monday\nplunged the country into turmoil.\n\n    Key Latin American stock indexes and currencies:\n    \n                              Latest    Daily % change\n MSCI Emerging Markets         1181.51             0.22\n                                        \n MSCI LatAm                    2110.45            -0.12\n                                        \n Brazil Bovespa              104520.50            -0.28\n                                        \n Mexico IPC                          -                -\n                                        \n Chile IPSA                    3938.41            -1.03\n                                        \n Argentina MerVal                    -                -\n                                        \n Colombia COLCAP               1220.06                - Currencies             Latest    Daily % change\n Brazil real                    5.3931             0.42\n                                        \n Mexico peso                   20.5052            -0.20\n                                        \n Chile peso                      757.4            -0.50\n                                        \n Colombia peso                 3650.52            -0.45\n Peru sol                       3.6198             0.05\n                                        \n Argentina peso                79.5500            -0.06\n (interbank)                            \n                                        \n \n\n (Reporting by Ambar Warrick in Bengaluru; Editing by Angus\nMacSwan)\n  "}