{"text": "Crowds queued up outside shops, pubs started selling pints at midnight and hairdressers welcomed desperate customers on Monday as England started to reopen its economy after three months of lockdown.After imposing the most onerous restrictions in Britain's peacetime history, Prime Minister Boris Johnson said the reopening was a \"major step\" towards freedom but urged people to behave responsibly as the coronavirus was still a threat.Johnson, whose unruly hair style has become a trademark look, was one of thousands who flocked to hairdressers and barbers to have a hair cut on Monday, having waited since early January when the latest lockdown was introduced.Some folk lined up at bars after midnight or in the morning to raise a pint with fellow revellers.\"It feels good to be back,\" Matthew McGuinness, a 21-year-old student told Reuters in the large garden of Wetherspoon's Fox on the Hill pub in south London. \"We planned it last night to come here for a breakfast, get a drink.\"\"I would not want to be working behind the bar here tonight. It's gonna be ridiculous,\" he said.Later on Monday, at the busy Skylight rooftop bar in central London, drinker Matt Culhan said he had travelled almost 70 miles (113 km) from Ipswich in eastern England to enjoy the atmosphere.\"It's a bit more of a vibe down here,\" he said. \"It's been absolutely amazing. Everyone's having a great time,\" he said.Getting people spending again is crucial for Britain's recovery after official data showed that 2020 was the worst year for its economy in more than three centuries with a 9.8% decline in gross domestic product.Johnson wants to hand back people their freedoms, but after being criticised for moving too slowly last year and then for unwinding restrictions too quickly, he has adopted a cautious easing of the latest lockdown.With more than 127,000 fatalities, the United Kingdom has the fifth-highest death toll in the world from COVID-19.As the sun rose, dozens of people queued up outside Primark (ABF.L) in English cities such as Birmingham and outside JD Sports (JD.L) on Oxford Street in London, undeterred by the unseasonably cold weather.The John Lewis department store chain said glassware and gifts had been the most popular items as shoppers prepared to host friends and families once again. In the run up to the reopening, John Lewis had also seen a more than 200% jump in sales of dresses.At the Thorpe Park adventure site near London, visitors ran  to the rides as it reopened. Drinkers in pub gardens said they had worn their thermals to be able withstand the cold.'SO EXCITED'In north London, Maggie Grieve reopened the Beaucatcher hairdresser salon to work through the long list of bookings.\"I'm so excited to see my clients: to see how they are and give them that feeling that they get from having had their hair done,\" Maggie Grieve, who manages Beaucatcher hairdressers in north London, told Reuters.\"Today is going to feel like every hairdresser's birthday. The well-wishers have already come in: emails, texts, WhatsApps, even neighbours in the street wishing luck and joy. It feels great. Now can't wait to get to the pub,\" Grieve said.Hundreds of thousands of businesses have been closed since early January when England entered a third lockdown to stem surging infections driven by the \"Kent\" variant of the virus. The UK has the fifth highest death toll in the world.But a fast vaccination campaign that has delivered a first shot to well over half of adults has helped to cut deaths by more than 95% and cases by over 90% from the January peak, paving the way for a staggered reopening.Wales, Scotland and Northern Ireland are reopening at a different pace, determined by their governments. Non-essential stores, such as home and fashion chains, will reopen in Wales as well as England on Monday, although those in Scotland need to wait until April 26.Pubs and restaurants will only be able to serve outdoors from Monday, with indoor service not allowed until May 17 at the earliest. ($1 = 0.7296 pounds)"}