{"text": "Six environmental organisations, including the World Wildlife Fund and Greenpeace, on Monday called on Norway to stop plans to open ocean areas for deep-sea mining.The government in January launched a process to open areas on its extended continental shelf for exploring and producing minerals from the ocean floor, with plans to issue the first licences as early as 2023. \"Minerals and metals for the green shift should be obtained from consumption reduction and better reuse on land, not from the depths of the sea where brutal mining can do irreparable damage to nature,\" the environmentalists said in a statement.They also called on Norway to speak up against deep-sea mining in international waters at the International Seabed Authority (ISA), a Jamaica-based UN body which discusses rules for seabed mineral production.Norway does not need ISA's permission for its own deep-sea mining push according to international law because potential resources are located on its extended continental shelf.The Nordic country has sponsored a number of expeditions in recent years to map the ocean floor along a part of the Mid-Atlantic Ridge in the Arctic, extending from Jan Mayen to the Svalbard Archipelago.The discovered deposits include metals and minerals that are important in battery technology, wind turbines and mobile telephones, the Norwegian Petroleum Directorate, in charge of the mapping, has said.In January, Norway's oil and energy ministry launched a public consultation on a proposed deep-sea mining impact assessment programme, the first step in the opening process.Environmentalists, however, said it was too early to conduct such a programme.\"We know less about the deep sea than about the moon's surface,\" Silje Ask Lundberg, the head of Norway's oldest environmental organisation Naturvernforbund (Friends of the Earth Norway) said.\"Mining on the seabed can destroy species and habitats that have an important role for both the sea and the planet.\"Steinar Loeve Ellefmo, an associate professor who heads a study programme on deep-sea mining at the Norwegian University of Science and Technology, said the study wasn't premature.I do not think it can be too early to collect data to learn, he said."}