{"text": "NAIROBI Two camps in Ethiopias Tigray region housing Eritrean refugees have been shut and the occupants relocated, authorities said on Thursday, after the United Nations said residents had reported attacks, including by suspected Eritrean troops.The UNHCR refugee agency has called for protection for the residents of the Shimelba and Hitsats camps, which it says were attacked by armed men who killed and abducted refugees. On Feb. 1, it said residents had reported that Eritrean troops had forced some refugees back into Eritrea.Accusations of an Eritrean military presence are one of the most contentious issues in Tigray, where the central government has claimed victory over a rebellious regional government in a conflict that began in November.Eritrea and Ethiopia have both denied that Eritrean troops operated on Ethiopian territory. The ousted Tigrayan regional authorities and many residents accuse Eritrea of intervening on the central governments behalf.Tesfahun Gobezay, director general of Ethiopias Agency for Refugees and Returnees Affairs (ARRA), confirmed the camp closures, first reported by the state news agency on Wednesday.The state-appointed human rights commission reported on Thursday that Shimelba and Hitsats had been destroyed. Tesfahun told Reuters that description was an overstatement.There was a lot of fighting in those areas, not in the camps but in those areas where the camps are located, he said.Refugees didnt get the necessary services quickly and also they panicked due to the firing happening around the camps. So they left the camps, and Ethiopian defence forces sheltered them and escorted them to the nearest towns of Tigray, he said.He said 5,300 refugees had gone to two other refugee camps in Tigray. Others were now in Tigray towns or the capital Addis Ababa.Chris Melzer, a UNHCR spokesman, said the agency concurred with the conclusion that the camps were now unsafe, considering the reports of attacks on Hitsats and Shimelba, the reports of abductions, destruction, looting, and killing of humanitarian staff. Decisions to relocate must be voluntary and movements must be organised in safety and dignity, he said.CAMPS UNREACHABLEAid agencies say they have been unable to reach the camps since the conflict erupted in Tigray. Reports from all sides are difficult to verify because communications to the region remain patchy and the government tightly controls access.The United Nations said on Feb. 1. that refugees who had fled from the two camps spoke of infiltration of armed actors in the camps, of killings, abductions and also some forced returns to Eritrea at the hands of Eritrean forces.In December, a United Nations team was shot at when it tried to reach the Shimelba camp. Two diplomatic sources told Reuters the U.N. team had encountered uniformed troops from Eritrea.The Ethiopian governments emergency task force for Tigray did not immediately respond to questions about the camps, while the prime ministers office referred Reuters to ARRA.Prime Minister Abiy Ahmed launched a military campaign in Tigray to remove the regions then-ruling Tigray Peoples Liberation Front (TPLF), after the government said regional forces attacked federal troops. Abiy has declared victory, but low level fighting has continued in some areas.Protests broke out in the regional capital Mekelle on Tuesday and continued on Wednesday, with residents blocking roads, protesting against reported killings by Eritrean troops and the failure of elders to stop the war. One person was shot dead after soldiers opened fire on protesters, according to residents and an aid worker.Eteneshe Nigusse, spokeswoman for a government-appointed interim administration in Tigray, said she needed to check casualty reports with security. She told Reuters the presence of the Eritrean army in Tigray was a major issue raised at a meeting of religious leaders, elders and the public on Tuesday."}