{"text": "ADDIS ABABA Ethiopias military has defeated local forces in the west of Tigray state, Prime Minister Abiy Ahmed said on Thursday, accusing his foes of atrocities during a week of fighting that threatens to destabilise the Horn of Africa.Rights group Amnesty International said scores and possibly hundreds of civilians were stabbed and hacked to death in the region on Nov. 9, citing witnesses. It said it had not been able to independently confirm who was responsible, but said the witnesses had blamed fighters loyal to Tigrays local leaders.Air strikes and ground combat between government forces and the Tigray Peoples Liberation Front (TPLF) have killed hundreds, sent refugees flooding into Sudan, stirred Ethiopias ethnic divisions and raised questions over the credentials of Abiy, Africas youngest leader who won a Nobel Peace Prize in 2019.The western region of Tigray has been liberated, Abiy said in a tweet. The 44-year-old leader comes from the largest ethnic group the Oromo and once fought with the Tigrayans against neighbouring Eritrea.With communications down and media barred, independent verification of the status of the conflict was impossible. Reuters was not able to confirm either sides version of events or Amnestys reports of atrocities.There are fears the conflict may draw in Eritrea, whose government signed a peace pact with Abiy two years ago but remains hostile to the Tigrayan leadership, and weaken Ethiopias role in an African Union (AU) force opposing Islamist militants in Somalia.Major conflict could also hinder foreign investment in Ethiopias economy, which had clocked nearly double-digit annual growth for years before the coronavirus hit and is liberalizing, with multinationals particularly eyeing the telecoms sector.GAPING WOUNDSAmnesty said that the people killed in the town of Mai Kadra in Tigrays southwest on the night of Nov. 9 appeared to have been day labourers who were not involved in the fighting. It cited witnesses describing bodies with gaping wounds that appeared to have been inflicted with knives or machetes.This is a horrific tragedy, it said in a statement.Amnesty International has not yet been able to confirm who was responsible ... but has spoken to witnesses who said forces loyal to the TPLF were responsible for the mass killings, apparently after they suffered defeat from the federal EDF forces, it said.Tigrays leader Debretsion Gebremichael, who chairs the TPLF, denied his forces were involved.This is unbelievable ... this should be investigated, Debretsion said in a text message to Reuters, accusing Abiy of creating facts on [the] ground.There was no immediate response to the Amnesty report from the Ethiopian government.REFUGEES FLEEThe TPLF, which rules the mountainous northern state of more than 5 million people, announced a state of emergency against what it termed an invasion.Abiy accuses the TPLF of starting the conflict by attacking a federal military base and defying his authority. The Tigrayans say they have been persecuted during his two-year rule.Abiy said some of his soldiers had been found dead in the town of Sheraro, shot with their legs and arms tied behind their back. This kind of cruelty is heartbreaking, he said.He did not say how many bodies were found or provide proof. Reuters could not verify his allegation and there was no immediate response from the TPLF.More than 11,000 Ethiopian refugees have crossed into Sudan since fighting started and aid agencies say the situation in Tigray is becoming dire. Even before the conflict, 600,000 people there were reliant on food aid.The U.N. refugee agencys representative in Ethiopia, Ann Encontre, told Reuters negotiations were under way with both sides for humanitarian corridors.A major emergency may be brewing with so many people escaping to Sudan, she warned. Half of the refugees were children and some were wounded.After taking office in 2018, Abiy was applauded for opening up a repressive political system, including freeing activists from jail and lifting bans on opposition political parties. He won his Nobel prize for the peace accord with Eritrea.But his democratic transition was already waning even before the push on Tigray, experts say, including jailing a prominent opposition member and restricting media.Abiy has so far resisted calls by the United Nations, the African Union and others for a ceasefire and talks.The army said transitional rule would be set up in parts of Tigray and urged local forces to surrender.In a wider push against the TPLF, Ethiopias parliament stripped 39 members, including Gebremichael, of immunity from prosecution.Police said they had arrested 242 TPLF activists suspected of plotting attacks in Addis Ababa. Weapons including bombs and bullets were also confiscated, the citys police chief said.Also in the capital, volunteers lined up at a stadium to donate blood for injured armed forces members. Some waved the Ethiopian national flag."}