{"text": "BRUSSELS/LONDON The head of the group advising the European Union on its green finance rules has urged Brussels to resist political pressure to weaken them, saying the credibility of the regulation is at stake.The EU is racing to meet an April 21 deadline to publish the first section of its sustainable finance taxonomy, a list of economic activities that will decide which ones can be labelled as green investments in the EU from next year.The rules have become mired in lobbying and disputes between member states, who disagree on whether natural gas, bioenergy and forestry deserve a green label.The chair of the EUs advisors on the rules wrote to the Commission on Friday, warning it not to sacrifice scientific evidence to win a political compromise.Deviating from environmentally sound parameters within the taxonomy, by stretching the current taxonomy framework beyond scientific rigour, introduces substantial risks to its intended purpose and to the credibility of the project overall, the letter said.It was signed by Nathan Fabian, who chairs the advisory platform of 57 members and 10 observers, as well as the platforms other five most senior advisors.Many parts of the experts advice appear to have been largely disregarded in recent drafts of the rules, the letter said. That advice said the rules must reflect scientific evidence on whether each economic activity complied with avoiding the worst impacts of climate change.Nine of the EUs advisors have threatened to quit over the Commissions latest proposal.Fabian told Reuters political negotiations on the taxonomy had appeared to drift away from science-based evidence, creating a risk that the taxonomy would fail to fulfil its original purpose.Its purpose is to have science-based criteria for the market to use as and when it sees fit, he said. That original purpose has been challenged, either through misunderstanding or intention.The taxonomy will not block funding for activities that do not get a green label. But by making truly sustainable activities more visible to investors, it aims to help shift capital into those activities - and out of polluting ones."}