{"text": "BRUSSELS The European Commission will propose mandatory minimum energy performance standards for buildings across Europe in a drive to cut emissions and create jobs in the renovation sector, according to a draft policy document seen by Reuters.The European Unions executive has made its Renovation Wave strategy, which is due to be published on Wednesday, a priority in its plan to cut greenhouse gas emissions across the bloc to net zero by 2050.The Commission does not comment on draft documents, which are subject to change before publication.Energy-guzzling buildings, many of which are heated by fossil fuels, produce more than a third of EU carbon dioxide emissions and account for 40% of the blocs energy consumption. Most of todays buildings will still be in use in 2050 - meaning could thwart the EUs green goals unless they are upgraded.The objective is to at least double the annual energy renovation rate of residential and non-residential buildings by 2030, the draft document said.At the moment, about 11% of existing buildings in the EU are renovated each year. But most renovations do not address energy performance and the EUs energy renovation rate is stuck at 1%.A key pillar of the new Renovation Wave strategy will be the introduction of mandatory minimum energy performance standards for existing European buildings.The Commission will propose the standards next year, following an analysis to decide when they will be phased in and the specific level of energy savings each building must achieve. All building types would be covered, according to the draft.Its absolutely essential that we have more legally-binding regulatory measures, said Louise Sunderland, senior advisor at the non-profit Regulatory Assistance Project, pointing to energy performance standards in the Netherlands, which have boosted renovation rates for social housing.The aim is to incentivise building owners to upgrade properties in time to meet the new standards, backed by financial support from sources including the EUs 750 billion euro ($885 billion) coronavirus economic recovery fund.The move could also boost employment after the pandemic, adding an extra 160,000 jobs in the EU construction sector by 2030, the draft said.Its a job-creating machine, Riley said."}