{"text": "WASHINGTON The European Union on Thursday acknowledged a move by the new U.S. government to refrain from imposing additional tariffs on EU goods in a long-running dispute over aircraft tariffs, and said it was ready to work to resolve trade disputes.The U.S. Trade Representatives office on Thursday said it had agreed with U.S. industry that it was unnecessary to revise existing tariffs on European goods at this time, refraining from changes that would have been possible during a periodic review.The move came a day after USTR said it looked forward to working with European allies to resolve a 16-year-long battle over subsidies provided to Europes Airbus and its U.S. rival Boeing Co.Asked about Thursdays decision, an EU spokesman said, The EU is ready to engage with the new U.S. administration on the basis of the EU-US agenda for global change we adopted on December 2. Our aim is to find solutions to our ongoing trade disputes, including on Airbus/Boeing.The American Italian Food Coalition, which represents more than 450 Italian companies, manufacturers and trade groups, said the move would give both sides time to work out a solution.The Biden Administration appropriately hit the pause button on another carousel round of tariffs, it said.Officials from the EU and Britain are keen to work out a deal with the administration of President Joe Biden, but talks are on ice until Bidens pick as top trade negotiator, Katherine Tai, is confirmed in her job by the U.S. Senate. That could take several more weeks, with a confirmation hearing not yet scheduled.Envoys from Britain and the European Union on Monday stressed their willingness to resolve the aircraft subsidies dispute.EU Ambassador Stavros Lambrinidis said Brussels had proposed a six-month suspension of tariffs on both sides to allow for negotiations. Britain, which is no longer part of the EU but is part of the Airbus consortium, has said it is also willing to lift tariffs, possibly unilaterally, as a goodwill gesture."}