{"text": "The European Union will tighten regulations on air pollution, waste and use of chemicals to protect public health and address key causes of biodiversity loss, the European Commission said on Wednesday.The plan to tackle pollution, published on Wednesday, sets out targets for 2030, on the way towards reducing air, water and soil pollution to levels no longer considered harmful to health and nature by 2050.\"One of the big lessons we have learned from the COVID crisis is the close connection between human health and the health of the planet. At the moment, neither is doing well,\" EU Environment Commissioner Virginius Sinkevicius said.Vulnerable groups including low-income communities bear the brunt of pollution's negative impacts, he added.Dirty air is a key culprit and is linked to the EU's climate change goals, since factories and cars that churn out pollutants also emit planet-warming gases such as CO2.The Commission said that by 2030 it aims to reduce premature deaths associated with air pollution by at least 55%.Europe's air quality has improved in recent years but is still deadly, with 379,000 premature deaths in the EU in 2018 linked to exposure to particulate matter, the European Environment Agency has said. The Commission said it would revise EU air pollution limits next year to better align them with upcoming World Health Organisation recommendations. Tighter \"Euro 7\" rules, due to be proposed this year, will also limit vehicle pollution.Other targets for 2030 include a 25% reduction in ecosystems where air pollution threatens biodiversity and a 50% reduction in marine plastic litter.To meet those goals, the Commission will propose measures to phase out endocrine disruptors - chemicals that interfere with hormones -, consider capping ammonia emissions from livestock farming and factories, and revise pesticides regulations to reduce the use of chemicals. EU rules coming into force from 2023 will set more stringent quality standards for drinking water. By 2025 the EU will review waste laws to improve recycling and reduce waste generation."}