{"text": "Europes drugs regulator will review the COVID-19 vaccine developed by AstraZeneca and Oxford University this month under an accelerated timeline, the watchdog said on Tuesday.The 27-member European Union is trying to speed up vaccinations after a slow start and as supply shortages oblige authorities to consider measures, such as extending the time between first and second shots.The European Medicines Agency (EMA) said on Tuesday it had received an application from the British drugmaker and could issue an opinion on a conditional marketing authorisation by Jan. 29 at a meeting of its human medicines committee (CHMP). (bit.ly/2XuWmm3)If endorsed by the EMA and formally approved by the European Commission, the vaccine would become the third against the new coronavirus available on the continent, after Pfizer-BioNTechs and Modernas.Pressure for a decision has increased following the discovery of more contagious variants of the novel coronavirus.AstraZeneca has said its vaccine should be effective against the variant prevalent in Britain, although trials have yet to confirm that.While cheaper and easier to distribute than rivals, the AstraZeneca/Oxford vaccine has been troubled by doubts over its most effective dosage.Britain in December became the first to approve the vaccine and other countries, including Argentina, El Salvador and India, have since given approval.The EMA said on Tuesday that during its rolling review of the vaccine, which it began in October, it had assessed data from ongoing trials in Brazil, Britain and South Africa.It is also studying additional information AstraZeneca provided at the CHMPs request.EU conditional marketing authorisation allows a treatment to be sold for a year before all necessary data on its efficacy and side-effects are available.The EU last year agreed to buy up to 400 million doses of the AstaZeneca shot and hopes to receive a first delivery two weeks after authorisation.They are thinking of two deliveries a month, but this is all in the making. They need to discuss this with member states, EU top vaccine negotiator Sandra Gallina told an EU Parliament hearing."}