{"text": "European shares retreated from eight-month highs on Thursday as surging coronavirus infections raised doubts about a quicker economic rebound and overshadowed several upbeat quarterly earnings reports.The pan-European STOXX 600 index was down 0.8%, reversing after having gained 12.5% so far this month.The banking index led sectoral declines following its best three-day winning streak since the global financial crisis in 2009, while travel stocks fell 0.6% after surging earlier in the week on hopes for an effective COVID-19 vaccine.Financial stocks were the single biggest drag on the STOXX 600.This is a calibration of, not capitulation from, the vaccine trades theme that is getting warmed up, analysts at Mizuho Bank said.Markets are re-assessing given (the mass availability of a vaccine) may take months, while second/third wave resurgence in Europe and the United States is hitting hospitalisations and invoking the re-imposition of restrictions.France on Wednesday overtook Russia as the worst affected country in Europe, while Italy surpassed the 1-million- infections mark to become one of the top 10 worst-affected countries globally.The benchmark STOXX 600 index has gained more than 40% since a coronavirus-driven crash in March, but it has lagged the U.S. benchmark S&P 500 on fears of a longer road back to pre-pandemic levels of economic activity.Data on Thursday showed Britains economy grew by a slower-than-expected 1.1% in September from August even before the latest restrictions on businesses. Londons FTSE 100 fell 0.7% after posting eight straight days of gains. [.L]Those figures provided another embarrassment for the government  plagued with infighting just as the latest, and potentially final, Brexit talks reach their crescendo  placing the UK at the bottom of the GDP table when it comes to major European economies, said Connor Campbell, financial analyst at spread better Spreadex.In company news, Siemens shed 3.3% after the German engineering group gave a cautious outlook on its recovery from the COVID-19 pandemic, saying it expects government and company investments next year to lag the global rebound in economic growth.Zurich Insurance Group rose 0.7% as it said its new life insurance business picked up in the third quarter, while Italys top insurer Generali lost 0.5% after saying it would not pay the second tranche of the dividend on 2019 results this year."}