{"text": "World shares dipped on Friday as investors awaited progress towards more U.S. fiscal stimulus, while the dollar was set for a weekly loss and cryptocurrency Bitcoin hit a record high.European shares fell at the start of trading, with the pan-European STOXX 600 index (.STOXX) down 0.2% on the day. Germany's DAX (.GDAXI) was down 0.7%. Britain's FTSE 100 (.FTSE) fell 0.35% and France's CAC 40 fell 0.3%.Italy's FTSEMIB index (.FTSEMIB) fell 0.8% on the day, with the country's bond yields were near record lows.Markets in China and most of Southeast Asia are closed on Friday for the Lunar New Year. China's stock and bond markets, foreign exchange and commodity futures markets are closed through Feb. 17 for the holiday.Futures for the S&P 500  declined 0.12%.MSCI's All Country World index (.MIWD00000PUS), which tracks stocks across 49 countries, fell 0.15% on the day, shy of record highs reached earlier this week.Investors weighed some tepid economic data against increasing COVID-19 vaccinations and the prospect that more government spending and continued cheap money from central banks will drive higher growth and, eventually, inflation.    Investors will have to follow a \"spike train\", monitoring hospitalizations, stimulus, inflation, and volatility, said Mark Haefele, chief investment officer at UBS Global Wealth Management, in his monthly letter to clients.\"Overall, we retain a favorable view of markets over our tactical investment horizon,\" he said. \"While the `spike train' may lead to volatility, we dont think it will derail the bull market.\"Earlier, MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) fell 0.2%, trading just shy of a record high reached in the previous session. Australian stocks (.AXJO) lost 0.63%. Shares in Tokyo (.N225) fell 0.14%, pulling back from 30-year highs.On Wall Street on Thursday, the Nasdaq (.IXIC) and S&P 500 (.SPX) gained 0.4% and 0.2%, respectively. The Dow Jones Industrial Average (.DJI) slipped 0.02%.  read more Prices held near records as investors bet on more government spending, although enthusiasm was tempered when U.S. President Joe Biden said that China was poised to \"eat our lunch,\" raising fears of renewed strain on Sino-U.S. ties.  read more U.S. weekly unemployment claims fell less than expected and core consumer prices rose at a slower pace, which caused some traders to temper their optimism about the economic outlook.  read more Bitcoin reached a record high of $49,000 before erasing gains.BNY Mellon's announcement that it would help clients hold, transfer and issue digital assets came just days after Elon Musk's Tesla (TSLA.O) said it had bought $1.5 billion worth of the cryptocurrency and would accept it as a form of payment for its cars.  read more Spot gold  fell 0.5% to $1,816.91 per ounce. U.S. gold futures  fell 0.7% to $1,813.6. Gold prices are still on track for their best week in three amid broad dollar selling. The dollar index  rose 0.25% on Friday but was still on course for a 0.6% weekly decline. Soft demand at an auction of $27 billion of new 30-year Treasuries on Thursday rattled bond investors. The yield on 10-year U.S. Treasuries  fell to 1.1532%. The 30-year yield  initially rose but then fell back to 1.9370%.Brent crude  fell 1.05% to $60.50 a barrel, having dropped half a percent the previous session. U.S. oil  fell 1.2% to $57.54 a barrel, after falling by 0.8% on Thursday.OPEC cut its demand forecast and the International Energy Agency said the market was still over-supplied, which cast a gloom over energy markets.  read more "}