{"text": "European stocks scaled new highs on Monday on broad-based gains, but worries about the pace of economic recovery made defensive sectors the best bid while travel stocks slumped with the Delta variant of coronavirus becoming dominant.The pan-European STOXX 600 index rose 0.7% and hit 461.10, extending gains from Friday after a tumultuous week. Germanys DAX also briefly touched a new high of 15,806.900 before closing just below that level.Real estate, utilities and healthcare were among the best-gaining sectors, up between 1.4% and 1.6%. Travel and leisure dropped 1.3% with British airlines leading losses. [.L]The World Health Organisation said on Monday the infectious Delta variant was becoming dominant, and many countries had yet to receive enough vaccine doses to protect their health workers.But England was still set to lift COVID-19 curbs next week.London stocks lagged European peers as declines in travel stocks were accompanied by a slide in energy and material stocks as oil and copper prices fell on economic worries. [MET/L] [O/R]Airlines are likely to continue on a relatively bumpy path as the UK shows its willingness to allow COVID levels to surge as a result of the reopening efforts, said Joshua Mahony, senior market analyst at online trader IG.Volatility picked up across global markets last week after U.S. and China data raised fears that economic growth might have peaked, driving government bond prices higher and stocks lower.The sharp decline in bond yields over the past week has not yet been reflected in stock markets or commodities, analysts at BCA Research wrote. A correction over the next few months cannot be ruled out.Focus this week will also be on a bunch of economic reports including headline U.S. inflation data and retail sales, as well as U.S Federal Reserve Chair Jerome Powells testimony before Congress on Wednesday and Thursday on inflation and the timing for tapering.Among individual stocks, Daily Mail and General Trust Plc jumped 3.3% after it said its largest shareholder, the Rothermere family, might take the British newspaper private in a 810-million-pound ($1.13 billion) deal, if the sales of its insurance risk unit and Cazoo business go through.Frances outdoor advertising company JCDecaux jumped 10.1% after JPMorgan upgraded the stock to overweight, citing a sharp rebound in its air passenger numbers.French IT consulting group Atos slumped 17.9% to the bottom of STOXX 600 after it cut full-year earnings forecast."}