{"text": "NEW YORK The United Nations Security Council discussed on Friday human rights abuses in North Korea after the issue was raised by seven members who accused Pyongyang of using the coronavirus pandemic to crack down further on the human rights of its own people.Germany, Britain, France, Belgium, Estonia, the United States and the Dominican Republic brought up the issue in a closed-door virtual meeting after diplomats said Russia and China objected to a public briefing on the situation.The DPRKs human rights violations pose an imminent threat to international peace and security. The DPRK government diverts resources away from its people to its illicit ballistic missile and nuclear programs, the seven countries said in a statement, read by German U.N. Ambassador Christoph Heusgen.North Koreas formal name is the Democratic Peoples Republic of Korea (DPRK). North Koreas U.N. mission in New York did not immediately respond to a request for comment on the Security Council meeting.North Korea has repeatedly rejected accusations of human rights abuses and blames sanctions for a dire humanitarian situation. Pyongyang has been under U.N. sanctions since 2006 over its ballistic missiles and nuclear programs.The governments decision to prioritize its weapons programs over the needs of its people and their isolation from the international community, is inevitably worsening the impacts of the pandemic on the North Korean population, Heusgen said.Between 2014 and 2017 the Security Council held annual public meetings on human rights abuses in North Korea.In 2018 the council did not discuss the issue amid now failed efforts by North Korea leader Kim Jong Un and U.S. President Donald Trump to work toward Pyongyangs denuclearization.Last year at least eight council members pushed for a meeting on human rights abuses, sparking Pyongyang to warn it would consider such a move a serious provocation to which it would respond strongly.The United States instead convened a meeting on the threat of escalation by North Korea amid growing tensions between Pyongyang and Washington."}