{"text": "(Reuters) -European stocks fell on Monday from all-time highs as investors booked profits ahead of the quarterly corporate earnings season, while two French utility companies surged on news of a merger deal after months of wrangling.Shares of Veolia and Suez surged 9.7% and 7.7% after the waste and water management companies agreed on a merger deal worth nearly 13 billion euros ($15.4 billion).The benchmark pan-European STOXX 600 index ended about 0.5% lower after closing at a record high on Friday, with technology, travel and leisure and commodity stocks leading declines.Wall Streets main indexes also inched lower as investors awaited economic data and the start of U.S. corporate earnings season that could justify the sky-high valuations. [MKTS/GLOB]European earnings will kick into higher gear later in April, with analysts expecting a 47.4% jump in first-quarter earnings for STOXX 600 companies, according to Refinitiv IBES data. Much of the support is likely to come from consumer cyclicals and industrial firms.UKs domestically focused FTSE mid 250 index dropped 0.4%, hovering just below a record high as shops, pubs, gyms and hairdressers reopened after three months of lockdown.In the UK, the rapid vaccine roll-out and the sharp fall in infections is clearly reassuring, said Rupert Thompson, chief investment officer at Kingswood in London.Even so, the speed of the forthcoming recovery remains uncertain.Bets on a global economic rebound, fuelled by heaps of stimulus, helped the STOXX 600 finally reclaim its pre-pandemic highs last week, with its recovery hampered by slow vaccine distributions and a new wave of infections in the continent.The U.S. benchmark S&P 500 had made up all of its coronavirus-driven losses by last August.Low cost airlines easyJet and Ryanair dropped 3.9% and 3.6% after HSBC downgraded the stocks to hold on concerns over a return in demand as the economy reopens.Italian diagnostics group DiaSorin SpA jumped 9.6% after it said it will acquire U.S. based Luminex Corp for $1.8 billion.Economically sensitive automakers were the top-performer among the European stock sectors."}