{"text": "European stocks closed flat on Tuesday, with economically sensitive sectors including banks, automakers and oil supporting markets across the continent.The regional STOXX 600 index closed up 0.05% after a mixed session, while Germanys DAX rose 0.1%, Frances CAC inched 0.2% lower and Britains FTSE 100 fell 0.7%.Investors are awaiting the start of the U.S. earnings season this week as well as clarity on fiscal spending plans under incoming U.S. President Joe Biden, who takes office on Jan. 20.In Europe, automakers jumped 1.7% to lead gains after Renault, BMW and VW reported 2020 sales.Their U.S. carmaking rivals also got a boost after General Motors announced its entry into the growing electric delivery vehicle business.Other cyclicals such as banks, travel and leisure and oil and gas extended last weeks rally on hopes that a larger U.S. stimulus under the incoming Biden administration will spur faster economic recovery.Oil majors BP and Royal Dutch Shell gained close to 2% as crude prices hit an 11-month high on tighter supply and expectations for a drop in U.S. inventories. [O/R]Still, losses in defensive sectors such as healthcare, utilities and consumer staples checked gains in most markets.Investors are still wondering where the next big catalyst for further upside will come from, and are painfully aware that the COVID-19 crisis remains untamed despite the introduction of vaccination programmes, Chris Beauchamp, chief market analyst at IG wrote in a client note.Britains exporter-heavy FTSE 100 underperformed other European markets, hit by a stronger pound and a surge in new COVID-19 cases. [GBP/]Companies listed on Europes STOXX 600 are expected to report a 26.3% drop in fourth-quarter earnings, data from Refinitiv I/B/E/S shows, as restrictions to control soaring coronavirus cases slowed an economic recovery.That comes ahead of a clear improvement predicted for the first two quarters of 2021, when earnings are set to rise 40.4% and 75.1% respectively.Maersk rose 3.4% after brokerage Berenberg upgraded the Danish shipping companys shares to buy, saying earnings momentum driven by freight prices could see it run higher.Swiss online pharmacy chain Zur Rose hit a record high, surging almost 15% to the top of STOXX 600, after BofA Global Research started coverage with buy rating."}