{"text": "Rising bond yields dragged European stocks lower on Friday, although major bourses were set for weekly gains as stimulus and vaccination programmes spurred hopes of a solid economic recovery. The pan-European STOXX 600 index (.STOXX) fell 0.3% after a four-session winning streak drove it to pre-pandemic highs a day earlier. The index posted weekly gains of 3.5%, its best performance since November. Tame U.S. inflation data and signs from the European Central Bank that it was ready to accelerate money-printing to keep a lid on borrowing costs helped boost risk appetite this week.\"It's not quite the end to the week that investors had hoped,\" said Russ Mould, investment director at AJ Bell\"However, markets are still ahead on the week and the recent sell-off in tech stocks looks like it has stabilised, which is important for investor sentiment.\"With government bond yields in the United States and Europe rising again on Friday, investors took some money off the table. \"On one hand, we had the ECB that tried to talk down yields, but at the same time we had the final approval of the big Biden stimulus package that drove U.S. yields somewhat higher again,\" said Bert Colijn, senior euro zone economist at ING.      U.S. President Joe Biden signed a $1.9 trillion stimulus bill into law on Thursday, with direct deposits from the legislation expected to go to Americans as early as this weekend.  read more While the stimulus is expected to give a boost to the U.S. economy, it has also raised worries about a spike in inflation that could push central banks to tighten monetary policy.The tech sector (.SX8P) fell the most in Europe, down 2.1%, while automakers (.SXAP) and miners (.SXPP) also weighed.Dutch tech investor Prosus (PRX.AS), which holds a third of Chinese tech giant Tencent Holdings (0700.HK), dropped 6.7% as China's market regulator fined 12 companies, including Tencent, related to deals that demonstrated illegal monopolistic behaviours.  read more German carmaker Daimler (DAIGn.DE) declined 1.9% after French rival Renault (RENA.PA) sold its entire stake in the company at a discount. BMW (BMWG.DE)fell 1.3% after saying its operating profit for 2020 fell due to the COVID-19 pandemic, despite a strong second-half rebound in sales.  read more British luxury group Burberry (BRBY.L) jumped 6.9% to the top of STOXX 600 after saying it had seen a strong rebound in sales since December.  read more Italy's Brunello Cucinelli (BCU.MI) surged 8.2% after the luxury goods maker raised its sales forecast for the year on expectations that the end of the pandemic was near. "}