{"text": "NEW YORK (Reuters) -The eurodollar futures market, which tracks short-term U.S. interest rate expectations over the next few years, is betting on a roughly 80% chance of a rate increase from the Federal Reserve by December 2022, after the release of stronger-than-expected inflation data.That was roughly a few months earlier than what the market estimated to be the start of the next tightening cycle, analysts said.Eurodollar futures contracts expiring by December 2022 showed an implied yield of 43 basis points in the afternoon session, equivalent to an 80% chance of a hike, analysts said.Meanwhile, eurodollar futures contracts between March to June 2023 showed a 100% chance of a 25 basis-point hike by the Federal Reserve. Specifically, the market is fully pricing in a hike by April 2023, said Gennadiy Goldberg, senior rates strategist at TD Securities in New York.Before the inflation data, rate futures markets priced in 100% chance a Fed hike in May, Goldberg added.The market sees a total of three hikes by December 2023.That said, there are several ways to estimate the probability of a Fed rate hike, which could have slightly different outcomes.Wednesdays data showed U.S. consumer prices increased more than expected as booming demand amid a reopening economy pushed against supply constraints. The consumer price index jumped 0.8% last month, the largest gain since June 2009.Markets are getting nervous about the rise in inflation, said Goldberg, but he cited comments from Fed Vice Chair Richard Clarida expecting inflation moderating later this year.Though Clarida is not concerned that the expected rise in prices will persist, he said the accelerating recovery is not shifting the Feds commitment to keeping low interest rates and a $120 billion pace of monthly bond purchases until the labor market is fixed.In the federal funds futures [0#FF:] market, investors have priced in a roughly 90% chance of a hike in February 2023, but with very little volume. The January 2023 contract has a little more volume, with a Fed hike priced at around 80%."}