{"text": "(Reuters) -European stocks rose on Wednesday, led by a charge in energy shares as oil prices hit two-year highs, while strong regional earnings reports and signs of speedy economic recovery offset concerns about a rapid rise in U.S. prices.The pan-European STOXX 600 index rose 0.3% after falling almost 2% on Tuesday, their worst selloff this year.The European oil & gas index jumped 2.0%, with shares of Royal Dutch Shell Plc , BP Plc, Paris-listed shares of TechnipFMC rising over 3.5% each.A jump in crude prices driven by signs of a swift economic rebound and upbeat forecasts for energy demand also pushed Londons FTSE 100 index up 0.8%.Data showed Britains economy grew by a stronger-than-expected 2.1% in March from February. [.L]Major European bourses also shrugged off a surprisingly strong read on U.S. inflation which dragged down Wall Streets main indexes deep in the red. [.N]In Europe dollar strength has borne down on the euro and sterling and allowed space for rallies in indices across the continent, said Chris Beauchamp, chief market analyst at IG.Another sign that perhaps European markets are the next place to be for many investors.Ample liquidity, a global semiconductor shortage and a recent rally in commodity prices are heightening fears of inflation as developed economies gradually reopen after lockdowns imposed to curb coronavirus outbreaks.Miners provided the biggest boost, with shares of Glencore, Anglo American and Rio Tinto gaining about a percent each as commodity prices continued to rally. [MET/L]We have a kind of central bank-sanctioned rally in commodities because they want the economy to run hot. That is great for industrials and materials and those stocks will continue to do well, said Marija Veitmane, senior multi-asset strategist at State Street Global Markets.European earnings are now expected to surge 90.2% in the first quarter, as per Refinitiv IBES data, up from a forecast of 83.1% growth last week.German lender Commerzbank jumped 8.6% after it beat expectations for first-quarter profit and raised its revenue outlook.Spirits maker Diageo rose 3.4% on restarting its capital return program, while Amsterdam-based technology investor Prosus NV gained 2.1%, buoyed by plans to acquire up to 45.4% of shares in its parent Naspers.French video games company Ubisoft fell 11.1% after it warned that operating profit might fall this financial year."}