{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2BqrJuly 12 Euro zone bond yields held near recent lows on Monday, supported by dovish European Central Bank commentary, as investors watched for clues from central bankers on both sides of the Atlantic ahead of Tuesdays U.S. inflation print.The market opened calmer on Monday after a rally last week gave German bonds their biggest two-week boost since June 2020, driven by hedge funds unwinding bets against U.S. Treasuries as economic growth assumptions came under doubt.The ECB will change its guidance on policy steps at its next meeting to reflect its new strategy and show it is serious about reviving inflation, ECB President Christine Lagarde said on Monday.It is not the right time to talk about dialing back stimulus and that the ECBs pandemic emergency bond purchases could transition into a new format, she said.Likely helped by dovish sentiment, Germanys 10-year yield, the euro area benchmark, was down 1 basis point to -0.30% 0719 GMT, not far from last weeks three-month low at -0.34%.Italian bonds outperformed with 10-year yields dropping nearly 2 bps to 0.75%, pushing down the closely-watched gap with 10-year German yields to 104 bps, below last weeks peak at over 110 bps.The focus will be speeches from ECB board member Luis de Guindos at 0900 GMT and U.S. Federal Reserve speakers expected at 1330 GMT and 1600 GMT.Traders are also preparing for Tuesdays June U.S. inflation print, which is expected to rise 4.9% year-on-year, down from 5% in May.Analysts at Danske Bank said U.S. Treasury repricing spilling over to euro zone government bonds is a risk for European government bonds, alongside potential market anticipation of an ECB tapering discussion in September and next weeks ECB meeting, they said.At these (bond) levels, Im... thinking that overall this year people who have underestimated deflation are underestimating inflation, Nils Kostense, head of government bond trading at ABN AMRO, said with reference to last weeks bond rally.Kostense expects the market to trade sideways in the near term given support from ECB buying.This weeks trade will also focus on supply, with euro zone public sector borrowers set to raise 39 billion euros, according to Commerzbank, around 20 billion of it being new supply.A new syndication is expected from the European Union this week, the latest to finance its COVID-19 recovery fund. (Reporting by Yoruk Bahceli; editing by Barbara Lewis)"}