{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2BqrAMSTERDAM, Nov 12 Euro zone bond yields fell in early trade on Thursday as caution replaced enthusiasm over COVID-19 vaccines, while focus also remained on the European Central Bank.ECB President Christine Lagarde said on Wednesday the bank will focus on more emergency bond purchases and cheap loans in its new stimulus package, due in December. Yields pulled back after bond prices fell earlier in the week on news of the Pfizer vaccine.On Thursday, Germanys 10-year yield was down 2 basis points to -0.52%> in early trade.UniCredit analysts noted that while European equities have gained and broken out of their recent trading range on the vaccine news, the Bund yield remains within its recent trading range and near its average since April.This suggests that ... investors are pondering with caution the implications of the vaccine on the economy, they said in a note, adding that concern over lockdowns may outweigh optimism around a future vaccine.The moves showed the ECBs policy rate -- at -0.50% -- provides a support level for the benchmark Bund yield, said Michael Leister, head of interest rate strategy at Commerzbank. He expects Lagardes reassurances to continue resonating with the market.Italian bonds, which outperformed after Lagarde spoke on Wednesday, saw 10-year yields down 1 basis point on the day in to 0.69%..Central banks will again be on focus on Thursday, with Lagarde due to speak together with Bank of England Governor Andrew Bailey and Federal Reserve Chairman Jerome Powell at the ECBs annual symposium at 16:45 GMT.Other ECB board members will also be speaking at the symposium earlier in the session.We expect other central bankers at Sintra today to echo similar caution on the outlook. This should allow EGBs (euro government bonds) to maintain the strength seen yesterday, although some may be looking to fade rallies at this point, analysts at Mizuho told clients.In the primary market, Ireland will auction up to 1.25 billion euros of debt via 10- and 30-year bonds and Italy will raise up to 6 billion euros from three-, seven- and 15-year bonds."}