{"text": "(The opinions expressed here are those of the author, a market analyst for Reuters.)FORT COLLINS, Colo. Soybean stockpiles in the United States are set to shrink to a seven-year low by next August, while domestic demand jumps to an all-time high. But prices are notably lower than in previous low-supply years.Chicago soybean futures have risen more than 30% over the last three months, a very unusual trend during the U.S. soybean harvest. Most-active futures on Tuesday had their biggest single-day surge in more than a year after the U.S. Department of Agriculture slashed U.S. ending stocks on a smaller crop estimate.U.S. soybean stocks-to-use, which measures supply versus demand, is pegged at 4.2% for 2020-21. That would be the second lowest within the last half-century, behind 2.6% in 2013-14. It is the smallest ratio USDA has printed in November in at least the last 40 years.The tight supply picture also stands at the world level. Global stocks-to-use for 2020-21 are seen at 16.1%, the lightest since 2012-13 and the smallest November projection in 13 years.Despite the historically low supply outlook, futures are well off the levels observed when stocks-to-use were equally as low, or even heavier, than what is projected for 2020-21. The question is whether current prices need to rise closer to those from a few years ago, or if the market has already discovered fair value.From January 2012 through June 2014, a period of similarly light soybean inventory, most-active futures never fell below $11.50 per bushel and averaged just over $14. Since June 2014, the contract has broken $12 in just one session, in June 2016.Commodity funds have held near record bullish soybean bets since late September, right after futures moved above $10 per bushel. As of Wednesday, speculators are predicted to be comfortably holding a new record long position.U.S. stocks-to-use were projected at 10.4% back in September when funds were packing on the longs, so the fundamentals have swung in favor of the bulls even more since then.THEN AND NOWOne key fundamental difference between now and 2012 or 2013 is market confidence that if the current rally continues, the United States will sufficiently increase soybean acreage next spring so that when 2020-21 ends in August, farmers could very likely be ready to collect a record-large crop.In 2013, recent soybean acreages were right up against the previous highs, and areas like those seen in recent years were unfathomable at that time. Brazils ever-expanding potential is also more likely to ensure that supply can eventually match or outpace demand once again.The stretch of extremely elevated soybean prices between 2010 and 2014 very abruptly ended in mid-2014 when U.S. farmers planted a soybean area nearly 8% larger than the previous high. Record-shattering yields soon followed, and futures have not since returned to those levels.Another factor that has entered the picture more recently is uncertainty around China. No one ever imagined prior to the trade war in 2018 that China could and would halve its U.S. imports, especially since the rapid increase in U.S. production was largely driven by insatiable Chinese demand.Analysts had always assumed Chinas needs would never slow, especially since it had been hard earlier last decade for production to keep up with the booming demand. Those needs plunged in 2018 amid an unprecedented outbreak of African swine fever, which was perhaps morbidly well-timed since it allowed China to give U.S. beans the cold shoulder in the name of the trade war."}