{"text": "China's Ant Group, the fintech giant whose $37 billion IPO was derailed by regulators days before it was due to list in November, is to restructure as a financial holding company.The overhaul comes just after e-commerce giant Alibaba Group Holding Ltd , of which Ant is an affiliate, was hit with a $2.75 billion antitrust penalty as China tightens controls on the \"platform economy\".  read more The Alibaba business empire has come under intense scrutiny in China since its billionaire founder Jack Ma's public criticism of the country's regulatory system in October. Following are key events leading up to Ant Group's shift to a holding company and the fine on Alibaba.Oct. 21, 2020: Ant Group, Alibaba's fintech unit wins the final nod from China's top securities watchdog to register its Shanghai initial public offering (IPO), clearing the last regulatory hurdle for what is shaping up as history's biggest IPO. Oct. 24: Ant's founder, billionaire Jack Ma, tells a public event attended by Chinese regulators that the nation's financial and regulatory system stifles innovation and must be reformed to fuel growth. He compares the Basel Committee of global banking regulators to \"an old man's club\". Oct. 30: Retail investors bid for a record $3 trillion worth of shares in Ant's dual listing, the equivalent of Britain's annual economic output, betting on demand for Ant's financial technology services in China. Nov. 2: Four of China's top financial regulators say they conducted regulatory talks with Ma and Ant's top two executives. They recommend tighter regulations for online micro-lending companies to help contain potential financial risks and rein in rising debt levels. Nov. 3: he Shanghai stock exchange suspends Ant's IPO on its tech-focused STAR Market, citing the regulatory talks as a \"material event\" and a tougher regulatory environment as factors that may disqualify Ant from listing. The move prompts Ant to freeze the Hong Kong leg of the listing. Nov. 10: China increases scrutiny on e-commerce marketplaces and payment services belonging to the likes of Alibaba, publishing draft rules aimed at preventing monopolistic behaviour by internet platforms. Nov. 23: China's increasing oversight of internet platforms is \"timely and necessary\", Alibaba CEO Daniel Zhang tells the World Internet Conference. Dec. 14: China imposes fines and announces probes into deals involving Alibaba and Tencent Holdings Ltd (0700.HK), telling internet giants it will not tolerate monopolistic practices and warning them to brace for tighter scrutiny.  read more Dec. 24: Chinese regulators says they has launched an antitrust investigation into Alibaba and will summon Ant executives, with the ruling Communist Party mouthpiece warning against monopoly and expansion \"in a disorderly and barbarian manner.\"  read more Dec. 27: China's central bank says it has asked Ant to shake up its lending and other consumer finance business.  read more Feb. 3: Ant agrees a restructuring plan with regulators under which it will become a financial holding company, says a person with direct knowledge of the matter.  read more Feb. 4: Ant will hive off its consumer credit data operations, people with knowledge of the matter tell Reuters, a concession to regulators that could help get the massive IPO back on track.  read more Feb. 7: China's market regulator releases new anti-monopoly guidelines targeting internet platforms, further tightening restrictions on the country's tech giants.  read more March 2: Ant is working on measures to help staff with \"short-term liquidity problems\", internal staff messages from executive chairman Eric Jing show, after the IPO suspension dashed employees' hopes of cashing in their shares.  read more March 12: Ant CEO Simon Hu unexpectedly resigns, the first top management exit since the scuppered $37 billion IPO.  read more March 18: Chinese regulators say they have Alibaba, Tencent, TikTok owner ByteDance and nine other technology companies for talks on use of \"deepfake\" technologies on their content platforms, stepping up scrutiny of the sector.  read more April 10: Regulators say they have fined Alibaba $2.75 billion for violating anti-monopoly rules and abusing its dominant market position, China's highest antitrust fine ever. April 12: China's central bank imposes a sweeping restructuring on Ant Group, including turning Ant into a financial holding company, a move expected to curb profitability and valuation.  read more "}