{"text": "Ant Group's CEO Simon Hu unexpectedly resigned on Friday in the midst of the financial technology group's regulatory-driven revamp after its scuttled initial public offering.Following are key events leading up to his departure.  read more OCT. 21: ANT IPO GETS GREEN LIGHT FROM SECURITIES REGULATORAnt Group wins the final nod from China's top securities watchdog to register its Shanghai initial public offering (IPO), clearing the last regulatory hurdle for its issue. OCT. 24: 'OLD MAN'S CLUB' At a public event attended by Chinese regulators, Ant founder and billionaire Jack Ma said the financial and regulatory system stifled innovation and must be reformed to fuel growth. He also compared the Basel Committee of global banking regulators to \"an old man's club\". OCT. 30: MOM-AND-POP INVESTORS BID $3 TRILLION FOR SHARESRetail investors bid for a record $3 trillion worth of shares in Ant's dual listing, the equivalent of Britain's annual gross domestic product, as they bet on demand for Ant's financial technology services in China. NOV. 2: REGULATORS ANNOUNCE TALKS WITH ANTFour of China's top financial regulators say they conducted regulatory talks with Ma and Ant's top two executives. Chinese regulators recommend tighter regulations for online micro-lending companies to help contain potential financial risks and rein in rising debt levels. NOV. 3: SHANGHAI IPO SUSPENDED, ANT FREEZES HK IPOThe Shanghai stock exchange suspends Ant's IPO on its tech-focused STAR Market (688688.SS), citing the regulatory talks as a \"material event\" and a tougher regulatory environment as factors that may disqualify Ant from listing. The move prompts Ant to also freeze the Hong Kong leg of its dual listing. DEC. 27: CHINA PUSHES ANT GROUP OVERHAULChina's central bank says it has asked Ant to shake up its lending and other consumer finance business.  read more FEB. 3, 2021: ANT AGREES RESTRUCTURING PLANAnt Group agrees a restructuring plan with Chinese regulators under which it will become a financial holding company, a person with direct knowledge of the matter says.  read more FEB 4: ANT TO HIVE OFF CONSUMER CREDIT BUSINESSAnt Group plans to hive off its consumer credit data operations, people with knowledge of the matter say, a concession to regulators that could help get its massive public share sale back on track.  read more MARCH 2: STAFF CONCERNS ABOUT SELLING COMPANY'S SHARESAnt's executive chairman says the group is working on measures to help staff with \"short-term liquidity problems\", after the suspension of its IPO dashed employees' hopes of cashing in their shares.  read more MARCH 12: HU RESIGNS AS CEO, ERIC JING TAKES OVERChief Executive Simon Hu unexpectedly resigns, the first top management exit since the scuppered $37 billion IPO.  read more "}