{"text": "A former federal prosecutor who helped recover billions of dollars in settlements from drugmakers and other companies accused of fraud is launching a new whistleblower law firm with another attorney.Gregg Shapiro, who was heading an industry-wide probe of drugmakers financial support of patient assistance charities before leaving the U.S. Attorneys Office in Massachusetts, is joining with Jeffrey Newman to form Newman & Shapiro.Newman, a former prosecutor and journalist, is the principal of Boston-based law firm Jeffrey Newman Law and since 2009 has represented whistleblowers pursuing fraud cases that have resulted in hundreds of millions of dollars in recoveries.Shapiros decision to join a whistleblower law firm contrasts with the typical career path of former federal prosecutors in his position, who often join large defense law firms.He said those lawyers often go to big law firms where they earn large salaries but end up defending the same types of big corporations and wealthy individuals that we investigated and prosecuted, and that was a path he was not interested in taking.Joining a whistleblower firm seems like the perfect way for me to continue contributing to society by doing what I do best, which is preparing fraud cases, he said.Shapiro met Newman on one of those cases, when he represented two whistleblowers in a case against Kindred Healthcare, the largest U.S. nursing home therapy provider, involving its RehabCare unit that settled for $125 million in 2016.That lawsuit, like many whistleblower claims, was filed under the False Claims Act, which allows whistleblowers to sue companies on the governments behalf to recover taxpayer money they were paid based on false or fraudulent claims.The cases are filed under seal so the U.S. Justice Department can investigate the claims and decide whether to join the lawsuits. Whistleblowers are entitled to 15% to 25% of any recovery as a reward.Shapiro, who joined the U.S. Attorneys Office in 2005 and served as the chief of its affirmative civil enforcement unit from 2013 to 2021, oversaw many investigations into healthcare and pharmaceutical companies that stemmed from those complaints.The settlements that resulted from his investigations included the $465 million accord that Mylan struck in 2017 to resolve Justice Department claims that it overcharged the government for its EpiPen emergency allergy treatment.He also worked on an investigation into Pfizers Wyeth that resulted in the drugmaker agreeing to pay $784.6 million in 2016 to resolve allegations that it underpaid drug rebates to Medicaid.More recently, Shapiro has been known for a series of investigations related to allegations that drugmakers used charities that help cover Medicare patients out-of-pocket drug costs as a means to pay them kickbacks to use expensive drugs.The investigation has resulted in more than $1.04 billion in settlements with 12 drugmakers, four charities and one pharmacy, including a $210 million deal with United Therapeutics and a $360 million settlement with Actelion Pharmaceuticals.Shapiro said in his new role he hopes to continue pursuing cases related to the high-price of medications, which he said can become associated with fraudulent behavior.But he also said he expects to handle other, non-healthcare related matters, such as whistleblower cases with the U.S. Securities and Exchange Commission."}