{"text": "(Adds quote)MOSCOW, Feb 12 Below are excerpts translated from Russian by Reuters from Central Bank Governor Elvira Nabiullina speaking at an online press conference after the central bank kept its key rate unchanged at 4.25% on Friday.ON KEY RATEAccording to our estimates, we think the potential for monetary easing has been exhausted.We did not consider cutting the key rate at todays meeting. When the IMF formulated its recommendations, this was most likely based on a more disinflationary scenario than we are considering in the base case.In our view, the situation is not developing towards the disinflationary scenario, but rather closer to the proinflationary scenario. Therefore, our estimates do not coincide with those of the IMF here.We intend to start publishing the key rate trajectory in April.ON MONETARY POLICYMonetary policy will remain soft on average throughout 2021, supporting the recovery of the Russian economy. In the base scenario, the return to neutral monetary policy will take place gradually.If the inflation forecast stabilises near the 4% level, then this is the time to return to neutral monetary policy.ON INFLATIONWe expect annual inflation to peak in February-March.We estimate the (peak) level to be somewhere around 5.5%, after which annual inflation will start to fall.ON OTKRITIE BANK(We could) either sell the group as a whole or possibly carve out certain parts and sell them separately, possibly including to strategic investors because there is demand for different types of assets. Above all we are talking about pension assets and the insurance company.I hope that by late spring-early summer we will take these decisions.In general we intend to start selling Otkritie Group in 2022.ON REPO AUCTIONSLiquidity fluctuations do occur and from this point of view we will keep long-term repo auctions for now, they remain so that banks feel comfortable and understand that they can take these funds from the central bank at any moment. (Reporting by Andrey Ostroukh, Gabrielle Ttrault-Farber, Elena Fabrichnaya, Darya Korsunskaya and Oksana Kobzeva; Writing by Alexander Marrow; editing by Maria Kiselyova)"}