{"text": "PARIS Alphabet Incs Google has agreed to pay $76 million over three years to a group of 121 French news publishers to end a more than year-long copyright spat, documents seen by Reuters show.The agreement between Google and the Alliance de la presse dinformation generale (APIG), a lobby group representing most major French publishers, was announced previously, but financial terms had not been disclosed.The move infuriated many other French outlets, which deemed it unfair and opaque. Publishers in other countries will scrutinize the French agreement, the highest-profile in the world under Googles new program to provide compensation for news snippets used in search results.Agence France-Presse (AFP) and other French news providers that do not belong to the group are not part of the agreement and are pressing forward with various actions against Google.The accord follows Frances implementation of the first copyright rule enacted under a recent European Union law that creates neighbouring rights, requiring large tech platforms to open talks with publishers seeking remuneration for use of news content.In Australia, lawmakers have drafted legalisation that would require Google and Facebook to pay publishers and broadcasters for content. Google has threatened to shut down its search engine in Australia if the country adopts that approach, which the company called unworkable.The French documents seen by Reuters include a framework agreement in which Google will pay $22 million annually for three years to a group of 121 national and local French news publications after signing individual licensing agreements with each.The second document is a settlement agreement under which Google agrees to pay $10 million to the same group in exchange for the publishers commitment not to sue over copyright claims for three years.Publishers would commit to an upcoming new product called Google News Showcase that would allow publishers to curate content and provide limited access to paywalled stories.Google declined to comment on terms of the deal.In January, the Reuters news agency, a division of Thomson Reuters Corp, struck a deal with Google to be the first global news provider to Google News Showcase.Reuters French rival AFP has maintained its complaint with the French antitrust watchdog against Google, an internal source said. Last month, AFPs Chief Executive Fabrice Fries welcomed the deal between Google and APIG, but called on the tech company to extend such copyright deals to news agencies.MAKING GOOGLE PAYPressure is mounting on Google globally to pay for news content, as the industrys advertising and revenues have plummeted with the rise of digital platforms.In Spain and Germany, publishers have tried but failed to charge Google for displaying excerpts, or snippets. German publishers lost a legal battle in 2019 for 1 billion euros worth of copyright fees since 2013.The text of the EU neighbouring rights rule was aimed at creating a new sustainable stream of revenues for news publishers.In the United States, the news industry is backing legislation that would allow it to negotiate collectively with the big platforms without violating antitrust law. In Congress, lawmakers recently issued a report saying dominant tech firms have harmed the news industry because they can impose unilateral terms on publishers, such as take-it-or-leave-it revenue sharing agreements.Andrew MacLeod, chief executive of Canadas Postmedia, said publishers there are watching discussions in other parts of the world. We seek an outcome to grow and architect our future rather than relying on a handout.LACKING TRANSPARENCYFrench publishers had little choice but to go along with the deal, three sources close to the matter, citing pressures from shareholders.The same sources said some publishers were upset Google refused to provide access to data showing how much money it generates from news.These opaque agreements dont ensure the fair treatment of all news publishers, since the calculation formula isnt made public, the union for independent online news publishers Spiil said this week. Google took advantage of our divisions to advance its interests.Fees range from as large as $1.3 million for Frances reference daily Le Monde to $13,741 for local publisher La Voix de la Haute Marne, documents show. They did not specify how the amounts were calculated.Leading national dailies Le Monde, Le Figaro and Liberation and their groups negotiated about 3 million euros ($3.6 million) each per year on top of the fee in the agreement, notably by agreeing in November to sell subscriptions through Google, one source close to the matter said.The head of Le Monde group Louis Dreyfus and Liberations boss Denis Olivennes declined to comment. Representatives for Le Figaro were not immediately available for comment.The head of APIG, Pierre Louette, did not respond to messages seeking comment.($1 = 0.8247 euros)(Fixing typographical error in paragraph four, please read Agence France-Presse)"}