{"text": "NEW DELHI U.S. video streaming company Netflix is in talks with Viacom18, part of the Indian conglomerate Reliance Industries media unit Network18, about a multi-year partnership to source content, three sources told Reuters, in a move that would expand a relationship between the two sides.Under the partnership, Network18 affiliates - which include its joint venture with ViacomCBS, Viacom18 - would create shows for Netflix to help the U.S. firm expand offerings in India, where it competes against the video streaming services of Amazon.com Inc and Walt Disney Co.A Netflix spokesman in India denied the company was in talks with Network18 or Viacom18, but did not elaborate. A spokeswoman for Viacom18 declined to comment on whether any talks were under way.Shares in Network18 Media & Investments surged 5% after the Reuters article.The financial terms of any potential partnership were not immediately clear and negotiations are still in the early stages, the sources said, who spoke on condition of anonymity because the talks are private.While the new shows will be used only by Netflix, that does not mean Network18 and its affiliates will stop creating shows for other platforms, said two of the three sources.Viacom18 licences content to several platforms, including Amazon. In 2019, its digital unit Tipping Point partnered with Netflix for three Hindi-language shows, but two of the sources said the current discussions were about a much bigger tie-up over several years.This is a bigger version of the 2019 deal in essence, said the first source.The second source described the ongoing discussions as one of Netflixs biggest moves to create local content in India.The scale of Netflixs ambition and aspiration in India is quite high, said the source, adding that the deal could involve at least 10 shows, mainly in Hindi.Network18 is controlled by Indian billionaire Mukesh Ambani through subsidiaries of his oil-to-telecoms conglomerate Reliance Industries.In recent weeks, Reliance has secured nearly $13 billion in investments from Facebook Inc, KKR & Co and other investors into its digital unit Jio Platforms, which houses movie and music apps, and a telecoms venture.Some Reliance executives are involved in the Netflix negotiations, two of the sources said. A spokesman at Reliance did not respond to a request for comment.Netflixs Indian roster includes blockbuster originals such as Sacred Games, a crime thriller set in Mumbai and starring some of Bollywoods biggest names. Its pricing is, however, higher than that of Amazon Prime Video and Disney-owned Hotstar.Netflix CEO Reed Hastings said in December the company planned to invest nearly $400 million during 2019 and 2020 to develop content for Indian viewers.Local-language shows are vital for Netflixs growth in India, which the company in 2018 said could deliver its next 100 million subscribers.While a content deal would boost Netflixs offerings, it would also aid Network18 whose revenue has been hit as businesses cut back on advertising and other spending during the coronavirus lockdown, said one of the sources, adding: It makes huge sense (for both companies)."}