{"text": "China is framing tough new rules to clamp down on a booming private tutoring industry, aiming both to ease pressure on school children and boost the country's birth rate by lowering family living costs, sources told Reuters.The clampdown will also have the effect of cooling China's cutthroat tutoring market for kindergarten through to the 12th grade, or K-12 pupils, that has grown exponentially in recent years to around $120 billion.At least one major company providing tutoring services has put a billion-dollar private fundraising round on ice amid increasing scrutiny from Beijing and looming industry uncertainty, according to three separate sources.The changes being drafted by the Ministry of Education and other authorities target before- and after-school K-12 tutoring, three people with knowledge of the matter told Reuters.One source said the draft rules could be unveiled as early as by end-June. All three sources requested anonymity as they were not authorised to speak publicly.Under the planned rules, on-campus academic tutoring classes will be banned, as will both on and off-campus tutoring during weekends, two of the people said. Regulators will also clamp down on off-campus tutoring, in particular for English and math, they added, restricting class times on weekdays.More than 75% of K-12 students attended after-school tutoring classes in 2016, according to the most recent figures from the Chinese Society of Education, and anecdotal evidence suggests that percentage has risen.As well as protecting sleep-deprived students, Beijing sees the changes as a financial incentive for couples to have more children as it seeks to shore up a rapidly declining birth rate, the sources said.\"It's rather urgent to lessen students' workloads, and reduce the financial burden on their parents who are becoming reluctant to have more kids,\" one source said.China's population grew over the 10 years to 2020 at the slowest pace in decades, the country's latest census showed on Tuesday, raising fears its dwindling workforce will be unable to support an increasingly elderly population.  read more Living costs in big cities, with education accounting for a big chunk of that, have deterred couples from having children.The new rules would seek to limit fees charged by companies for tutoring, one of the sources told Reuters.The ministry didn't immediately respond to Reuters request for comment.INDUSTRY ON NOTICEThe K-12 tutoring industry would grow to nearly 1 trillion yuan ($155 billion) in 2025, up from around $120 billion in 2019, according to market researcher Qianzhan.However, Beijing's increasing oversight is already hitting company stocks and fundraising plans.The planned rules would add to restrictions imposed in March, including a ban on live-streamed classes for minors after 9 p.m., a crackdown on advertising, and a ban on academic tutoring course offerings for pre-school kids. Online education startup Yuanfudao, backed by tech behemoth Tencent (0700.HK), has suspended preliminary talks to raise around $1 billion which would have valued the company at $22 billion, said the three separate sources.Yuanfudao, which was valued at $15.5 billion in a funding round last October, started informal talks with investors in  December, one of the sources said, adding plans were put on hold in March in response to increasing regulatory oversight of the sector. Yuanfudao, which along with main rival Zuoyebang had raised billions of dollars during China's COVID-19 lockdowns as students were pushed online, did not respond to a comment request.Yuanfudao and Zuoyebang were fined a maximum penalty of 2.5 million yuan ($389,420) each by regulators on Monday over false advertising.A source told Reuters that a large state broadcaster was told by regulators last month to remove TV commercials from two players, New Oriental Education & Technology Group  and TAL Education Group (TAL.N) that they had placed earlier.Shares in New York-listed New Oriental and peer TAL have fallen 23% and 26%, respectively, this year, compared to a 13% gain in the benchmark NYSE composite index (.NYA).The stocks ended down 5.8% and 2.1%, respectively, on Wednesday.New Oriental said it had not placed any TV advertisements in the past two months and declined to comment on the potential tightening regulations. TAL didn't respond to a request for comment."}