{"text": "Goldman Sachs Group Inc (GS.N) executives are examining how well the bank navigated several major market events this year that caused extreme volatility, people familiar with the matter told Reuters.The review will include a market-wide fire sale of stocks triggered by Archegos Capital Management's default on margin calls at banks including Goldman, the sources said.  read more The meltdown of Archegos, a New York investment fund run by former Tiger Asia manager Bill Hwang, has sent shock waves across Wall Street and drawn regulatory scrutiny in three continents. Goldman Sachs is also looking more broadly at how it handled recent market events, with a particular lens on compliance and best practices, the sources said.That could include what happened during the Reddit-fueled trading frenzy in equity markets, including shares of GameStop Corp (GME.N), as well as the U.S. Federal Reserve's decision to end pandemic-related capital relief for banks, which caused issues in fixed-income markets. Also this year, there was chaos in energy markets in mid-February after a deep freeze in Texas sent the cost of fuel and power sky-high.Goldman Sachs declined to comment.Although Goldman did not earn or lose a significant amount of money on Archegos' default and its CEO has said the bank's controls worked well, the surge of volatility across several markets this year prompted management to take a closer look at its risks and hedges, the sources said.Reviews of this nature are routine at large Wall Street banks, especially when they face scrutiny from regulators and politicians. The GameStop and Archegos events have prompted financial regulators to say they are taking a closer look at what caused the volatility.The Fed considers it a \"risk-management breakdown\" at firms that handled Archegos' trades, Chairman Jerome Powell told  CBS's \"60 Minutes\", which aired on Sunday, pledging that the regulator will not let it happen again.Goldman's chief executive, David Solomon, said last week that the bank's risk controls on Archegos \"worked well.\" As part of its review, the bank's compliance department examined its decision to begin doing business with Archegos in late 2020 and noted it required the family office to increase the collateral it was required to post early this year, one of the sources said.That helped Goldman avoid losses on positions that rivals including Japanese bank Nomura Holdings Inc (8604.T) and Switzerland's Credit Suisse Group AG (CSGN.S) are now facing.  read more Goldman and several banks avoided doing business with Archegos in its early days because Hwang's prior firm reached a $44 million insider trading settlement with the U.S. Securities and Exchange Commission in 2012. They warmed up to the client last year after enough time had passed and it was clear that rivals were doing business with Hwang again.However, Archegos had six prime brokers handling its trades, with different levels of leverage and margin requirements on a handful of concentrated bets. When some of its positions went belly-up in late March, the banks had to seize collateral and sold billions of dollars' worth of stock to cover Archegos' positions."}