{"text": "JD.com Inc (9618.HK) is in talks to buy part or all of a stake in brokerage Sinolink Securities (600109.SS) worth at least $1.5 billion, three people said, as the e-commerce major aims to bolster its financial services operations.A deal to buy the stake from Sinolink's largest shareholder, Yongjin Group, would be the biggest bet in acquisition value terms by Beijing-based JD.com in China's $45 trillion financial market. \"The valuable brokerage licence is key for tech giants to monetise their huge online traffic and grow into bigger firms, as otherwise they have to direct such traffic to other financial institutions,\" one of the sources said. China's 2nd-biggest e-commerce company by revenue started discussions with Yongjin late last year, seeking to buy part or all of its 27% stake, said two of the people with direct knowledge of the matter.Based on Sinolink's market value of 39 billion yuan ($6 billion) on Thursday, a 27% stake would be worth about 10 billion yuan, Reuters calculations show.After Reuters reported the discussions, Sinolink shares jumped by their maximum 10% daily limit on Friday, reversing earlier losses.The potential deal comes as Chinese tech majors look to expand into financial services despite a regulatory crackdown on some parts of the sector, sources said. JD.com draws the bulk of its revenue from its core e-commerce business and owns only a few small financial licences, mainly offering online services including consumer credit and wealth management products.It has long eyed a foray into the fast-growing brokerage industry, which was worth $1.4 trillion by the end of 2020, the same two people said. Chengdu-based Sinolink was just outside the top 20 biggest brokerages in China by operating revenue in 2019, official data showed. Its business includes stock broking, sponsoring and underwriting equity and debt deals, financial advisory and wealth management.     China's top two tech giants, Alibaba Group (9988.HK) and Tencent (0700.HK), hold stakes in leading investment bank China International Capital Corp (3908.HK). Alibaba has also invested in large broker Huatai Securities (601688.SS), while Tencent has backed Hong Kong-based online brokerage Futu Holdings (FUTU.O). Refinitiv shows, JD.com has only made two deals in the financial sector: its investment in online platform for automotive financing Yixin Capital's $550 million fundraising in 2016, and another worth an undisclosed amount in China Taiping Insurance Holdings' (0966.HK) financial services unit in 2018. The JD.com-Yongjin talks were at an early stage and subject to change, cautioned the sources, who declined to be identified because of confidentiality constraints.     Sinolink said its controlling shareholder had not discussed with JD.com the sale of part or all of its stakes, and the firm did not have information to disclose. JD.com and Yongjin did not immediately respond to requests for comment.TIGHTER REGULATIONFor privately run Yongjin, the potential deal would satisfy its plan to divest its financial services business to bypass new regulations on financial holdings firms, said the third person.The new rules require a capital threshold for companies that operate more than two types of financial businesses. Should a company fail to meet the requirement after a one-year grace period, Beijing can force a share sale. In September, Guolian Securities said it would acquire Sinolink through a share swap and stake purchase from Yongjin, exchange filings showed. The tie-up was later scrapped amid questions over potential insider trading activities. Founded in 1995 by late entrepreneur Wei Dong and now run by his wife, Chen Jinxia, Yongjin manages more than 400 billion yuan of assets, with 30 billion yuan self-owned, according to its website.($1=6.4878 Chinese yuan renminbi)"}