{"text": "NEW DELHI/SRINAGAR India is considering offering young Kashmiri militants an escape from a life of violence by temporarily resettling them in more peaceful parts of the country, according to the top military commander in the Kashmir Valley.Lieutenant General B.S. Raju revealed the plan for a new scheme to offer a way out of militancy during a telephone interview from his headquarters in Srinagar, Kashmirs main city.He told Reuters recommendations had been submitted to Prime Minister Narendra Modis government and that the plan, while not finalised, was in an advanced stage.These are young boys who need to be taken care of for a period of time, Raju said, adding that could involve temporarily settling them outside of Muslim-majority Kashmir.Past efforts to persuade fighters to put down their guns have had mixed success. But Raju said the military had recommended the schme take a longer-term approach to rehabilitating ex-militants.The bottom-line is that it will have a structure that will help and give confidence to the people who are opting to surrender, Raju said.More than 50,000 people have died during more than three decades of an insurgency that New Delhi accuses neighbouring Pakistan of fuelling, by using militant groups to wage a proxy-war across the disputed border dividing the Himalayan region.India has flooded the valley with security forces - about 200,000 military and paramilitary troops are deployed there. And Raju said militant attacks have dropped by nearly 40% compared to last year.AROUND 180 ACTIVELast August, Prime Minister Modi changed the political landscape by taking away Jammu & Kashmirs status as Indias only Muslim majority state, splitting it into two federally-controlled territories and removing the special privileges afforded to Kashmiris.Promising a concerted effort to develop the region economically, Modi said the move was need to integrate Kashmir more fully with the rest of the country, but critics said it would further alienate Kashmiris.Pakistan, which maintains a long-standing territorial claim on Kashmir though it denies accusations that it materially helps the militants, has denounced Modis action.Since the start of the year, Indian security forces have killed around 135 militants, most of them recruited locally.The military estimates that there are currently around 180 militants operating with various groups active in the valley, Raju said. Some 70 local Kashmiris are reckoned to have been recruited by these groups since the start of the year, about a dozen less than during the same period a year ago.We wish that this should drop further, and finally cease altogether, Raju said.Currently most surrenders are conducted in line with a 2004 policy that provides a lump sum payout of 150,000 Indian rupees ($2,000), a small monthly stipend, free vocational training and cash payments for weapons handed over.The New Delhi-based South Asia Terrorism Portal estimated that more than 400 insurgents have surrendered since 2004, but after 2007 the numbers came down to a trickle, with only two dozen men giving up arms in the last three years.Kuldeep Khoda, a former Kashmir police chief, said the scheme had partly failed because the vocational training provided by the government was inadequate.If you ask me very frankly, there was hardly any training being given. They were just kept there for a few months, he said. It was just a formality which was being completed."}