{"text": "WASHINGTON The Trump administration plans to reinterpret a Cold War-era arms agreement between 34 nations with the goal of allowing U.S. defense contractors to sell more American-made drones to a wide array of nations, three defense industry executives and a U.S. official told Reuters.The policy change, which has not been previously reported, could open up sales of armed U.S. drones to less stable governments such as Jordan and the United Arab Emirates that in the past have been forbidden from buying them under the 33-year-old Missile Technology Control Regime (MTCR), said the U.S. official, a former U.S. official and one of the executives. It could also undermine longstanding MTCR compliance from countries such as Russia, said the U.S. official, who has direct knowledge of the policy shift.Reinterpreting the MTCR is part of a broader Trump administration effort to sell more weapons overseas. It has overhauled here a broad range of arms export regulations and removed the U.S. from international arms treaties including the Intermediate-Range Nuclear Forces Treaty and the Open Skies Treaty.Sidestepping the accord would allow U.S. defense contractors General Atomics Aeronautical Systems Inc and Northrop Grumman Corp to break into new markets currently dominated by less sophisticated offerings from China and Israel, which do not participate in the MTCR.Heidi Grant, the Pentagons Director of Defense Technology Security Administration, declined to comment on the pending MTCR policy change but said the U.S. military is eager to see drone sales expanded to more countries. Such sales would bolster the militaries of allies and replace drones sales from other nations, she said. If we are unable to meet this growing demand, we shoot ourselves in the foot, Grant told Reuters.She said the drones would help allies fight terrorism, establish border control and generally help stop threats before they reach the United States. Grant declined to name specific nations the Pentagon believes should get more U.S.-made weapons.The State Department, which makes final decisions on drone sales, declined to comment on the policy change. The White House also declined to comment.U.S. agencies including the departments of Commerce, Energy, Justice and Homeland Security agreed to the change in May, and the State Department is expected to approve the first drone sales under the new interpretation as soon as this summer, said the U.S. official and industry executives. They said the administration has already notified Northrop Grumman and General Atomics, the two major U.S. drone makers, of its plans.The change is scheduled for a review by the White House National Security Council at its June 16 meeting, said one of the executives and a former U.S. official with knowledge of the internal policy discussions. The council is expected to support the policy change and discuss a possible White House announcement, they said.The Trump administration is pressing ahead with its revamp of drone export policy under pressure from American manufacturers and despite objections from human rights advocates, who warn of the risk of fueling instability in hot spots including the Middle East and South Asia.Expanded sales of armed drones could increase global conflicts, said Rachel Stohl, a weapons expert at the Stimson Center in Washington, a think tank focused on security issues that opposes weapons proliferation.Once they leave U.S. control, we lose our ability to influence how and where they are used, she said.LOWERING THE BARUnder the State Departments current interpretation of the MTCR, all sales of large drones are subject to what is known as a strong presumption of denial, which has made approvals rare. But the high bar to get a deal greenlighted will be removed, signaling to previously forbidden customers that their orders have much better chance of approval, according to the official, the former official and one of the defense executives.Reuters could not determine what specific criteria the State Department will use in scrutinizing weapons deals under the new interpretation.Until now, only England, France and Australia have been allowed to buy large, armed drones from U.S. manufacturers, according to data collected by The Center for the Study of the Drone at Bard College in New York state.Jordan, Romania, Saudi Arabia and UAE have shown interest in purchasing U.S. systems and will be among the first customers in line when the U.S. policy changes, one of the industry executives said. Officials from the Washington embassies of those nations did not respond to requests for comment.The U.S. official and the former official said any country where U.S forces are operating drones in the counterterrorism fight, such as Kuwait, could be a potential customer for lethal drones. The Embassy of Kuwait in Washington did not return a request for comment.U.S. drone manufacturers, face growing competition overseas especially from Chinese and Israeli rivals who have far fewer rules limiting sales.The defense contractors are vying for a larger share of the global military drone market, which the Teal Group, a market research firm, forecast annual sales, research and development will rise from $15.8 billion in 2020 to nearly $20 billion by 2029.Bart Roper, Senior Vice President for Strategic Development at General Atomics, said the firm has been limited under current policy and that a liberalization of the rules could result in hundreds of new sales. Roper, who did not confirm the policy change, said there is strong interest from Middle East and Southeast Asian customers that have been forced to purchase aircraft from the Chinese because of a lack of U.S. alternatives.A Northrop Grumman spokesman added that increased drone exports would lead to closer work on the technology with allies, helping keep U.S. drones state-of-the-art.MISSILE PACTThe MTCR agreement - originally signed in 1987 by the United States, Canada, France, Germany, Italy, Japan, and Britain - focused on stopping the proliferation of nuclear weapons. The pact has been credited with slowing or stopping missile programs in countries such as Egypt, Argentina and Iraq.The MTCR policy shift has been under consideration by the Trump administration since 2017, but has been delayed several times as the United States has grappled with objections within the government and from other nations in the agreement, two of the executives and the current and former officials said.Some state department officials objected to the change for fear that advanced weaponry would be sold to governments that have abused human rights, the former official said.The U.S. plan is to reinterpret its treatment of drones that fly slower than 800 kilometers per hour, including Reapers and Global Hawks. Global Hawks, made by Northrop Grumman, are not armed and are typically used for surveillance. Reapers, made by General Atomics, are used for both surveillance and air strikes - including the recent U.S. strike that killed top Iranian General Qassem Soleimani in January.The MTCR currently classifies such drones as cruise missiles - and therefore subject to high export restrictions - because of the technical specifications for unpiloted aircraft in the 1987 pact. Under the reinterpretation, the United States will treat these drones as if they belong in a lower category that falls outside MTCR jurisdiction.The Pentagons Grant said boosted sales of sophisticated weaponry can strengthen U.S. alliances and help allied militaries safeguard U.S. interests. It also enables cooperation with allies when they use the same equipment, and would speed efforts to replace or repair drones in combat.Over time, she said, boosting sales of the drones could also lower their cost to the U.S. government by giving defense contractors economies of scale."}