{"text": "SANTIAGO Chiles environmental regulator has withdrawn from its legal battle to defend a compliance plan by lithium miner SQM that it approved last year, according to a filing seen by Reuters, a decision that could prove a major setback as the miner seeks to ramp up output of the coveted battery metal.The Environmental Superintendent (SMA) also said it was planning a new comprehensive management plan for the Atacama salt flat in northern Chile where SQM and other companies mine lithium and copper. The flat supplies around one-quarter of the worlds lithium, an ultralight metal that helps power electric vehicles and cell phones.In 2019, the regulator gave its blessing to a $25 million compliance plan drawn up over three years by SQM after an investigation found the company had over-drawn lithium-rich brine from the salt flat. But that decision was tossed out by a regional court in December at the behest of local indigenous communities.The SMA had been planning to take the battle to defend the compliance plan to the countrys Supreme Court, but said in the filing that it had ultimately decided not to fight the lower courts order.The (decision) to drop the appeal... comes as the SMA begins to develop a comprehensive management plan for the Atacama salt flat basin, the agency said.The about-face by the regulator is likely to be seen as a win for indigenous and environmental activists, who have long called for closer scrutiny of mining in the region. The agency did not elaborate on why it had changed its mind.Soaring lithium demand has raised questions about whether Atacama can support current and future levels of lithium production along with the needs of sprawling nearby copper mines, a booming tourism industry, and indigenous communities.The SMA said its new management plan was aimed at assessing the impacts of four principal companies that have projects in the salt flat. The filing named SQM, SQMs lithium rival Albemarle, Antofagastas Zaldivar copper mine and BHPs Escondida, the worlds largest copper mine.Those actions include enforcement, the agency said, citing its recent decision to charge Escondida with over-pumping water for 15 years. It also said it would cross-reference data from the miners, in order to better understand their environmental footprint.SQM told Reuters in a written statement that it respected the regulators decision and would resubmit its compliance plan for a fresh evaluation.We believe that the SMAs withdrawal will focus the efforts of all those involved on complying with regulations and the concerns of the communities, the company said.Albemarle declined to comment on the regulators decision. Last year, the company announced a voluntary plan to begin monitoring water flows beneath the salt flat.BHP and Antofagasta did not immediately reply to requests for comment.The decision does not call on the companies to scale back or halt their operations, but raises new questions about environmental management at a time when SQM has sought to expand its operations in the Atacama.WATER WOESWater continues to be a major sticking point for the plans of both SQM and Albemarle to boost output of lithium from the salt flats of the Atacama, the worlds driest desert and by far the biggest source of supply in South Americas so-called lithium triangle.Besides environmentalists, car companies, including Volkswagen and Daimler, have also ratcheted up scrutiny of their lithium suppliers in the area.The lower court, in its December 2019 decision to scrap SQMs compliance plan, noted the flats particular fragility and called for a water model to help ensure mining on the flat was sustainable.The SMA had initially rebuked those arguments, calling the courts decision unfounded. It accused judges of cherry-picking information to favor its finding and omitting... evidence that had been pondered by the SMA.In the latest filing, the SMA said it now believed it best to abide by the courts decision and require SQM to conduct a new compliance plan."}