{"text": "NEW YORK Goldman Sachs Group Inc management is considering whether to scale back financial targets set earlier this year, as the coronavirus pandemic has hindered the banks business model revamp, analysts and sources inside the bank told Reuters.Goldman unveiled plans to boost returns on equity and cut costs during its first-ever investor day in January. To reach its goals, Goldman would squeeze more revenue from existing businesses like wealth management as well as relatively new ones like consumer lending, while launching additional corporate services like cash management.Since then, the pandemic has slammed into the economy, crippling loan demand and causing widespread unemployment. It has also prevented Goldman bankers from drumming up business with new customers the way they could before coronavirus lockdowns.Although Goldmans trading revenue has soared thanks to market volatility, other initiatives have stalled.Unless theres a silver bullet vaccine cure, it looks like Goldman will not hit its targets, said Viola Risk Advisors bank analyst David Hendler. Its behind on wealth management and its behind on consumer.A spokesman for Goldman referred Reuters to executives prior statements but declined to comment further.Goldman Sachs executives have stood by their targets, stressing that the path to achieving them in the coming years would not be linear. They are not expected to move the goalposts on Wednesday when the bank reports third-quarter results.Instead, the bank may change targets in January, a year after they were set, said the sources, who were not authorized to speak publicly.As it stands, Goldman pledged to produce a return on tangible common shareholders equity (ROTE) of more than 14% by 2023, compared with 10.6% in 2019.The bank also outlined plans to cut expenses by $1.3 billion over that time frame, producing an efficiency ratio of 60% compared with 68.1% in 2019. A lower efficiency ratio means a company is better at managing costs relative to revenue.Failing to hit the targets would deal a blow to Chief Executive David Solomon, who has pledged to make Goldman Sachs look more like a conventional bank. However, analysts already anticipate target revisions and say there is little Solomon could do about the financial consequences of the pandemic.Analyst estimates for Goldmans ROTE do not exceed 12% in the coming years, and the consensus for its efficiency ratio is 63.2% by 2024, suggesting a lack of confidence in the banks targets, UBS analyst Brennan Hawken noted in a recent report.So far this year, Goldman has had to delay the launch of a new digital wealth management initiative and slow hiring of private wealth advisors in response to the pandemic. The bank also slowed loan growth in the consumer division and set aside more money for loans that could go bad.Helping Goldmans profits, analysts expect trading revenue to stay aloft through year-end and for the bank to see cost-cutting benefits in 2021.Goldman has been automating more roles and recently said it was laying off a modest number of staff, primarily in back-office functions. Automation is likely to accelerate as the pandemic continues, leading to more job cuts, the sources said.Although Goldman may miss its pre-pandemic targets, Odeon Capital analyst Dick Bove thinks Solomon is pursuing the correct strategy in shaping Goldman more like a conventional bank.Overall, this company is moving in the right direction at the right time, he said."}