{"text": "The U.S. Federal Reserve has asked lenders to start providing information on the measures they are taking to mitigate climate change-related risks to their balance sheets, according to four people with knowledge of the matter.The previously unreported supervisory discussions highlight how U.S. watchdogs are moving to execute President Joe Biden's agenda to incorporate climate risk into the financial regulatory system, with potentially major ramifications for Wall Street.While European regulators are this year rolling-out climate-change \"stress tests\" for lenders, the Fed lags its peers.  read more Fed officials have previously said they are considering a new scenario analysis to help them understand how climate change may affect trillions of dollars' worth of bank assets, but have not said how or when they would start to apply such tests.  read more In private discussions, however, Fed supervisors have begun pressing large lenders to detail the measures they are taking to understand how their loan books would perform under certain climate change scenarios, the four people said.Fed officials have not dictated the parameters for the analysis but have made it clear they expect lenders to conduct the internal risk-management exercises and hand over the data, the people said.That analysis includes testing the geographical exposure of bank assets to physical risks such as flooding, drought and wildfires, as well as testing exposures to different sectors, such as how oil and gas loans may perform versus renewable energy loans.The aim of the tests is to identify risks, but the Fed has not indicated that the data it is gathering would translate into any additional capital charges or other regulatory actions.\"They're being very pragmatic. They're doing their homework,\" said one of the people.Global banks -- including JPMorgan (JPM.N), Citigroup (C.N), Wells Fargo (WFC.N), Bank of America (BAC.N), Goldman Sachs (GS.N) and Morgan Stanley (MS.N) -- have been exploring the implications of climate change for some time, both internally and in some cases with European regulators like the Bank of England who are more aggressively integrating climate change risks into the regulatory framework.Nevertheless, the new climate scrutiny from the U.S. central bank adds to the pressure on Wall Street lenders, forcing them to make investments in technology, data management and staff.\"The data work is a big deal,\" said another of the sources.The banks did not immediately respond to requests for comment on the private discussions with the Fed.STRESS TESTSClimate change could upend the financial system because physical threats such as rising sea levels, as well as policies and carbon-neutral technologies aimed at slowing global warming, could destroy trillions of dollars of assets, risk experts say.In a 2020 report, a Commodity Futures Trading Commission panel cited data estimating that $1 trillion to $4 trillion of global wealth tied to fossil fuel assets could be lost.The Fed in January appointed Kevin Stiroh, one of its top supervisors, to lead a new team focusing on climate-related financial risks, but some congressional Democrats are pushing the central bank to move much faster and add climate risks to bank stress tests which dictate Wall Street's capital plans.In March, Fed governor Lael Brainard said that climate scenario tests could be helpful but that they would also rely on qualitative judgments and be highly uncertain.Fed Chair Jerome Powell has said the agency will tread carefully and focus on incorporating climate change into existing regulatory obligations, as opposed to creating strict new rules. It is unclear, though, if he will be renominated to lead the Fed after his term expires next year, while his vice chair Randal Quarles, a Republican appointee who oversees bank regulation, is expected to leave this year.Progressive groups say there is much more the central bank could do to address climate risks, even if it does not want to go as far as its European counterparts.  read more Tim Clark, a former senior Fed official who helped build its stress tests after the 2008 financial crisis, said it should publicly communicate that it expects banks to incorporate climate change into their risk management processes.\"That's something they can basically start right now and make it clear to the industry that they expect banks to be working hard on this.\""}