{"text": "WASHINGTON The Trump administration has filed a motion asking a court to dismiss a lawsuit against the presidents executive order targeting social media companies, calling it a profound misunderstanding, according to a copy of the motion seen by Reuters.The lawsuit was brought in June by the Center for Democracy and Technology (CDT), a Washington-based tech group funded by Facebook Inc, Alphabet Incs Google and Twitter Inc. It marked the first major legal test of President Donald Trumps directive.Trump issued an executive order in May against social media companies in an attempt to regulate platforms where he has been criticized, just days after Twitter took the rare step of fact-checking one of his tweets about mail-in voting. Trump threatened to scrap or weaken a law known as Section 230, which protects internet companies from litigation over content posted by users.The lawsuit by CDT argued Trumps social media executive order violates the First Amendment rights of social media companies, will chill future online speech and reduce the ability of Americans to speak freely online.The administration argues that the executive order only directs government agencies, and not private companies, to act.The EO challenged here imposes no obligations on any private party, said the motion filed by the Department of Justice in the U.S. District Court for the District of Columbia, which was seen by Reuters.It directs executive officials to take steps that could lead various agencies to examine ... allegations that large social media online platforms have displayed political bias in moderating content, the motion said.The lawsuit reflects long-simmering tensions between the Trump administration and social media companies that have become key tools in Trumps political arsenal.Avery Gardiner, CDTs general counsel, called Trumps executive order unconstitutional. CDTs lawsuit argues that the White House ran afoul of the First Amendment, which prohibits government officials from retaliating against an individual or entity for engaging in protected speech.Instead of actually trying to address the merits of the issues, and to engage in litigation that will show the severe constitutional deformities of the executive order, it is resorting to legal maneuvering, Gardiner said on Wednesday, referring to the Trump administrations move.The CDT has negotiated a briefing schedule with the DOJ. CDT will be filing its response by the end of August and the government is likely to respond by Sept. 21, she said.White House spokesman Judd Deere said the administration moved to dismiss the case because it is not a valid legal argument.The left-wing lobbying organizations brief seems to suggest it doesnt understand how administrative action works or possibly that it doesnt understand the nature of the judicial system, he told Reuters on Wednesday.The Department of Justice did not immediately respond to a request seeking comment.Twitter called the executive order a reactionary and politicized approach to a landmark law. It declined comment on the CDT lawsuit. Google and Facebook did not respond to requests for comment.Trumps order seeks to channel complaints about political bias to the Federal Trade Commission. At a recent Senate hearing, the agencys chairman, Joseph Simons, said the FTC has not taken any action to enforce the order.The U.S. Commerce Department has petitioned the Federal Communications Commission (FCC) seeking new transparency rules in how social media companies moderate content after Trumps executive order directed the action. Earlier this month FCC Chairman Ajit Pai agreed to open the petition to public comment for 45 days."}