{"text": "Activist investor ValueAct Capital has amassed a $1.53 billion stake in Seven & i Holdings (3382.T) and would like the Japanese owner of the 7-Eleven convenience store chain to consider changes, including a potential break-up.ValueAct told its investors on Wednesday in a letter seen by Reuters that it built a 4.4% stake in Seven & i and believes that the sum of its parts is worth much more than its current market value.The hedge fund said the 7-Eleven business could be worth more than double what its parent is currently valued at if the company restructures itself to focus on the convenience stores or if 7-Eleven is spun out.The new stake in Seven & i marks a return to Japan for ValueAct, where shareholder activism is gaining traction and the firm has considerable experience, having made an investment in Nintendo (7974.T) last year and having previously bet on Olympus Corp (7733.T) and JSR Corp (4185.T).  read more Seven & i last year spent $21 billion to buy the Speedway convenience stores. 7-Eleven's convenience stores are a consistent, high-return business, while Seven & i's other retail and financial assets, such as real estate have not contributed to cash flow of late even though they are backed by valuable assets, the investment firm noted.\"We invested in Seven & i Holdings at an estimated P/E ratio of 11 times, while global peers trade at 15 times to 25 times,\" ValueAct said in the letter.The company's shares that are traded in the United States climbed 4% on a day the broader market is down. Seven & i did not immediately respond to a request seeking comment.ValueAct declined to comment. The investment firm, run by Mason Morfit, is up 18% since January after returning 12.5% last year, an investor in the firm said.ValueAct underscored the role 7-Eleven could play for Japan in the letter, arguing it could become what McDonald's Corp (MCD.N) and Starbucks Corp (SBUX.O) are to the United States, what Inditex (ITX.MC) is to Spain and Aldi is to Germany.But work is necessary to achieve these goals, ValueAct said noting that 7-Eleven would need to speed up its global digitalization strategy. In the United States it could focus more on food, which can be quickly tailored to tastes, and cut corporate costs.Over the last months, ValueAct has engaged with Seven & i's board directors and management and is optimistic that it can continue to build trust and alignment with the company, it said in the letter.The letter reflects ValueAct's style of collaborating with management by making suggestions instead of dictating terms to management and the board.Over decades ValueAct has distinguished itself from other activist investors. While rivals often publicly demand board seats and push management to accept their plans quickly, ValueAct prefers to work behind the scenes, making few public statements or releasing detailed plans for change.In the letter ValueAct also said that this new investment echoes the firm's previous investments in Japan.The challenges and opportunities facing Seven & istrategy, organizational design, digitalization and ESGare very familiar to us, the letter said. ValueAct has helped facilitate sales of businesses at Olympus and JSR."}