{"text": "LOS ANGELES Federal workplace safety regulators said on Friday they will revisit several COVID-19 related safety investigations performed during the Trump administration as part of a wider effort to better protect workers from the pandemic.The U.S. Occupational Safety and Health Administration (OSHA) also announced a new enforcement program targeting companies that put the most workers at serious risk of virus exposure, or that retaliate against workers who report unsafe conditions.The announcements follow a Reuters special report earlier this year that found OSHA has so far largely failed to hold employers accountable for unsafe conditions during the pandemic. The story identified dozens of workplaces where employees complained of slipshod pandemic safety around the time of outbreaks - and regulators never inspected the facilities or, in some cases, took months to do so. Click for story reut.rs/3jC2hQfIn one example, workers at a United Parcel Service Inc facility complained twice last spring to Arizonas OSHA agency about unsafe conditions and workers contracting COVID-19. Arizona OSHA officials never inspected the facility, despite a well-publicized outbreak among dozens of workers, including a manager who died from COVID-19.UPS expressed regret about the managers COVID-19 death but said the illness was not work-related. The company said it has strengthened protocols requiring social distancing, masks and sanitation since the early days of the pandemic.Reuters also revealed last month that about two-thirds of employers cited by federal OSHA for COVID-19 safety violations had not paid fines, and more than half had appealed the OSHA citations. During the appeals - which can drag on for years - companies dont have to pay fines and arent required to fix problems identified by OSHA inspectors. Click for story reut.rs/30FGgaCAs part of its new effort to target workplaces with the highest COVID-19 risk, OSHA officials said inspectors will prioritize industries including healthcare, meat packing, grocery stores, restaurants and prisons, where workers are frequently in close contact with others.The agency said it will also use data it has collected on reported COVID-19 fatalities and illnesses to plan unannounced inspections and follow-up visits to workplaces with a history of infections.FOCUS ON WORKERSJames Frederick, acting head of OSHA, said the aim is to truly focus on workers with the biggest need for assistance. OSHA has limited resources, and we want to utilize them the best we can.Frederick, an appointee of President Joe Biden, did not criticize the prior administrations worker safety efforts, but said OSHA now has enough experience and data to pinpoint where workers face the highest risk.He said the agency is planning to do 1,600 inspections over the next year as part of the new program, some of which will be reviews of prior OSHA COVID-19 investigations.A report last month from the Labor Departments Office of Inspector General found that most of OSHAs COVID-19 inspections last year were done remotely, which meant there is an increased risk that OSHA has not been providing the level of protection that workers need at various job sites.OSHA received 15% more complaints between February and October last year, compared to the same period in 2019, yet the agency conducted 50% fewer inspections, most of which were done virtually, the report found.OSHA said on Friday it would now prioritize on-site inspections, and only conduct virtual inspections if site visits cannot be performed safely.OSHAs new enforcement initiative applies to about half of states where the federal agency enforces workplace safety; the agency is encouraging state OSHA agencies in the remainder of the country to adopt a similar approach.OSHA has still not announced whether it will set an emergency standard that could require masks and social distancing at workplaces, a move supported by worker advocates but resisted by the former administration of President Donald Trump. President Joe Biden issued an executive order in January directing OSHA to study whether such a standard is needed, and if so, issue it by March 15.Frederick, the acting OSHA head, said Friday the agency is still reviewing the matter, but declined to say what OSHA plans to do."}