{"text": "NEW DELHI/MUMBAI India is confident of getting included in a global bond index by October but it will not be able to raise funds in the coming financial year as the actual listing could take around 12 months after its inclusion, said two senior sources aware of the discussions.Since 2019, India has been working towards getting included in global bond indexes as rising government borrowing has necessitated opening the largely domestic bond market to a broader investor base.India was hopeful of completing the listing in the upcoming financial year, starting on April 1, as it would help bring down borrowing costs, which have been rising in recent weeks due to a lack of appetite amid high supply, one of the sources said.The government plans to issue bonds worth $165.24 billion to fund its spending programme in the upcoming fiscal year to revive the pandemic-hit economy from a slump.The indices will be reviewed in September. We have dealt with most of their concerns, we should be able to resolve the other issues too, said one of the sources, referring to an index provider.We expect to be included in at least one of the two major indexes in September or October, he said.However, he said the actual listing could take longer and would not be concluded before the end of the fiscal year.The finance ministry and the central bank, the Reserve Bank of India, did not immediately respond to requests for comment.Last September, J.P. Morgan opted not to include Indias government bonds in one of its flagship emerging market indexes after investors cited problems with capital controls, custody and settlement and other operational snags.Two other senior officials said India was in the final stages of negotiating with Euroclear for settlement of Indian bonds and that could likely be a precursor for a bond listing as it would allay most investor concerns.OPEN UP MOREIndia expects to get approval from major index operators like J.P. Morgan and Bloomberg Barclays in September as it is planning to move fast on resolving taxation concerns of investors in these passive funds and bond settlement issues by August, the first source said.J.P. Morgan and Bloomberg declined to comment.Several bonds are now part of the Fully Accessible Route (FAR) and as of January, the outstanding FAR bonds were over $145 billion. The government sets a limit on foreign institutional investors government securities purchases, but the FAR category introduced in 2020 is free from such limits.We have already opened investments through the fully accessible route and securities across the curve are available from five to 30 years. We will definitely open up more securities on a need basis, a second source said requesting anonymity.There have been concerns about outflows if the bond market is fully opened to foreign investors and what is largely thought of as hot money flows that flood in to chase high yields but can exit just as quickly during times of distress.Over the last couple of years, however, there has been a shift in the attitude of regulators and the government towards the global bond indexes, which largely have passive fund houses among their investor base, which are known to be longer-term investors.The government is expecting to be given a 3-4% weightage initially for the first 2-3 years after listing, which is expected to be raised gradually to 10% over five years, the first official said.India has one of the largest bond markets among emerging-market economies with more than $800 billion in debt stock. Long-held restrictions on foreign buying of its bonds have kept it out of the top benchmarks used by global money managers and an inclusion could be a landmark change."}