{"text": "WASHINGTON/NEW YORK/MEXICO CITY The United States is investigating a Venezuelan shipping magnate for possibly violating U.S. sanctions by bringing fuel to gasoline-short Venezuela, according to two senior Trump administration officials.The probe focuses on a cargo that Wilmer Ruperti, a former tanker captain who is now a wealthy businessman, sent in April from Trinidad and Tobago, the officials told Reuters.Ruperti, 60, has been close to Venezuelas ruling Socialists since the 1999-2013 rule of Hugo Chavez, winning lucrative contracts with state oil company PDVSA. He has maintained that relationship under President Nicolas Maduro, according to people familiar with the matter.Neither Ruperti nor representatives for him or his Swiss-registered companies Maroil Trading and ES Euro Shipping responded to requests for comment from Reuters via email, post and LinkedIn.Venezuelas government and PDVSA did not respond to requests for comment.Ruperti is best-known in Venezuela for chartering ships in 2002-2003 to import gasoline and help break a strike at PDVSA, earning a medal from a grateful Chavez.The tanker carrying the April shipment of about 150,000 barrels had signaled Aruba as its destination but stopped transmitting its location before discharging at Venezuelas El Palito terminal, according to Refinitiv Eikon data and people with knowledge of the matter.President Donald Trumps envoy on Venezuela, Elliott Abrams, said the Treasury Department, which oversees sanctions policy, would determine the course of the investigation.I believe that people who enforce U.S. sanctions are looking at his activities, he said in a May 29 interview.Mr. Ruperti has acknowledged what he is doing, Abrams added, without elaborating.Ruperti told the Associated Press in April that he had sent 300,000 barrels of gasoline to Venezuela that month and intended to ship a further million. He was quoted as describing the deal as humanitarian work and said his lawyers had informed the Treasury Department in March, without receiving objections.U.S. officials have said there were exceptions under the sanctions for humanitarian goods such as food, medicine and even in some cases fuel but such shipments require explicit U.S. authorization.Abrams said he was unaware of any U.S. approval for Rupertis activities. A second senior Trump administration official, speaking on condition of anonymity, confirmed Ruperti was being investigated and also said no waiver had been given.The official called Rupertis transactions definitely sanctionable though provided no timeline for potential action: Were always going to build the best case possible.The Treasury Department, whose Office of Foreign Assets Control (OFAC) handles sanctions enforcement, did not confirm it was investigating Ruperti. It said it receives many disclosures and inquiries each week through official channels about whether activities by individuals or entities are in compliance.Those submitting such requests should not conclude their activity is permissible or otherwise not sanctionable under OFACs authorities without receiving formal confirmation from OFAC, a Treasury spokesman said.TRUMP FRUSTRATEDSome U.S. officials say privately that Trump is frustrated by his failure to unseat Maduro, whom he derides as a corrupt dictator. Washington has sought in recent months to crack down on sanctions-busting, but Maduro retains the support of his military as well as Russia, China, Cuba and Iran.Washington says its stringent sanctions are meant to oust Maduro, but his government calls it illegal persecution that heaps suffering on the Venezuelan people.The United States, and most western nations, say Maduro rigged his 2018 re-election and instead recognize opposition leader Juan Guaido as rightful leader. Maduro says Washington wants to gain control of the OPEC nations vast oil reserves.The roughly 150,000-barrel shipment at the center of the U.S. probe left Trinidads Pointe-a-Pierre port aboard the Liberia-flagged Aldan tanker on April 20, signaling Aruba as its destination, according to Eikon data.But on April 22, its transponder stopped transmitting a location, the data showed. According to three sources, the ship then went to Venezuelas El Palito oil terminal for unloading.Eurotankers Inc, the Aldans Greece-based manager, did not immediately respond to a request for comment. A representative of the Trinidadian state-owned oil company Paria Fuel Trading also did not respond to questions from Reuters.Neither Ruperti nor his company Maroil have publicly confirmed details of the transaction. But a March invoice seen by Reuters showed a request by Maroil to PDVSA for a 12 million euro ($13.7 million) advance payment before delivery of a fuel supply. Reuters could not confirm if the payment was completed.After delivering the gasoline, Maroil also received a 270,000-barrel cargo of fuel oil from PDVSA on the tanker Confidence P in May, according to internal PDVSA documents. That suggests the gasoline deal could have included a swap element, though Reuters was unable to verify that.U.S. authorities consider some of these kinds of exchanges to be sanctions-evading practices, the senior official said. Some of PDVSAs foreign partners have avoided cash transactions with the company because of Washingtons ban on its use of the U.S. financial system, and have instead turned to barter trade.Venezuela is producing crude and fuel oil in excess but it faces a severe gasoline shortage, with long lines at gasoline stations.With its 1.3 million barrel-per-day refining network all but collapsed, Maduro last month imported fuel from U.S. adversary Iran, also under sanctions.Since Trump took office in 2017, his administration has imposed sanctions on Maduro and dozens of his allies. If Ruperti is added to the blacklist, any U.S. assets he possesses would be frozen and Americans would be prohibited from doing business with him.U.S. public records searches show Ruperti has had residences listed in the Miami area, including Doral, an affluent town with a large community of Venezuelan emigres. Reuters was unable to independently verify whether he continues to hold property in the United States.Rupertis ties with Maduros administration remain close, according to people familiar with the matter.He helped pay the legal defense for two nephews of Maduros wife, first lady Cilia Flores, in a New York drug trafficking trial in which both were convicted in late 2016, one of the sources said, confirming news reports at the time."}