{"text": "WASHINGTON/SAN FRANCISCO Top U.S. cybersecurity official Christopher Krebs, who worked on protecting the election from hackers but drew the ire of the Trump White House over efforts to debunk disinformation, has told associates he expects to be fired, three sources familiar with the matter told Reuters.Krebs, who heads the Department of Homeland Securitys Cybersecurity and Infrastructure Security Agency (CISA), did not return messages seeking comment. CISA and the White House declined comment.Separately, Bryan Ware, assistant director for cybersecurity at CISA, confirmed to Reuters that he had handed in his resignation on Thursday. Ware did not provide details, but a U.S. official familiar with his matter said the White House asked for Wares resignation earlier this week.The departure is part of the churn in the administration since Republican President Donald Trump was defeated by Democrat Joe Biden in last weeks election, raising concerns about the transition to the president-elect who would take office on Jan. 20. Trump, who has yet to concede and has repeatedly made unsubstantiated claims of electoral fraud, fired Defense Secretary Mark Esper and has installed loyalists in top positions at the Pentagon.Krebs has drawn praise from both Democrats and Republicans for his handling of the election, which generally ran smoothly despite persistent fears that foreign hackers might try to undermine the vote.But he drew the ire of the Trump White House over a website run by CISA dubbed Rumor Control which debunks misinformation about the election, according to the three people familiar with the matter.White House officials have asked for content to be edited or removed which pushed back against numerous false claims about the election, including that Democrats are behind a mass election fraud scheme. CISA officials have chosen not to delete accurate information.In particular, one person said, the White House was angry about a CISA post rejecting a conspiracy theory that falsely claims an intelligence agency supercomputer and program, purportedly named Hammer and Scorecard, could have flipped votes nationally. No such system exists, according to Krebs, election security experts and former U.S. officials.On Twitter, U.S. Senator Mark Warner, a Democrat, wrote: Chris Krebs has done a great job protecting our elections. He is one of the few people in this Administration respected by everyone on both sides of the aisle. There is no possible justification to remove him from office. None.Krebs has steadily shot down rumors of fraud in recent days, including retweeting leading election security expert Matt Blaze, who for years has warned of specific vulnerabilities in election gear, when the professor wrote that no serious evidence has yet been found or presented that suggests that the 2020 election outcome in any state has been altered through technical exploitation.Gregory Crabb, chief information security officer for the U.S. Postal Service, which was also under pressure over misinformation about mail-in ballots, said: From my view on the election frontlines, Krebs was a great partner and deserves accolades for his work."}