{"text": "MILAN Europes medicines regulator is planning to speed up assessments of any COVID-19 vaccines that are modified to protect against variants of the virus, the head of the agencys COVID-19 task-force told Reuters on Friday.Marco Cavaleri, chair of the vaccine evaluation team at the European Medicines Agency (EMA), said there should be no need for lengthy large-scale trials like those needed to evaluate the first COVID-19 vaccines, since tweaks for new variants can be tested on smaller groups.We are working on updated guidelines, assuming that we cannot ask for large Phase III trials. This will allow us to go faster, said Cavaleri.We will ask for much smaller trials, with a few hundred participants, rather than 30,000 to 40,000, he told Reuters. He said the EMA would focus primarily on immune response data.Drugmakers including Pfizer, Moderna and AstraZeneca have been testing their COVID-19 vaccines against several fast-spreading, more infectious variants of the novel coronavirus.Variants which emerged in Brazil (known as P.1.), Britain (known as 20I/501Y.V1 or B.1.1.7) and South Africa (known as 20I/501Y.V2 or B.1.351) have already spread around the world, piling more pressure on governments struggling to tame the pandemic which has killed almost 2.5 million people.These are the three major variants that are worrying scientists, with their spread raising the risk that newly-developed COVID-19 vaccines will need to be updated or tweaked to be effective against some variants, and that people may require one or more booster shots.STREAMLININGLast week, the U.S. Food and Drug Administration also said it is considering a rapid review process for the quick turnaround of new COVID-19 booster shots if variants emerge against which the vaccines do not provide protection.Vaccine makers Pfizer and BioNTech, as well as AstraZeneca and Moderna, whose COVID shots have been authorised for emergency use in Europe, have said they are preparing for the possibility that variants will emerge that could require tweaks to their vaccines.Normally, an EMA approval requires extensive studies with large numbers, starting with safety and ending with efficacy.We will also try to streamline regulatory procedures doing something similar to what happens with flu vaccines. In short, without the drugmakers having to submit all the preliminary data again, Cavaleri said.He added that the EMA is also aware that in the near future it may no longer be possible to do clinical trials with placebo for categories such as the elderly, due to rollout of current COVID-19 vaccines.In that case we could think about a head-to-head comparison with an already approved vaccine, he said.Cavaleri also told Reuters Johnson & Johnson will file its vaccine formal application in the next few days.Probably as early as next week, he said, noting that the EMA has been conducting a rolling review of the vaccine for some time. Mid-March is reasonable for the EMA decision, he said.The EMA, he added, has been in contact to date with about 50 pharmaceutical companies working on COVID vaccines.Regarding the Russias Sputnik V vaccine, he said the agency is in constant contact with the company producing it.There is a constructive cooperation. If there are no problems with the answers we receive on the subject of the production phase, the rolling review could start within a matter of weeks, he saidThe EMA is also in contact with the Chinese companies developing vaccines, particularly Sinovac Biotech, but the process for the Chinese vaccine is a few steps behind the Russian one, he said."}