{"text": "U.S. civil rights groups will organize an advertiser boycott against Alphabets YouTube if it does not remove President Donald Trumps channel, the groups told Reuters.Jim Steyer, one of the organizers of the Stop Hate for Profit campaign which led over 1,000 advertisers to boycott Facebook in July, said the groups are demanding YouTube take down Trumps verified YouTube channel, which has 2.76 million subscribers.YouTube said late on Tuesday that the company removed new content uploaded to President Donald Trumps channel as it violated policies for inciting violence, and that it barring the uploading of fresh content for a minimum seven days, though the suspension could be extended.YouTube described its action as a first strike. Under its policy a channel would be banned permanently if it incurs three strikes.Facebook, Twitter and Snap Inc have all blocked Trump after supporters of the president stormed the U.S. Capitol last week, leading to five deaths.Trumps YouTube channel gives him the opportunity to continue spreading false information that the U.S. election was stolen, Steyer said.On Tuesday, Trumps YouTube channel posted eight new videos, including one in which Trump told reporters I think Big Tech has made a terrible mistake by blocking him.The White House did not immediately respond to requests for comment.YouTube has told the groups it is considering the demands but has yet to act, Steyer said.If YouTube does not agree with us and join the other platforms in banning Trump, were going to go to the advertisers, he added.We join in with our coalition partners and ask that YouTube act decisively to help stop the spread of hate by shutting Trumps account down, said the NAACP in a statement to Reuters.The NAACP, Anti-Defamation League and Color of Change along with Steyers group Common Sense Media, are among the organizers of the Stop Hate for Profit campaign, which had recruited major advertisers including Verizon Communications and Unilever to pull their ads from Facebook over hate speech concerns.Despite the widespread boycott, Facebook posted record revenue during its third quarter but agreed to create a role for a head of civil rights."}