{"text": "CARACAS Venezuelas government has negotiated an agreement with Chinese banks for a grace period until the end of the year on some $19 billion in loans that are paid off with oil shipments, according to three sources in Caracas with knowledge of the situation.The government of late socialist leader Hugo Chavez borrowed more than $50 billion from China through the oil-for-loan arrangements, which were mainly underwritten by the state-owned China Development Bank. Chavezs successor, President Nicolas Maduro, stopped making the associated payments as the South American OPEC nations economy unraveled.The grace period was the result of talks that Caracas sought with Beijing earlier this year to seek financial support amid the tumble in oil prices and the coronavirus pandemic, according to the sources, who asked not be identified.This (arrangement) will be in place until at least December, and then they will re-evaluate it, said one of the sources.Venezuelas information ministry and state oil company PDVSA, along with China Development Bank, did not reply to requests for comment.The spokespersons office at Chinas foreign ministry, in a faxed reply to Reuters questions, said: I am not aware of the situation that you are saying. I would like to stress that China and Venezuela have a long history of practical cooperation.Without the grace period, Maduros government would have to make some $3 billion in payments this year - equivalent to a quarter of 2019 crude exports. Local economists estimate Venezuelas 2020 oil export revenue will be around $4 billion.Ecuador last week said it had won a grace period on a credit line with the China Development Bank, allowing it to postpone $417 million in payments for one year.Venezuela since last year has been unable to meet its obligations on the loans, in part due to U.S. sanctions meant to force Maduro from power that create penalties for companies that buy Venezuelan crude.Chinese state oil company CNPC has stopped buying crude directly from PDVSA as a result of the sanctions, according to three other Venezuelan sources with knowledge of the situation.This helps, but it does not alleviate the cash flow problem, said one of the sources.In 2016, Maduro's government negotiated a grace period that allowed it to make interest-only payments on the debt, a deal that lasted for at least a year, according to the sources. reut.rs/3kBCY11, reut.rs/2XTphR7China, which was Venezuelas largest financier during the Chavez era, stopped delivering fresh funds to Venezuela seven years ago.Maduro earlier this year said Venezuela was receiving personal protection equipment and medical advice from China to confront the COVID-19 pandemic, part of a broader Chinese effort to provide assistance in Latin America."}