{"text": "WASHINGTON/CHICAGO Two key U.S. senators are circulating a bipartisan draft bill that would reform how the Federal Aviation Administration certifies new aircraft in the wake of two fatal Boeing 737 MAX crashes that killed 346 people.The draft, which was completed this week and reviewed by Reuters, is authored by Senate Commerce Committee Chairman Roger Wicker, a Republican, and the top Democrat on the panel, Senator Maria Cantwell.The FAA, Wickers office and Boeing declined to comment on the draft bill.It aims to grant the FAA new power over the long-standing practice of delegating some certification tasks to aircraft manufacturer employees. It would give the agency authority to hire or remove Boeing employees conducting FAA certification tasks and allow the FAA to appoint safety advisers.One congressional aide said the bill would put the FAA back in the drivers seat overseeing airplane certification.Boeings best-selling plane has been grounded since March 2019 and the manufacturer faces an ongoing criminal probe and investigation by the Transportation Departments inspector general. The largest U.S. planemaker hopes to conduct a key certification test flight late this month as it works to resume flights.The draft bill would require reforms aimed at preventing undue pressure... or instances of perceived regulatory coziness or other failures to maintain independence between the FAA and Boeing employees conducting certification tasks.It would also require regular audits and authorize $150 million over 10 years for new FAA training and to hire specialized personnel to develop technical standards for new technologies and operations.Congress needs to make sure aviation safety in the United States is the strongest in the world, Cantwell said in a statement to Reuters. Strong technical aviation expertise on the ground cannot simply be ignored by senior management at the FAA.The Senate Commerce Committee is holding a hearing on Wednesday with FAA Administrator Stephen Dickson to review agency oversight of aircraft certification. Aides hope to release a draft of the bill by then.MORE OVERSIGHTAn October report by a panel of international air safety regulators raised significant questions over the certification process, finding the FAA had just 45 people in an office overseeing Boeings Organization Designation Authority and its 1,500 employees.For the 737 MAX, the FAA initially delegated 40% of the certification tasks to Boeing, an amount that increased as the five-year review progressed. The panel said FAA involvement in the certification of Boeings MCAS flight control software, a key safety system faulted in both fatal crashes, would likely have resulted in design changes that would have improved safety.The review also found signs of undue pressure on Boeing employees performing tasks for the FAA and said they should be able to speak without fear of reprisal.The draft legislation would ensure no one could prohibit a Boeing employee from talking to the FAA and grant new whistleblower protections to workers at airplane and parts manufacturers. It would also require the FAA to create a new safety reporting system for employees to detail concerns anonymously.PILOT BEHAVIORThe draft bill also addresses concerns about human factors, saying the FAA must review and potentially modify existing assumptions on how pilots identity and respond to cockpit situations.A federal review concluded Boeing underestimated the effect a malfunction of new automated software in the aircraft could have on pilots, who were dealing with a cacophony of alerts in both 737 MAX crashes.When certifying a new aircraft type, the FAA must address the cumulative impact new technologies may have on pilot response, consult outside experts and notify other international regulators and encourage them to make evaluations.The draft bill was shared with aviation associations, unions and family members of those killed in the fatal Boeing crashes, seeking their input.Michael Stumo, who lost his daughter, Samya, in the second 737 MAX crash in Ethiopia, praised the draft but called for improvements to ensure the FAA is in charge, especially overseeing major hazardous and catastrophic systems like MCAS."}