{"text": "BRUSSELS A group of 165 companies and industry bodies have called on EU antitrust enforcers to take a tougher line against Google, saying the U.S. tech giant unfairly favours its own services on its web searches.The group includes U.S. and UK companies as well as peers in 21 EU countries. It sent a joint letter to EU antitrust chief Margrethe Vestager on Thursday, saying Google was giving its own services, such as those for accommodation, travel and jobs, preferential placement in its search results and urging swift action to stop the practice.Google, a unit of Alphabet, has refuted assertions that it unfairly favours its own services. It says that its users are not locked in and that competition to its services is just one click away on the internet.People expect Google to give them the most relevant, high quality search results that they can trust, a Google representative said.They do not expect us to preference specific companies or commercial rivals over others, or to stop launching helpful services which create more choice and competition for Europeans.Vestager has levied fines totalling 8.25 billion euros ($9.7 billion) against Google in the past three years for abusing its market power to favour its shopping comparison service, its Android mobile operating system and its advertising business.The 165-strong group - which says it is the largest-ever to write in concert to EU competition chiefs urging action - comprised 135 companies that offer online services plus 30 industry associations.Signatories to the letter, seen by Reuters, included longstanding Google critics Yelp, Expedia, Trivago, Kelkoo, Stepstone and Foundem - whose complaint triggered the EU shopping probe against Google.The European Commission said it had received the letter and would reply in due course. It added that it monitored the market carefully to assess the effectiveness of remedies offered for Google Shopping.UNJUSTIFIED ADVANTAGESWhile we compete amongst ourselves for the best consumer experience, there is one common competitor that does not compete fairly - Google, the letter said.Google gained unjustified advantages through preferentially treating its own services within its general search results pages by displaying various forms of grouped specialised search results (so-called OneBoxes), it added.OneBoxes outline information and images in boxes placed near the top of search results and are often ways for local businesses to get more visibility.For example, a search for local jobs might throw up a box offering Googles job-search service, or a results for a flight query might have a box offering Googles flights-search service.With this exclusive use of OneBoxes, Google artificially keeps users within its own service and prevents them from visiting competing, more relevant services, the letter said.The group said the Digital Markets Act - new EU tech rules in the pipeline that would prevent dominant online platforms from favouring their own services - would take too long to come into effect. They urged Vestager to act swiftly to ensure Google gave its rivals equal treatment in search results.Many of us may not have the strength and resources to wait until such regulation really takes effect, they said.Vestager is due to announce a draft law on Dec. 2, which will need input from EU countries and the European Parliament before it can become legislation in a process that could a year or more. It is unclear how the new rules would affect Googles presentation of its search results.($1 = 0.8514 euros)"}