{"text": "Contentful, a website platform whose customers include Spotify (SPOT.N), WeWork and the British Museum, is exploring options including a U.S. initial public offering that could value it at close to $5 billion, people familiar with the matter said on Wednesday.The Berlin-based company, which plans to go public by the end of 2021, is close to hiring financial advisers to inform on the best route to the stock market, which could also involve a merger with a so-called blank-check firm or special-purpose acquisition company (SPAC), the sources said.The sources, who requested anonymity as the discussions are confidential, cautioned that Contentful's plans might change and there was no certainty that a deal would materialize.Contentful declined to comment.Contentful is among a new generation of fast-growing, venture-backed European startups that are seeking to capitalize on a red-hot IPO market.A wave of European companies including Swedish fintech company Klarna, Leonardo DiCaprio-backed MindMaze, Swiss gambling data company Sportradar AG and Roger Federer-backed shoe firm ON Running are preparing to go public in the United States through either a SPAC deal or a traditional listing.SPACs are shell companies that raise funds in an initial public offering with the aim of merging with a private company, which becomes public as result, providing an alternative to traditional IPOs.Founded in 2012 by European tech entrepreneurs Sascha Konietzke and Paolo Negri, Contentful operates a content management system, which is used by large global companies. According to Contentful, about 28% of Fortune 500 companies currently use the platform to manage their content.In 2019, Contentful hired San Francisco-based Steve Sloan, a former Microsoft Corp (MSFT.O) and Amazon.com Inc (AMZN.O) executive, as chief executive.Last June, Contentful raised $80 million from investors led by Sapphire Ventures, General Catalyst, Salesforce Ventures and others, valuing it at nearly $1 billion. Other prominent  investors include San Francisco-based venture capital firm Benchmark and European VC Balderton Capital."}