{"text": "FRANKFURT French music distributor Believe is preparing a 2021 stock market flotation that could value it at around 2 billion euros ($2.4 billion) as its owners seek to benefit from high valuations for tech companies, people close to the matter said.The company is working with Rothschild on the potential listing, which could take place in Paris or New York, one of the people said, adding more banks would be brought in later and that the timing and possible valuation were fluid.Believe and its founders were not available for comment, while Rothschild had no immediate comment.Paris-based Believe, also known as Believe Digital, Believe Music and Believe Distribution Services, helps connect artists with their audiences, distributing their music and videos digitally to online streaming and download services.It supplies platforms such as Spotify, Deezer, Apple Music, YouTube, Amazon Music and Napster, and counts labels such as World Circuit, TruThoughts, Soundway and Brownswood Recordings as its clients. Believe features artists including Gaven James, Novo Amor and Parov Stelar on its website.An initial public offering would allow the fast-growing, profitable company to raise funds to accelerate its expansion plans, one of the people said.Digitalisation upended the music industry at the break of the century, when file sharing led to a crash in CD sales. Streaming and its recurring revenues saved the industry and intermediaries like Believe now help to connect musicians and labels with the big digital platforms.In 2015, investors Technology Crossover Ventures (TCV), XAnge, GPBullhound Sidecar and Ventech took stakes in Believe in a $60 million financing round.According to 2017 media reports, Sony Music Entertainment was at the time in talks to buy the company. But no deal materialised.French newspaper Les Echos reported last year that Believe was expected to post 700 million euros in 2019 revenues. The company has not published sales or profit figures.($1 = 0.8463 euros)"}