{"text": "CHICAGO AstraZeneca Plc is preparing to file for U.S. emergency use authorization (EUA) for its COVID-19 vaccine later this month or early April after accumulating enough data to judge the inoculations efficacy, sources with knowledge of the ongoing clinical trial told Reuters on Friday.The British drugmaker completed enrollment in its trial of more than 32,000 volunteers in January and now has data on at least 150 cases of COVID-19, two sources familiar with the trial told Reuters.The number of COVID-19 cases among those who got the vaccine versus infections in participants who received a placebo will show how effective the AstraZeneca shot was at preventing illness in those age 18 and over.The AstraZeneca vaccine, developed in collaboration with Oxford University, has been authorized for use in theEuropean Union and many countries but not yet by U.S. regulators.The U.S. Phase III study results are necessary for the FDAs evaluation of an EUA request for our vaccine, a company spokeswoman said, without confirming trial details being reported by Reuters. We expect data from our U.S. Phase III trial to be available soon, in the coming weeks, and we plan to file for emergency use authorization shortly thereafter.Highly anticipated results from the U.S. trial could help settle safety concerns arising over reports of serious blood clots in some vaccine recipients that have led several nations to pause administering the vaccine.A World Health Organization expert advisory committee islooking into the matter.The data could also help determine what becomes of doses already sitting in U.S. warehouses awaiting approval. The New York Times reported on Thursday that some countries have been asking to procure doses of the vaccine not currently being offered in the United States.AstraZeneca said in February it expects its vaccine could receive U.S. emergency use authorization at the beginning of April and could immediately deliver 30 million doses to locations around the United States.In a Friday press briefing, White House Coronavirus Response Coordinator Jeff Zients said the United States has a small inventory of the AstraZeneca vaccine, which it plans to keep and deploy to Americans should an EUA be granted.The U.S. stance could thwart AstraZenecas efforts to come closer to delivering on its contractual obligation with the EU of 180 million doses in the second quarter.AstraZeneca told the EU earlier this year it would cut its supplies in the second quarter by at least half to less than 90 million doses, EU sources told Reuters, after a bigger reduction in the first three months of the year."}