{"text": "TOKYO Myanmars first satellite is being held on board the International Space Station following the Myanmar coup, while Japans space agency and a Japanese university decide what to do with it, two Japanese university officials said.The $15 million satellite was built by Japans Hokkaido University in a joint project with Myanmars government-funded Myanmar Aerospace Engineering University (MAEU). It is the first of a set of two 50 kg microsatellites equipped with cameras designed to monitor agriculture and fisheries.Human rights activists and some officials in Japan worry that those cameras could be used for military purposes by the junta that seized power in Myanmar on Feb. 1.That has put the deployment on hold, as Hokkaido University holds discussions with the Japan Aerospace Exploration Agency (JAXA), the two Hokkaido University officials said.We wont get involved in anything that has to do with the military. The satellite was not designed for that, one of the officials, a manager of the project, told Reuters, asking not to be identified.We are discussing what to do, but we dont know when it will be deployed. If it is halted, our hope is that the project could be restarted at some point.The manager did not say when the satellite was meant to be deployed, or when a decision would have to be taken by JAXA either to go ahead or delay it.The second Hokkaido University official said the contract with MAEU did not specify that the satellite cannot be used for military purposes. However, data from the spacecraft would be collected by the Japanese university and cannot be independently accessed by Myanmar officials, the second official said.Since the coup, university officials had been unable to contact the rector of MAEU, Prof Kyi Thwin, the second official added.Officials at JAXA could not be reached for comment. MAEU did not respond to calls seeking comment, nor did a spokesman for Myanmars junta.The satellite was launched by NASA on Feb 20 as a small part of a large and varied payload of supplies to the International Space Station 400 km (250 miles) above the earth. It has since been kept by JAXA inside Japans Kibo experiment module. JAXA astronaut Soichi Noguchi is one of the seven crew members now on board the space station.Japan has close ties to Myanmar and is one of its biggest aid donors. While condemning the violence, it has not taken as hard a stance against the coup as the United States and some other Western countries which have applied sanctions.While the spacecraft has not been built to military specifications, Teppei Kasai, Asia programme officer for Human Rights Watch, said it would be easy for Myanmars army rulers to appropriate the technology for military use.So the involved Japanese universities should suspend the project and urgently review it for potential human rights risks, Kasai said."}