{"text": "Indias retail inflation remained above 7% in October for a second straight month as vegetable prices stayed at elevated levels, worrying policymakers, who are struggling to pull Asias third largest economy from a deep slump.Octobers annual retail inflation of 7.61% was higher than the forecast of 7.30% in a Reuters poll of economists. It stood at 7.27% in September, government data showed on Thursday.COMMENTARYJOSEPH THOMAS, HEAD OF RESEARCH, EMKAY WEALTH MANAGEMENT, MUMBAIFood prices do not seem to be moderating contrary to earlier expectations, and from just fruits and vegetables the price surge has moved to all the major food components as well.This may have an impact on the trajectory of interest rates, and RBI may have to continue to focus on liquidity provision rather than rate action.It is also a fact that the economy is going through unprecedented economic developments and therefore one may expect a relatively higher price level. But persistently high inflation could invite action from the RBI by way of even reducing the free liquidity.ADITI NAYAR, PRINCIPAL ECONOMIST, ICRA, GURUGRAMDespite the favourable base effect and the abundant kharif harvest, food inflation increased further in October 2020, led by vegetables as well as various other items. However, fresh arrivals in the market may help to cool off prices in the near term.Worryingly, the core inflation also rose to 5.7% in October 2020 from 5.5% in September 2020, led by a number of items such as clothing and footwear, housing, health, recreation and amusement.While a base effect and some softening in vegetable prices may pull down the CPI inflation in the ongoing month, it is expected to recede below 6% only in December 2020.KUNAL KUNDU, INDIA ECONOMIST, SOCIETE GENERALE, BENGALURUIndias October CPI printed way above expectations, driven majorly by food prices which rose by 11.1% yoy. Vegetable price unsurprisingly was the villain of the piece.While core inflation too inched up from 5.7% to 5.8%, the two basic drivers were continued elevated levels of transportation prices due to major supply side disruption, and high cost of personal care services owing to strict social distancing requirements and high sanitization costs.We expect a rate cut only during Q2 2021. RBI cant touch rates now given the level of inflation.VIVEK KUMAR, ECONOMIST, QUANTECO RESEARCH, MUMBAICPI inflation of 7.61% in October 2020 trumped market expectations of 7.3%. The October print continues to underscore the persistence of elevated food inflation in case of vegetables and protein-rich items such as meat, fish, eggs, and pulses.Meanwhile, core inflation continues to remain between 5.7% and 5.8%, and has displayed remarkable stickiness in the last four months.SAKSHI GUPTA, SENIOR ECONOMIST, HDFC BANK, GURUGRAMCPI inflation spiked to 7.6% in line with our forecast. Food continues to play spoilsport.Going forward, we expect inflation to moderate somewhat December onwards. We do not expect the RBI to cut rates in December. However, we continue to see a window of opportunity for some rate action in H1 2021 before the RBI adopts a prolonged pause.RADHIKA RAO, ECONOMIST, DBS BANK, SINGAPOREOctober inflation is close to our estimate and above consensus, on seasonal supply-side drivers fuelling the food component. This comes on the back of broad-based rise led by perishables and protein products.These are magnified by pandemic-related pressures as well as price cum tax rigidity in commodities, generalising it to other components.SREEJITH BALASUBRAMANIAN, ECONOMIST - FUND MANAGEMENT, IDFC AMC, MUMBAIOctober CPI of 7.6% was above our estimate of 7.3%, owing to even-higher generalised food price sequential momentum. Price pressures have been high not just in perishables, but also in pulses and other protein-based items such as egg, meat and fish.However, inflationary pressures continue to be dominated by supply-side factors and the RBI has been very clear that monetary policy will stay accommodative into FY22, although in its latest monthly bulletin it highlighted generalisation of price pressures and unanchoring of inflation expectations as a risk to recovery.ANAGHA DEODHAR, ECONOMIST, ICICI SECURITIES, MUMBAIHigh food inflation despite easing restrictions and improving mobility numbers indicate the problem is more complex and likely to persist in the near future.Moreover, transport costs and personal care expenses continued to be high as COVID-19 has increased transaction costs. We expect inflation to remain high in the near future and decreased chances of a rate cut."}