{"text": "Indias annual retail inflation picked up in September to 7.34% from a year ago as food prices surged ahead of the festival season, government data showed on Monday.Analysts in a Reuters poll had forecast that retail inflation would rise to 6.88% in September, compared to 6.69% in the previous month.COMMENTARYRAHUL GUPTA, HEAD OF RESEARCH-CURRENCY, EMKAY GLOBAL FINANCIAL SERVICES, MUMBAIUnless the inflation falls below the higher band of 6%, we dont expect RBI to cut rates despite central bank governor Das stating RBI will look through inflation.But eventually as the supply shocks dissipate as the economy continues to unlock, we may see inflation falling back to the tolerance band of 2%-4%. The central bank expects CPI to fall in the 2%-6% target in the second half of FY21, so we cannot rule out any rate cut this fiscal year.ANAGHA DEODHAR, ECONOMIST, ICICI SECURITIES, MUMBAIInflation remains stubbornly high, touching a 8-month high now. Sharp rise in prices when people are losing jobs and the overall demand deficiency is indicative of the fact that COVID-19 has damaged our supply chains severely.The internals show that perishable items such as meat, fish, eggs and vegetables have continued driving the inflation up. Core inflation is also sticky at elevated levels, making the uptrend more worrying.With this number, Q2 inflation has overshot RBIs forecasts. I dont see any sign of inflation abating in the near future. Theres definitely going to be pressure on bond yields in the coming days.I think its safe to say that we have exhausted the room for rate cuts.RUPA REGE NITSURE, GROUP CHIEF ECONOMIST, L&T FINANCIAL HOLDINGS, MUMBAIThe latest growth inflation dynamics doesnt project a healthy picture. Elevated food inflation primarily on account of a surge in vegetable prices in September has raised CPI print to an ugly level of 7.34%.Luckily, core inflation has eased from 5.8% to 5.7%. At the same time industrial production continued to shrink at a more or less similar pace.The recent uptick in high frequency indicators will get reflected in IIP from the next month, while CPI inflation will start easing from November on account of seasonality and favourable base effect.SUJAN HAJRA, CHIEF ECONOMIST, ANAND RATHI SECURITIES, MUMBAIThe numbers were slightly above expectations mainly due to higher fuel, gold and personal care prices. I still think inflation will come down significantly to close to 5% by December.The long-term trajectory is still towards decline even though it wont reach RBIs comfort zone soon. It still doesnt change the trend or RBIs policy perspective and I expect a rate cut in this cycle either in the next or the forthcoming policy meeting.MADAN SABNAVIS, CHIEF ECONOMIST, CARE RATINGS, MUMBAIFood inflation continues to be intransigent and has spread beyond horticulture and pulses to eggs, meat, spices, etc. The miscellaneous category has registered higher increase of 6.9%, with personal care going up by 12.3%.Quite clearly there seems to be less control on food inflation and the supply shocks are having a pernicious impact on overall inflation. The late withdrawal of monsoon can have an impact on vegetable prices for one more month as it has been observed in October already.Under these conditions it would be hard to take a rate cut call in the next policy too as the October number would also tend to be above the 6% mark.KUNAL KUNDU, INDIA ECONOMIST, SOCIETE GENERALE, BENGALURUIndias September CPI shot up on-year to reach 7.3%, way more than the market and our expectations. Food prices, which account for nearly 40% of the CPI basket, rose by nearly 11%, putting paid to hopes of earlier easing.Expectedly, food prices have been driven by protein and vegetable prices, while supply-side disruption continues to keep transportation costs elevated. This data, unless revised down subsequently would mean policy cut by the RBI may now be quite far off even as the economy continues to struggle.Proclaiming a clear stagflationary situation, IIP for August contracted by 8% on-year, slightly lower than market expectations of -7.8%.SAKSHI GUPTA, SENIOR ECONOMIST, HDFC BANK, GURUGRAMInflation print surprised on the upside in September on the back of rising food inflation, as supply disruptions continued to linger on. It was not just a vegetable-led spike but protein items also surged in the month, which is worrying.In the core basket, demand-led items showed some moderation, but gold and car fuel prices continued to put upward pressure on the core print.The space for further rate cuts in FY21 now seems to be closing, even perhaps for the February meeting. The RBI is likely to keep its stance accommodative, despite these inflation spikes, and focus on managing the yield curve and liquidity going ahead.GARIMA KAPOOR, ECONOMIST-INSTITUTIONAL EQUITIES, ELARA CAPITAL, MUMBAIThe CPI inflation for September significantly surprised on the upside amid a sharp surge in food inflation that may have been driven by heavy monsoon in some parts of the country and localised lockdowns in few states that disrupted the supply chains.We expect inflation prints to start easing from October-November on account of seasonality amid robust Kharif arrivals, and CPI inflation to average ~5.7%, shrinking the window available to MPC to cut rates this fiscal year. Our call of 25 bps rate cut during January-March FY21 looks less probable now."}