{"text": "WASHINGTON The U.S. House of Representatives is expected to impeach President Donald Trump as soon as Wednesday, accusing him of inciting insurrection ahead of last weeks storming of the Capitol.The following is a primer on what a second impeachment proceeding of Trump would look like and how lawmakers could block Trump from running for president in 2024.How does impeachment work?A misconception about impeachment is that it refers to the removal of a president from office. In fact, impeachment refers only to the House of Representatives, the lower chamber of Congress, bringing charges that a president engaged in high crimes or misdemeanors.If a simple majority of the Houses 435 members approves bringing charges, known as articles of impeachment, the process moves to the Senate, the upper chamber, which holds a trial. The Constitution requires a two-thirds vote of the Senate to convict and remove a president.House Democrats have accused Trump of inciting the lawless action that took place at the Capitol on Jan. 6. Trump on Tuesday told reporters that his speech to protesters before the Capitol was stormed was totally appropriate.When will the Senate hold a trial?The top Senate Republican, Mitch McConnell, has said that because the Senate is in recess, the earliest a trial could begin is Jan. 20, the day of Bidens inauguration ceremony. To start sooner, all 100 senators would need to vote in favor of doing so.Senate Democratic Leader Chuck Schumer is exploring using emergency authority to reconvene the Senate before then, a senior Democratic aide said on Monday. Such a move would require McConnells approval.Impeachment experts said the Senate is free to set its own rules and could hold a trial in a single day if it wanted to.Why have an impeachment trial if Trump is already gone?Impeachment could be used to remove Trump from office and to disqualify him from holding political office in the future.Two historical precedents, both involving federal judges, make clear that the Senate could also vote to disqualify the president from holding office in the future, with only a simple majority needed.Paul Campos, a professor of constitutional law at the University of Colorado, said that even if the Senate does not convict the president, senators could hold a second, separate vote to prevent him from future office.That would mean Democrats, who will take control of the Senate later in January, could bar Trump from running for president in 2024 even without the support of Republican senators.Trump could, however, try to challenge such a determination in court, Campos said. The Supreme Court in 1992 said it would not second-guess the Senates decisions about how to handle impeachment proceedings.The Senate has great latitude in deciding how it wants to conduct a trial, Campos said.Other legal experts, however, said the Senate could only prevent Trump from holding office if it first votes to convict him in the impeachment trial.Lawmakers could also declare that Trump engaged in insurrection or rebellion under the 14th Amendment to prevent him from running again. This would require a majority in both the House of Representatives and the Senate.Two-thirds of each chamber can subsequently vote to lift the ban.Has a U.S. president ever been impeached twice?No, but legal experts said it is clearly constitutional for Congress to do so.Trump was impeached by the Democratic-led House in December 2019 on charges of abuse of power and obstruction of Congress over his dealings with Ukraine about political rival Joe Biden, now the president-elect. Trump was acquitted by the Republican-led Senate in February 2020."}