{"text": "North American cannabis companies rocketed in value in recent days - before plunging on Thursday  read more  - as the Reddit forums behind a month of frenzied stock market trading stoked interest in a sector booming on the back of expectations of decriminalization. However, the investment case for the sector's biggest players, nicknamed Gang Weed by Reddit's WallStreetBets community, differs substantially from that of GameStop Corp (GME.N) - or \"Gamestonk\" as it was dubbed by many online - and from other retailers involved in the past month's surges. WHY CANNABIS?Pot stocks have been rising for months, fueled by state moves toward decriminalization across the United States and, since November, expectations that President Joe Biden will seek to relax federal prohibitions on marijuana. With Democrats also taking of control of the Senate, Majority Leader Chuck Schumer promised last week to make the issue a priority.Federal decriminalization would allow interstate movement of cannabis products, making it possible for companies to begin operating in a similar fashion to the alcohol industry.At the same time, banks and other financial institutions, previously restrained by the federal prohibition, will be able to work with cannabis companies, giving the industry access to much-needed financing.However, experts caution against over-enthusiasm and say actual changes could require full legalization.CANADA-CENTRICFor now, no U.S. marijuana producer has been allowed to list on a U.S. exchange and U.S.-based investment and mutual funds have largely avoided investing in Canadian-listed producers. As a result, in contrast to GameStop, much of whose stock was held by major U.S. financial institutions, the companies driven higher in the past week tend to be owned by a much more diverse range of small hedge funds, investors and venture capitalists.The biggest investor in Sundial Growers Inc (SNDL.O), for example, is hedge fund Hudson Bay Capital, with a small stake of 1.26%, according to Refinitiv data. No other financial investor holds more than 1% of its shares. This means that the rally to date has likely already been driven by small - or \"retail\" - investors.On Reddit's WallStreetBets thread, Sundial, Tilray Inc (TLRY.O) and Aphria Inc (APHA.TO) were the three most discussed stocks on Wednesday, according to one regular count of the number of mentions. (https://www.reddit.com/user/pdwp90/)SHORT OF SHORTSThe huge rises in shares of GameStop, cinema operator AMC Entertainment Holdings Inc (AMC.N) and Blackberry Ltd (BB.TO)  last month were also the result of a squeeze on hedge funds and other investors who had taken out \"short\" bets on those stocks falling. After months of gains, short interest - the percentage of a company's shares that have been borrowed as part of short trades - in the marijuana companies is an average of just under 14%. Tilray, among the biggest gainers but also engaged in a complicated merger with rival Aphria, has the highest short interest, at just over 23%, according to financial analytics firm S3. That compares with the peak short interest as a percentage of the shares in GameStop on Jan. 4 at 141.86%, according to S3. That means that any squeeze on investors who have bet against the stock will have less impact. "}