{"text": "Before Apple Inc banned Parler from its App Store store on Saturday, the social media site topped the charts as the most popular free app on its App Store in the United States.Interest in the fast-growing app had surged again after Twitter banned President Donald Trump on Friday.After Amazon.com Inc stopped hosting its business, effectively taking the upstart social media service offline, Parler is now fighting for survival.What is Parler?Parler, which was founded in 2018, is a social media network which styles itself as a free speech-driven space. The app has largely attracted U.S. conservatives who disagree with rules around content on social media sites like Facebook Inc and Twitter Inc.Parler has had about 10.8 million installs globally from across the App Store and Google Play, 8.7 million of those from the United States, according to Sensor Tower data. In January, it said it has over 12 million registered users.Trump, who was last week permanently suspended from Twitter as social media platforms cracked down on his accounts, does not have a verified Parler account, but his Team Trump campaign does. Trump allies such as attorney Rudy Guiliani and the presidents son Eric Trump also joined the platform, as did conservative media such as Epoch Times and Breitbart News and prominent Republicans including Senator Ted Cruz.In November, conservative activist Rebekah Mercer confirmed that she and her family, including her father and hedge-fund investor Robert Mercer, have provided funding to the company. Conservative commentator Dan Bongino also said in June he was taking an ownership stake in the company, which is based near Las Vegas in Nevada.Why has Parler been taken offline?The site effectively went dark after Amazon.com Inc suspended its web hosting service and will remain so unless it can find a replacement.Suspensions by Apple Incs App Store and Alphabet Incs Google had already meant potential new users were unable to download the app.The platforms said Parler was not doing enough to prevent the spread of posts inciting violence, following unrest at the U.S. Capitol by Trump supporters last Wednesday after weeks of violent rhetoric on online sites.Parler is now suing Amazon, accusing the company of an illegal, politically motivated decision to shut it down.Amazon said the lawsuit has no merit. In an email correspondence included in Parlers lawsuit, Amazon cited 98 examples of Parler posts that clearly encourage and incite violence.Parler Chief Executive John Matze has said the company does not condone or accept violence on its platform.Parlers policies ban certain types of content, including fighting words or threats to harm that include threats of violence against an individual or group, obscenity and pornography. The guidelines advise users to not purposefully share rumors about other users/people you know are false, but do not mention other policies against misinformation.Disinformation researchers said far-right groups that appeared at the riot maintained a vigorous online presence on alternative platforms including Parler where they spread violent rhetoric and organized ahead of the unrest."}