{"text": "Fighting that broke out on Sept. 27 over the mountain enclave of Nagorno-Karabakh quickly became the deadliest for more than 25 years in a long-running conflict between Armenia and Azerbaijan.WHERE AND WHAT IS NAGORNO-KARABAKH?Its a mountainous, forested patch of land that sits inside the territory of ex-Soviet Azerbaijan and is recognised under international law as part of that country. But the ethnic Armenians who make up the vast majority of the estimated 150,000 population reject Azeri rule. They have been running their own affairs, with support from Armenia, since Azerbaijans troops were pushed out in a war in the 1990s. A ceasefire was agreed in 1994 but at least 200 people were killed in a violent flare-up in 2016. Nagorno-Karabakh survives almost totally on budget support from Armenia and donations from the worldwide Armenian diaspora.WHY HAS FIGHTING BROKEN OUT NOW?Tensions between the two sides have been building over the summer, and spilled into direct clashes on Sept. 27. The timing is significant because the outside powers that have mediated in the past - namely Russia, France and the United States - are distracted by the COVID-19 pandemic, the upcoming U.S. presidential election and a list of world crises from Lebanon to Belarus. Lower-level clashes in July prompted only a muted international response. Turkey, which held large military exercises with Azerbaijan in July and August, has been even more conspicuous in its support compared with past crises. Turkish President Tayyip Erdogan has said Ankara will stand by Azerbaijan with all its resources and heart.WHAT ARE THE RISKS?Past outbreaks of fighting have killed some 30,000 people since 1988. Military and political analysts say they have witnessed an increase in deployment of heavy weaponry such as rockets and artillery, bringing a higher risk of civilian casualties that would make it harder to pull the two sides back from all-out war. That in turn could draw in other powers such as Turkey and Russia and destabilise the South Caucasus region, an important corridor for pipelines carrying oil and gas.WHAT COULD STOP THE FIGHTING?Russia potentially holds the key: it has a mutual defence pact with Armenia and a military base there, but also enjoys good relations with Azerbaijan and has no interest in the conflict spreading. Moscow brokered a humanitarian ceasefire that went into effect on Saturday though it quickly came under strain. If its diplomacy succeeds, Moscow could earn kudos for ending the fighting at a time when it is under intense criticism on other fronts, including over its backing for Belarus President Alexander Lukashenko after a disputed election and over the poisoning of Russian opposition politician Alexei Navalny in Siberia, which Germany says was carried out with a nerve agent."}