{"text": "LONDON Global banks were left shell-shocked this year by a series of commodity trader collapses after instances of fraud were laid bare by the coronavirus crisis.The $21 billion liquidity hole left by the Dutch bank will be hard to fill, presenting a more uncertain future for smaller commodity traders without a strong presence in a niche market.Trade finance is a term covering many types of loans, typically from banks, that facilitate global movement of goods from wheat to gasoline. The loans reduce risk for counterparties and allow them to juggle multiple transactions.Most trade finance loans are short-term, less than a year.Commodity finance was hit hard by the 2008 financial crisis and subsequent regulation aimed at preventing similar downturns.WHAT ARE THE DIFFERENT TYPES OF LOANS?* A letter of credit (L/C) is the most common form of trade finance. A buyers bank sends a letter to the sellers bank guaranteeing payment to the seller once goods arrive.* Major oil and commodity trading firms make use of another type of loan called a revolving credit facility (RCF). Under an RCF, a consortium of banks allow a company to borrow up to an agreed upon maximum threshold. The company can repeatedly borrow and repay this credit, as long as it not exceed the threshold.* Companies that do regular business together and have built trust may forgo the guarantees provided by L/Cs and opt to use open credit instead. This does not provide protection in the event a counterparty fails to meet its obligations.HOW DOES IT WORK?* For example, with the loans a trader can buy five cargoes of crude oil or build a significant futures position while still waiting on payment for other crude cargoes sailing to a refinery.WHAT ARE THE TYPES OF STRUCTURED COMMODITY FINANCE LOANS?* Pre-export finance: Banks provide a longer-term loan to cover the costs of production secured against the sale of future output.* Prepayment: This type of long-term loan is more frequently used in the oil industry than other commodities. For instance, a trading house, backed by banks or insurers, will provide upfront cash to an oil producer and gradually be repaid with physical barrels of crude. The timeframe for this type of loan is usually several years."}