{"text": "The U.S. Food and Drug Administration authorized the first COVID-19 vaccine developed by Pfizer Inc and BioNTech SE , making it available for emergency use to patients aged 16 and older.In clinical trials, the vaccine was 95% effective at preventing illness and showed no short-term safety issues.The following is an outline of vaccine distribution plans.WHAT HAPPENS NEXT?The federal government plans to release the nations first 2.9 million doses within days of the authorization to 64 states, U.S. territories and major cities, as well as five federal agencies. Although the federal government is coordinating distribution efforts, states have the final decision over who gets the first shots. The federal government is sending the first shipments to more than 600 locations.WHO IS FIRST IN LINE FOR A SHOT?States are prioritizing healthcare workers and elderly long-term care residents for the first vaccinations. There are about 21 million healthcare workers in the United States and 3 million nursing home residents. Most states anticipate they will be able to vaccinate only between 13% and 18% of their healthcare workers with the first distribution, a Reuters analysis found. The federal government has said it will continue to send out millions of doses each week but has not released exact figures.WHO IS NEXT IN LINE?States have broad discretion over who will get the vaccine next. So far, a panel advising the Centers for Disease Control and Prevention (CDC) has only issued the guidance that healthcare workers and nursing home residents should be first.The CDC has laid out a possible framework of three distribution phases, suggesting essential workers and people aged 65 and older as the next priority.Some states have indicated they plan to give essential workers priority after healthcare workers and nursing home residents receive the vaccine.At least 20 large industries are lobbying states to get their workers classified as essential, a Reuters analysis found, including Uber Technologies Inc, DoorDash Inc, and others.WILL THERE BE ENOUGH VACCINES TO GO AROUND?Pfizer has said it would make 50 million doses this year - enough to inoculate 25 million people - about half of which would go to the United States. Pfizer has an agreement with the U.S. government to supply a total of 100 million doses, enough for 50 million people to be vaccinated. The United States has an option to buy an additional 500 million doses.An panel of expert advisers to the FDA will review a second COVID-19 vaccine from Moderna Inc next week. If that vaccine is authorized, federal officials have said they will be able to vaccinate 20 million Americans in December, 30 million in January, and 50 million in February.Johnson & Johnson and AstraZeneca Plc also have vaccines in late-stage trials. If those vaccines receive authorization early next year, officials said there would be enough doses to vaccinate about 75 million Americans a month by about March or April.Officials said by the middle of next year, the United States will have distributed enough vaccines for most Americans who want the vaccine to be inoculated.WHAT HAPPENS ONCE I GET THE VACCINE?The vaccine is given in two shots, three weeks apart. Pfizer has said side effects in trial volunteers were mostly mild to moderate, and cleared up quickly. The most severe side effects occurred after the second dose, including flu-like symptoms, fatigue and headache.Although the vaccine was shown to be highly effective at preventing illness, there is no data yet that suggests it also prevents infection or the ability to spread the virus to others. Mask-wearing and social distancing will likely remain in place until more people are vaccinated or proof emerges that the vaccine also prevents virus transmission."}