{"text": "Indonesian authorities have retrieved one of two black boxes, the Flight Data Recorder, from a Sriwijaya Air Boeing 737-500 that crashed into the Java Sea on Saturday.  read more This is how the black box readout process works.WHAT ARE BLACK BOXES?They are not actually black but high-visibility orange. Experts disagree how the nickname originated but it has become synonymous with the quest for answers when planes crash.Many historians attribute their invention to Australian scientist David Warren in the 1950s. They are mandatory.The aim is not to establish legal liability, but to identify causes and help prevent future accidents. HOW HAVE THEY EVOLVED?The earliest devices recorded limited data on wire or foil. Models like those typically found on the 1980s-designed Boeing 737-50 use magnetic tape. Modern ones use computer chips.The recordings are housed inside crash-survivable containers able to withstand 3,400 times the force of gravity on impact. The disappearance in 2014 of Malaysian Airlines MH370 triggered debate about whether data should be streamed instead.Airbus and France's BEA are testing an alternative design in a floatable panel embedded in the aircraft's fuselage. Bolts would retract and the device would fall away when the plane is about to crash on water, avoiding a deep-sea search.HOW BIG ARE THEY?They weigh about 10 pounds (4.5 kilos) and contain four main parts: * a chassis or interface designed to fix the device and facilitate recording and playback* an underwater locator beacon* the core housing or 'Crash-Survivable Memory Unit' made of stainless steel or titanium * inside there, the recordings on chips or older formats.There are two recorders: a Cockpit Voice Recorder (CVR) for pilot voices or cockpit sounds, and a Flight Data Recorder (FDR).HOW WILL THE RECORDERS BE HANDLED?After a crash over the sea, the recorder is placed back in water to prevent damage from contact with air while being transported.Once dry, technicians peel away protective material and carefully clean and retrieve the recordings, which are copied.Lab experts sometimes use \"spectral analysis,\" a way of examining sounds that can pick out barely audible alarms or the first fleeting crack of an explosion. Indonesian investigators say the Sriwijaya jet appeared to be intact when it hit water.HOW MUCH INFORMATION IS AVAILABLE?The FDR contains about 25 hours of data on eight tracks and the CVR has 30 minutes of conversation, according to the final report on a similar model of Boeing 737 which crashed in 2008.Later models have two hours of cockpit recordings.In many countries, only the main investigator and a handful of people are allowed to hear the raw cockpit tapes. WHERE WILL THE DATA BE READ?Indonesian officials leading the probe have said they plan to perform the readout at their facilities. If recorders are badly damaged, the operation is occasionally delegated to an overseas agency like France's BEA or the device's manufacturer. Photographs of the Sriwijaya data recorder arriving at a port on Tuesday appeared to show its crash-resistant container intact.HOW LONG WILL THE RESULTS TAKE?Indonesia has said it will take 2-5 days to inspect and download recordings. Their analysis can take much longer.Interim reports are published after a month but are often  sparse. Deeper investigations take a year or more to complete.Experts say air accidents are usually caused by a cocktail of factors.    "}