{"text": "LOS ANGELES U.S. President Donald Trump will visit the U.S.-Mexico border on Tuesday just a week before he is due to leave office to tout what he views as one of his biggest accomplishments: the partial construction of a wall along the U.S.-Mexico border.Trump plans to visit the wall in Alamo, Texas, a town in Texas Rio Grande Valley. It is distinct from the site of the Battle of the Alamo, a pivotal Texan loss in the Texas Revolution, which was later used by some Texans to invoke a battle cry. The White House denied any symbolism in Trumps choice of destination.WHY IS TRUMP VISITING THE BORDER?White House spokesman Judd Deere said the visit would mark Trumps completion of more than 400 miles of border wall  a promise made, promise kept  and his Administrations efforts to reform our broken immigration system.The 400 miles (644 km) includes a significant amount of wall construction in places where previous administrations had already built structures.It represents arguably the most concrete legacy of Trumps four-year administration and his overhaul of the U.S. immigration system, including a crackdown on migrants crossing the southern border.In his 2016 presidential run, Trump had originally vowed to build a big, beautiful wall on the U.S.-Mexico border that would be 1,000 miles long. He also promised that Mexico would pay for its construction, but funding has come from the United States.HOW MUCH WAS ACTUALLY BUILT?As of Jan. 8, U.S. Customs and Border Protection (CBP) said the Trump administration had completed 453 miles of border barrier overall.Much of it replaces barriers that had been put in place by previous administrations, with only 80 miles of primary and secondary barrier in areas where there were previously no structures, according to CBP.WHO PAID FOR THE WALL CONSTRUCTION?Trump claimed throughout his 2020 election campaign that Mexico was paying for the wall, but in fact the U.S. government has footed the bill. About $15 billion in funding has come from the Department of Homeland Security, as well as from the Defense and Treasury Departments.WILL BIDEN CONTINUE TO BUILD THE WALL?President-elect Joe Biden has pledged to halt construction and focus more on technology to secure the border. He said in August that not another foot of wall would be built under his administration and that he would drop lawsuits to seize land for border construction.It is not entirely clear what Bidens administration will do with contracts for wall construction that have already been awarded but have yet to be completed, or how it will deal with land that has already been condemned.The Trump administration has filed dozens of lawsuits to seize land in Texas since Election Day as it scrambles to move forward with wall construction. It has also sped up construction on public lands where opponents say mountainous rough natural terrain already acted as an effective barrier.Representative Henry Cuellar, a Texas Democrat who sits on the House of Representatives Appropriations Committee, is among those pushing for remediation for environmental damage caused by wall construction. He also wants potential reparations for people whose land was condemned for wall construction under Trump.(This story corrects in paragraph 2 to show that Battle of the Alamo was part of the Texas Revolution)"}