{"text": "The U.S. Food and Drug Administration has authorized Pfizer (PFE.N) and BioNTechs  COVID-19 vaccine for use in children as young as 12, widening the countrys inoculation program as vaccination rates have slowed significantly.  read more The following information should help parents deciding whether to inoculate their adolescent children.IS THE VACCINE SAFE FOR 12-15 YEAR OLDS?The FDA found the vaccine to be safe and effective in Pfizer's clinical trial. That trial included 2,260 participants in that age group, half of whom received the same vaccine dose  given to adults. The other half got a placebo as a comparison group. The safety profile for those 12 to 15 was found to be similar to 16- to 25-year-olds who have received the vaccine, the agency said. The most commonly reported side effects - all of which were short lived - were pain at the injection site, fatigue, headache, chills, muscle pain, fever and joint pain, the FDA said.More than 2 million 16- and 17-year-olds in the United States have already received at least one dose of the Pfizer/BioNTech vaccine.CHILDREN DON'T USUALLY GET VERY SICK, SO WHY GET THE SHOT?Most children with COVID-19 only develop mild symptoms or no symptoms at all. However, children are not without risk of becoming seriously ill. Pediatric medical experts point out that many children have been hospitalized and some have died. Dr. Lee Savio Beers, president of the American Academy of Pediatrics,  encourages parents to get the vaccine for their adolescents as soon as they are eligible.Infected children, even those without symptoms, can still spread the virus to vulnerable people at home and elsewhere. There have been outbreaks traced to sporting events and other activities for children in this age range. Inoculating as many people as possible is seen as essential to breaking the back of the pandemic.WILL I BE REQUIRED TO VACCINATE MY TEEN?While states can require teens to get vaccinated in order to attend public school, most are unlikely to do so before the vaccine receives full approval. Such requirements often take legislation, which in this case could be a lengthy and controversial process given how the vaccine has been politicized in many parts of the country. Private schools may be able to require it sooner unless a state law suggests otherwise.Summer camps - attented by some 26 million children each year - are generally not regulated as tightly by states and have more freedom to require or merely enourage vaccinations for staff and campers. However, vaccinating kids could allow them to avoid quarantine if they are exposed to someone who tests positive.WHERE CAN MY CHILD GET THE VACCINE?Teens will receive their vaccines at the same sites and pharmacies that are administering them to adults, provided they have the Pfizer/BioNTech shots on hand. They may also be able to receive the shots at pediatric offices able to properly store the vaccine.WHICH VACCINE CAN MY TEEN GET?As of now, only the Pfizer/BioNTech vaccine is authorized for use in people under the age of 18 in the United States.ARE ANY OTHER COUNTRIES VACCINATING ADOLESCENTS?Canada and Algeria have also authorized the Pfizer vaccine for this age group. Pfizer has said it has submitted the data needed for authorizaion to other regulators around the world, including the European Medicines Agency."}