{"text": "SAN FRANCISCO Facebook Inc fired an employee who had criticized Chief Executive Mark Zuckerbergs decision not to take action against inflammatory posts by U.S. President Donald Trump this month, citing his tweet challenging a colleagues silence on the issue.Brandon Dail, a user interface engineer in Seattle, wrote on Twitter that he was dismissed for publicly scolding a colleague who had refused to include a statement of support for the Black Lives Matter movement on developer documents he was publishing.Dail sent the tweet a day after joining dozens of employees, including the six other engineers on his team, in abandoning their desks and tweeting objections to Zuckerbergs handling of Trumps posts in a rare protest at the social media company.Intentionally not making a statement is already political, Dail wrote in the tweet, sent on June 2. He said on Friday that he stood by what he wrote.Facebook confirmed Dails characterization of his dismissal, but declined to provide additional information. The company said during the walkout that participating employees would not face retaliation.Dail did not respond to a request for comment.Trumps posts which prompted the staff outcry included the racially charged phrase when the looting starts, the shooting starts in reference to demonstrations against racism and police brutality held after the May 25 killing of George Floyd, a black man who died in police custody in Minneapolis.Twitter affixed a warning label to the same post, saying it glorified violence. Facebook opted to leave the post untouched.Zuckerberg defended his decision at a tense all-hands meeting with employees that week. During the meeting, Dail tweeted that it was crystal clear today that leadership refuses to stand with us.Dail again voiced objections this week after both Facebook and Twitter declined to take action against a Trump post that contained an unsubstantiated conspiracy theory about Martin Gugino, a 75-year-old protester who was critically injured by police in Buffalo, New York.Trumps attack on Martin Gugino is despicable and a clear violation [of] Facebooks anti-harassment rules. Its again extremely disappointing that we (and Twitter) havent removed it, he said.Internal dissent is often encouraged at Silicon Valley tech giants, but the companies have been accused of penalizing workers who organise and air complaints publicly.Alphabets Google fired at least five workplace activists late last year, while Amazon dismissed critics of its warehouse conditions during the coronavirus pandemic.Both companies denied firing employees for speaking out."}