{"text": "WASHINGTON Lobbyists for Facebook and Google threw their weight against new U.S. legislation that seeks to aid struggling news publishers by allowing them to negotiate collectively against the tech companies over revenue sharing and other deals.U.S. lawmakers introduced the plan in Congress on Wednesday to address a perceived power imbalance between news outlets and the tech giants. Critics accuse the companies of using content to drive traffic and ad revenue to their platforms without fairly compensating the publishers.The move adds to pressure on the tech firms, which are facing antitrust lawsuits and the threat of more regulation.Google, which declined comment on the proposal, launched a website here on Thursday asserting it is \"one of the world's biggest financial supporters of journalism\" by virtue of the ad revenue and content licensing fees it provides to media. Google said its search engine sends readers to publishers' websites 24 billion times per month.Also opposing the bill are two technology industry trade groups that Facebook and Google belong to -- the Computer & Communications Industry Association and NetChoice.Objective news coverage is a public good, but we dont think the way to fund that public good is by constructing a cartel, said CCIA President Matt Schruers.The group opposed a 2019 version of the legislation and views the proposed joint bargaining as a way of restricting competition.Carl Szabo of NetChoice said his goal was to kill the bill or at least convince lawmakers to amend it so that it would be restricted to smaller publications, excluding outlets such as the Washington Post or New York Times.I dont think they should be doing this legislation, period, he said. This legislation allows the Washington Post and New York Times and other big papers to call the shots for the smaller outlets.Some industry observers say the proposal could disproportionately benefit private equity firms and hedge funds that have snatched up medium and large newspaper chains. Newspapers such as the Chicago Tribune and the Miami Herald are controlled by the likes of Alden Global Capital and Chatham Asset Management.The bills come not long after Facebook battled with Australia over how much it should pay news publishers for their content. During the fight, Facebook blacked out Australian news pages and only restored them once the government granted concessions.Facebook declined comment on the new U.S. legislation.Senator Amy Klobuchar, a Democrat who sponsored the bill in the Senate, said the Australia dispute illustrated Facebooks outsized clout and the need to give publishers more leverage. We have to have an even playing field and allow people to negotiate, she said Thursday in a congressional hearing.The tech platforms appear to have few friends in Congress, where Democrats have been angered by misinformation online and conservatives argue that their views have been stifled.Among groups that back the legislation, David Chavern, president and chief executive of the News Media Alliance, sees collective bargaining as a critical way to increase the negotiating power of small and medium-size publishers.There has to be some kind of dispute resolution mechanism between platforms and publishers in addition to collective bargaining, said Chavern, adding that his group is flexible about what that could entail."}