{"text": "The move comes two years after Facebook Chief Executive Mark Zuckerberg said in a 2018 interview with tech website Recode said that while he found Holocaust denial deeply offensive, he did not think Facebook should delete such content.Ive struggled with the tension between standing for free expression and the harm caused by minimizing or denying the horror of the Holocaust, said Zuckerberg, who is Jewish, in a Facebook post on Monday.My own thinking has evolved as Ive seen data showing an increase in anti-Semitic violence, as have our wider policies on hate speech, he said.The social media company said that, starting later this year, it would also direct people searching for terms associated with the Holocaust or its denial to credible information off Facebook.The World Jewish Congress and the American Jewish Committee praised the move.For several years, the World Jewish Congress has advocated for Facebook to remove Holocaust denial content from its platform, that group said in a statement.This summer, civil rights groups organized a widespread Facebook advertising boycott to try to pressure social media companies to act against hate speech on their platforms.This has been years in the making. Having personally engaged with @Facebook on the issue, I can attest the ban on Holocaust Denial is a big deal, tweeted Jonathan Greenblatt, chief executive of the Anti-Defamation League, one of the boycotts organizers. Glad it finally happened, he added.The Conference on Jewish Material Claims Against Germany has also pushed for Facebook to ban Holocaust denial content and has called for Zuckerberg to meet with survivors through its #NoDenyingIt social media campaign.In August, Facebook banned certain anti-Semitic conspiracy theories and stereotypes.In its blog post bit.ly/36XixY0, the company cited a recent survey that found almost a quarter of adults in the U.S. aged 18-39 said they believed the Holocaust was a myth, that it had been exaggerated or they were not sure.The company said that enforcement of its new policies would not happen overnight.There is a range of content that can violate these policies, and it will take some time to train our reviewers and systems on enforcement, it said."}