{"text": "WASHINGTON President Donald Trump will embark on a heavier fundraising schedule in coming weeks as his re-election campaign faces a possible cash crunch that has forced it to pull back television advertising in some crucial states.Trumps campaign started the year with more than 10 times as much money as Democratic rival Joe Biden. But to the alarm of some Republican donors, the former vice president closed the gap as Democratic donors consolidated behind him and the Trump campaign burned through its cash more quickly.Biden, who leads Trump in most national and battleground state polling ahead of the Nov. 3 election, had about $99 million in the bank to Trumps $121 million by the end of July, according to disclosures by each sides campaign. Including money raised by the candidates national parties, Biden outraised Trump nearly $365 million to $210 million in August.I am flabbergasted that the money lead we had in February has completely evaporated, said Dan Eberhart, a Republican fundraiser and executive in the oil and gas industry who cut a $100,000 check to the Trump Victory Fund in June.Trump this week said his campaign had to spend millions on advertisements earlier this year to fight the impression that he mishandled the coronavirus pandemic, which has killed more than 191,000 Americans and devastated the U.S. economy.A couple of donors questioned whether the campaigns purchase of a multi-million dollar ad during the Super Bowl in February so far ahead of the election, as well as ads in the heavily Democratic Washington, D.C. market in June, were more about Trumps vanity than strategy.Eberhart said some of the campaigns recent actions, including buying ads in few-day increments as opposed to weekly and going dark in some states for a stretch, suggested the campaign now faces a cash pinch.Bill Stepien, who became Trumps campaign manager in July, told reporters this week that the campaign was very comfortable and confident in how were spending and where were spending.Biden is poised to outspend Trump on ads in the final weeks of the race. The Democrats campaign has booked about $181 million in television and radio ad spending between September and November, compared to $156 million by the Trump campaign, according to ad tracking firm Advertising Analytics.The current bookings show Biden will spend more than Trump in battleground states North Carolina, Pennsylvania, Michigan, Arizona and Wisconsin. Trump is slated to outspend Biden in Florida and Ohio.Stepien said in a statement that the incumbents campaign has invested heavily in a field operation and ground game aimed at turning out voters while the Biden campaign is waging almost exclusively an air war.We like our strategy better, Stepien said.WOOING BIG AND SMALL-DOLLAR DONORSIn the final stretch of the race, the Trump campaign will increase its outreach to donors of all means, advisers said.Trumps weekend agenda includes meeting with deep-pocketed donors on Saturday in Washington and on Sunday in Las Vegas. In total, the campaign, the Republican National Committee and state party organizations expect to raise $18 million for Trumps re-election effort this weekend, according to a Republican official.The president has resisted hosting virtual fundraisers, which Biden and Democrats have relied on as an alternative to in-person gatherings during the pandemic.A Trump adviser said the campaign is ramping up its small-dollar fundraising through direct mail and digital appeals.Even though the digital side has been strong, they havent built the small-dollar program, said the adviser, who spoke on condition of anonymity. People can go out and use the same philosophy we use for high-dollar bundling, but people can get their friends and family to donate and generate revenue that way.Another Trump donor, speaking on condition of anonymity, said no one was panicked over Bidens fundraising haul last month, which beat the previous monthly record of $193 million set by former President Barack Obama in September 2008.I havent had one person be concerned about it, said the donor, adding Trump would have enough money to see him through Election Day.Eberhart, too, said Trump would get his message out despite not having the cash advantage the campaign had anticipated. Trump beat Hillary Clinton in 2016 after getting out-raised by her and associated super PACs, he said.Trump has already shown that he does more with less, Eberhart said."}