{"text": "Europe's medicines regulator backed the use of Pfizer's (PFE.N) COVID-19 vaccine for children as young as 12, paving way for a broader roll-out in the region after similar clearances in the United States and Canada.  read more DEATHS AND INFECTIONS* Eikon users, see COVID-19: MacroVitals https://apac1.apps.cp.thomsonreuters.com/cms/?navid=1592404098 for a case tracker and summary of newsEUROPE* All Italians aged over 16 will be able to be vaccinated from June 3 onwards. * Spain, Greece are Ireland said they were preparing to adopt COVID-19 certificates to help citizens move more freely across the EU and attract foreign travellers ahead of the summer tourist season.  read more * Czech restaurants, bars, night clubs and other hospitality venues can serve customers indoors from Monday.  read more AMERICAS* The Canadian province of Ontario will begin offering second doses of COVID-19 vaccines to people 80 and up next week, and everyone in the province should be eligible by early August.  read more * California will offer $116.5 million in cash and gift cards to residents who get vaccinations before June 15, the latest incentive by U.S. states desperate to persuade those hesitating to get the injection.  read more ASIA-PACIFIC* Japan on Friday extended a state of emergency in Tokyo and other areas by about three weeks to June 20 as the pandemic shows no signs of easing less than two months before the Summer Olympics open. * Infections in the South Asia region surpassed 30 million, according to a Reuters tally. * Malaysia's prime minister announced a nationwide \"total lockdown\" starting in June as infections surged to record levels. * Taiwan aims to cover 60% of its population with at least one dose of vaccine by October.  read more * An institution sponsored by Thailand's Princess Chulabhorn said it plans to import 1 million doses of Sinopharm's vaccines, which are due to arrive in June. MIDDLE EAST AND AFRICA* Algerian medics fear next week's reopening of national borders will trigger a new surge in cases despite health measures, as people living abroad rush home to see family.  read more * Thirty-two members of parliament in the Democratic Republic of Congo, or about 5% of the total, have died from COVID-19 since the start of the pandemic, the vice president of the National Assembly said.  read more MEDICAL DEVELOPMENTS* Britain's medicine regulator approved Johnson & Johnson's (JNJ.N) Janssen COVID-19 vaccine for use, with the government adding it had cut its order for the vaccine by 10 million doses. * The Russian health ministry ethical committee has declined to approve clinical trials in Russia of a vaccine combining Russia's Sputnik V and AstraZeneca's (AZN.L) shots.  read more * A Japanese health ministry panel approved the use of Pfizer's vaccine for those aged 12 and above. * Thailand's food and drug regulator approved for emergency use the coronavirus vaccine developed by China's Sinopharm.  read more ECONOMIC IMPACT* Stock markets were on track for a seventh consecutive day and fourth straight month of gains, as investors bet the United States will lead the world economy out of its COVID-19 slump with a $6 trillion spending boom. * The recovery of global goods trade is accelerating from a steep drop a year ago, although some regions are lagging given an unequal roll-out of vaccinations, the World Trade Organization said. "}