{"text": "WILMINGTON, Del. U.S. President Donald Trumps campaign sued Michigan and Pennsylvania this week to prevent them from certifying Democratic challenger Joe Biden as the winner of the two states in the Nov. 3 presidential election.Since Biden clinched victory in the election on Saturday, Trump has refused to concede and has repeatedly claimed, without evidence, that there was widespread voter fraud.The Trump campaign has filed a flurry of lawsuits, part of a larger strategy to try to overturn the election results in key battleground states.Several lawsuits have been dismissed, and legal experts said the remaining cases are narrow or in the cases of Pennsylvania and Michigan are based on weak claims.Below is a list of cases that will play out in the coming days and weeks:PENNSYLVANIA, MICHIGAN LAWSUITS TO BLOCK BIDEN VICTORIESIn federal courts in Pennsylvania and Michigan, the Trump campaign has sued to prevent Biden from being certified by election officials as the winner of the election in those states.On Nov. 8, Trumps campaign filed a lawsuit in the Middle District of Pennsylvania alleging Pennsylvanias mail-in voting system lacked all of the hallmarks of transparency and verifiability that were present for in-person voters.On Nov. 11, the campaign filed a similar federal lawsuit in the Western District of Michigan alleging misconduct such as harassment of Republican poll challengers and a requirement that they adhere to six-foot distancing rules unlike Democratic poll challengers.The complaint said Michigan election results should not be certified without confirming that all ballots were counted properly, and a special election might be needed in problematic precincts.OTHER PENNSYLVANIA LITIGATIONTrumps campaign on Nov. 4 sought to intervene in a case pending before the U.S. Supreme Court, challenging a ruling from Pennsylvanias highest court that allowed state election officials to count mail-in ballots postmarked by Election Day even if they were delivered as late as three days later.Pennsylvania election officials have said there were about 10,000 late-arriving ballots, which were separated.The justices had previously ruled there was not enough time to decide the cases merits before Election Day but indicated they might revisit it afterwards.Justice Samuel Alito, joined by conservative Justices Clarence Thomas and Neil Gorsuch, said at the time there was a strong likelihood the Pennsylvania court ruling violated the U.S. Constitution.The Trump campaign is also fighting a number of more narrow cases in the state. On Nov. 12, the campaign scored a narrow victory after the states Commonwealth Court barred county election officials from counting mail-in and absentee ballots in which voters provided missing information after Nov. 9.ARIZONA CHALLENGETrumps campaign said on Nov. 7 it filed a lawsuit in Arizona alleging that Maricopa County, which includes Phoenix and is the states most populous county, incorrectly rejected votes cast on Election Day by some voters.The lawsuit filed in state Superior Court in the county said poll workers told some voters to press a button after a machine had detected an overvote.Trumps campaign said this disregarded voters choices in those races, and that the affected votes could prove determinative for the presidential race.NEVADA LOSSA voter, a member of the media and two candidates campaigns sued Nevadas secretary of state to prevent the use of a signature-verification system in Clark County, which includes Las Vegas, and to provide public access to vote counting.A federal judge rejected the request on Nov. 6, saying there was no evidence the county was doing anything unlawful.GEORGIA BALLOT FIGHTThe Trump campaign on Nov. 4 filed a lawsuit in a state court in Chatham County that alleged late-arriving ballots were improperly commingled with valid ballots, and asked a judge to order that late-arriving ballots be separated and not counted.The case was dismissed on Nov. 5.MICHIGAN BALLOT-COUNTING SUITTrumps campaign filed a lawsuit in Michigan on Nov. 4 to halt vote counting, saying campaign poll watchers were denied meaningful access to witness the counting of ballots.Michigan Court of Claims Judge Cynthia Stephens dismissed the case a day after it was filed."}