{"text": "WASHINGTON Republican lawmakers in election battleground states have passed a wave of new voting requirements and limits this year, saying the measures are needed to curb voter fraud despite scant evidence of it in the United States.Backers of the measures cite former President Donald Trumps baseless claim that fraud underlay his decisive presidential election loss to Democrat Joe Biden in November. Democrats and voting rights advocates have sued state officials over the new laws, denouncing the efforts as partisan power grabs that will disproportionately disenfranchise voters of color.ARIZONARepublican Governor Doug Ducey signed a law on Tuesday to stop counties from automatically mailing Arizonans early ballots if they do not use them often enough. The legislation, also passed on Tuesday, will remove voters from the states Early Voting List if they fail to submit an early ballot at least once every two election cycles.Republican lawmakers in most other states have bundled voting restrictions into sweeping bills to pass them in one go, but they are taking a piecemeal approach in Arizona. The states legislature is expected to consider other voting hurdles in coming weeks, including a bill requiring absentee voters to provide more proof of identity.TEXASThe Texas House of Representatives passed new Republican-backed voting restrictions on May 7, barring officials from mass-mailing absentee ballot applications and giving partisan poll watchers more access to voting sites. The state Senate previously approved its own bill, which would eliminate extended voting hours and prohibit drive-through voting.A bicameral committee is next expected to combine both bills into a final version, in a largely closed-door process controlled by Republicans. The final measure would then get one last vote from each chamber before heading to Republican Governor Greg Abbott, who has indicated he will sign it into law.FLORIDAA law signed by Republican Governor Ron DeSantis on May 6 imposed additional requirements on requesting and submitting absentee ballots. Absentee voters must submit new proof of identity when requesting their ballots and reapply for absentee ballots in each new general election cycle, rather than every two cycles.The law also limited the use of absentee drop boxes to the early voting period, gave partisan election observers more power to raise objections and required people offering voters assistance to stay at least 150 feet (45 meters) away from polling places, an increase from the previous 100-foot (30-meter) radius.GEORGIAOne of the most controversial new voting measures passed in Georgia, where Republican Governor Brian Kemp signed a law on March 25 that tightened absentee ballot identification requirements, restricted ballot drop-box use and allowed a Republican-controlled state agency to take over local voting operations.Critics said the legislation aims to disenfranchise Black voters, who helped propel Biden to the presidency and deliver Democrats two U.S. Senate victories in Georgia in January that gave them control of the chamber. Top U.S. companies also decried Georgias law, and Major League Baseball moved its All-Star game out of the state in protest.IOWARepublican Governor Kim Reynolds signed a law on March 9 that shortened the states early voting period and Election Day polling place hours, imposed tighter deadlines for absentee ballots to be submitted, and made it a felony for election officials to disobey guidance from Iowas secretary of state, who is currently a Republican."}