{"text": "Amy Coney Barrett, President Donald Trumps nominee for a lifetime job on the U.S. Supreme Court, has served as a federal appeals court judge since 2017 and has weighed in on cases involving several hot-button issues including abortion, gun rights, immigration and campus sexual assault.Trump appointed Barrett, a favorite of religious conservatives, to her current job as a judge on the Chicago-based 7th U.S. Circuit Court of Appeals.Here are some of her notable legal opinions.ABORTIONAlthough Barrett has not ruled directly on abortion as a judge, she has cast votes signaling opposition to rulings that struck down abortion-related restrictions. Abortion rights groups have expressed concern that Barrett could help overturn the landmark 1973 Roe v. Wade Supreme Court decision that legalized abortion nationwide.In 2016, Indiana passed a law requiring that fetal remains be buried or cremated after an abortion.After rulings by trial and appeals court judges found the law violated the constitutional right to an abortion recognized by the Supreme Court, Barrett voted in 2018 in favor of rehearing the case, signaling opposition to rulings against the measure. She was outnumbered on the 7th Circuit, but the Supreme Court later reinstated the Indiana law.In 2019, Barrett voted to rehear a ruling by a three-judge 7th Circuit panel that upheld a challenge to another Republican-backed Indiana abortion law. The Indiana measure would require that parents be notified when a girl under 18 is seeking an abortion even in situations in which she has asked a court to provide consent instead of her parents.Barrett again was outnumbered on the 7th Circuit, but the Supreme Court in July threw out the ruling against the law and ordered that the case be reconsidered.GUN RIGHTSBarrett indicated support for expansive gun rights in a March 2019 opinion dissenting from a 7th Circuit ruling regarding gun ownership by people convicted of serious crimes.She was part of a three-judge panel that considered a challenge to a federal law that bars people convicted of felonies from owning firearms. A businessman who had pleaded guilty to mail fraud argued that the law violated the U.S. Constitution as applied to him.The two other judges, both appointed by Republican President Ronald Reagan, said the federal law and a similar Wisconsin one were constitutional.In a dissent, Barrett wrote that, absent evidence that the man was violent, permanently disqualifying him from owning a gun violated the Constitutions Second Amendment, which guarantees the right to keep and bear arms.History is consistent with common sense: it demonstrates that legislatures have the power to prohibit dangerous people from possessing guns, Barrett wrote. But that power extends only to people who are dangerous.CAMPUS SEXUAL ASSAULTBarrett wrote a 2019 ruling on behalf of a unanimous three-judge 7th Circuit panel that made it easier for male college students accused of sexual misconduct to challenge how campus tribunals handled their cases. The case involved a male student at Purdue University in Indiana who was accused of sexually assaulting a female student.Barrett revived a lawsuit by the accused student who said the university had put him through a sham proceeding in which he could not properly defend himself.The case against him boiled down to a he said/she said -Purdue had to decide whether to believe the woman accuser or the male accused, Barrett wrote, adding that it is plausible that Purdue officials chose to believe the accuser because she is a woman and to disbelieve the accused because he is a man.The ruling noted that if a university adopts even temporarily a policy of bias favoring one sex over the other in a disciplinary dispute to avoid liability or bad publicity, it amounts to sex discrimination.The ruling allowed the male student to proceed with a theory that Purdues treatment of him constituted impermissible discrimination on the basis of sex.IMMIGRATIONIn June, Barrett said in a dissenting opinion that she would have let one of Trumps hardline immigration policies go forward in Illinois.The litigation was over the public charge rule, a policy of denying legal permanent residency to certain immigrants deemed likely to require government assistance in the future.Barrett dissented when a three-judge 7th Circuit panel voted to halt the policy in Illinois."}