{"text": "Nagorno-Karabakh is a mountainous and heavily forested patch of land that sits inside the territory of the former Soviet republic of Azerbaijan.Under international law, Nagorno-Karabakh is recognised as part of Azerbaijan. But the ethnic Armenians who make up the vast majority of the population reject Azeri rule. They have been running their own affairs, with support from Armenia, since Azerbaijans troops were pushed out in a war in the 1990s.Long-standing ethnic tensions in the region between Christian Armenians and their mainly Muslim neighbours flared in Nagorno-Karabakh in the late 1980s.New fighting that broke out on Sept. 27 quickly became the deadliest since the 1990s. Talks brokered by Russia led to an agreement on a humanitarian ceasefire from Oct. 10 though it quickly began to fray.The conflict over Nagorno-Karabakh risks dragging in the big regional powers, Russia and Turkey. Moscow has a defence alliance with Armenia, while Ankara backs its ethnic Turkic kin in Azerbaijan.In the 1980s, the territory was within the borders of the then-Soviet republic of Azerbaijan, though most decisions were made in Moscow.As the Soviet Union began to break up, it became apparent that Nagorno-Karabakh would come under the direct rule of the Azeri government. The ethnic Armenians did not accept that.Sectarian conflict erupted, escalating into war in 1991 between Azerbaijans troops and Nagorno-Karabakhs ethnic Armenian forces backed by Armenia. About 30,000 people were killed and many more were displaced.Authorities in Nagorno-Karabakh declared independence that year but it was not recognised internationally, leaving the ethnic Armenian administration there in a state of legal limbo and under blockade from Azerbaijans government.By 1994, when an internationally brokered ceasefire was agreed, ethnic Armenians controlled almost all of Nagorno-Karabakh, plus some surrounding Azeri districts that gave them a buffer zone and land bridge connecting their region to Armenia.Azerbaijan vowed to take back control over the territory, using military force if necessary.International efforts over the years to find a lasting peace settlement, involving France, the United States and Russia as mediators, have failed to clinch a deal."}