{"text": "More than 100 wildfires have ripped through parts of the U.S. West in recent weeks, consuming areas nearly the size of New Jersey, killing at least 24 people and forcing hundreds of thousands of people to flee their homes.While wildfires typically erupt in states west of the Rocky Mountains in late summer, climate change has made matters worse by contributing to greater extremes in wet and dry seasons, scientists say. As a result, vegetation flourishes then dries out, leaving more abundant, volatile fuel for fires.One of the largest this year is the so-called August Complex fires, which have scorched nearly 750,000 acres (303,514 hectares) in the Mendocino National Forest northwest of Sacramento, according to the California Department of Forestry and Fire Protection.Here are a few of the largest wildfires ever to scorch the U.S. western states:- The Mendocino Complex fire of July 2018, previously Californias largest wildfire, consumed 459,123 acres (185,800 hectares), left one person dead and destroyed 280 structures in Northern California. Its cause is still being investigated.- The Long Draw Fire, Oregons biggest fire in nearly 150 years, scorched 557,648 acres (225,672 hectares) in the southeastern part of the state in July 2012. It was blamed on a lightning strike.- The Okanogan Complex Fire started as a number of smaller blazes in August 2015 sparked by lightning in north-central Washington, but grew to become the states largest wildfire, blackening some 305,000 acres (123,429 hectares). The fire was blamed for the deaths of three firefighters, fourth injuries and the destruction of 90 single-family dwellings, 86 cabins and nearly 100 outbuildings.- The Wallow Fire started in the White Mountains of east-central Arizona on May 29, 2011 and soon became the states largest wildfire, consuming 538,049 acres (217,740 hectares) as it spread into western New Mexico. Two cousins admitted to accidentally starting the blaze by leaving a smoldering campfire unattended and were ordered to pay $3.7 million to cover its losses.- The Murphy Complex Fire started as six lightning-sparked wildfires in July 2007 in south-central Idaho and north central Nevada that came together and scorched 652,016 acres (263,861 hectares) of land, much of it federal property."}