{"text": "Unrest and violence are worsening across Nigeria, where gunmen in the northwest were reported to have kidnapped around 30 students from a forestry college overnight in the fourth mass school abduction since December.Growing public anger prompted President Muhammadu Buhari to replace his military high command earlier this year.Here is a summary of the violence:ARMED GANGS, NORTHWEST/NORTH-CENTRAL NIGERIAArmed gangs that rob and kidnap for ransom, commonly described as bandits, are active across the northwest.Such groups killed more than 1,100 people in the first half of 2020 alone, according to rights group Amnesty International.In the latest incident, gunmen kidnapped around 30 students from a forestry college near a military academy on the outskirts of Kaduna city in Kaduna state, the states security commisioner Samuel Aruwan said. The army rescued 180 other people, he said.Last month, 279 schoolgirls were freed after being abducted from their boarding school at Jangebe in northwest Nigerias Zamfara state, and 27 teenage boys were released 10 days after being kidnapped from their school in the north-central state of Niger. One student was shot dead in that attack.In December, gunmen abducted 344 boys from a boarding school in northwestern Katsina state. They were released roughly a week later. Islamist militants Boko Haram claimed responsibility, but sources later said the abduction was driven by inter-communal feuding.Amnesty said it had documented an alarming escalation in attacks and abductions since January 2020.The banditry has made it increasingly difficult to farm, travel or tap some states rich mineral assets, such as gold; the government banned mining in Zamfara following the last kidnapping.ISLAMIST INSURGENTS, NORTHEAST NIGERIABoko Haram and its Islamic State offshoot, Islamic State West Africa Province, have waged a decade-long insurgency in northeastern Nigeria.The violence has displaced about 2 million people and killed more than 30,000, according to the United Nations refugee agency and the Council on Foreign Relations, a New York-based think tank.In late February, suspected Islamist insurgents pounded the biggest city in the region, Maiduguri, with rocket-propelled grenades, killing at least 10 and injuring dozens in the worst attack in a year on the city. A few days later, suspected Islamist insurgents overran the town of Dikwa in Borno state, a military stronghold and humanitarian hub,In November, Boko Haram killed scores of farmers, beheading some of them, in Borno state.FARMER-HERDER CLASHES, MIDDLE BELTClashes between nomadic cattle herders and farmers in Nigerias Middle Belt have killed thousands of people and displaced half a million over the past decade, according to estimates from French medical charity Medecins Sans Frontieres.In the past, authorities have blamed the violence on religion or ethnic divisions, but locals say the groups are fighting for access to fertile land and water. [reut.rs/3agztKy]Experts fear the conflict will become worse as global warming intensifies competition for scarce resources.PROTESTS AGAINST POLICE BRUTALITY, NATIONWIDEWhat began as largely peaceful protests against police brutality turned violent in October after security forces fired on demonstrators, according to witnesses and Amnesty.At least 10 people were killed in the upscale Lagos neighbourhood of Lekki on Oct. 20, Amnesty said. The army and police denied shooting protesters there and have said their actions during the protests kept the nation safe.In the days that followed, rioting, looting and lawlessness broke out across the country. It was the worst unrest in Nigeria since the end of military rule in 1999.PIRACY, VANDALISM AND THEFT IN NIGER DELTATurmoil and lack of economic development in the oil-producing Niger Delta region have sparked insecurity on land and at sea.Attacks by pirates in the Gulf of Guinea, most of whom are based in Nigeria, hit a record last year, according to the International Maritime Bureau. It warned that well-armed and violent gangs are marauding further out to sea.In January, pirates killed one sailor and kidnapped fifteen.Kidnappings are also common on land, and last year, oil companies stepped up security for their installations."}