{"text": "George Floyd's younger brother, Philonise Floyd, took the stand on Monday in the murder trial of Derek Chauvin, telling the jury about his brother's love of basketball and adoration of their mother.Chauvin, who is white, was helping officers to arrest Floyd, a 46-year-old Black man, on suspicion of using a fake $20 bill to buy cigarettes at a grocery store, when he knelt on Floyd's neck for nine minutes, sparking global protests.The county examiner ruled Floyd's death a homicide at the hands of the police, but Chauvin's lawyers say the death may have been a drug overdose, a contention that prosecutors say is contradicted by medical evidence.Here is a look at some important moments from the 11th day of witness testimony:PHILONISE FLOYD, GEORGE FLOYD'S YOUNGER BROTHERPhilonise Floyd, 39, testified how he and his older brother and three other siblings grew up in a housing project for poor families in Houston, playing Nintendo video games and dreaming of one day being as skilled as their basketball heroes.The testimony was allowed under a Minnesota doctrine that lets loved ones reminisce to the jury about a crime victim in what is called \"spark of life\" testimony.  read more The siblings were raised by a mother everyone in the community called Miss Cissy, whom George Floyd doted on.\"He was a big momma's boy,\" Philonise Floyd told jurors.George Floyd was inconsolable at her 2018 funeral, his brother recalled.\"He was just kissing her and kissing her, he didn't want to leave the casket,\" Philonise Floyd testified.Prosecutors also used the brother's time on the stand to pre-emptively attack a defense Chauvin's lawyers have said in court filings they intend to use, revolving around the meaning of a slang term used by George Floyd during his arrest: \"hooping.\"Chauvin's lead lawyer, Eric Nelson, has argued that when Floyd is heard in body-worn camera footage telling police he \"was just hooping earlier,\" he was referring to taking drugs rectally.After showing photographs of a young George Floyd dressed in a basketball uniform, prosecutor Steve Schleicher made no reference to the defense theory, but asked the brother: \"When he would talk about playing basketball, would he use any particular term or phrase?\"\"He said: 'Let's go hooping,'\" Philonise Floyd replied. \"You have to hoop every day. If you don't go and shoot a whole bunch of shots, like 50 to 100 shots a day, my brother would say he would never be able to compete.\"CHAUVIN'S UNSUCCESSFUL BID TO SEQUESTER JURYNelson sought to have the jury sequestered in light of the fatal police shooting a day earlier of a Black man named Daunte Wright in a traffic stop in Brooklyn Center, a suburban city just north of Minneapolis.  read more Hennepin County District Judge Peter Cahill denied the defense request, although he plans to sequester jurors by confining them to a hotel once they begin deliberations in downtown Minneapolis.The shooting, which police said happened after an officer accidentally grabbed her gun instead of her Taser, sparked a night of angry protests, with Brooklyn Center police firing rubber bullets and chemical irritants at protesters.  read more DR. JONATHAN RICH, CARDIOLOGISTRich, a cardiologist and medical school professor at Northwestern University in Illinois, testified that there were several moments when Chauvin could have intervened to save Floyd's life.He also echoed the previous testimony given by a pulmonologist, toxicologist, forensic pathologist and others in supporting the conclusion last year by the Hennepin County chief medical examiner that Floyd's death was a homicide caused by police restraint.\"I can state with a high degree of medical certainty that George Floyd did not die from a primary cardiac event, and he did not die from a drug overdose,\" Rich told the jury.There were several moments when Chauvin could have saved Floyd's life, Rich said: by not pinning him into the ground with his knee in the first place; by moving Floyd out of the prone position; or by beginning to give Floyd chest compressions once another officer noted Floyd's heart had stopped beating.Rich, who specializes in heart transplant surgery, said Floyd's heart was slightly enlarged but he had no pre-existing heart issue, and so a heart attack was ruled out.\"Every indicator is that Mr. Floyd had an exceptionally strong heart,\" Rich testified."}