{"text": "WASHINGTON The following are some facts about the Guantanamo U.S. military prison in Cuba. The Biden administration has launched a formal review with the aim of closing it.* The United States set up the prison after U.S.-led forces invaded Afghanistan in pursuit of the al Qaeda network behind the hijacked plane attacks that killed nearly 3,000 people in New York, the Pentagon and rural Pennsylvania on September 11, 2001.* The Guantanamo prison drew worldwide condemnation during Republican President George W. Bushs administration, which kept hundreds of foreign terrorism suspects locked up there in the aftermath of the 2001 attacks and the subsequent U.S. war against the Taliban in Afghanistan.* The first 20 prisoners arrived on Jan. 11, 2002. They and other early arrivals were held at Camp X-Ray, in chain-link wire cages that have long since been replaced by modern prison buildings. Its population grew to a peak of about 800 inmates before it started to shrink.* Upon taking office in 2009, Obama ordered the detention operation at Guantanamo Bay closed by January 2010 but missed the deadline, partly because Congress imposed tough restrictions on prisoner transfers, including a ban on bringing them to prisons on the U.S. mainland. By the end of his second term, he reduced the inmate population to mid-double digits from 242 by repatriating some and sending others to countries willing to accept them.* When Trump took office, he signed an order in 2018 to keep open the detention center, though he never loaded it up with bad dudes, as he once vowed. However, he once expressed dismay at the cost of keeping the controversial prison open.* Trump inherited a prison population of 41 from Obama, and later transferred one prisoner to Saudi Arabia.* Now, 40 prisoners are left, most held for nearly two decades without being charged or tried. Of the prisoners who remain, nine have been charged or convicted by slow-moving military commissions. The most notorious is Khalid Sheikh Mohammed, accused Sept. 11 mastermind. About two dozen have not been charged but have been deemed too dangerous to release. But six inmates have previously been cleared for release by an inter-agency government panel yet remain jailed.* Nine prisoners have so far died at Guantanamo. Seven deaths were classified as suicides, mainly by hanging, and the others were attributed to colon cancer and a heart attack.* Some detainees have said they were tortured at Guantanamo. The U.S. government has acknowledged that interrogators used now-banned techniques that included sleep deprivation, extreme temperatures and loud music. Prisoners were also chained in painful stress positions. The CIA admitted using the simulated drowning technique known as waterboarding on three of the captives who were held at secret prisons and then transferred to Guantanamo.* The United States spends hundreds of millions of dollars a year to keep the prison open."}