{"text": "WASHINGTON President-elect Joe Biden has promised to build an administration that reflects the diversity of the country, and is expected to announce his choices for some key White House and Cabinet positions in the next few weeks.He got off to a quick start on Wednesday by naming longtime aide Ron Klain as his White House chief of staff. Here are some top contenders for other prominent positions, according to Reuters reporting.SECRETARY OF STATEChris Coons - The Democratic U.S. senator from Delaware, Bidens home state, is a close Biden friend and adviser who is a prominent member of the Senate Foreign Relations Committee and would presumably have an easy path to confirmation from his Senate colleagues.Susan Rice - The former national security adviser, U.N. ambassador and assistant secretary of state was on Bidens short list as a possible running mate. Her deep experience makes her a logical choice, but she could face Republican opposition over her involvement in the controversy over the deadly 2012 attack on the U.S. mission in Benghazi, Libya.William Burns - The longtime career foreign service officer is a former deputy secretary of state, ambassador to Russia and lead negotiator in the secret talks that eventually paved the way to the 2015 Iran nuclear deal. He is now president of the Carnegie Endowment for International Peace.TREASURY SECRETARYLael Brainard - She is a member of the Federal Reserve Board of Governors and a former undersecretary for international affairs during the 2009 global financial crisis. She has voted against regulatory rollbacks on banks but could face criticism from liberals who want a less moderate choice.Sarah Bloom Raskin - She formerly served as a Fed governor and deputy Treasury secretary, the only woman so far to hold the second-in-command role at the agency. A lawyer and former state financial regulator in Maryland, she has worked in finance, and currently serves as a director with Vanguard, the investment giant with $6 trillion in assets under management.Janet Yellen - The former Fed chair deepened the Feds focus on workers and inequality and has remained active in policy debates at the Brookings Institution think tank after President Donald Trump replaced her as head of the central bank in 2018.DEFENSE SECRETARYMichele Flournoy - She is the consensus front-runner for the job, which would make her the first woman to lead the Pentagon. She served as a top Defense Department official in the Bill Clinton and Barack Obama administrations, advised Bidens campaign on defense issues and co-founded a consulting firm with Antony Blinken, one of Bidens top advisers.Tammy Duckworth - The U.S. senator from Illinois, who was considered as a possible Biden running mate, lost both her legs when her helicopter came under fire while she was an Army officer in Iraq in 2004. She was an assistant secretary of veterans affairs under Obama and would be the first Thai-American Cabinet member.ATTORNEY GENERALSally Yates - A former deputy attorney general, she was briefly the acting attorney general early in Trumps term before being fired for insubordination for refusing to defend travel restrictions targeting seven Muslim-majority nations.Doug Jones - A former federal prosecutor with a strong civil rights record, Jones won a U.S. Senate seat in a 2017 special election in deeply conservative Alabama. He was defeated this year by Republican Tommy Tuberville, a former football coach.ENERGY SECRETARYElizabeth Sherwood-Randall - A former adviser to Biden when he was in the U.S. Senate, she served in the Obama administration as deputy secretary of energy, where she led an initiative to address cyber and physical challenges to the power grid. She is now a professor at the Georgia Institute of Technology.Jay Inslee - He focused on climate change during his failed presidential bid in 2019, but was re-elected to a third term as governor of Washington this year. He has been pushed for consideration in the Cabinet by environmental activists given his efforts to pass a carbon tax and clean-fuels standard.ENVIRONMENTAL PROTECTION AGENCYHeather McTeer Toney - A former regional administrator of the EPA under Obama, the clean-air activist is national field director for Moms Clean Air Force. A favorite of progressives, she has advocated and trained diverse officials on leadership and climate in over 15 countries including Kenya, France, Portugal, Nigeria and Senegal.Mary Nichols - The former assistant administrator for the EPA during Clintons administration is chairwoman of Californias Air Resources Board, which regulates air pollution in the state.CENTRAL INTELLIGENCE AGENCYMichael Morell - He was the CIAs deputy director and acting director of the agency twice under Obama. He is now the chairman of the geopolitical risk practice at Beacon Global Strategies, a consulting firm in Washington.Avril Haines - She was the deputy national security adviser under Obama, and previously was the first woman to serve as CIA deputy director. She held several posts at Columbia University after leaving the Obama administration in 2017.HEALTH AND HUMAN SERVICESVivek Murthy - A physician and former surgeon general, Murphy has gained prominence in recent months as co-chairman of Bidens advisory board on dealing with the coronavirus pandemic, which the president-elect has pledged to make his top priority on taking office.Mandy Cohen - A physician who serves as the secretary of North Carolinas Health and Human Services Department, where she has been a major advocate for expanding Medicaid, the government health insurance program for low-income Americans. She served as the chief operating officer at the Centers for Medicare and Medicaid Services in the Obama administration.David Kessler - The former commissioner of the Food and Drug Administration has been a co-chair of Bidens advisory board on the coronavirus pandemic. As head of the FDA, he cut the time needed to approve drugs to treat AIDS and moved to try to regulate the tobacco industry.HOMELAND SECURITYAlejandro Mayorkas - A Cuban-American lawyer, he would be the first Latino to head the department. As head of Citizenship and Immigration Services under Obama, he led implementation of the Deferred Action for Childhood Arrivals (DACA) program for so-called Dreamers, who were brought to the United States illegally as children. DACA drew Republican criticism and could lead to Republican opposition in the Senate if he is nominated.Xavier Becerra - The former congressman succeeded Vice President-elect Kamala Harris as California attorney general, where he has won praise at times from progressives, and also could be considered to replace her in the U.S. Senate.Lisa Monaco - The former Biden aide on the Senate Judiciary Committee, where she worked on the Violence Against Women Act, was also a top adviser on homeland security to Obama. She served as an assistant attorney general for national security, and chief of staff to former FBI Director Robert Mueller.AMBASSADOR TO UNITED NATIONSWendy Sherman - She helped lead the nuclear negotiations with Iran while serving as the State Departments undersecretary for political affairs under Obama.Pete Buttigieg - The former mayor of South Bend, Indiana, and Afghanistan veteran fell short in his presidential bid this year but became one of Bidens top advocates in the campaign against Trump, putting him in line for a top job in the administration."}