{"text": "Twitter Inc on Thursday released data for the first time on the effectiveness of measures introduced to combat U.S. election misinformation, including labels it applied to President Donald Trump and others.Tweets from Trump that shared false claims about voter fraud and challenged the election outcome to his 88 million followers have been shared tens of thousands of times on the platform.WARNINGS AND LABELSIn a blog post, Twitter said it labeled about 300,000 tweets across the site with disputed or potentially misleading content under its civic integrity rules between Oct. 27 and Nov. 11. It said these represented 0.2% of all US election-related tweets sent during that period.Twitter said 456 of these tweets were also hidden by a warning message and had their engagement limited, meaning users could not retweet, reply to or like the tweets. A Twitter spokeswoman said this week it had stopped using these more restrictive election-related warning labels.The company said approximately 74% of the people who viewed labeled tweets saw them after the company applied a label or warning message.FRICTIONTwitter also prompted users to quote tweet content rather than just retweet it, to try and slow the spread of sharing.The company said it had data showing the change did slow the spread of misleading information.In the blog post, Twitter said it was taking more time to study the effect but that the measure would be kept in place for now.RECOMMENDATIONSThe company stopped providing liked by and followed by tweet recommendations from accounts that users did not follow in their home timelines and notifications - but the change did not provide the desired results.Twitter said it did not see a statistically significant difference in misinformation prevalence from the change and so would be reverting back to normal.It said that eventually it planned to replace these recommendations with more tailor-made ones, for instance, based on topics that users follow.CONTEXT IN FOR YOU TRENDSTwitter said that it had seen results from only showing trends in the For You section that its team had added context, it would not be keeping this requirement.It said this was because it limited the amount and breadth of trends that Twitter could show people."}