{"text": "WASHINGTON Democratic U.S. President-elect Joe Bidens team has tapped a mix of progressives and centrist policy experts, including former derivatives market regulator Gary Gensler, to lead a transition plan for financial industry oversight. nL1N2HW38V]Here is how staffing could shake out at some of the key financial regulators, according to nearly two dozen lobbyists and policy experts in Democratic circles.CONSUMER FINANCIAL PROTECTION BUREAU (CFPB)The CFPB director is a critical role for progressives such as Senator Elizabeth Warren who believe the agency can help tackle wealth inequality and racial injustice. A June Supreme Court ruling handed Biden the power to fire Republican President Donald Trumps CFPB director, Kathy Kraninger, and many policy experts expect him to quickly replace her after he takes office on Jan. 20.Potential candidates for the role include Warrens protge, U.S. Representative Katie Porter; Federal Trade Commissioner Rohit Chopra; Bharat Ramamurti, Warrens former aide who sits on a pandemic congressional oversight panel; and Patrice Ficklin, the CFPBs fair lending director who has been at the agency since its inception in 2011.SECURITIES AND EXCHANGE COMMISSION (SEC)Biden is also expected to quickly staff up the SEC, which under Chair Jay Clayton, a Trump appointee, has pursued many rule changes opposed by Democrats and investor advocates.Clayton, whose role is based in Washington, has said he wants to return home to New York and is expected to resign before his term ends in June. That would position senior Democratic SEC Commissioner Allison Lee as acting chair until a new chair is sworn in.Progressives are keen on former Democratic SEC Commissioner Kara Stein for chair, although Rob Jackson, also a former Democratic commissioner who currently teaches at New York University School of Law, is preferred by moderates. Gensler is also a contender, the sources said.BANKING REGULATORSThere will be a handful of banking regulator roles to fill, with the first likely to be comptroller of the currency. That is because current Comptroller Brian Brooks is serving in an acting capacity, allowing Biden to replace him quickly. Amy Friend, formerly senior deputy comptroller and chief counsel at the agency under Obama, is seen as a leading candidate.Federal Deposit Insurance Corporation (FDIC) Chair Jelena McWilliams cannot be removed by Biden and has said she wants to serve out her term, which ends in 2023. But Biden can still tilt the agencys five-seat board, which passes rules via majority vote, by quickly appointing the heads of the CFPB and Office of the Comptroller of the Currency who always hold seats on the FDIC board too. Obama-era holdover and former FDIC Chair Martin Gruenberg already has a seat.If McWilliams resigns, Michael Barr, professor at the University of Michigan Law School and former Obama administration Treasury official is seen as a contender for that or another banking slot, as is Graham Steele, a director at the Stanford Graduate School of Business and former Federal Reserve staffer. Barr is advising the transition team.COMMODITY FUTURES TRADING COMMISSION (CFTC)Current Republican CFTC Chair Heath Tarbert is expected to resign, putting senior Democratic Commissioner Rostin Behnam in line for acting chair. But the sources said Dan Berkovitz, the other Democratic CFTC commissioner and formerly general counsel to Gensler when he led the agency, is the front-runner for the permanent chairmans role.FEDERAL HOUSING FINANCE AGENCY (FHFA)The FHFA is led by libertarian Mark Calabria who has said he is committed to overhauling the countrys housing finance market before his term ends in 2024. He is unlikely to resign, the sources said, and cannot currently be fired. That could change, however, pending a Supreme Court challenge to the agencys structure, which could find the director can be removed.If so, Biden, for whom affordable housing is a key policy, is likely to replace him. Potential contenders for his job include Eric Stein, who was special adviser to Democratic FHFA Director Mel Watt from 2014 to 2019, and Diane Yentel, chief executive of the National Low Income Housing Coalition. Stein is also advising the transition team.All those named above, or their representatives, declined to comment or did not respond to requests for comment, other than Ficklin. While she would not comment on whether she was in contention for a role, she said she would be honored to serve."}