{"text": "DUBLIN Thousands of infants died in Irish homes for unmarried mothers and their offspring run by the Catholic Church from the 1920s to the 1990s, an inquiry found on Tuesday, an appalling mortality rate that reflected brutal living conditions.There have been a series of reports into allegations of abuse and mistreatment by priests and members of religious orders. Here are some details of their findings:* FERNS REPORT INTO CLERICAL SEXUAL ABUSE, OCTOBER 2005- The first official inquiry into the activities of abusive priests - in the diocese of Ferns in County Wexford - detailed the Churchs handling of 100 allegations, including of rape, against 21 priests dating back to the mid-1960s. It found that for 20 years the bishop in charge of the rural diocese did not expel priests but simply transferred them to a different post.* COMMISSION TO INQUIRE INTO CHILD ABUSE, MAY 2009- The Commission to Inquire into Child Abuse issued a five-volume report which found that priests abused children between the 1930s and the 1970s in Catholic-run institutions. It described orphanages and industrial schools in 20th century Ireland as places of fear, neglect and endemic sexual abuse.Generations of priests, nuns and Christian Brothers - a Catholic religious order - beat, starved and, in some cases raped, children, the inquiry found. Some of the testimonies spoke of children scavenging for food from waste bins, being flogged, scalded and held under water.* MURPHY REPORT INTO CLERICAL SEXUAL ABUSE, NOVEMBER 2009:- The Murphy report investigated widespread child abuse by priests in the Dublin archdiocese between 1975 and 2004 that the Church obsessively concealed under a policy of dont ask, dont tell about abuse. The archdiocese was preoccupied with protecting the reputation of the Church over and above protecting childrens welfare, the report said.* CLOYNE REPORT INTO CLERICAL SEXUAL ABUSE, JULY 2011:- The report into the handling of sex abuse claims in the County Cork diocese of Cloyne showed that senior clergy were still trying to cover up abuse allegations almost until the present day, a decade after it introduced rules to protect minors, and that the Vatican was complicit in the cover-up.Then-Irish Prime Minister Enda Kenny accused the Holy See of obstructing investigations into sexual abuse by priests. The Vatican responded by recalling its ambassador to Ireland.* MAGDALENE LAUNDRIES REPORT, FEBRUARY 2013- An official report compiled by an inter-departmental government committee into Irelands notorious Magdalene Laundries found that 10,000 women and girls, some as young as nine, were put through an uncompromising regime of unpaid work from the foundation of the Irish state in 1922 until 1996.The report found that many of the women - some of whom were subjected to the harsh discipline of the institutions for simply becoming pregnant outside wedlock - were sent there by the Irish state.* MOTHER-AND-BABY HOME REPORT, JANUARY 2020- Following the 2014 discovery of an unmarked grave with the remains of hundreds of babies on the grounds of a former so-called mother-and-baby home, the Irish government ordered an investigation into the treatment of children at the church homes for unmarried mothers.The report, which covered 18 mother and baby homes where young pregnant women were hidden from society over decades, found that around 9,000 children died in all - a mortality rate of 15%."}