{"text": "New York Governor Andrew Cuomo is the latest of numerous major U.S. political figures in both parties to be faced with sexual misconduct accusations and calls to step down.Cuomo insisted on Friday that he would not resign despite calls for him to do so from a growing list of fellow New York Democrats unwilling to await the outcome of two investigations into the claims that seven women have made against him.Here is a list of some recent political figures who have faced accusations of sexual misconduct during their public lives. Reuters has not independently confirmed the accusations against Cuomo or against the other political figures.PRESIDENT JOE BIDENEven before he formally entered the Democratic presidential race, a former Nevada assemblywoman accused Joe Biden in March 2019 of inappropriately touching her and kissing her on the head at a campaign rally in 2014. Days later, a Connecticut woman said he touched her inappropriately, and rubbed noses with her at a 2009 political fundraiser.Biden responded with a video in which he pledged to be more mindful of respecting personal space. In March 2020, a former Senate staff assistant accused Biden of sexually assaulting her in 1993, which Biden and his campaign denied. Biden was elected president in November with a record 81.3 million votes.FORMER NEW YORK ATTORNEY GENERAL ERIC SCHNEIDERMANEric Schneiderman resigned as New York attorney general in May 2018 after New Yorker magazine reported that four woman with whom he had had romantic relationships or encounters alleged that he had abused them. Scheiderman contested the allegations, but stepped down within hours of their publication following a call from Cuomo to do so.FORMER SENATOR AL FRANKEN OF MINNESOTAAl Franken left his U.S. Senate seat in January 2018 after sexual misconduct accusations that prompted most of his Democratic colleagues to press him to resign. Franken, a former comedian from Minnesota, denied some of the allegations that he had groped and tried to kiss women without their consent, adding that Others I remember very differently. Calls for Frankens ouster came while a Senate Ethics Committee investigation was pending. A year and a half later, Franken said he regretted quitting and seven of his Democratic colleagues said they regretted having urged him to do so.FORMER ALABAMA SUPREME COURT CHIEF JUSTICE ROY MOOREAfter sexual misconduct allegations surfaced against Republican Roy Moore, he lost his bid to represent reliably conservative Alabama in the U.S. Senate in a special election in 2017 in a stunning upset to Democrat Doug Jones. Moore, a former chief justice of the state Supreme Court, was accused by several women of sexual assault or misconduct when they were teenagers and Moore was in his early 30s. He denied the accusations.FORMER U.S. REPRESENTATIVE JOHN CONYERSMichigan Democrat John Conyers stepped down in December 2017 as the longest serving member of the U.S. House of Representatives after several accusations of sexual misconduct. At the time, the House Ethics Committee opened an investigation into the allegations of several former female aides whose accusations included inappropriate touching and that he came to a meeting in only his underwear. Conyers denied the allegations.FORMER PRESIDENT DONALD TRUMPRepublican Donald Trump won the U.S. presidency in November 2016 in the face of several sexual misconduct allegations. By the end of his first year in office, Trump had piled up accusations of unwanted sexual advances from more than a dozen women, who said the incidents occurred long before he entered politics, many of them in the 1990s. Trump denied the accusations, and his White House accused the women of lying. The allegations included unwanted kissing and groping. Trump lost his re-election bid in 2020 but still received 74.2 million votes, the second-highest total ever.U.S. SUPREME COURT ASSOCIATE JUSTICE BRETT KAVANAUGHThe U.S. Senate confirmed Brett Kavanaugh as an associate justice of the Supreme Court in October 2018, notwithstanding a 36-year-old sexual assault allegation that became the subject of grueling testimony. University professor Christine Blasey Ford told the Senate Judiciary Committee that she feared Kavanaugh would rape and accidentally kill her during the alleged assault in 1982, when both were high school students in Maryland. Kavanaugh, who was nominated by Trump, unequivocally and categorically denied the allegation.FORMER NEW YORK GOVERNOR ELIOT SPITZEREliot Spitzer stepped down as New York governor in March 2008 after a report surfaced that he had patronized a prostitute ring. Spitzer, a Democrat, apologized for his private failings, but did not refer specifically to the report at the time. Months later, he admitted his involvement with the ring after a federal prosecutor declined to bring charges."}