{"text": "ADDIS ABABA Ethiopas Prime Minister Abiy Ahmed, who won the 2019 Nobel Peace Prize, has sent troops into northern Tigray state whose leaders he accuses of treason, triggering a conflict with implications around the Horn of Africa.Here are some of the knock-ons:HUMAN COSTAfricas second largest nation, with 115 million people, was already suffering from COVID-19, a locust plague and ethnic clashes that have uprooted hundreds of thousands in the last two years.Now the Tigray conflict has killed hundreds of combatants, sent more than 10,000 refugees fleeing to Sudan and interrupted aid operations for more than half a million people reliant on food aid and other emergency assistance. Non-essential United Nations staff and others have pulled out.HORN OF AFRICA SECURITYTigray borders both Sudan and Eritrea, which fought a 1998-2000 war with Ethiopia that killed tens of thousands in trench warfare and minefields. Despite the 2018 peace deal, Eritreas President Isaias Afwerki remains hostile to the TPLF and there are fears Asmara may become sucked in to back Abiy.Ethiopias military is the most effective in the Horn of Africa, which borders the Suez Canal, one of the worlds busiest shipping routes. It plays a big role in an African Union (AU) force combating al Qaeda-linked militants in Somalia, which may be affected if it has to divert resources to Tigray.FOREIGN INVESTMENTThe prime minister had pledged to liberalize Ethiopias tightly-controlled economy, which clocked nearly double-digit annual growth for years before coronavirus hit.The lucrative telecoms industry, in particular, was considered a big prize by multinational mobile companies, with licence issues planned for next year. A full-scale war would hinder the economy and the entry of foreign capital.Furthermore, Addis Ababa is an aviation hub for the region, with state-owned Ethiopian Airlines the continents most successful and fastest-growing airline.REFORMS AT RISKAfter taking office in 2018, Abiy was applauded for opening up a repressive political system, including freeing activists from jail and lifting bans on opposition political parties. Last year, he won his Nobel prize for a peace pact with Eritrea.But his democratic transition was already waning even before the push on Tigray, experts say, including jailing a prominent opposition member and restricting media.The Tigray Peoples Liberation Front (TPLF), which rules the region of more than 5 million people, accuses Abiy of persecuting them, while he says they attacked a military base and have rebelled against his national authority.In the past week, the government has arrested more than 150 people they accuse of being operatives for the Tigrayans, furthering the impression of an autocratic slide.ETHNIC FRACTURESWhile Abiys more open rule won him plaudits at first, it also uncorked frictions over ethnicity, land and resources that exploded into violence killing many hundreds of people.He is an Oromo, Ethiopias largest ethnic group, and his militancy against the Tigrayan leaders may encourage other groups to exploit the chaos to push for more autonomy. Redeployment of forces to Tigray could leave other regions exposed.ARMY SPLITSEthiopias national army is Africas largest and best-trained. But its best fighters are from Tigray and most of its hardware is also there, under the Northern Command.The military is already showing signs of splitting along ethnic lines. Some Tigrayan soldiers are refusing to fight their own people, while some military hardware and bases in the region are under control of the local leadership, experts say."}