{"text": "(Thomson Reuters Foundation) - Fallout from the coronavirus pandemic could lead to more children being recruited by armed groups, the United Nations warned on Friday as the world marked the International Day Against the Use of Child Soldiers - also known as Red Hand Day.Despite global efforts to end the use of child soldiers, girls and boys are still forced into combat - as fighters and in other roles - in at least 14 countries including the Democratic Republic of Congo, South Sudan and Somalia.Here are 10 facts about child soldiers:1. Tens of thousands of children are estimated to be recruited and used by armed groups. In 2019 alone, more than 7,740 children, some as young as six, were recruited and used as soldiers around the world, according to the United Nations. Most are recruited by non-state groups.2. The Democratic Republic of Congo, Somalia, Syria and Yemen currently have the largest number of child soldiers.3. Children are not only recruited by armed forces and groups as fighters. They are also used as informants, looters, messengers, spies and as domestic or sexual slaves.4. The forced recruitment of children for use in armed conflict is considered one of the worst forms of child labour, alongside abuses such as trafficking for sexual exploitation, according to the U.N. International Labour Organization (ILO).5. Not all child soldiers are boys holding guns. Many girls are also used by armed forces and groups across the globe, including in Afghanistan, Colombia, the Central African Republic, Nigeria, South Sudan, Syria and Yemen.6. The recruitment and use of children as soldiers is one of the six U.N.-defined violations affecting children in times of war. The list also includes: the killing and maiming of children, sexual violence against children, child abductions, attacks against schools or hospitals and the denial of humanitarian access for children.7. Many children are forcibly recruited and used by armed forces or groups but others are pushed into joining armed groups or forces due to socio-economic factors such as extreme poverty or a lack of access to education.8. Armed conflicts have damaging effects on children directly involved in violence and atrocities, according to UNICEF. Girls and boys exposed to the horrors of war are often left with long-lasting psychological scars and frequently need psychosocial support upon their release.9. If former child soldiers are not successfully reintegrated into society, there is a high risk of them being recruited again, according to Save The Children. Reintegration support programs are often underfunded, aid workers say.10. A total of 170 countries have ratified the Optional Protocol of the Convention on the Rights of the Child on the involvement of children in armed conflict (OPAC), which banned the participation of children under 18 in hostilities, but the practice continues in more than a dozen nations.Sources: Save The Children, World Vision, War Child, UNICEF, ILO, Office of the U.N. Special Representative for Children and Armed Conflict."}