{"text": "On Tuesday, Apple Inc will broadcast an event from its Cupertino, California campus and is widely expected to announce new iPhones that can tap 5G wireless data networks.Apple teased the events announcement with the tagline Hi, speed, a possible allusion to the far faster speeds that some variations of 5G can deliver.Apple is far from the first phone maker to launch 5G phones. Indeed, nearly all of its rivals such as Samsung Electronics Co Ltd have 5G models on store shelves already. Apples entrance to the fray is likely to bring fresh attention to the technology, even if U.S. carriers are still years away from rolling out the fastest versions.Heres a closer look at what analysts expect Apple to announce.A FLAGSHIP IPHONE FOR PROSStarting with last years iPhone models, Apple forked its iPhone 11 flagship devices into a Pro variant that packed more cameras and an upgraded screen starting at a $1,000 while the standard flagship cost $700. Analysts expect a similar split this year, with two iPhone Pro models, one of which could feature a larger screen than last years largest Max model. Some analysts expect a 3D camera to assist with features like augmented reality, similar to a sensor that Apple put into some iPad models earlier this year. Both iPhone Pro models are likely to have 5G features.A FLAGSHIP IPHONE FOR EVERYONE ELSEAs with the previous year, analysts expect a plain iPhone 12 model that will likely have cheaper screen technology and fewer cameras, but otherwise retain features from the top-of-the-line model such as new same A14 processor chips. Look for this model to come in only one size, arrive in the middle of Apples pricing range and be the phone Apple promotes as the right choice for most users.POCKETS OF THE WORLD, REJOICEApples iPhones have steadily grown in size since their debut in 2007, and the most recent flagships can strain even the roomiest pants pockets. Fans of phones that can be comfortably used with one hand are stuck with Apples iPhone SE, whose design harkens back to the 2014 iPhone 6 despite having a newer processor chip.Analysts this year expect Apple to show a smaller version of its flagship - perhaps called the iPhone 12 Mini - that will have features such as a screen with far smaller bezel but in form factor closer to the iPhone SE.This model is likely to be Apples lowest price flagship, but a major question is whether it will support the fastest variant of 5G called millimeter wave. Millimeter wave technology requires new radio chips that drive up the cost of phones - some Android phones with the feature cost more than their other 5G cousins - and take up space inside the phone.A SMALLER HOMEPODApple was a late comer to the smart speaker market, launching its HomePod in early 2018, well after rivals Amazon.com Inc and Alphabet Incs Google had come to dominate the market. Apple has not released an update to the HomePod since then, but analysts expect a smaller, cheaper speaker, possibly called the HomePod Mini, though it is unclear whether Apple will match the $40 price tag for some of Amazon and Googles smallest speakers."}