{"text": "The European Union on Wednesday entered into a deal with Pfizer and BioNTech for the supply of up to 300 million doses of their COVID-19 vaccine candidate, as it tries to catch up with the United States and United Kingdom to secure supplies of experimental vaccines.COUNTRY/REGION COMPANY DEAL TERM NO OF DOSES DELIVERY DATE STORY LINKU.S. Moderna $1.53 bln 100 mln + option for additional Unspecified400 mlnU.S. Pfizer and BioNTech $1.95 bln 100 mln + option for 500 mln By OctobermoreU.S. AstraZeneca $1.2 bln 300 mln Expected to begin inOctober 2020U.S. Novavax $1.6 bln 100 mln By January 2021U.S. Johnson & Johnson Over $1 bln 100 mln + 200 mln more under Unspecifiedsubsequent agreementU.S. Sanofi and GlaxoSmithKline $2.1 bln 100 mln + option for 500 mln UnspecifiedmoreEU AstraZeneca 750 mln euros for At least 300 mln + 100 mln By end-2020300 mln doses additionalEU Johnson & Johnson Undisclosed 200 mln + 200 mln additional UnspecifiedEU Sanofi and GlaxoSmithKline 324 mln euros 300 mln Unspecified($384 mln)EU Moderna In talks 80 mln UnspecifiedEU CureVac In talks 225 mln + option for 180 mln UnspecifiedadditionalEU BioNTech/ Pfizer Not specified Up to 300 mln End of 2020EU ReiThera In early talks Unspecified UnspecifiedItaly, AstraZeneca 750 mln euros 300 mln + 100 mln additional Not applicableGermany, the ($843 million)Netherlandsand FranceUK Johnson & Johnson Non-profit basis 30 mln + option for up to 22 Unspecifiedfor emergency use; mln moreoption to purchaseadditional dosesUK Novavax Not specified 60 mln, and plan for a By early 2021; phase 3late-stage trial in UK with trial in Q3govt supportUK Valneva Multi-million 60 mln + 40 mln additional Not Applicablepound investmentUK Sanofi, GlaxoSmithKline Financial terms Up to 60 mln Not ApplicableundisclosedUK Pfizer and BioNTech Financial terms 30 mln Not ApplicableundisclosedUK AstraZeneca 84 million pounds 100 mln 4 million in 2020. Earlier [nL8N2HQ6UO]($110.40 million) about 30 million doses wereexpected with initialdeliveries by Sept/Oct.2020Canada Pfizer and BioNTech Financial details Unspecified Through 2021undisclosedCanada Moderna Unspecified Unspecified UnspecifiedCanada Johnson & Johnson Unspecified Up to 38 mln UnspecifiedCanada AstraZeneca Unspecified Up to 20 mln UnspecifiedCanada Novavax Unspecified Up to 76 mln Q2 of 2021Japan Moderna Unspecified 50 mln doses, to be distributed H1 of 2021 [nL1N2HK0CP]by TakedaJapan Pfizer and BioNTech Financial details 120 mln H1 of 2021undisclosedJapan Johnson & Johnson In talks Not Applicable Not ApplicableJapan AstraZeneca Co-production with 120 mln First 30 mln expected byJCR Pharma, March 2021Daiichi SankyoBiotech and KMBiologicsJapan Novavax Co-production with 250 mln Production is yearlyTakeda estimateEurope, Latin Arcturus Therapeutics In talks Not Applicable Not ApplicableAmerica and Holdings IncSoutheast AsiaIsrael Arcturus Therapeutics $275 million Initial 1 mln Not ApplicableIsrael Moderna Financial terms Not Applicable Not ApplicableundisclosedIndonesia Sinovac Biotech Financial terms At least 40 mln By March 2021undisclosedChina AstraZeneca Produced by At least 200 mln By end 2021Shenzhen KangtaiBiologicalProductsThailand AstraZeneca Undisclosed Undisclosed Mid-year 2021Uzbekistan Russias sovereign fund, Undisclosed Up to 35 mln UnspecifiedRDIFEgypt RDIF Undisclosed 25 mln UnspecifiedIndia RDIF Undisclosed 100 mln Late 2020Nepal RDIF Undisclosed 25 mln UnspecifiedBrazil Gamaleya Research Institute Undisclosed Brazils Bahia state to get 50 To start in Novemberand RDIF mln and will conduct Phase 3clinical trialsBrazil AstraZeneca $356 mln to buy, 100 mln December/Januaryproduce vaccineMexico Gamaleya, RDIF Financial terms 32 mln November 2020unspecifiedMexico, AstraZeneca To produce vaccine 150 mln + up to 250 mln more First half of 2021Argentina for most of LatinAmericaQatar Moderna Unspecified Unspecified As soon as vaccine isapproved and releasedAustralia Novavax Unspecified 40 mln First half of 2021Argentina RDIF Unspecified 10 mln Between December andJanuary 2021Hungary RDIF Unspecified Unspecified To start importing smallquantities in December 2020for final testing andlicensing($1 = 0.8484 euros)($1 = 0.7609 pounds)"}