{"text": "DUBLIN Thousands of children died in homes for unmarried mothers and their offspring run by Irelands Catholic Church from the 1920s to the 1990s, an inquiry found on Tuesday.Following are some extracts from the report, in which the authors paraphrase the testimony of witnesses questioned.* Some witnesses described that while working on their hands and knees, they were verbally abused about their status as fallen women. Witnesses reported being called sinners, dirt, spawn of Satan, or worse.* A woman told the inquiry that she was 17 years old when she entered a mother and baby home in the early 1970s, finding it to be a mix of hospital, school and jail, full of grief and despair and of disturbing things, including, she said, women screaming, a woman who had lost her mind, and a room with small white coffins.*You were reminded every day that you were a sinner, said a witness who in the mid-1970s became pregnant when she was 17. Her job was to clean the parquet floors in the home. One nun would dirty the floor after I cleaned it. I would have to clean it again.* Another witness who said she had been placed in a home following a rape recalled a girl dying there during childbirth. This witness told the inquiry that the girls parents would not take her home, even in death...* Another witness was 14 when she became pregnant, knew nothing of what was happening to her body or about childbirth and, although in serious pain from the onset of labour, was given no pain relief. The nun with her during the process told her: Youve had your fun, this is payment. The baby weighed nearly 10 pounds.* One witness said she gave birth in a mother and baby home in the late 1960s. Having said to a nun in the home that her plan was to go to England with her baby to stay with her sister, the response to the witness was: That doesnt happen here. Youll do what we tell you and thats it. Youre not keeping that baby. Youre going nowhere with that baby. Youre going home and the baby is going somewhere else."}