{"text": "The International Panel for Pandemic Preparedness and Response issued its report on Wednesday into the global handling of the COVID-19 pandemic, calling for a new transparent global system to be set up for investigating disease outbreaks.The report, \"COVID-19: Make it the Last Pandemic\", is to be debated at the World Health Organization's annual ministerial assembly opening on May 24.  read more Here are the main findings and recommendations of the panel of independent experts led by former New Zealand Prime Minister Helen Clark and former Liberian President Ellen Johnson Sirleaf:FAILINGS1) The World Health Organization (WHO) should have declared the new coronavirus outbreak in China an international emergency earlier instead of waiting to Jan. 30, it said.2) The WHO's Emergency Committee did not recommend travel restrictions, due to WHO's International Health Regulations, which \"serve to constrain rather than facilitate rapid action\" and need revamping, it said.3) Governments failed to grasp that the Jan. 30 emergency declaration was WHO's \"loudest possible alarm\" and that it has no authority to declare a pandemic. Many countries failed to take strong measures until the WHO eventually did describe it as a pandemic on March 11, it said.RECOMMENDATIONSThe panel of independent experts called for setting up a new global system for surveillance of disease outbreaks that could spark a pandemic.WHO should be empowered to dispatch experts to investigate outbreaks at short notice, obtain pathogen samples and publish information without prior government approval.The WHO and World Trade Organization (WTO) should convene governments and drugmakers to hammer out an agreement on voluntary licensing and technology transfers to boost vaccine production, the report said.If that fails to happen within three months, a waiver of intellectual property rights under the WTO's Agreement on Trade-Related Aspects of Intellectual Property Rights should come into force immediately, it said.A new funding model should be set up to halt the system of earmarking funds in the U.N. agency's budget and to increase member states' fees.The experts called for setting up a Global Health Threats Council, to be led at the head of state and government level, to maintain political commitment to pandemic preparedness.An international pandemic financing facility should be established to mobilise $5 billion to $10 billion annually for pandemic preparedness, they said."}