{"text": "HONG KONG A group of Hong Kong families on Saturday demanded the urgent return of their activist relatives detained last month by mainland Chinese authorities as they tried to flee the city by boat to Taiwan.Relatives of six of the 12 detained activists donned masks and hats to shield their identities as they made their first public appeal for help and information on their plight, supported by several local politicians.Some sobbed and wept as they pleaded for those detained to be allowed to consult lawyers appointed by the families and not the Chinese government and to be allowed to call their relatives in Hong Kong.I cant imagine whats the worst case scenario, said a woman surnamed Li, whose son Li Tsz-yin, 29, is among those being held in a detention centre in the southern city of Shenzhen.These 20 days were very tough for us, we didnt know whether or not hes safe or alive. she said.They said they still had no information on the charges their relatives faced, and the Hong Kong government had given no concrete assistance.A boy aged 16 is the youngest being held.Several need medication, the relatives said. The brother of one detainee, surnamed Tang, said he had no way of getting asthma and skin allergy prescriptions to his sibling.A spokesperson for the Immigration Department said staff were assisting in the case and were in regular contact with the families.The local governments office in Guangdong had learned from the authorities that the 12 Hong Kong people are currently in good physical condition and have hired representatives from Mainland lawyers.The Chinese Coast Guard Bureau posted on its social media site on Aug. 27 that it had arrested at least 10 people on Aug. 23 after intercepting a boat off the coast of the southern province of Guangdong.Hong Kong media, citing unidentified sources, said the 12 were headed to Taiwan to apply for political asylum. Their arrests come as local activists and politicians fear a worsening clamp-down across the city as a sweeping new national security law imposed by Beijing in July takes full effect.The law means Hong Kong people can face mainland courts in serious national security cases - a prospect that has alarmed many across the former British colony.Hong Kong has its own independent legal system and rule-of-law traditions vastly different from mainland China, where the justice system is ultimately controlled by the Communist Party.Hours before the families appearance, U.S. Secretary of State Mike Pompeo said the United States was deeply concerned about the activists. He noted they had been denied to access to lawyers and local authorities had not provided any information on their welfare or the charges against them.Hong Kong Chief Executive Carrie Lam said earlier this week that if they had been arrested for breaking mainland law then they have to be dealt with according to the mainland laws."}