{"text": "Sir Tim Berners-Lee, the British computer scientist who was knighted for inventing the internet navigation system known as the World Wide Web, wants to re-make cyberspace once again.With a new startup called Inrupt, Berners-Lee aims to fix some of the problems that have handicapped the so-called open web in an age of huge, closed platforms such as Facebook.Building on ideas developed by an open-source software project called Solid, Inrupt promises a web where people can use a single sign-on for any service and personal data is stored in pods, or personal online data stores, controlled by the user.People are fed up with the lack of controls, the silos, said Berners-Lee, co-founder and chief technology officer of Inrupt, in an interview at the Reuters Next conference. This new, updated web, Berners-Lee said, will enable the kind of person-to-person sharing and collaboration that has helped make the big social media services so successful while leaving the user in control.John Bruce, a veteran technology executive who is CEO of Inrupt, said the company had signed up Britains National Health Service, the BBC and the government of Flanders in Belgium as pilot customers, and hoped to announce many more by April.Inrupts investors include Hearst Ventures, Octopus Ventures and Akamai, an internet content delivery firm. Bruce declined to say how much has been raised.Bruce said the NHS pilot was addressing the long-standing problem of incompatible medical records. With Inrupt, he said, the NHS could give everyone a holistic presentation of your medical history, with various doctors and other service providers able to update that record even as it remains in the users control.A key aim for Inrupt is to get software developers to write programs for the platform. Inrupt, like the original web, is at its core mostly a set of protocols for how machines talk to one another, meaning that specific applications bring it to life.The use cases are so broad, its like a do-over for the web, Berners-Lee said.For more coverage from the Reuters Next conference, please click here here or.To watch Reuters Next live, visit here"}