{"text": "The U.S. economic recovery will be slow until the coronavirus is under control, and Americans will have to manage life with the virus for at least the next several months, three Federal Reserve policymakers said on Wednesday.After rebounding strongly in May and June, economic activity began to trail off in July, when an increase in infections led to new restrictions in some states and contributed to a slowdown in spending. Employment growth also slowed considerably last month, and the expiration of enhanced unemployment benefits has raised concerns that jobless Americans could start to fall behind on rent and other expenses.Consumer spending will probably remain weak as people avoid activities that require high levels of social interaction for health reasons, Boston Fed President Eric Rosengren said during an online event organized by the South Shore Chamber of Commerce in Massachusetts.The San Francisco Fed president, Mary Daly, warned about the impact of the expiration of the supplemental $600 weekly jobless benefit.It creates the potential for a hole, a little bit of a hole, in consumer demand and consumer spending, Daly said. We have evidence that suggests they were spending those resources to pay rent or to buy food or to buy other consumer goods.Despite concerns from some employers that the benefits were discouraging people from returning to work, Daly, in a webcast discussion with the Economic Club of Las Vegas, said there was little evidence to support that claim.INCONSISTENT EFFORTSBoth Rosengren and Dallas Fed President Robert Kaplan warned that Americans will need to find ways to adapt to the risks of the virus, until a vaccine becomes available.Kaplan, in a webcast event with the Lubbock Chamber of Commerce in Texas, said Americans need to learn to live with the virus, using safety measures such as masks so the economy can remain open.Daly said she expects the economic rebound will be slow and gradual, depending on the virus, and she does not expect a V-shaped recovery.Rosengren said the United States had done a poor job of containing the virus when compared to parts of Europe, and that the blunders were affecting the recovery. He pointed to states that saw only a short-lived increase in economic activity after lifting restrictions too quickly while states that imposed longer shutdowns earlier are now benefiting from better health outcomes and more robust spending.Limited or inconsistent efforts by states to control the virus based on public health guidance are not only placing citizens at unnecessary risk of severe illness and possible death  but are also likely to prolong the economic downturn, Rosengren said.Kaplan said he expects the U.S. unemployment rate to remain elevated at 9% at the end of the year, but said it could be lower if businesses and consumers take steps to control the spread of the virus. The unemployment rate in July was 10.2%.If we dont follow that, while people may feel freer, the economy will grow slower, Kaplan said.Both Daly and Rosengren said that participation in the Feds Main Street Lending Program, which is meant to carry small and medium-sized businesses through the crisis, could grow.Rosengren said low early use of the program was not a sign of failure, and more businesses may turn to the facility in the fall if the economy worsens.Asked about the rise in U.S. government debt, Rosengren said he supports strong fiscal stimulus, but said it must be paired with efforts to contain the virus.If you want to actually make sure that the debt doesnt explode, you have to make sure that we get the pandemic under control, he said."}