{"text": "(Reuters) -The U.S. economy could see a significant rebound this year thanks to accommodative monetary and fiscal policy, but the labor market still has much room for improvement, Boston Federal Reserve Bank President Eric Rosengren said on Monday.With labor-market slack still significant, and inflation still below the Federal Reserves 2 percent target, my perspective is that the current highly accommodative stance of monetary policy is appropriate, Rosengren said during a virtual discussion with business leaders.Coronavirus vaccines ability to successfully prevent the spread of new variants of the virus would also be important, he said. Assuming virus variants do not become especially problematic, we should see an unusually strong post-recession recovery, he said.Under a new framework adopted last year, Fed officials will be patient and leave rates near zero until inflation materializes - no longer raising rates in anticipation of higher inflation when the unemployment rate is low, Rosengren said.Policymakers are trying to avoid the sluggish recovery that took place after the global financial crisis, and it is possible that the unemployment rate could drop to pre-pandemic levels of about 4% within the next two years, Rosengren said. Some employers will need to juice up their benefits packages or increase pay to attract new workers as business picks up, he said.Were likely to a be facing a tight labor market down the road, he said.However, Rosengren said it is unlikely the economy will overheat this year, and said the Fed has the tools to counter any surprise jumps in inflation.While they focus on the recovery, policymakers should also be wary of risks lurking in financial markets, Rosengren said. For example, some money market funds faced liquidity problems last year after some investors pulled their money quickly, he said.Solutions could include requiring some funds to invest more in government-backed debt. It could also help to develop a system for buying and selling Treasury securities that is not as reliant on broker dealers, which can face strain when large volumes of Treasury securities are sold."}