{"text": "Alibaba (9988.HK) is entering a long probation. A $2.8 billion fine for preventing sellers from using rival sites is a light penalty for the Chinese e-commerce titans abuse of its market dominance. But orders to spearhead healthy competition raise the prospect of further changes that could cause serious damage. Coupled with the squashing of the initial public offering of its financial affiliate Ant, Beijing is coming down hard on technology giants.Boss Daniel Zhang and top executives on Monday assured investors that the company's regulatory woes are behind it, sending its Hong Kong shares up 5%. After a four-month long investigation, the State Administration for Market Regulation concluded that Alibaba's annual revenue accounted for over 70% of the top 10 e-retail platforms between 2015 and 2019 and called out its punishment of merchants for doing business with rivals.The immediate financial penalty is a manageable cost of doing business against the $5 billion of free cash flow Alibaba is forecast to generate in the three months to March, per Refinitiv data. SAMR is claiming just 4% of Alibabas 2019 domestic revenue, half the proportion than in 2015 when it fined U.S. chipmaker Qualcomm (QCOM.O) $975 million, and well short of the maximum 10% permitted.Yet it leaves a sharp sword hanging over Alibaba. The company will have to submit annual self-assessments to authorities for the next three years. And though the probe was focused narrowly on forcing merchants to transact exclusively, regulators have asked Alibaba to make \"thorough rectifications\" based on sweeping guidelines ranging from leading the development of healthy competition and innovation for the entire industry to opening up its data.The lack of detail is ominous: Alibaba uses data in its core business to help sellers reach more customers as well as in newer ventures like logistics and cloud computing. Vague regulatory demands put it at the mercy of the whims of officials.This comes as e-commerce upstarts led by Pinduoduo (PDD.O) chip away at Alibabas market share and as a shift to holding more inventory and logistics squeezes margins. Total annualised shareholder returns are barely one-third of its top rival JD.com (9618.HK) over a three-year period. A record fine sends a message that China is ready to have a bigger say in how powerful private companies are run.On Twitter https://twitter.com/mak_robynCONTEXT NEWS- Alibaba said on April 12 that it will introduce measures to lower entry barriers and business costs faced by merchants on e-commerce platforms.- China's State Administration for Market Regulation on April 10 announced it had fined the e-commerce company 18 billion yuan ($2.8 billion) after an anti-monopoly investigation found Alibaba had abused its dominant market position since 2015.- SAMR concluded Alibaba restricted competition by preventing its merchants from using other online e-commerce platforms, a practice known as \"choose one of two\". That hindered the free circulation of goods, infringed on the legal rights of merchants and harmed consumer interests, the regulator said.- In addition to the fine, Alibaba has been ordered to make \"thorough rectifications\" to strengthen internal compliance and protect consumer rights. The company is required to submit self-assessment reports for three years.- Alibaba said in a letter published on its corporate blog that it accepts \"the penalty with sincerity and will ensure our compliance with determination\".- For previous columns by the author, Reuters customers can click on"}