{"text": "NEW YORK A former Amazon.com Inc worker who protested conditions at his New York City fulfillment center sued the retailer on Thursday, accusing it of discrimination for firing him and for putting Black and Hispanic workers at heightened risk of contracting COVID-19.In a proposed class action filed in Brooklyn federal court, Christian Smalls alleged Amazon failed to provide needed protective gear to its predominantly minority workforce, subjecting them to inferior working conditions than its mainly white managers.Citing a leaked memo from Amazons general counsel to Chief Executive Jeff Bezos, Smalls also said Amazon fired him after concluding that as a Black man he was a weak spokesman for workers.He also said Amazon tried to drum up public support by making him the face of workers criticizing its pandemic response.The complaint seeks unspecified damages for Black and Hispanic workers at the Staten Island facility.Amazon fired Smalls on March 30, saying he joined a protest at the Staten Island facility despite being on paid quarantine, after had having close contact with someone diagnosed with COVID-19.It fired at least three other workers critical of its pandemic response in April, citing various alleged workplace violations.New York Attorney General Letitia James wrote to Amazon later in April, expressing serious concern it was trying to silence critics of its health and safety measures.In a statement on Thursday, Amazon spokeswoman Lisa Levandowski said Amazons focus on customers is central to our work in diversity and inclusion, and that Smalls was fired for putting others health and safety at risk.The Seattle-based company has benefited from the pandemic as consumers shopped online more often.Amazon has said it expects to invest $10 billion this year on COVID-19 initiatives to deliver products and keep employees safe, including by distributing masks to workers and employing disinfectant spraying and temperature checks worldwide.On Oct. 1, Amazon said 19,816 of its 1.37 million front-line U.S. workers between Mar. 1 and Sept. 19 had tested positive or were presumed positive for the coronavirus.It said that was 42% fewer than if the infection rate had mirrored the rate for the general population.Last week, a Brooklyn federal judge dismissed a separate lawsuit accusing Amazon of creating a public nuisance at the Staten Island facility.The case is Smalls v Amazon Inc, U.S. District Court, Eastern District of New York, No. 20-05492."}