{"text": "ABUJA (Thomson Reuters Foundation) - Nigerias Ngozi Okonjo-Iweala  an elite economist who has confronted corruption and kidnappers at home and risen to the top ranks of the World Bank, is poised to become the first woman and first African in charge of policing global trade.Backed by U.S. President Joe Biden to lead the World Trade Organization (WTO), the 66-year-old Harvard graduate was dubbed troublemaker by friends and foes alike in Nigeria for her vigour in championing the poor and fighting the good fight.It is a nickname the former finance minister was fond of.It was a badge of honour. If I was regarded as ... trouble to the establishment because of my desire to clean up our public finances and work for a better life for Nigerians, then so be it, she wrote in her book Reforming the Unreformable.Daughter of a traditional king, Okonjo-Iweala saw her mother kidnapped - she had dared to call out corruption in the Nigerian oil industry - then stared down her captors. They blinked first, though full details of the release never emerged.Okonjo-Iweala also received threatening phone calls and ably outmanoeuvred political foes seeking her downfall.All good credentials for a woman charged with steering global trade back on track and closing the widening chasms - be it between China and the United States or rich and poor nations - at a time when economic ground rules are up for grabs.Okonjo-Iweala won White House backing to lead the embattled WTO last week, lifting a block imposed by former President Donald Trump after a WTO selection panel recommended her as chief in October.WE HAD TO FIX EVERYTHINGBorn in the southern Nigeria town of Ogwashi-Ukwu, Okonjo-Iweala spent most of her childhood with her grandmother while her parents were studying in the United States, and sometimes recalls the hardships she experienced during her early years.She left home as a teenager in 1973 to study economics at Harvard and in 1981 earned her PhD in regional economics and development from the Massachusetts Institute of Technology, eventually becoming a U.S. citizen in 2019.In 2007, she founded NOI Polls, Nigerias first indigenous opinion-research group, which partners with Gallup.Following in her footsteps at Harvard, her daughter and three sons all graduated from the Ivy League school. Her husband is a neurosurgeon based in Washington.Much of Okonjo-Iwealas career has been spent at the World Bank, where she rose to the No. 2 spot after returning to Nigeria to serve as the countrys first female finance minister under former President Olusegun Obasanjo.It seemed in those days as if we had to fix everything at once, Okonjo-Iweala wrote in her book about her 2003-2006 spell as Obasanjos finance chief.We needed to redress fundamental inequality, pervasive corruption, and power struggles that were undermining the Nigerian society, she said.Aides recall her endless energy and dedication.Her sense of duty is astonishing, said Chiogor Constance Ikokwu, a media adviser to Okonjo-Iweala during her second stint as finance minister, under former President Goodluck Jonathan from 2011 to 2015.Once, we travelled outside the country for an assignment. She was unwell. She was in pain at the hotel.To my amazement, Madame Minister pulled through. Not only did she make it to the function, her performance was dazzling. No one at the event had an inkling that she was ill an hour prior, she told the Thomson Reuters Foundation.Supporters hope Okonjo-Iweala can reinvigorate the leaderless 164-member WTO, which observers say is facing the deepest crisis in its 25-year history.It has not clinched a major multilateral trade deal in years and failed to hit a 2020 deadline on ending subsidies for overfishing.Okonjo-Iweala, who said last week she was looking forward to the conclusion of the leadership race and moving ahead with needed reforms, has previously stressed the need for the WTO to play a role in helping poorer countries with COVID-19 vaccines.Trade can contribute to public health - seeing that connection, invoking those (WTO) rules, actively discussing COVID-19 issues and how the WTO can help ... For me, that would be a priority, she told Reuters in September."}