{"text": "The first shots in a massive U.S. COVID-19 vaccine campaign will be administered as early as Monday, with Pfizer Inc and partners aiming to start shipments across the hard-hit country on Sunday, an Army general organizing the rollout said.Healthcare workers and elderly people in long-term care facilities are expected to be the main recipients of the first wave of 2.9 million shots this month, with healthcare worker inoculations as soon as Monday and nursing home residents by the end of next week, U.S. Army General Gustave Perna said on a Saturday press call.Despite months of preparation, distributing and administering the vaccine to as many as 330 million recipients poses a major logistical challenge, he said. The vaccine has complex shipping requirements and must be stored at -70 Celsius.We have a lot of work to do. We are not taking a victory lap. We know road ahead of us will be tough, Perna said.Pfizers vaccine was authorized for use by U.S. regulators on Friday. Cases are surging in the United States, with thousands of deaths per day, while hospital intensive care units across the country are nearing capacity. More than 295,000 Americans have died of COVID-19.Doses of the vaccine from U.S.-based Pfizer and German partner BioNTech will be delivered to 145 locations around the country on Monday, Perna said.The remainder of the 636 delivery locations selected by U.S. states and territories will receive doses on Tuesday and Wednesday, he said, adding that every week going forward Pfizer will have more doses ready for distribution and administration.Within three weeks, the vaccine program known as Operation Warp Speed should be able to get Pfizers shots to any healthcare facility in the country, Perna said.Pfizer is working with logistics companies United Parcel Service Inc and FedEx Corp to distribute the vaccines. They must coordinate deliveries of doses with shipments of other products needed to store and administer vaccines, such as syringes, dry ice, and protective equipment for healthcare workers.The final mile is going to be the most difficult. Once it hits the hospital or nursing homes, they also have to keep the vaccine under temperature control, said Cathy Morrow Roberson, a logistics consultant and former UPS analyst.This massive clock is ticking, there is no room for error, she added.More U.S. residents will be eligible in January, when those in the highest priority populations are expected to have had an opportunity to receive a vaccine.With distribution imminent, top regulators sought to reassure Americans that the record fast pace was warranted and had not sacrificed safety.We worked quickly based on the urgency of this pandemic, not because of any other external pressure, U.S. Food and Drug Administration Commissioner Stephen Hahn said during a press conference earlier in the day.The United States on Friday evening granted an emergency use authorization for the vaccine for people aged 16 and older. The immunization was 95% effective in preventing COVID-19 in a late-stage trial.It is the first COVID-19 vaccine authorized in the United States. Britain, Canada and three other countries have already authorized the vaccine.The Trump administration has poured billions of dollars into developing vaccines and will manage the distribution and allocation to states. Authorities have said general availability of the vaccine is expected by April.An advisory group to the U.S. Centers for Disease Control and Prevention voted Saturday to recommend the vaccine for patients 16 and over.The FDA said the vaccine is safe for most Americans with allergies despite reports of severe adverse reactions in the UK in two patients who had a history of serious allergies."}