{"text": "The Federal Communications Commission (FCC) on Friday designated five Chinese companies as posing a threat to national security under a 2019 law aimed at protecting U.S. communications networks.The FCC said the companies included Huawei Technologies Co (HWT.UL), ZTE Corp (000063.SZ), Hytera Communications Corp (002583.SZ), Hangzhou Hikvision Digital Technology Co (002415.SZ) and Zhejiang Dahua Technology Co (002236.SZ).A 2019 law requires the FCC to identify companies producing telecommunications equipment and services \"that have been found to pose an unacceptable risk to U.S. national security.\"Acting FCC Chairwoman Jessica Rosenworcel said in a statement: \"This list provides meaningful guidance that will ensure that as next-generation networks are built across the country, they do not repeat the mistakes of the past or use equipment or services that will pose a threat to U.S. national security or the security and safety of Americans.\" The 2019 law used criteria from a defense authorization bill that previously identified the five Chinese companies. In August 2020, the U.S. government issued regulations barring agencies from buying goods or services from any of the five Chinese companies.In 2019, the United States placed Huawei, Hikvision and other firms on its economic blacklist.    Last year, the FCC designated Huawei and ZTE as a national security threat to communications networks - a declaration barring U.S. firms from tapping an $8.3 billion government fund to purchase equipment from the companies.In February, Huawei challenged the declaration in a petition filed with the Fifth U.S. Circuit Court of Appeals. Huawei declined to comment on Friday on the new FCC designation.Hikvision said late on Friday it strongly opposed the FCC decision \"and is weighing all options on how to best address this unsubstantiated designation. Hikvision does not belong on a list for next-generation networks.\"      The other three companies did not comment or could not be reached for comment.The FCC in December finalized rules requiring carriers with ZTE or Huawei equipment to \"rip and replace\" that equipment. It created a reimbursement program for that effort, and U.S. lawmakers in December approved $1.9 billion to fund the program."}