{"text": "NEW YORK, June 12 (LPC) - US Collateralized Loan Obligation (CLO) managers are adding fixed-rate tranches to attract investors after issuance fell more than 50% amid the coronavirus pandemic.According to LPC Collateral data, three of the six US CLOs issued last week, including funds from Sound Point Capital Management and Onex Credit, feature a fixed-rate tranche.Adding the fixed-rate tranche, as well as issuing smaller deals with shorter reinvestment periods or ensuring funds are compliant with European risk-retention rules, are steps managers have taken to rekindle interest in the asset class as volumes dropped.New CLO issuance ground to a halt as markets faltered as CLO managers faced numerous downgrades on the loans they buy amid the economic fallout of the Covid-19 outbreak.There has been just over US$25bn of US CLO issued this year through the end of May, down almost 55% from the same period in 2019, according to LPC Collateral data.When there are periods of volatility and the CLO market is in the process of reopening, managers and arrangers will do everything they can to cast as wide a net as possible to draw in interest from as many investors as possible, said John Wright, co-head of North American liquid and structured credit at Bain Capital Credit, which manages and invests in CLOs.CLOs are the biggest buyers in the US$1.2trn US leveraged loan market, which companies including American Airlines and Hilton Worldwide rely on for financing for daily operations and to back mergers and acquisitions. Fewer CLOs can limit financing or make funding more expensive for borrowers.FIXED-RATE ALLUREThe leveraged loans CLOs buy for their funds pay interest of a coupon plus the London interbank offered rate (Libor), a floating-rate benchmark. The funds use the interest payments received from their investment companies to then pay their own investors.Adding fixed-rate tranches can attract new investors or entice holders to purchase more of the fund beyond the floating-rate tranches. Only the better-rated tranches often pay fixed rates.One way you can draw in different pockets of interest is having fixed-rate debt, which may be different demand from the same investors, Wright said. The market is in the process of reopening, and managers and arrangers are willing to entertain options that when the market is strong, they may not be as interested in seeking incremental demand.Insurance companies need to match their liability outflows  they are funding at fixed rates  so they typically exhibit strong demand for these types of tranches, said Jason Merrill, an investment specialist at Penn Mutual Asset Management.It comes down to asset liability management for insurance companies, he said. If you have more certainty surrounding the magnitude of future cash flows, you can match those with higher confidence against future liability cash outflows. This increased certainty becomes especially important in a volatile rate environment.Fixed-rate investments can help avoid potential issues with future rate moves, including changes in Libor, which is set to be phased out by the end of 2021.Last week Sound Point, Onex, and ZAIS Group all priced CLOs with fixed-rate tranches.Sound Point priced its Sound Point CLO XXVI with a US$30m Triple A tranche with a fixed coupon of 2.231% and a US$5m AA slice with a coupon of 2.9782%, according to LPC Collateral data. Onex raised its OCP CLO 2020-19 with a US$18m Triple A slice with a coupon of 2.10%, and ZAIS priced its ZAIS CLO 15 deal with a US$10m AA tranche at a coupon of 4.08%.Company spokespeople did not respond to requests for comment by press time.The CLO market will continue to look at options to draw investors.Whenever you enter a deal, you are trying to be creative for your client and get them the best possible deal, said Chris Heron, co-head of CLO origination at RBC Capital Markets. Managers want to connect with investors on multiple fronts."}