{"text": "NEW YORK A Florida private equity manager has been indicted on charges he lied about his investors in order to obtain a $95 million bank loan for his $500 million fund, federal prosecutors in Manhattan said on Wednesday.Elliot Smerling, 52, of Lake Worth, Florida, was charged with wire fraud and bank fraud, each carrying a maximum 30-year prison term, as well as aggravated identity theft.The indictment came after Silicon Valley Bank sued Smerling on March 24, saying he fraudulently obtained the loan after saying he had backing from prominent investors like billionaire hedge fund manager and New York Mets owner Steven Cohen.David Kubiliun, a lawyer for Smerling, declined to comment.According to court papers, Smerling, a principal at JES Global Capital, falsely claimed in his loan application that New York University had agreed to invest $45 million with him, while an unnamed investment manager would invest $40 million.Prosecutors said Smerling also submitted a forged audit letter and falsified bank records for a wire transfer.Silicon Valley Bank, based in Santa Clara, California, said Smerling drew the $95 million from a $150 million credit line it provided, and had yet to repay $80 million.It said Smerling obtained the credit line after providing subscription agreements from investors who had purportedly committed $500 million to his fund, but that the documents were inauthentic, inaccurate or forged.Among the alleged investors were three banks and endowment funds for NYU and the University of Miami, as well as Cohen, Silicon Valley Bank said in its civil complaint.Smerling was arrested in February, and a federal judge in West Palm Beach, Florida on March 3 ordered him jailed.The judge said Smerling had significant assets including two Florida homes and luxury vehicles from Audi, Cadillac, Ferrari, Mercedes-Benz and Porsche, among others.He also said Smerlings wife was a Brazilian-U.S. citizen, and that if Smerling fled to Brazil there would be no viable way to extradite him.The criminal case is U.S. v Smerling, U.S. District Court, Southern District of New York, No. 21-mj-02223. The bank case is Silicon Valley Bank v. JES Global Capital GP III et al in the same court, No. 21-02552."}