{"text": "Florida property insurers are jacking up rates by double-digit percentages, blaming the hikes on lingering damage from past hurricanes, a wave of litigation, and a law that encourages lawyers to sue by allowing courts to award them big fees. The rate increases in Florida, the third-largest property insurance market among U.S. states, are the highest in memory, according to some insurance agents and residents. One danger, they say, is that the new rates could make owning a home in Florida unaffordable.\"I was flabbergasted,\" said Karlos Horn, a 35-year-old law student who owns a four-bedroom, single-family home in Hendry County, Florida. He said his premium doubled to $200 per month last August.That is equivalent to half of his $400 mortgage payment and the largest increase in his five years as an owner.Florida's property insurance market, which collected $56.6 billion in premiums during 2019, is unique and covers complex risks including devastating hurricanes and the impact of climate change. Many insurers left the state after suffering big losses from hurricanes Katrina and Wilma in 2005, leaving about 60 small and mid-sized firms underwriting property policies there today.Although there were no major weather events last year, some insurers are still grappling with claims from Hurricane Irma in 2017, said Logan McFaddin, an American Property Casualty Insurance Association executive who specializes in Florida.They are also facing what McFaddin described as out of control litigation in Florida, partly because of a law that can require insurers to pay attorneys excessive fees in those cases. The practice has spurred a cottage industry of contractors and lawyers who sue insurers to replace a whole roof when only a few tiles are damaged, insurers say.Other less dramatic problems, such as leaky pipes, happen at an \"abnormally high\" frequency in Florida, often causing severe damage, including mold, consistently gnawing at profits, said Charles Williamson, chief executive officer of Vault, a Florida-based insurance exchange for wealthy individuals. Insurers are also passing along to consumers the cost of hefty rate hikes for their own coverage, known as reinsurance, which kicks in after insurers pay a set amount of claims.INSURER OF LAST RESORTFlorida's domestic property insurers reported a more than $1 billion underwriting loss for the first three quarters of 2020 and almost $500 million in negative net income, according to the Florida Office of Insurance Regulation.\"Insurance carriers understand that their role in our marketplace is to pay claims,\" Florida Insurance Commissioner David Altmaier told Reuters. \"The challenge is when those claims are so much more expensive than they expect, it creates uncertainty, it creates turmoil - and that has to be addressed.\"Florida insurers requested 105 rate increases during the first ten months of 2020, Altmaier said. More than half of the increases that regulators approved were greater than 10%.Last month, Altmaier testified before Florida lawmakers, including his views on roofing litigation. \"We need to really spend some time on this ... coming up with ways that we might be able to mitigate this kind of activity,\" he said.Lee Gorodetsky, an insurance agent in Fort Lauderdale, Florida, said he cannot recall such steep rate hikes during his 34-year career. \"The last two years have been the worst we've seen,\" he said.As prices rise, more consumers are turning to Citizens Property Insurance Corp, Florida's insurer of last resort, which takes on high-risk customers who cannot obtain other insurance or must pay extremely high rates.Citizens issued 545,000 policies as of Feb. 5, a 23% increase from a year ago, and it expects the number to grow to about 700,000 by year-end, a spokesman said. The growth signals an unhealthy broader market by showing that typical coverage is not as widely available, industry experts said. Insurers are hoping Floridas state government will approve proposed legislation that would curb the elevated litigation costs they have seen in recent years. The bill, if passed, would add to other reforms enacted in 2019.Measures would include limiting the fees insurers must pay lawyers in claims disputes, shortening time frames for filing claims and capping payouts for roof replacements.However, the bill might also harm homeowners' ability to pursue legitimate claims, lawyers said. That would unfairly favor insurers, one lawyer said.\"It's a great business model that insurers can collect premiums and not get sued when they don't pay somebody right away everything that's owed,\" said Tampa lawyer Chip Merlin, who represents policyholders. \"It doesn't take a rocket scientist to figure out that that's good for the insurance industry.\""}