{"text": "Feb 12 Vaccine makers are shoring up their supply of a critical raw material in messenger RNA vaccines: the lipid molecules that help deliver the genetic RNA material into cells.Manufacturers are under pressure to increase production of COVID-19 vaccines as infections from the pandemic approach 110 million people.But the supply effort has gotten off to a slow start, and vaccine makers still face multiple potential bottlenecks, including a tight supply of lipids used in mRNA vaccines from Pfizer Inc and German partner BioNTech, as well as Moderna Inc.BioNTech has signed two new deals with manufacturers to produce lipids at scale, while Modernas supplier told Reuters it has recently doubled its monthly production of the key ingredients.Lipids are organic compounds that are insoluble in water. Both vaccines use a blend of lipids to coat and protect pieces of mRNA, which enter the cells of an inoculated person and prompt them to produce proteins that teach the immune system to fight the virus.In theory, lipids should be easy to produce at large scale, because only a small amount is required for each dose, and most are small molecules that are not complex to synthesize, experts who developed the technology told Reuters. Other types of lipid are widely used in cosmetics and some other pharmaceuticals.But to produce billions of new COVID-19 vaccines for the world, vaccine makers have to be willing to share their proprietary formulas with specialized contract manufacturers.Those contract manufacturers must build new production lines and prove that they meet regulatory standards for safety. The process takes months, even for experienced manufacturers.The challenge is highlighted by new supply agreements between BioNTech and two manufacturers: Germanys Merck KGaA and Evonik.Pfizer, which along with BioNTech aims to produce 2 billion doses of its vaccine this year, is supplied by British-based Croda.Canadas Acuitas has licensed its proprietary lipids to BioNTech, so Evonik can manufacture them on BioNTechs behalf, Evonik told Reuters. Evonik expects to begin shipments in the second half of the year, while Merck has said it will boost deliveries by year-end.As the pandemic progresses there is an increasing appreciation about the complex nature of lipid synthesis, Merck said in an emailed statement.Officials for Pfizer, BioNTech and Moderna did not immediately comment on the status of their lipid supply. BioNTechs chief executive, Ugur Sahin, told Reuters in December that the lipid supply was an important raw materials issue, one of several the company expected to be able to address.Moderna is aiming to make at least 600 million doses of its vaccine in 2021. The companys lipids supplier, Germanys CordenPharma, scaled up its manufacturing for the vaccine by 50 times last summer.More recently, CordenPharma modified its production and supply chain to double monthly deliveries, Matthieu Giraud, who oversees lipid production at the company, told Reuters.Smaller mRNA producers and suppliers said they do not see lipids as a long-term bottleneck.Peter Lutwyche, chief executive of Genevant Sciences, a Vancouver company that has licensed lipid technology to vaccine projects, said there are likely a number of contract manufacturers that could boost production further.The lead times for lipids from these specialized vendors may be getting longer, but I do not believe its the bottleneck, he said.Pieter Cullis, a University of British Columbia professor who co-founded Acuitas and has spent decades developing lipid nanoparticle technology, said manufacturing sites approved to make conventional pharmaceuticals could be repurposed to make the proprietary lipids within a few months.None of the lipids are required in huge amounts because the vaccine is so potent, said Cullis: to make a billion doses of vaccine, only hundreds of kilograms of lipid are required.Theres nothing to say you cant scale this to infinity and back, he said of mRNA vaccines in general. Theres Pfizer saying (they will make) 2 billion doses this year, and theyre probably going to exceed that."}