{"text": "DUBLIN Haunted by ghostly visions of the brothers she never knew, Anna Corrigan had a bad night ahead of the publication on Tuesday of a 3,000-page report into the horrors that unfolded at Irelands Church-run Mother and Baby Homes.Her older brothers, John and William Dolan, were born at one of the homes for unmarried mothers and their infants, in the provincial town of Tuam in western Ireland. They are thought to be among 802 babies and children who died at the home and were unceremoniously dumped in a mass grave by the Catholic nuns who ran it.I had a very bad nights sleep last night, Corrigan told Reuters in a Zoom interview from her home in Dublin, describing unsettling dreams about her family.Along with other people affected by the Tuam tragedy, she is awaiting Tuesdays release of an inquiry report into alarmingly high death rates at the homes, which deputy Prime Minister Leo Varadkar has already said made difficult reading.My heart is breaking for every survivor, said Corrigan. I feel traumatised.In the past, Irelands strict Catholic morality made it deeply shameful to become pregnant before marriage, and women would be rejected as sinful by their families and society.Many were hidden in Mother and Baby Homes to give birth, then separated from their babies and sent away. Some of the children were fostered, some adopted, and some remained in the homes until they could be sent to state-funded, Church-run orphanages that were also rife with abuse.Run by nuns from the Bon Secours order, the Tuam home operated from 1925 to 1961 and was demolished in the 1970s.It was only decades later that research by amateur local historian Catherine Corless led to the discovery of the mass grave in what had been the grounds of the home. Corless, who grew up in Tuam with her family, was driven by disturbing childhood memories of skinny children from the home being segregated from the other pupils at her school.The Bon Secours sisters have made no comment about why babies corpses were buried in the way they were. They have said they transferred the homes records to the local authority when the home closed in 1961.Born in 1956, Corrigan grew up as an only child. Much later in life, after her parents had died, she investigated her family history and was shocked to discover that her mother had had two baby boys at the Tuam home, in 1946 and 1950.Both babies died very young, records suggest. Corrigan has obtained a death certificate for John, but no information at all on what happened to William. She has had to adjust to a new identity as the youngest of three children, and feels a deep sense of loss for the siblings she never had a chance to meet.Like other relatives and survivors, she has called for the remains of babies and children found in Tuam to be exhumed and identified through DNA testing. The government said in 2018 that would happen, but so far little progress has been made.In the absence of any certainty, Corrigan often thinks about her unknown brothers, even wondering if they might not be dead after all.Where are they? Are they dead? Are they walking around America? Do they know who I am? Do they know who they are? she said, wiping away tears."}