{"text": "DETROIT Ford Motor Co is aiming to grab a significant share of the emerging electric vehicle market with products like the new E-Transit cargo van to match the hold it already has over the traditional internal combustion engine market.The company unveils its new E-Transit commercial van on Thursday during a virtual webcast. Chief Executive Jim Farley has made clear Ford is betting connected, electric commercial vehicles, can generate lucrative, recurring profits despite a growing field of electric competitors.Ford already dominates the U.S. and European markets for gasoline-powered commercial vehicles with shares of 40% and almost 15%, respectively.We deserve the same share in EVs that we have in ICE and we think were well positioned to get there, Ted Cannis, head of Fords North American commercial vehicle business, said in a telephone interview ahead of the online introduction.Farley said Ford expects global demand for electric vans will grow by more than 1.1 million vehicles by 2030 and while startups like Rivian and Arrival have contracts to build electric vans for Amazon.com Inc and UPS, respectively, none can match Fords product or service options, including a deep list of service centers and upfitters.Workhorse or Arrival or Rivian, they dont have the breadth of product, Cannis said. Ford has invested in Rivian, but the E-Transit is not related to the startups van.The E-Transit comes in eight configurations, including three roof heights and three lengths, as well as in cargo, cutaway and chassis cab versions. The low-roof cargo van version will have an EV driving range of 126 miles.The new van, which includes a standard 12-inch touchscreen and the ability to do over-the-air software updates, will have a starting price of almost $45,000, about $10,000 more than the gas-powered version, and comes with an 8-year, 100,000 electric vehicle component warranty.Others planning EVs for the commercial van segment include Germanys Daimler AG, General Motors Co and startups Xos Trucks and Bollinger Motors.Cannis did not disclose what sales volumes Ford is planning for E-Transit, but Bill Rinna, director of Americas vehicle forecasts at LMC Automotive said the Dearborn, Michigan, automaker is expected to build 20,000-25,000 a year in North America.Two of three electric vehicles Ford has announced as part of an $11.5 billion investment in electrification through 2022 are aimed at commercial customers - the E-Transit and an electric F-150 pickup, coming in mid-2022.Fords Mustang Mach-E electric SUV, arriving later this year, represents a low-volume challenger to electric luxury vehicle market leader Tesla Inc..Regulators in Europe and some U.S. cities are stepping up pressure on businesses to replace diesel or gasoline-fueled delivery vans with electric models to reduce pollution.Ford said Tuesday it will invest $100 million and hire 150 workers to build the E-Transit at its plant near Kansas City, Missouri."}