{"text": "    * Dollar index still up nearly 0.75% this week\n    * World FX rates in 2020 tmsnrt.rs/2RBWI5E\n\n    By David Henry\n    NEW YORK, Nov 12 The dollar held steady on Thursday as investors were cautious over\nexpectations about a COVID-19 vaccine that is unlikely to avert a grim winter in the United States and\nEurope as the pandemic's latest wave intensifies.\n    The dollar index was up 0.01% in the morning in New York, after having rebounded a little in\nLondon from lows during Asia trading.\n    The latest U.S. weekly jobless claims report did not budge the dollar when it came out on Thursday\nmorning. The report showed the pace of decline in claims had slowed to 709,000 compared with 757,000 the\nprior week and forecasts for 735,000 claims.\n    U.S. stocks fell, with the S&P 500 dropping about 0.5% in early New York trading.\n     U.S. Treasury yields slumped, in line with Europe, weighed down by the rise in coronavirus cases\naround the world and data showing inflation going nowhere in the United States. In midmorning trading,\nU.S. benchmark 10-year yields were down at 0.917%\n    Euro bond yields fell slightly earlier in the day. Larger moves were being held in check as investors\nawaited speeches at midday in New York trading from Federal Reserve Chair Jerome Powell, European Central\nBank President Christine Lagarde and Bank of England Governor Andrew Bailey at a virtual central banking\nforum.\n   \"There is a nervous calm in the capital markets today,\" said Marc Chandler, chief market strategist at\nBannockburn Global Forex.\n    While prices are not charting a new direction, nervousness stems from the outlook for the coronavirus\npandemic, central banks' future interest rate policies and the transition from last week's U.S.\npresidential elections, Chandler said.\n    The questions come amid possibly shifting views about the U.S. dollar's role as a safe haven or as a\nticket to gains from a strengthening global economy, he said. \n    The euro bumped higher by 0.14% to $1.1796.\n    The euro is trying to find its feet \"after the vaccine-related storm of activity at the start of the\nweek, and after the U.S. election news,\" said Jane Foley, head of FX strategy at Rabobank.  \n    The euro, Chandler noted, has been trading between $1.16 and $1.20 since late July. \"Being in the\nmiddle of a range makes nobody happy. Bulls nor bears can be happy,\" he said.\n    Europe is grappling with surging infections and new COVID-19 restrictions, with Germany's economic\nadvisers trimming next year's growth outlook. In the United States, cases continue to hit record levels.\n    The dollar's strength in the past week has for now put the brakes on a long drop for the greenback,\nwhich had shed about 10% against a basket of currencies between March and the announcement of progress on\nPfizer Inc's COVID-19 vaccine on Monday.\n    Earlier in Asia, the New Zealand dollar made a fresh 20-month high versus the U.S. dollar as traders\nbecame less convinced that negative rates are a sure thing for New Zealand.\n    Along with the virus, Republican U.S. President Donald Trump's refusal to concede defeat to Democrat\nJoe Biden in last week's election is also beginning to jangle investors' nerves.\n    The dollar gained 0.6% against the Canadian dollar $1.314\n    Sterling licked its wounds as trade talks between Britain and the European Union seemed set to\ndrag on past yet another deadline, raising the prospect that no trade deal may be reached before Brexit\ntransition arrangements end on Dec. 31.\n    The British currency last traded 0.5% lower to the dollar at $1.3149.\n========================================================\n    Currency bid prices at 9:50AM (1450 GMT)\n Description      RIC         Last           U.S. Close  Pct Change     YTD Pct     High Bid    Low Bid\n                                              Previous                   Change                 \n                                              Session                                           \n Dollar index                 $92.9910       92.9910     +0.01%         +0.00%      +93.1390    +92.7710\n Euro/Dollar                  $1.1796        $1.1779     +0.14%         +5.22%      +1.1823     +1.1759\n Dollar/Yen                   105.2250       105.6400    -0.44%         -3.16%      +105.4750   +105.1600\n Euro/Yen                     124.11         124.15      -0.03%         +1.77%      +124.5000   +123.6900\n Dollar/Swiss                 0.9148         0.9169      -0.21%         -5.44%      +0.9170     +0.9133\n Sterling/Dollar              1.3149         1.3223      -0.55%         -0.85%      +1.3227     +1.3133\n Dollar/Canadian              1.3140         1.3062      +0.60%         +1.15%      +1.3141     +1.3059\n Aussie/Dollar                0.7254         0.7281      -0.35%         +3.40%      +0.7293     +0.7247\n Euro/Swiss                   1.0791         1.0797      -0.06%         -0.56%      +1.0808     +1.0782\n Euro/Sterling                0.8968         0.8905      +0.71%         +6.08%      +0.8990     +0.8905\n NZ                           0.6868         0.6883      -0.22%         +2.07%      +0.6914     +0.6856\n Dollar/Dollar                                                                                  \n Dollar/Norway                9.1030         9.0875      +0.18%         +3.78%      +9.1375     +9.0850\n Euro/Norway                  10.7390        10.7060     +0.31%         +9.16%      +10.7760    +10.6760\n Dollar/Sweden                8.6235         8.6211      -0.10%         -7.74%      +8.6709     +8.5973\n Euro/Sweden                  10.1701        10.1800     -0.10%         -2.85%      +10.2010    +10.1580\n \n    \n (Reporting by David Henry in New York and Ritvik Carvalho in London; editing by Jonathan Oatis)\n  "}