{"text": "* Dollar index up nearly 1% this week* Aussie, kiwi sink as vaccine enthusiasm fades* World FX rates in 2020 tmsnrt.rs/2RBWI5ELONDON, Nov 12 The dollar steadied on Thursday as investors tempered bullish expectations about a COVID-19 vaccine that is unlikely to avert a grim winter in Europe and the United States as the pandemics second wave intensifies.The dollar index hovered between 0.1% higher and flat during early deals in Europe, while the risk-sensitive Australian and New Zealand dollars ground about 0.2% lower. The euro gained 0.1%.Europe is already grappling with surging infections and new social restrictions, with Germanys economic advisers trimming next years growth outlook. New York has ordered bars and restaurants to close early as U.S. cases hit record levels.The weakness in broad USD and reflationary momentum in equities, which we saw on the back of the U.S. election and improvements in the vaccine situation, seem to be fading across FX and equities, said Christin Tuxen, Head of FX Research at Danske Bank.Sterling licked its wounds as trade talks between Britain and the European Union seemed set to drag on past yet another deadline, raising the prospect that no trade deal may be reached before Brexit transition arrangements end on Dec. 31.The British currency last traded 0.3% lower to the dollar at $1.3182.The moves have, for now, put the brakes on a long, precipitous drop for the dollar, which had shed about 10% against a basket of currencies between March and the announcement of progress on Pfizers COVID-19 vaccine on Monday.Larger moves were held in check as investors await speeches from Federal Reserve Chair Jerome Powell, European Central Bank President Christine Lagarde and Bank of England Governor Andrew Bailey at a central banking forum later on Thursday.The USD is steady even as U.S. COVID-19 cases rose 135k yesterday while EUR-USD dips back below 1.18 as COVID-19 case counts snowball across Europe as the winter of despair sets in, suggesting further monetary and fiscal measure will be on the way, said Stephen Innes, global chief market strategist at AXI.KIWI HOVERSBefore a cautious mood spilled over from equities trade into the currency markets, the kiwi made a fresh 20-month high on the greenback as traders became less convinced that negative rates are a sure thing anymore for New Zealand.Bond markets moved sharply across the curve to price longer odds on that possibility on Wednesday, and yields inched higher on Thursday as the kiwi rose to $0.6915. It had last fallen back to trade 0.25% lower on the day at $0.6862.Less stimulus is required than we thought in August, but still a substantial amount of stimulus, RBNZ Assistant Governor Christian Hawkesby told Bloomberg in an interview.ANZ Bank still thinks New Zealand rates will head below zero in August 2021, but said its now become a bit of a toss up and that it is clear that going negative is no longer urgent.Late in the afternoon, however, some of that move reversed and the New Zealand dollar last sat at $0.6871, while the Aussie retreated to $0.7264.Along with the virus, U.S. President Donald Trumps refusal to concede defeat to Democrat Joe Biden in last weeks election is also beginning to jangle investors nerves.CBA analysts in Sydney say a 5% leap in the greenback is possible if Trump does find a way to stay in office, most likely by relying on electoral college delegates to cast votes for him, even if their states endorsed Joe Biden at the ballot box."}