{"text": "    * Dollar taking breather after rally to multi-month peak\n    * Analysts see room for further dollar gains this week\n    * British pound flounders near two-month trough\n    * Bitcoin back above $60,000, closing gap to record high\n\n    By Kevin Buckland\n    TOKYO, April 12 The dollar languished near\n2-1/2-week lows against major peers on Monday as a decline in\nTreasury yields restrained the U.S. currency.\n    The British pound sank toward a two-month low,\ncontinuing its decline from a nearly three-year high reached in\nFebruary, with analysts pointing to blood clot concerns around\nthe AstraZeneca vaccine, which the U.K. has relied\nheavily on for its aggressive vaccination programme.\n    Bitcoin traded above $60,000, closing the gap to\nits record high.\n    Both the dollar and Treasury yields are taking something of\na breather after scaling multi-month peaks at the end of last\nmonth, powered by bets that an accelerating U.S. recovery from\nthe pandemic will lift inflation faster than Federal Reserve\npolicymakers anticipate.\n    While the Fed's repeated insistence that near-term price\npressures will prove transitory has soothed investors this\nmonth, the dollar firmed on Friday following\nstronger-than-expected producer price data, taking the edge off\nthe currency's worst week this year.\n    The dollar index, which tracks the greenback against\na basket of six rivals, was little changed at 92.304 in Asia,\nfollowing a 0.9% slump last week. It dipped below 92 on Thursday\nfor the first time since March 23.\n    The benchmark 10-year Treasury yield was at\n1.6622% after dropping as low as 1.6170% last week. It had\nsurged to a more than one-year high of 1.7760% on March 30.\n    \"Key for the near-term outlook will be whether yields\ncontinue to consolidate around these levels, or march higher,\"\nwhich would support the dollar, National Australia Bank\nstrategist Tapas Strickland wrote in a client note.\n    \"The broader thematic of a rapid rebound in the U.S. economy\non the back of an impressive vaccine rollout continues.\"\n    Data on Friday showed the largest annual gain in 9-1/2 years\nfor U.S. producer prices, backing expectations for higher\ninflation as the economy reopens amid an improved public health\nenvironment and massive government funding.\n    U.S. consumer price data will be released Tuesday.\n    Fed Chair Jerome Powell speaks on Wednesday at the Economic\nClub of Washington. In an interview on Sunday on CBS's \"60\nMinutes,\" Powell said the U.S. economy is at an \"inflection\npoint\" with expectations that growth and hiring will pick up\nspeed in the months ahead, but he also warned of risks stemming\nfrom a hasty reopening.\n    Against the euro, the dollar hovered near the lowest\nsince March 23 at $1.1901. It bought 109.66 yen, close to\n a two-week low below 109 reached on Thursday.\n    \"USD has some upside potential this week,\" Commonwealth Bank\nof Australia strategist Kimberley Mundy wrote in a report.\n    \"Strong U.S. economic data will highlight the divergence\nbetween the U.S.s fast economic recovery and the more stunted\nrecoveries in other developed economies.\"\n    The dollar can lift back toward 110 yen, while the euro has\nscope to retrace most of that recent gains from its almost\nfive-month low near $1.17, she said.\n    The British pound slipped 0.2% to $1.36745, nearing Friday's\nlow of $1.3670, a level not seen since Feb. 8.\n    Bitcoin traded at $60,102.69 after rising as high\nas $61,222.22 over the weekend, approaching the record peak of\n$61,781.83 set one month ago. \n    Miners have not been selling recently minted tokens at a\ntime of greater demand from corporations and investors,\naccording to Justin d'Anethan, sales manager at digital asset\ncompany Diginex in Hong Kong.\n    \n========================================================\n    Currency bid prices at 542 GMT\n Description      RIC         Last           U.S. Close  Pct Change     YTD Pct     High Bid    Low Bid\n                                              Previous                   Change                 \n                                              Session                                           \n Euro/Dollar                  $1.1886        $1.1901     -0.13%         -2.73%      +1.1911     +1.1885\n Dollar/Yen                   109.5470       109.6300    -0.04%         +6.09%      +109.7570   +109.4850\n Euro/Yen                     130.23         130.47      -0.18%         +2.61%      +130.6100   +130.1500\n Dollar/Swiss                 0.9265         0.9246      +0.22%         +4.74%      +0.9266     +0.9253\n Sterling/Dollar              1.3677         1.3706      -0.20%         +0.12%      +1.3712     +1.3670\n Dollar/Canadian              1.2564         1.2525      +0.32%         -1.32%      +1.2565     +1.2528\n Aussie/Dollar                0.7599         0.7618      -0.24%         -1.20%      +0.7627     +0.7596\n NZ                           0.7024         0.7030      -0.07%         -2.17%      +0.7042     +0.7014\n Dollar/Dollar All spots\nTokyo spots\nEurope spots \nVolatilities \nTokyo Forex market info from BOJ \n    \n\n    \n (Reporting by Kevin Buckland\nEditing by Shri Navaratnam and Gerry Doyle)\n  "}