{"text": "* Dollar/yen jumps to 3-wk peak after U.S. 10-yr yield rises* USD inches ahead on other majors* Kiwi dips after RBNZ extends QE, talks of negative rates* Graphic: World FX rates in 2020 tmsnrt.rs/2RBWI5ESINGAPORE/TOKYO, Aug 12 The dollar inched ahead on Wednesday, as a jump in U.S. yields pushed it higher against the Japanese yen, while the kiwi briefly hit a one-month low after the central bank extended its bond buying programme.The yield on 10-year U.S. debt, which rises when bond prices fall, made its steepest gain in two months on Tuesday ahead of the largest ever 10-year auction later on Wednesday.That triggered a wave of gold selling, which deepened in Asia, and it has pressured the yen as better returns on U.S. debt lures investment from zero-yielding Japan.The yen fell 0.24% to 106.76 per dollar, its lowest since July 24. The tumbling gold price, which has dropped roughly 7% in two days, also dragged on the Australian dollar since Australia is the worlds second biggest gold producer.The Aussie fell 0.35% to $0.7120 while the New Zealand dollar fell 0.5% to $0.6547.Elsewhere in financial markets, the focus was on the political holdup in Washington over a new stimulus package, which capped broader investor sentiment.The jump in yields was driven by both repositioning ahead of big debt issuance this week and a sense that the global recovery is looking broader and more robust - a mood helped somewhat by Russia hailing the approval of a COVID-19 vaccine.Investors have been positioning themselves to buy back dollars they had sold against the yen, said Mitsuo Imaizumi, chief FX strategist at Daiwa Securities, adding that a short squeeze was seen as the U.S. yields spiked.Against a basket of currencies, the dollar extended a bounce made last Friday as U.S.-China tensions ratcheted higher with President Donald Trumps ban on TikTok and WeChat.It last sat at 93.846. Against the euro the greenback was a tad firmer at $1.1718 and against the pound it extended Tuesday gains that followed a weak British jobs report to hit $1.3021 per pound.The dollar index has slumped 9% from a three-year high it hit in March and lost 4% in July alone, leaving investors divided over whether the support the greenback has found in August amounts to a bounce or a pause in its decline.DOVISH KIWIIn New Zealand the central bank kept rates on hold, as expected.But it surprised markets a little by extending the duration of its bond buying program, flagging an increase in purchases next week, and putting a little more emphasis on the possibility of negative rates in the future.Taken together, thats why interest rates have fallen a few basis points and why the kiwi fell, said Westpac FX analyst Imre Speizer. Thats a modest dovish reaction.Ten-year New Zealand government debt was last down about 5 basis points, reflecting a small drop across the curve, and the kiwi recovered slightly from a one-month low $0.6524.On the horizon are U.S. inflation figures due at 1230 GMT, which are expected to show consumer price growth drift down to 1.1% on a year-on-year basis from 1.2% in June.Investors are also looking for signs that the political impasse in Washington over the next stimulus programme can be overcome, with the stalemate weighing on U.S. equities as Democrats and Republicans blamed each other for the deadlock. (Reporting by Tom Westbrook; Editing by Sam Holmes and Kim Coghill)"}