{"text": "    * Dollar index near three-week lows\n    * China's yuan drops after central bank lowers reserve requirement\n    * Pound strengthens after lockdown measures announced\n    * Graphic: World FX rates in 2020 tmsnrt.rs/2RBWI5E\n\n (Adds details, updates prices; previous LONDON)\n    By Chuck Mikolajczak\n    New York, Oct 12 The dollar index held near three-week lows on Monday as optimism over the\npossibility of a COVID-19 relief bill was curbed by concern over the pandemic while China's yuan fell\nafter the People's Bank of China (PBOC) changed its reserve requirements policy. \n    On Sunday, the Trump administration called on Congress to pass a stripped-down coronavirus relief bill\nusing leftover funds from an expired small-business loan program, as negotiations on a broader package\ncontinue to run into roadblocks.\n    The greenback has held within a range of about 2% over the past three weeks as talks have gone back\nand forth. The dollar had its biggest loss in six weeks on Friday amid rising hopes a fiscal stimulus\npackage would be agreed to stem the economic fallout from COVID-19. More stimulus is seen as\nnegative for the dollar. \n    \"The chances of getting a comprehensive stimulus deal before the election are slim,\" said Edward Moya,\nsenior market analyst, at OANDA in New York. \n    \"So what that means is that the damage to the economy is going to grow and it means that right now we\nare talking somewhere around $1.8 or $2 trillion ...and that just means the stimulus is going to be bigger\nthe longer they wait.\"  \n    The offshore yuan fell 0.8% against the dollar after China's central bank said on Saturday\nit would lower the reserve requirement ratio for financial institutions when conducting some foreign\nexchange forwards trading, a move seen as a bid to curb recent yuan appreciation.\n    The yuan had reached a more than 17-month high on Friday in offshore trade and has gained nearly 8%\nagainst the dollar since late May. But on Monday the offshore yuan was on track for its biggest daily\ndecline against the dollar since March. \n    The PBOC's move to end the requirement for banks to set aside cash to cover yuan forward transactions\nwould make it easier to short the yuan, said RBC's head of Asia FX, Alvin Tan.    \n    The move was also cited by analysts as a reason for weakness in the China-sensitive Australian dollar,\nwhich was down about 0.4%.   \n    The dollar index fell 0.1%. \n    The euro  was down 0.15% to $1.1814. In Europe, the World Health Organization has urged\ngovernments to restrict activity to combat a rapid rise in COVID-19 infections.\n    The Japanese yen weakened 0.31% versus the greenback at 105.28 per dollar after Bank of\nJapan Governor Haruhiko Kuroda stressed his readiness to take additional monetary easing steps.\n\n    The pound held above $1.30, strengthening after Prime Minister Boris Johnson set out on Monday a\nthree-tier system of local lockdown measures in England. Sterling was last trading at\n$1.3069, up 0.18% on the day.\n    ========================================================\n    Currency bid prices at 11:10AM (1510 GMT)\n Description      RIC         Last           U.S. Close  Pct Change     YTD Pct     High Bid    Low Bid\n                                              Previous                   Change                 \n                                              Session                                           \n Euro/Dollar                  $1.1814        $1.1832     -0.15%         +5.38%      +1.1827     +1.1787\n Dollar/Yen                   105.2750       105.6300    -0.36%         -3.09%      +105.6900   +105.2550\n Euro/Yen                     124.36         124.92      -0.45%         +1.98%      +124.9600   +124.3300\n Dollar/Swiss                 0.9088         0.9096      -0.08%         -6.08%      +0.9123     +0.9088\n Sterling/Dollar              1.3068         1.3045      +0.18%         -1.46%      +1.3072     +1.3006\n Dollar/Canadian              1.3103         1.3115      -0.09%         +0.86%      +1.3142     +1.3102\n Aussie/Dollar                0.7212         0.7243      -0.41%         +2.80%      +0.7235     +0.7205\n Euro/Swiss                   1.0735         1.0760      -0.23%         -1.08%      +1.0774     +1.0735\n Euro/Sterling                0.9038         0.9062      -0.26%         +6.91%      +0.9079     +0.9038\n NZ                           0.6647         0.6671      -0.34%         -1.20%      +0.6670     +0.6644\n Dollar/Dollar                                                                                  \n Dollar/Norway                9.1375         9.1285      +0.25%         +4.32%      +9.1630     +9.1245\n Euro/Norway                  10.7964        10.8100     -0.13%         +9.74%      +10.8240    +10.7760\n Dollar/Sweden                8.7933         8.7792      -0.07%         -5.93%      +8.8231     +8.7856\n Euro/Sweden                  10.3871        10.3945     -0.07%         -0.77%      +10.4127    +10.3820\n \n\n\n (Reporting by Elizabeth Howcroft and Chuck Mikolajczak, Editing by Larry King and Andrea Ricci)\n  "}