{"text": "* Dollar index up nearly 1% this week* Yen, Swiss franc sold as investors seek riskier assets* Kiwi holds gains as investors trim bets on negative rates* Graphic: World FX rates in 2020 tmsnrt.rs/2RBWI5ESYDNEY, Nov 12 The dollar held broad gains on Thursday as investors adjusted some of their bullish expectations about a COVID-19 vaccine, tempering a recent rally in risk assets but keeping enough confidence to support the greenback against other safe-havens.The dollar index sat just below a one-week high hit overnight and the dollar stood close to a one-week top against the Swiss franc and a three-week peak against the yen.The yen, a popular vehicle for bets against the dollar, is now at 105.41 per dollar, some 2% below an eight-month high it hit against the greenback last week, when Joe Bidens lead in the U.S. election spurred a wave of dollar selling.The euro slipped 0.3% overnight after the European Central Bank said it would focus on bond buying and cheap loans to boost pandemic-wrecked economies, while the British pound was lower as Brexit trade talks dragged on.Only in the Antipodes was the dollar weaker or steady, after the kiwi leapt following an upward adjustment in the Reserve Bank of New Zealands unconstrained cash rate projection, which prompted traders to trim expectations for negative rates.I think we had a speculative market that was increasingly comfortable being short U.S. dollars, said National Australia Banks head of foreign exchange strategy, Ray Attril.Then we had the vaccine news and a big spike in U.S. bond yields, which I think just acted as a little bit of a check on unbridled U.S. dollar bearishness, he said.A lot of positions probably got squeezed. I think it was a condition of the market rather than a strong fundamental response or a change of thinking about the U.S. dollar.Against a basket of currencies, the dollar fell more than 10% from a March peak to the 10-week low hit on Monday. It has since rallied nearly 1%, mostly thanks to safe-haven selling after Pfizer announced it had a working virus vaccine.The dollars decline had been predicated on crumbling U.S. bond yields, as the Federal Reserve promises low rates for a long time, and hopes for a global recovery that would lift other currencies.OCBC strategist Terence Wu in Singapore said that new drivers might now need to be found to send the dollar any lower.With the broad dollar in a consolidative mode, the posture for USD/CNH may also be sideways in the near-term. These factors play into limited downside for USD-Asian pairs in the near-term, he said in a note.In early Asia trade, the Chinese yuan was a fraction firmer offshore at 6.6121 per dollar and other majors hung on where they left off the New York session.The Australian dollar was steady at $0.7281 and sterling nursed a 0.4% overnight loss at $1.3220.The New Zealand dollar gained a fraction to re-test its Wednesday highs after Bloomberg reported that improved economic performance had changed the central banks thinking.Less stimulus is required than we thought in August, but still a substantial amount of stimulus, RBNZ Assistant Governor Christian Hawkesby told Bloomberg in an interview.Kiwi bond yields surged on Wednesday as investors swiftly priced out expectations of negative rates.The shift also sent the Australian dollar to a six-month low against the kiwi.The pair looks heavy and at risk of further downside, said Chris Weston, head of research at broker Pepperstone in Melbourne. (Reporting by Tom Westbrook; Editing by Sam Holmes)"}