{"text": "* Dollar/yen jumps after U.S. 10y yield rises 7 bps* USD steady on other majors* Kiwi in focus ahead of RBNZ* Graphic: World FX rates in 2020 tmsnrt.rs/2RBWI5ESINGAPORE, Aug 12 The dollar found support on Wednesday, as a jump in U.S. yields pushed it higher against the Japanese yen and investors wagered on a broader and deeper U.S. coronavirus recovery.The yield on 10-year U.S. debt, which rises when bond prices fall, made its steepest gain in two months overnight ahead of a record $38 billion auction later on Wednesday.That attracts investment, particularly from Japan where yields at the front of the curve are pinned around or below zero, and lifted the dollar by half a percent on the yen to 106.53 - where it stayed on Wednesday.Elsewhere in financial markets, focus was on the political holdup in Washington over a new stimulus package, which capped broader investor sentiment.In Asia, the New Zealand dollar hit a three-week low following a fresh coronavirus lockdown in Auckland and ahead of a crucial central bank policy decision due at 0200 GMT.The move up in yields is driven by both repositioning ahead of big issuance this week and a sense that the U.S. recovery is broadening and looking more robust, said NAB senior FX strategist Rodrigo Catril.That is reflected in the rotation in equities into more cyclical sectors and plays into the idea that U.S. Treasury yields should be higher, reflecting that improvement in prospects for the global recovery, he said.Dollar/yen is the most sensitive...but higher U.S. Treasury yields should in theory be broadly supportive for the dollar.Against a basket of currencies, the dollar extended a bounce made last Friday as U.S.-China tensions ratcheted higher with President Donald Trumps ban on TikTok and WeChat.It last sat at 93.654. Against the euro the greenback was steady at $1.1740 and against the Australian dollar it was firm just below a one-week high at $0.7147.The dollar index has slumped 9% from a three-year high it hit in March and lost 4% in July alone, leaving investors divided over whether the support the greenback has found in August amounts to a bounce or a pause in its decline.RBNZ WATCHTraders in Asia have a wary eye fixed on the Reserve Bank of New Zealand on Wednesday.No change in rates is expected, but the bank can often surprise and a dovish tone is likely -- especially with Auckland back under lockdown because four new COVID-19 cases were detected after 102 virus-free days.Its far too soon to say what the exact implications are, but the return of COVID-19 presents downside risk to the outlook, ANZ analysts said in a note on Wednesday.The (policy) committee can ill-afford to be complacent, and need to underscore that they will do what it takes. We thus expect a very dovish tone, which poses significant downside risks for the New Zealand dollar.Most analysts expect an expansion of the central banks bond buying programme beyond the current NZ$60 billion and for negative rates to remain firmly on the table.The kiwi was last at $0.6564, its lowest since July 21.Elsewhere the pound was under pressure following poor labour market data overnight, which showed British job losses jumping to their highest level in more than a decade last quarter.U.S. inflation figures due at 1230 GMT are expected to show consumer price growth drift down to 1.1% on a year-on-year basis from 1.2% in June.Investors are also looking for signs that the political impasse in Washington over the next stimulus programme can be overcome, with the stalemate weighing on U.S. equities overnight as Democrats and Republicans blamed each other for the deadlock. (Reporting by Tom Westbrook; Editing by Sam Holmes)"}