{"text": "    * Graphic: World FX rates tmsnrt.rs/2RBWI5E\n\n (Adds quote, context, updates prices; changes dateline,\nprevious LONDON, byline)\n    By Karen Brettell\n    NEW YORK, April 12 The dollar dipped slightly on\nMonday as traders awaited highly anticipated U.S. inflation and\nretail sales data in coming days, and as Treasury yields held\nbelow recent highs before new supply.\n    The dollar's performance has been tied to U.S. Treasury\nyields for most of 2021, after concern about rising inflation in\nthe United States and a stimulus-fuelled economic rebound\ntriggered a jump in Treasury yields.\n    A fall in U.S. yields last week triggered the worst week for\nthe dollar in 2021. Yields edged higher on Monday before the\nTreasury will sell $120 billion in new coupon-bearing supply\nthis week, though they are holding below one-year highs reached\nlast month.\n    U.S. consumer price data for March due on Tuesday is the\nnext major economic focus. Investors are betting that price\npressures will increase due to increased fiscal and monetary\nstimulus and as businesses reopen from COVID-19 related\nclosures.\n    Comparisons with last year are also likely to be strong, due\nto a drop in inflation a year ago when businesses closed due to\nCOVID-19.\n    \"With U.S. data expected to come in strong this week, we\nbelieve the dollars rise can continue,\" analysts at Brown\nBrothers Harriman said in a report on Monday.\n    Retail sales data for March is also due on Thursday.\n    The dollar index was last down 0.11% against a basket\nof currencies at 92.108. It is holding above a three-week low of\n91.995 reached on Thursday.\n    The euro gained 0.06% to $1.1908.\n    Federal Reserve Chairman Jerome Powell said on Sunday that\nthe U.S. economy was at \"an inflection point\" and looked set for\na strong rebound in the coming months, but he also warned of\nrisks stemming from a hasty reopening.\n\n    Bitcoin traded above $60,000, closing the gap to\nits record high.\n    Sterling rose 0.26% to $1.3744 as traders cheered\nthe latest phase of the British government's economic reopening\nplan. \n    The dollar fell 0.18% to 109.43 yen versus the\nJapanese currency.\n    U.S. dollar net short positions have fallen to their lowest\nin nearly three years, according to data published on Friday.\n\n    ING analysts noted that speculators had cut their net short\ndollar positions for the 12th consecutive week, which could\nprove a headwind for further dollar gains.\n    \"At this stage, the dollar has lost all its positioning\n'advantage,' having a neutral speculative positioning, which\nsuggests we should no longer see dollar rallies against most G10\ncurrencies exacerbated by the unwinding of USD shorts,\" they\nwrote.\n    \n    ========================================================\n    Currency bid prices at 10:08AM (1408 GMT)\n Description      RIC         Last           U.S. Close  Pct Change     YTD Pct       High Bid    Low Bid\n                                              Previous                   Change                   \n                                              Session                                             \n Dollar index                 92.1080        92.2180     -0.11%         2.364%        +92.3310    +92.0070\n Euro/Dollar                  $1.1908        $1.1901     +0.06%         -2.54%        +$1.1919    +$1.1872\n Dollar/Yen                   109.4250       109.6300    -0.18%         +5.94%        +109.7650   +109.2500\n Euro/Yen                     130.29         130.47      -0.14%         +2.66%        +130.6100   +129.9000\n Dollar/Swiss                 0.9229         0.9246      -0.17%         +4.33%        +0.9268     +0.9228\n Sterling/Dollar              $1.3744        $1.3706     +0.29%         +0.61%        +$1.3776    +$1.3670\n Dollar/Canadian              1.2554         1.2525      +0.26%         -1.39%        +1.2567     +1.2528\n Aussie/Dollar                $0.7620        $0.7618     +0.03%         -0.94%        +$0.7635    +$0.7596\n Euro/Swiss                   1.0990         1.1000      -0.09%         +1.69%        +1.1015     +1.0983\n Euro/Sterling                0.8662         0.8679      -0.20%         -3.08%        +0.8695     +0.8641\n NZ                           $0.7030        $0.7030     +0.01%         -2.09%        +$0.7049    +$0.7014\n Dollar/Dollar                                                                                    \n Dollar/Norway                8.4780         8.4980      -0.17%         -1.21%        +8.5295     +8.4735\n Euro/Norway                  10.0955        10.1120     -0.16%         -3.55%        +10.1310    +10.0910\n Dollar/Sweden                8.5658         8.5376      +0.41%         +4.50%        +8.5730     +8.5363\n Euro/Sweden                  10.1994        10.1582     +0.41%         +1.22%        +10.2065    +10.1630\n \n    \n (Reporting by Karen Brettell in New York; additional reporting\nby Tommy Wilkes in London; editing by Jonathan Oatis)\n  "}