{"text": "* Dollar off 3-week low as U.S. stimulus negotiation hits snag* Yuan falls after PBOC removes reserves for forward trading* Sterling near eyes EU summit ahead of self-imposed deadline* Graphic: World FX rates in 2020 tmsnrt.rs/2RBWI5ETOKYO, Oct 12 The dollar inched up in early Monday trade as riskier currencies slipped after negotiation on a U.S. stimulus package ran into resistance and as the yuan dropped after Chinas central bank took a measure seen as aimed at curbing its strength.The euro slipped 0.1% to $1.1817 while the Australian dollar shed 0.3% to $0.7222. The yen was little changed at 105.52 to the dollar.The U.S. dollar index edged up to 93.108, bouncing back from Fridays near-three-week low of 92.997. The index saw its biggest loss in six weeks on Friday on hopes that a deal for new U.S. stimulus would be reached.President Donald Trump on Friday offered a $1.8 trillion coronavirus relief package in talks with House Speaker Nancy Pelosi - moving closer to Pelosis $2.2 trillion proposal.But Trumps offer drew criticism from several Senate Republicans, many of whom are uneasy about the nations growing debt and concerned a deal would cost Republicans support in the upcoming presidential election, denting the risk-on mood.Still, with Nov. 3 election only weeks away, investors bet that Democrat Joe Biden is more likely to win the U.S. presidency and offer a larger economic package.Over the past few days, the markets seem to assume Biden will win the election. Trump seems desperate to get a deal but his comments are getting treated like a noise, said Yusuke Okada, manager of forex at Mitsubishi Trust Bank.But I do think we could see a return of political uncertainties by the election. Markets seem to have priced in only the good news, he added.FORWARD THINKINGThe offshore Chinese yuan dropped after the Peoples Bank of China (PBOC) said it will lower the reserve requirement ratio for financial institutions when conducting some foreign exchange forwards trading.Analysts said the measure could keep the yuans strength in check by encouraging the use of forwards.The authorities have not stood in the way of yuan strength, but this move could be seen as a sign that they want to slow the pace of appreciation, wrote Khoon Goh, head of Asia Research at ANZ in Singapore.Our interpretation is that removing the reserve requirement is intended to encourage firms to hedge in order to manage currency risk. It also enhances the foreign exchange market structure by making it easier for foreign investors to hedge their onshore portfolio investments.The yuan hit a 17-month high on Friday, both in onshore and offshore trade, having gained more than 6% against the dollar since late May driven by a favourable yield differential between China and other major economies.The yuan has been supported by the relative strength of the Chinese economy as China has managed the coronavirus much better than some other countries, said Masashi Hashimoto, senior economist at Institute for International Monetary Affairs in Tokyo.But the Chinese authorities now appeared to have grown wary of the yuans strength, he said.The yuan last traded at 6.7171 per dollar in offshore trade , down 0.4%.Elsewhere, sterling traded at $1.3035, having reached a one-month high of $1.3050 on Friday on guarded optimism about Brexit negotiations ahead of a European Union summit this week.British Prime Minister Boris Johnson has set a deadline of the Oct. 15 EU summit for a deal with the union.Trade is a tad slow overall, due to a holiday in U.S. money and bond markets on Monday. (Reporting by Hideyuki Sano; Editing by Christopher Cushing and Gerry Doyle)"}