{"text": "* Dollar index close to three-week lows* Chinas yuan drops after Central Bank lowers reserve requirement* Riskier currencies stabilise* Graphic: World FX rates in 2020 tmsnrt.rs/2RBWI5ELONDON, Oct 12 The dollar held near three-week lows on Monday amid optimism about fiscal stimulus in the United States, while the yuan fell after Chinas central bank changed its policy on yuan reserves.The dollar index was steady, having seen its biggest loss in six weeks on Friday, when investors upped their bets that a fiscal stimulus package would be agreed to mitigate the economic fallout from COVID-19.The Trump administration called on Congress to pass a stripped-down version of the relief bill on Sunday, while negotiations on a broader package continue.The dollar has been buffeted by the on-again, off-again stimulus negotiations. Still, with Nov. 3 election only weeks away, investors are betting that Democrat Joe Biden is more likely to win the U.S. presidency and offer a larger economic package.Any negative fallout from a failure to reach a fiscal deal before the election will be dampened by expectations for even bigger stimulus after the election, MUFG currency analyst Lee Hardman wrote in a note to clients.Market participants remain optimistic over a Blue Wave, he added, citing polling data which shows a Biden lead.The dollar index was at 93.118 at 0729 GMT, flat on the day and having almost completely reversed its recovery at the end of September.The euro was down 0.2% on the day at $1.1808. In Europe, the World Health Organization has urged governments to restrict activity to combat a rapid rise in COVID-19 infections.Speculators cut their euro long positions to a two-month low in the week to Oct. 6, weekly CFTC data showed.European Central Bank President Christine Lagarde is due to speak at 1100 GMT.The yen was up 0.1% against the dollar at 105.520. The safe-haven Swiss franc was flat against the euro at 1.07630 .The riskier New Zealand and Australian dollars were both down around 0.2% on the day, having eased gains from Friday, when they rose to their highest in nearly three weeks .CHINAS CENTRAL BANK STEPS INThe yuan fell after the Peoples Bank of China (PBOC) said on Saturday that it will lower the reserve requirement ratio for financial institutions when conducting some foreign exchange forwards trading.Analysts say the move was a bid to curb recent yuan appreciation.The yuan reached a 17-month high on Friday in both onshore and offshore trade. It has gained more than 6% against the dollar since late May, driven by a favourable yield differential between China and other major economies.At 0743 GMT on Monday, the onshore yuan was down 0.3% . The offshore yuan was at 6.7109 per dollar, also down 0.3% on the day.The move was also cited as a reason for weakness in the China-sensitive Australian dollar.Markets may take this move as a signal the PBoC intends to slow CNY appreciation in the near term, though we note the accompanying statement included a vow to keep the exchange rate flexible, stabilize market expectations and maintain a broadly stable exchange rate, UBS strategists wrote in a note.The next big move in the yuan may be linked to the U.S. election outcome and who will be negotiating trade with China for the next four years, UBS added. (Reporting by Elizabeth Howcroft, editing by Larry King)"}