{"text": "    * Dollar index up nearly 0.8% this week\n    * Kiwi holds gains as investors trim bets on negative rates\n    * Very slight risk-averse mood creeps in late in Asia trade\n    * Graphic: World FX rates in 2020 tmsnrt.rs/2RBWI5E\n\n    By Tom Westbrook\n    SYDNEY, Nov 12 The dollar held broad gains on\nThursday as investors tempered bullish expectations about a\nCOVID-19 vaccine, while the kiwi hovered at an almost 20-month\npeak as the odds lengthened on New Zealand imposing negative\ninterest rates.\n    The dollar index was steady through the Asia session\nand has added about 0.8% this week, mainly thanks to heavy\nselling in haven currencies such as the Swiss franc and Japanese\nyen, and weakness in the euro as COVID-19 cases surge in Europe.\n    Sterling also nursed losses as trade talks between\nBritain and the European Union seemed set to drag on past yet\nanother deadline, raising the prospect that no trade deal is\nreached before Brexit transition arrangements end on Dec. 31.\n    The moves have put the brakes on a long a precipitous drop\nfor the world's reserve currency, which shed about 10% against a\nbasket of currencies between March and the announcement of\nPfizer's working COVID-19 vaccine on Monday.\n    \"I think we had a speculative market that was increasingly\ncomfortable being short U.S. dollars,\" said National Australia\nBank's head of foreign exchange strategy, Ray Attril.\n    \"Then we had the vaccine news and a big spike in U.S. bond\nyields, which I think just acted as a little bit of a check on\nunbridled U.S. dollar bearishness,\" he said.\n    The yen, a popular vehicle for bets against the dollar is\nnow, at 105.28 per dollar, some 2% below an eight-month high it\nhit against the greenback last week, when Joe Biden's lead in\nthe U.S. election spurred a wave of dollar selling.\n    The euro, itself heavily loaded with short bets\nagainst the dollar, was kept under $1.18 and also weighed by\nGermany's economic advisers cutting 2021 growth projections.\n\n    \"On the relative macro front, Europe is still on a weaker\nfooting compared to U.S.,\" said OCBC Bank strategist Terence Wu,\nwho believes the dollar's decline is running out of steam.\n    \"We also view the resilience in the Australian dollar with\nsome skepticism, and look to turn short on the Aussie if there\nare signs that equities are losing steam.\"  \n\n    REBOUND DOWN UNDER\n    Resistance to the dollar's strength in the Antipodes has\nbeen led by the kiwi, which added a whisker to\nWednesday's rise as the central bank's tone has traders less\nconvinced that negative rates are a sure thing anymore.\n    Rates markets moved sharply across the curve to price longer\nodds on that possibility on Wednesday, and yields inched higher\non Thursday as the kiwi hit an almost 20-month top of $0.6915.\n    \"Less stimulus is required than we thought in August, but\nstill a substantial amount of stimulus,\" RBNZ Assistant Governor\nChristian Hawkesby told Bloomberg in an interview.\n    ANZ Bank still thinks New Zealand rates head below zero in\nAugust 2021, but said it's now \"become a bit of a toss up\" and\nthat it is clear that going negative is no longer urgent.\n    A risk averse mood which spilled over from equity markets\nthrough the Asia session kept a lid on further gains, though,\nand pushed the Aussie down marginally to $0.7272.\n    Along with the virus, U.S. President Donald Trump's refusal\nto concede defeat in the election is also beginning to jangle\ninvestor nerves.\n    \"Market participants appear to assume recounts and legal\nchallenges are the only avenues for President Trump to remain in\noffice,\" said Commonwealth Bank of Australia analyst Joe\nCapurso.\n    \"However, there are other pathways,\" he said, such as\nRepublican state legislatures sending separate delegates to cast\nelectoral college votes in Trump's favour, or for \"faithless\nelectors\" to ignore the ballot box outcome.\n    \"We expect the dollar to jump sharply, by at least 5%, if\nPresident Trump does find a way to stay in office.\"\n    \n    ========================================================\n    Currency bid prices at 3:44PM in Sydney (0444 GMT)\n Description      RIC         Last           U.S. Close  Pct Change     YTD Pct     High Bid    Low Bid\n                                              Previous                   Change                 \n                                              Session                                           \n Euro/Dollar                  $1.1774        $1.1779     -0.03%         +5.03%      +1.1787     +1.1772\n Dollar/Yen                   105.2650       105.6400    -0.35%         -3.08%      +105.4750   +105.2150\n Euro/Yen                     123.93         124.15      -0.18%         +1.63%      +124.2200   +123.9400\n Dollar/Swiss                 0.9161         0.9169      -0.09%         -5.33%      +0.9170     +0.9157\n Sterling/Dollar              1.3207         1.3223      -0.09%         -0.39%      +1.3227     +1.3211\n Dollar/Canadian              1.3075         1.3062      +0.11%         +0.66%      +1.3077     +1.3059\n Aussie/Dollar                0.7272         0.7281      -0.12%         +3.64%      +0.7293     +0.7272\n NZ                           0.6877         0.6883      -0.07%         +2.21%      +0.6914     +0.6877\n Dollar/Dollar All spots\nTokyo spots\nEurope spots \nVolatilities \nTokyo Forex market info from BOJ \n        \n\n (Reporting by Tom Westbrook; Editing by Sam Holmes and Lincoln\nFeast.)\n  "}