{"text": "* Dollar index up nearly 1% this week* Aussie, kiwi sink as vaccine enthusiasm fades* World FX rates in 2020 tmsnrt.rs/2RBWI5ELONDON, Nov 12 The dollar dipped on Thursday as investors appeared to waver between optimism and caution over expectations about a COVID-19 vaccine that is unlikely to avert a grim winter in Europe and the United States as the pandemics second wave intensifies.The dollar index was down 0.15% by midday in London, off earlier lows as risk appetite rebounded a little from Asian trading hours. U.S. stock futures pared some of their losses in the run up to the start of trading in New York.The risk-sensitive Australian and New Zealand dollars made up some ground, last trading only about 0.1% lower.After an initial fall, the euro bumped higher by 0.3% to $1.1823.Activity in euro/dollar was a little lighter yesterday and I would suggest that after the vaccine related storm of activity at the start of the week, and after the U.S. election news, that the euro is trying to find its feet, said Jane Foley, head of FX strategy at Rabobank.In the near-term it seems that $1.18 could be a pivot.Foley added, however, that in the run up to the European Central Bank meeting in December the market may feel a little uncomfortable with long positions on the euro, particularly as Q4 economic data for the euro zone comes through, which she said would be undoubtedly poor.Europe is grappling with surging infections and new COVID-19 restrictions, with Germanys economic advisers trimming next years growth outlook. New York has ordered bars and restaurants to close early as U.S. cases hit record levels.Sterling licked its wounds as trade talks between Britain and the European Union seemed set to drag on past yet another deadline, raising the prospect that no trade deal may be reached before Brexit transition arrangements end on Dec. 31.The British currency last traded 0.4% lower to the dollar at $1.3167.The moves in the past week have for now put the brakes on a long drop for the dollar, which had shed about 10% against a basket of currencies between March and the announcement of progress on Pfizers COVID-19 vaccine on Monday.Larger moves were held in check as investors await speeches from Federal Reserve Chair Jerome Powell, European Central Bank President Christine Lagarde and Bank of England Governor Andrew Bailey at a central banking forum on Thursday.The weakness in broad USD and reflationary momentum in equities, which we saw on the back of the U.S. election and improvements in the vaccine situation, seem to be fading across FX and equities, said Christin Tuxen, Head of FX Research at Danske Bank.KIWI HOVERSBefore a cautious mood spilled over from equities trade into the currency markets, the kiwi made a fresh 20-month high versus the U.S. dollar as traders became less convinced that negative rates are a sure thing for New Zealand.Bond markets moved sharply across the curve to price longer odds on that possibility on Wednesday, and yields inched higher on Thursday as the New Zealand currency rose to $0.6915. It had last fallen back to trade 0.16% lower on the day at $0.6870.Less stimulus is required than we thought in August, but still a substantial amount of stimulus, RBNZ Assistant Governor Christian Hawkesby told Bloomberg in an interview.ANZ Bank still thinks New Zealand rates will head below zero in August 2021, but said its now become a bit of a toss up and that it is clear that going negative is no longer urgent.Along with the virus, U.S. President Donald Trumps refusal to concede defeat to Democrat Joe Biden in last weeks election is also beginning to jangle investors nerves.CBA analysts in Sydney say a 5% leap in the greenback is possible if Trump does find a way to stay in office, most likely by relying on electoral college delegates to cast votes for him even if their states endorsed Joe Biden at the ballot box."}