{"text": "* Dollar index close to three-week lows* Chinas yuan drops after central bank lowers reserve requirement* Riskier currencies stabilise* Graphic: World FX rates in 2020 tmsnrt.rs/2RBWI5E (Updates with yuan move, adds comments and detail)LONDON, Oct 12 Chinas yuan fell on Monday after the Peoples Bank of China (PBOC) changed its reserve requirements policy, a move seen as a bid to curb recent yuan appreciation, while the dollar index held near three-week lows.The onshore and offshore yuan both fell 0.8% against the dollar after Chinas central bank said on Saturday that it would lower the reserve requirement ratio for financial institutions when conducting some foreign exchange forwards trading.The yuan reached a 17-month high on Friday in both onshore and offshore trade. It has gained around 6% against the dollar since late May, driven by a favourable yield differential between China and other major economies.But on Monday the offshore yuan was on track for its biggest daily decline against the dollar since March, changing hands at 6.7446 at 0921 GMT.Its probably people covering long China positions, said Neil Jones, head of FX sales at Mizuho. Theres an element of liquidating long China positions because globally the market generally has been quite upbeat on China.The PBOCs move to end the requirement for banks to set aside cash to cover yuan forward transactions would make it easier to short the yuan, said RBCs head of Asia FX, Alvin Tan.This is being interpreted as a subtle signal from the PBOC to restrain the speed of the yuans rise, but how much of a restraint will become clearer with the upcoming daily fixings, Tan said.HSBC strategists wrote in a note to clients that the policy change was unlikely to reverse the downward trend in dollar-yuan.The move was also cited by analysts as a reason for weakness in the China-sensitive Australian dollar, which was down 0.3% on the day at 0.72205 at 0925 GMT.The New Zealand dollar was down 0.3% at 0.6653.The U.S. dollar index was steady, having seen its biggest loss in six weeks on Friday, when investors upped their bets that a fiscal stimulus package would be agreed to mitigate the economic fallout from COVID-19.The Trump administration called on Congress to pass a stripped-down version of the relief bill on Sunday, while negotiations on a broader package continue.The dollar has been buffeted by the on-again, off-again stimulus negotiations. Now, with Nov. 3 election only weeks away, investors are betting that Democrat Joe Biden is more likely to win the U.S. presidency and offer a larger economic package.Any negative fallout from a failure to reach a fiscal deal before the election will be dampened by expectations for even bigger stimulus after the election, MUFG currency analyst Lee Hardman wrote in a note to clients.Market participants remain optimistic over a Blue Wave, he added, citing polling data which shows a Biden lead.The dollar index was at 93.169 at 0927 GMT, up 0.1% on the day and having almost completely reversed its recovery at the end of September.The euro was down 0.2% on the day at $1.1803. In Europe, the World Health Organization has urged governments to restrict activity to combat a rapid rise in COVID-19 infections.Speculators cut their euro long positions to a two-month low in the week to Oct. 6, weekly CFTC data showed.European Central Bank President Christine Lagarde is due to speak at 1100 GMT.The yen was up 0.1% against the dollar at 105.540. The safe-haven Swiss franc was flat against the euro at 1.076 ."}