{"text": "Christopher Droney departed from the 2nd U.S. Circuit Court of Appeals in January 2020, after eight years as an appellate judge and 14 as a U.S. district judge in Connecticut. Hes now in private practice at Day Pitney.Droney, who was appointed to the trial court by President Bill Clinton and to the appellate court by President Barack Obama, opted to retire completely from the bench when he turned 65.President Donald Trump reshaped the federal bench, and especially the appellate courts, with dozens of judicial appointments. With Democrats now in control of the presidency and the Senate for the first time in nearly a decade  and with at least 60 judges eligible for senior status  I spoke to Judge Droney on Thursday morning about the role of politics in judges decisions about stepping down, how courts treat senior judges and his own experience since hes left the court.What follows is a condensed version of our conversation, edited for clarity and brevity.FRANKEL: Judge, weve seen a rash of announcements since President Biden took office from judges saying that theyre going to step down or take senior status. How much does politics come into these decisions? You were appointed to both the trial court and the appeals court by Democratic presidents. But you stepped down during a Republican administration.DRONEY: Well, I think it plays some role, especially in the last four years because the Senate under (Majority Leader Mitch) McConnell appointed so many federal judges. But in my case, I didnt have to worry about it as much because I had some role in the appointment of my successor (William Nardini). Hes a terrific judge and is a mainstream judge and not someone that I think the public would worry about.But certainly in the last four years its been much more political, and I think that the real reason ... was (getting rid) of the requirement that there be 60 votes to confirm. All you need now is 51. So thats really what drove the train the last four years.VIDEO:Judge Droney: \"I like being back in the real world again\"FRANKEL: Do you think that there were judges who held off on retiring or taking senior status after the filibuster rules changed for judicial appointments because of political considerations?DRONEY: Sure, I know of at least one who held off for a while and she just took senior status right after the new president was sworn in.FRANKEL: Weve seen on the Supreme Court that there starts to be some pressure for justices to step down when a particular political party is in power. Is there the same kind of pressure on appellate judges, in particular, knowing how many appointments were filled in the last four years?DRONEY: Im not aware of any senators calling into the 2nd Circuit, suggesting people go senior.FRANKEL: What would the response be? Would judges just be like, Come on. Get out of here?DRONEY: Well, it depends on the individual and how close they are to the particular senator. I think youd be polite, but youd say, I understand your point of view, Senator, but you know Ive got my own decision to make. Thanks for your input.I dont think theres any pressure that anybody can bring on judges to take senior status or retire.FRANKEL: When you were on the bench were there many senior judges and how active were they in the business of the 2nd Circuit?DRONEY: They are very active. They only have to sit 25% of the time of an active judge, but I dont know anybody who sat (for that) few sittings. Most of them sat far more than that.You wrote an article and Professor (Marin) Levy wrote an article (for the Northwestern Law Review) about the issue of trying to convince active judges to go senior.But I thought we treated seniors just like active judges, except for en banc. That's the only real difference that I saw: Unless they sat on the panel decision, they couldn't sit en banc. But other thanthat,I thought we treated the seniors just like the rest of us.If they wanted to write an opinion, they got the opinion. But I'm sure other circuits are different.FRANKEL: That law review article that you referred to does make it sound like the 2nd Circuit does a great job of respecting senior judges, but is there any reason that other circuits are not so good at it?DRONEY: I dont know of any reason. We certainly benefited from their participation.People like Guido Calabresi or Ralph Winter, you know, who are legends? Why wouldnt you want to hear what Guido Calabresi has to say? Or why not have him write the tort opinion that your panel is looking at? Or Ralph Winter, who just left us, write the antitrust opinion?I mean, maybe you try to talk one of the judges out of his or her chambers if she wasnt being productive and then she could be in a smaller chambers with fewer clerks, but I never saw that because everybody is working pretty hard.I wasnt on another circuit. I was just on mine  and boy, it worked great.FRANKEL: OK, so its been a little more than a year, since you went into private practice and into community service. What is the best thing about being off the bench? And what advice would you give to the many judges who are (soon) going to join you in being either senior or off the bench entirely?DRONEY: Well, every decision is an individual one.Itmatters what the individual circumstances are of each judge, so I leave it to that. But as to the best thing: One of my colleagues said that I had my First Amendment rights restored when Iretiredand I was able to write up op ed articles on the Michael Flynn case and the Roger Stone sentencing and pardon.I felt like I had a lot of things to say about that because of my background as a former U.S. attorney and a federal judge. And Ive signed some letters supporting, for example, Merrick Garland as Attorney General to the United States. I think hed be terrific.So those are things I really wanted to do again  to kind of be back in making my positions known, especially given the jobs Ive had in the past. I think its helpful to have somebody who was a trial judge or was a circuit judge or was U.S. attorney say theres something wrong with what the Department of Justice did in the Flynn sentencing and the motion to dismiss the Flynn case by the government.Thats what Ive enjoyed the most: being able to make my views known and not having to worry about compromising my job as a judge.FRANKEL: Wow, that was an unexpected response, but really interesting.DRONEY: What did you think I was going to say? I enjoyed skiing a little more, playing golf?FRANKEL: I thought youd say its fun to get back into working with clients. Thats what people usually say.DRONEY: It is! Ive got some great cases Im working on with great lawyers at my firm, and I do like helping people, too, as a lawyer. Im doing a big pro bono case for the Innocence Project. I couldnt do that before. Ive loved all my prior jobs too, but I do like being back in the real world again.The opinions expressed here are those of the author. Reuters News, under the Trust Principles, is committed to integrity, independence and freedom from bias."}