{"text": "WASHINGTON Dr. Deborah Birx, the former Trump White House Coronavirus Task Force coordinator, is taking a private sector job, joining a Texas manufacturer that says its purifiers clean COVID-19 from the air within minutes and from surfaces within hours.Birx will join Dallas-based ActivePure as chief scientific and medical adviser, she and the company said on Friday.An expert in global health, Birx came to the White House in 2020 to help lead the Trump administrations response to the pandemic.But she was criticized for not standing up to former President Donald Trump as he played down the virus, predicted it would disappear, and questioned whether ingesting bleach could help cure infected Americans.While her friend and former mentor, Dr. Anthony Fauci, was promoted to become a top medical adviser to Democratic President Joe Biden, Birx did not get a job in the new administration.The Biden administration wanted a clean slate, she told Reuters in an interview. I understand that completely.Birx left government earlier this week.She and Fauci, she said, asked themselves regularly what could have been done differently over the last year.When you have the 100,000 people we lost over the summer, and the 300,000 people we lost over the fall-winter surge, you have to ask yourself and have to know that it didnt go as well as it should have, she said.All of us are responsible for that.The coronavirus has killed more than 530,000 people in the United States, more than any other country.Birx said she was still processing regrets and steps she could have taken to do be more effective.Im trying to rank order them, she said. We have to be willing to step back and really analyze where we could have been and why we werent more effective.Birx said she remained concerned about the level of testing in the country, but she praised the new administration for modeling mask-wearing and other behaviors that help to combat the virus.Trump, a Republican, eschewed masks.I think the messaging has been very good, very consistent, she said of the Biden team. Thats really important when youre asking people to change their behaviors.In addition to her role at ActivePure, Birx has also joined the George W. Bush Institute as a global health fellow and the biopharmaceutical company Innoviva as a board member, she said."}