{"text": "A former federal prosecutor and special inspector general who oversaw a $700 billion U.S. government bailout fund was named on Wednesday as the independent monitor to oversee the United Auto Workers union.The appointment of Neil Barofsky, now a lawyer at Jenner & Block, was approved by U.S. District Judge David Lawson.In total, 16 people have been convicted in a wide-ranging probe conducted by the office for the U.S. attorney for the Eastern District of Michigan, which last December reached a deal with the union for independent oversight.  read more On Tuesday, former UAW President Dennis Williams, was sentenced to 21 months in prison and fined $10,000 on Tuesday for conspiring to embezzle union funds.Under the Justice Department consent decree, Barofsky has  authority to exercise disciplinary powers within the UAW, investigate possible fraud or corruption within the union, and seek discipline against UAW officers and members.The monitor can investigate, audit and review all aspects of the UAW other than collective bargaining agreements.Several UAW officers, including the two former UAW presidents, have pleaded guilty to embezzling millions of dollars for their personal benefit, using the funds to purchase expensive liquor and cigars and to pay for golfing outings and related equipment, and expensive hotel stays.The UAW represents about 400,000 U.S. workers, including workers at Detroits Big Three automakers and in other fields. At its peak in 1979, the union had a membership of some 1.5 million.Barofsky's oversight of the UAW is scheduled to last six years, with a potential early termination or extension depending on the circumstances. Barofsky said Wednesday he was \"honored by this historic assignment and look forward to working with the UAW and the government in carrying out the Consent Decree.\"In 1988, the U.S. Justice Department sued to force out senior leaders at the International Brotherhood of Teamsters union and appointed a trustee because of the unions connection to organized crime. The government oversaw the Teamsters from March 1989 until 2015, and a five-year transition period ensued."}