{"text": "Two-time All-Star pitcher Jim \"Mudcat\" Grant has died. He was 85.The Cleveland Indians, one of his former teams, said Grant died peacefully in Los Angeles on Friday night.Grant was the first Black 20-game winner in American League history when he went a career-best 21-7 for the Minnesota Twins in 1965. He tossed six shutouts and was an AL All-Star that season.Grant went 2-1 in three World Series starts for the Twins in 1965 when they lost to the Los Angeles Dodgers in seven games. He played nearly four seasons with the franchise from 1964-67.\"The Minnesota Twins are deeply saddened by the loss of Jim 'Mudcat' Grant, a key part of the franchise's early years in Minnesota and linchpin of the starting rotation on the record-setting 1965 club,\" the Twins said in a statement. \"Though he spent just four years of his 14-year career with the Twins, Mudcat remained a beloved member of our organization well into his retirement and was a frequent visitor with fans and staff alike at TwinsFest. We send our condolences to the entire Grant family, as well as the other organizations impacted by his 60-plus years in and around the baseball world.\"Overall, Grant went 145-119 with a 3.63 ERA in 571 appearances (293 starts) with seven teams from 1958-71. He had 18 shutouts among 89 complete games.Grant broke in with the Indians and went 67-63 with a 4.09 ERA in six-plus seasons. He recorded 50 complete games, eight shutouts and nine saves for Cleveland.Grant was an All-Star for the Indians in 1963.\"The Cleveland Indians family is deeply saddened by the loss of Jim \"Mudcat\" Grant, a true fan favorite on both the playing field and in the broadcast booth,\" Indians senior vice president for public affairs Bob DiBiasio said in a statement. \"A native of Lacoochee, FL, he joined the Indians organization at the age of 18 in 1954, made his Major League debut in 1958, and left a legacy as large as his personality. To this day, Mudcat was a cherished member of the Indians Alumni Ambassador Program. We send our condolences to the entire Grant family , as well as to his many teammates and other organizations impacted by his 60-plus years in our game.\" said Bob DiBiasio, Indians SVP/Public Affairs.Hall of Famer Fergie Jenkins, himself a Black pitcher, was among the many folks paying homage to Grant.\"Saddened to hear about the passing of Mudcat Grant,\" Jenkins said on Twitter. \"The first Black Ace and basically wrote the book on pitching. One of my best friends. My thoughts are with the Grant family. You will be missed my friend.\"Grant also played for the Dodgers (1968), the expansion Montreal Expos (1969), St. Louis Cardinals (1969), Oakland Athletics (1970, 1971) and Pittsburgh Pirates (1970-71)--Field Level Media"}