{"text": "Former Kansas City Chiefs assistant coach Britt Reid was charged on Monday with driving while intoxicated during a February crash near Arrowhead Stadium that left a 5-year-old girl severely injured, the prosecutor's office in Jackson County, Missouri, said.A police investigation determined that Reid, 35, who is the son of Chiefs head coach Andy Reid, was driving a truck that was traveling nearly 84 miles per hour (135 kph) just before the crash, prosecutors said.A test of his blood serum after the crash showed his blood alcohol concentration to be at 0.113, according to prosecutors. The legal limit while operating a motor vehicle in Missouri is 0.08.If convicted of the Class-D felony DWI, Reid could face up to seven years in prison, according to media reports.Jackson County Prosecutor Jean Peters Baker said her office \"will vigorously pursue these charges and Reid is not receiving any favorable treatment from Kansas City police or the Jackson County Prosecutor's Office.\"The girl injured in the crash, according to medical records, suffered severe traumatic brain injury, a parietal fracture, brain contusions and subdural hematomas.Last month, an attorney for the girl's family said her prognosis was \"grim\" and that it is believed she will have lifelong brain damage.  read more \"We are going to be advocating for the most serious charges and the most serious sentence that Britt Reid could receive,\" attorney Tom Porto told ABC's \"Good Morning America.\"Reid's lawyer, J.R. Hobbs, said in a statement that his client had been released after posting bond on Monday.\"Mr. Reid voluntarily appeared before the court for his initial appearance and was released on conditions of bond,\" Hobbs said.\"A status conference will be set in the future as is customary. There will be no further comment at this time.\"In the Feb. 4 incident, Reid's truck struck a disabled vehicle and another vehicle that was attempting to offer assistance while both vehicles were pulled over to the side of the road. It came three days before the Chiefs lost to the Tampa Bay Buccaneers at the Super Bowl in Tampa, Florida.Reid, who was hospitalized and needed surgery for injuries he sustained in the crash, did not make the trip to Tampa and is no longer with the team.\"The Kansas City Chiefs organization remains steadfast in our concern for all who have been impacted by this tragic accident,\" the team said in a statement on Monday.\"The Chiefs are regularly in contact with the family's designated representative during this challenging time.\""}