{"text": "Former Hong Kong stock exchange CEO Charles Li plans to launch a platform this autumn for global institutional investors to fund China's small and medium enterprises (SMEs).Li told Reuters in an interview that in \"traditional finance\" investing in SMEs was rarely worthwhile for global institutions as the due diligence was difficult, risks were high and funding amounts small. To bridge this gap, Li is proposing that large Chinese companies, for example restaurant chains, franchises or food and delivery platforms provide funding to their suppliers or partners in return for a cut of their counterparty or smaller company's future revenue for an agreed period of time.\"There's one financial indicator that is completely digitalized in China which is their revenue,\" Li said, adding that franchise owners, or platform companies often \"get their access to the cashflow before the little guy has it.\" These investment opportunities would be listed on Li's new NUMAex platform, allowing global institutions to provide the necessary capital in return for interest.Li is the majority shareholder in Hong Kong-based New Markets HK Ltd, which will operate NUMAex. It currently has about 30 employees.He stepped down from Hong Kong Exchanges and Clearing (0388.HK) last year after 11 years during which it completed a $2.2 billion takeover of the London Metal Exchange and made an unsuccessful approach for the London Stock Exchange Group (LSEG.L) in 2019. The new project would initially target family offices, insurance companies and private wealth managers, to whom the SMEs' cashflow data would be disclosed in real time, Li said. Li detailed his new venture on the sidelines of the annual Parliament meeting this week and in connection with a related proposal he submitted as a Chinese People's Political Consultative Conference (CPPCC) delegate.He expects NUMAex to have signed memoranda of understanding with around 20 companies at launch, though only a handful would already be listed with executed cash flow swaps in progress.\"China needs a new breed of financial institutions ... that are fundamentally different,\" he added. "}