{"text": "Foxconns planned $10 billion investment in the U.S. state of Wisconsin did not create enough jobs in 2019 to earn tax credits, the state government said last month, the second year the company missed targets touted by President Donald Trump as a major economic win.For many, the factory has become a symbol of failed promises in Midwestern states that were key to Trumps 2016 election but flipped to Democrat Joe Biden last week. Trump is seeking some recounts.Foxconn said on Thursday its investment plan did not depend on who the U.S. president was. It was, however, exploring the option of building a new production line there.We continue to push forward in Wisconsin as planned, but the product has to be in line with the market demand ... there could be a change in what product we make there, Chairman Liu Young-way said at an investor conference.Possible new products include those related to servers, telecommunications and artificial intelligence, he later told reporters.Foxconn initially sought to make advanced large-screen displays for TVs at the Wisconsin site. It later said it would build smaller liquid crystal display screens instead.Foxconn, formally Hon Hai Precision Industry Co Ltd, reported near flat third-quarter profit on Thursday, beating market estimates amid firm demand for telecommuting devices amid a coronavirus-induced work-from-home trend.It booked July-September net profit of T$30.8 billion ($1.08 billion), Reuters calculations showed based on nine-month figures, versus T$30.7 billion a year earlier.That compared with the T$28.61 billion average of 13 analyst estimates compiled by Refinitiv.Chief Financial Officer David Huang said third-quarter revenue fell 7% due to clients delaying product launches.Still, Liu said Foxconn saw stronger than expected demand for both smartphones and servers, with strong shipments of Apples new iPhone 12 supporting revenue.Analysts and Liu expect this trend to continue in the coming months. Foxconn is likely to assemble all premium models and 70% of other models, said analysts, including those from Taipei-based Fubon Research.Foxconn expects consumer electronic product revenue to rise about 10% in the fourth quarter, as well as next year.Consumer electronics, including smartphones, made up 41% of revenue in the third quarter, followed by devices for cloud computing at 28% and other computing products such as laptops at 24%.Underscoring weak demand during the pandemic, global smartphone shipments fell 1.3% from a year earlier in the September quarter, data from researcher IDC showed.($1 = 28.5080 Taiwan dollars)"}