{"text": "Paris has said it will delay a European Union financial services deal with Britain until Prime Minister Boris Johnson grants European fishermen fair access to UK waters, a source familiar with the French move said on Wednesday.\"We've made a link between the two,\" the source said.The post-Brexit dispute over access to the UKs rich fishing grounds last week saw France and Britain send patrol vessels to the Channel island of Jersey as French trawlers protested there.A second source, an EU diplomat, said Britain was failing to adhere to the terms of a deal governing its post-Brexit trade ties with the EU. There can be no progress in other areas if these are not resolved, the person added.\"It's not just France and it's not just fishing,\" said the European diplomat. \"Britain must fully apply the agreements it signed up to, which is not the case right now.\"Britain's huge financial services sector was largely cut off from the EU, its biggest export customer, on Dec.31 when the UK completed its departure from the bloc.A new UK-EU trade deal does not cover financial services and direct access to the single European market for financial firms in the City of London has yet to be decided by the bloc under a process known as equivalence.Britain and the EU have agreed in principle on a memorandum of understanding on cooperation between financial regulators, but it has yet to be formally ratified by the bloc's 27 member countries, including France.\"We will resume our equivalence assessments once the regulatory cooperation framework is in place and do so on a case-by-case basis, taking into account the UK's regulatory intention,\" the EU's financial services chief Mairead McGuinness said on Tuesday.Banks in Britain say they don't expect the EU to grant meaningful direct access anytime soon and that the time is better spent on making the City more globally attractive.French fishermen say Jersey, a self-governing British Crown Dependency, unilaterally imposed restrictions on the waters they could fish in when it issued licenses it late April.Jersey has since proposed delaying new post-Brexit restrictions on French fishermen until the end of July, French Seas Minister Annick Girardin told parliament on Tuesday.New proposal by Jersey: Were not there yet, the minister later tweeted."}