{"text": "The seven-month fight between Frances leading waste and water utilities has ended with honours roughly even. After pulling out all the stops to fend off a takeover by Veolia (VIE.PA), Suez (SEVI.PA) on Monday accepted a deal that values the company at almost 13 billion euros. Suez boss Bertrand Camus can claim to have squeezed a few extra euros out of his rival. Meanwhile, the 14 billion euro buyer scoops up 500 million euros of cost savings in North and South America without bursting its banks.Given a rivalry that stretches back to the 19th century, any takeover was always going to be a passionate affair. The thorniest issue was what to do with Suezs domestic water and sewage operations which, combined, would have been too much for French competition regulators. Camus attempted to thwart Veolia by transferring the business to an employee-controlled foundation. But once Veolia boss Antoine Frrot had lined up new owners for the unit, including infrastructure investor Meridiam and state-backed Caisse des Depots, it was only a matter of time before Suezs defences were breached.Veolia is paying 20.50 euros per share for Suez, nearly 14% above its previous bid. However, the bill for Frrot works out at just under 12.4 billion euros, thanks to the 29.9% stake he picked up last year at a slight discount. Including Suezs 9.7 billion euros of net debt, the deal  including the soon-to-be-separated French operations  is costing Veolia 22 billion euros.That just about stacks up. Suez will make an operating profit of 1.6 billion euros in 2022, according to forecasts compiled by Refinitiv. Add the expected cost savings and deduct French corporation tax at 27%, and Veolia should reap a post-tax return of 1.5 billion euros, or about 6.8% of its outlay. Thats slightly above Suezs 6.4% cost of capital, as estimated by Morningstar.Splitting off the French business, along with relatively minor operations in Africa and Asia, should further improve Frrots sums. Meridiam said the New Suez was worth around 7 billion euros, lowering the all-in cost for Veolia and leaving it to focus on the bits with the greatest overlap.Suezs defensive shenanigans and the months of wrangling may not have burnished the appeal of French M&A. Ultimately, however, shareholders on both sides can claim an honourable draw.On Twitter https://twitter.com/edwardcropleyCONTEXT NEWS- French water and waste management utilities Veolia and Suez said on April 12 that they had agreed a deal worth nearly 13 billion euros, ending months of wrangling over the terms.- Under the agreement, Veolia will pay 20.50 euros per share in cash for the 70.1% of Suez that it does not already own.- Suezs French water and sewage operations, along with its operations in Italy, the Czech Republic, Africa, Central Asia, India, China and Australia, will be split off into a New Suez which will be owned by shareholders including French investors Meridiam and Caisse des Depots.- Suez shares were up 7.9% at 19.90 euros by 0820 GMT on April 12. Veolia shares climbed 6.8% to 24.11 euros.- For previous columns by the author, Reuters customers can click on"}