{"text": "It's not surprising U.S. President Joe Biden's $1.9 trillion coronavirus emergency plan touched off concerns that a gusher of federal spending on the possible eve of a vaccine-fueled economic take-off might lead to inflation.What is surprising is who is doing the fretting: Not debt-hawk Republicans but former Treasury secretary, Democratic stalwart and Harvard University professor Lawrence Summers, who in a recent Washington Post essay said the Biden plan could \"set off inflationary pressures of a kind we have not seen in a generation ... Stimulus measures of the magnitude contemplated are steps into the unknown.\"       Summers' critique, however, represents perhaps only the most prominent breach in what had seemed a broad consensus among economists that in responding to the pandemic - an unforeseen shock that brought a healthy economy to a standstill - it was near impossible to do too much.Turns out that thinking is SO last year. As the details of the Biden plan work through Congress, the one-size-fits-all, spend-it-fast approach that fueled approval of the initial relief measures nearly a year ago has shifted to a more detailed argument over whether spending less might deliver a better result.  The debate has veered from economic wonkiness - what dataset best estimates household spending? how big is the \"output gap\" anyway? - to more recently resemble a family feud, replete with snarky tweets and, on Friday, a staged showdown between Summers and Nobel economics laureate and New York Times columnist Paul Krugman.In the webcast debate, organized by Princeton University, Summers questioned adding another $1.9 trillion in stimulus to a \"potentially booming economy.\" \"There is no question there is tremendous suffering,\" he said, but \"this goes way beyond what is necessary.\"Krugman called Summers' concerns exaggerated and, echoing comments by Federal Reserve Chair Jerome Powell earlier this week, likened rescuing the coronavirus-battered economy to fighting a war.  \"When Pearl Harbor is attacked you dont ask how big is the output gap,\" he said.Biden administration officials have brushed off Summers' arguments as \"flat out wrong,\" with Treasury Secretary Janet Yellen - who holds Summers' old job and was chosen over him for chair of the Federal Reserve by then-President Barack Obama in 2013 - saying the millions of unemployed were proof of the need to \"go big.\"Former Fed economist Claudia Sahm, an advocate of faster and more generous pandemic spending, on Twitter blasted naysayers for what she called \"dangerous fear-mongering about inflation\" that could cut the recovery short.  NEW YEAR, NEW CONCERNSBut it isn't just Summers raising questions about the economics of the Biden package through a lens of general sympathy to it.A research team including Harvard's Raj Chetty, best known for groundbreaking research on the slowing ability of the poor to move into the U.S. middle class, has suggested lowering the income cutoff for $1,400 \"stimulus\" checks from $75,000 might make sense because those making more than that won't spend the money fast enough to help the economy now.Jason Furman, who chaired Obama's Council of Economic Advisers, has recommended the additional $400 in weekly unemployment insurance proposed by Biden be scaled back over time so people will be motivated to find jobs as the rollout of vaccines makes it safer to work. \"There is a risk of people taking too long to get into jobs, being too optimistic and ending up being long-term unemployed. This risk was trivial relative to the need to support people in 2020, by this fall it will be more real,\" he wrote.In his Friday debate with Summers, Krugman acknowledged stimulus checks had a weaker economic justification than other aid, such as unemployment insurance, but said: \"They are also the most popular. That's part of making policy.\"It's not clear if the debate will influence the outcome of a bill that may move intact through a Congress controlled by Democrats. \"It is going to pass with Kamala Harris vote,\" Krugman said. \"And then we will find out\" in coming months who was right."}