{"text": "MELBOURNE American Taylor Fritz criticised Australian Open organisers after his third-round defeat by top seed Novak Djokovic was halted for 10 minutes while fans were removed from Rod Laver Arena on Friday to comply with fresh lockdown restrictions.The 23-year-old was on his way back to levelling his clash with an injured Djokovic when the umpire told the players to leave the court midway through the fourth set while fans made their way to the exits to comply with the COVID-19 lockdown.Melbourne went into a five-day lockdown from midnight after an outbreak of the virus at a hotel in the city.I mean, to be honest, like, completely honest, its absolutely ridiculous that at a Grand Slam match were asked to leave the court for 10 minutes in the middle of the match, like, in the middle of the fourth set, he told reporters.I understand the fact that Victoria is going back into lockdown and people have to go. If thats the case, then we shouldnt have played tonight if we werent going to finish the match on time.This years Australian Open was delayed by three weeks so that players were given enough time to quarantine and prepare for the tournament. Limited crowds have been permitted but the next five days will be without fans.The boisterous atmosphere had riled Djokovic at times but he recovered to win 7-6(1) 6-4 3-6 4-6 6-2 and stay on course for a record-extending ninth Australian Open title.Fritz said the fans leaving harmed his hopes of a shock win.I guess not having fans there did I feel hurt me because they were kind of pushing for me, the American said. But, you know, we still came back and I won the set.Its not like it made that big of a deal. I just think its not really proper conditions to play a third round of a slam.Fritz also said he would be surprised if Djokovic was unable to play his fourth round match against Canadian Milos Raonic.He obviously wasnt looking too good in the third and the fourth sets, but I mean he looked pretty good to me in the fifth. If he can play like he played in the fifth, I dont see why he wouldnt play. Hell beat pretty much anyone."}