{"text": "JOHANNESBURG/MUMBAI - As the coronavirus pandemic upended the global diamond industry, shuttering mines from Lesotho to Canada and disrupting supply chains, Rajen Patel swapped diamond polishing for peanut farming. \\Patel, who worked for a decade in Indias Surat where about 80% of the worlds diamonds are polished, joined the exodus of gem workers leaving the city as cases of the virus shot up. After taking up farming in his home village, he has no plans to return in the coming months.I wont earn as much I was earning in Surat, but I wont starve and there is no fear of getting infected with coronavirus, he said.Demand for diamonds has plummeted during the pandemic, freezing sales and squeezing prices. With temporary mine closures at risk of becoming permanent, diamond miners are seeking ways to extract more value from their stones.The lone bright spot has been steady demand for large, high-quality diamonds from affluent investors, according to financiers and sales data.There are a lot more enquiries from people seeking to buy these luxury stones as a hedge, said Chris Del Gatto, CEO of the DelGatto Diamond Finance Fund, the largest non-bank lender to the diamond, jewellery and watch industries.Prices for high quality one-carat diamonds are rising steadily and are currently around 12% higher than at the start of the year, in contrast to still-depressed prices for lower-quality stones of the same size, data from trading platform RapNet shows.For an interactive graphic, click hereGRIM YEARCOVID-19 has forced miners to cancel or delay sales, with major diamond shows scrapped due to health and travel restrictions. The few sales that have taken place showed rough diamond prices down between 15% and 27%.What has happened in the second quarter, I have never seen in my life, De Beers Chief Executive Bruce Cleaver told Reuters. There was no really properly functioning rough market.Indian imports of rough diamonds plunged from $1.5 billion in February to just $1 million in April, data from the Gem & Jewellery Export Promotion Council shows.For an interactive graphic click here hereAntwerp, another diamond hub, saw rough imports drop 20% year-on-year in the first half, according to data from Antwerp World Diamond Centre. The city's exports of polished diamonds fell 46%.https://graphics.reuters.com/HEALTH-CORONAVIRUS/DIAMONDS/qzjpqwmknpx/chart.pngREAL OPPORTUNITYIn a bid to survive, some miners are trying to change the traditional pricing game by securing a cut of onward polished diamond sales, and miners may eventually have direct tie-ups with luxury jewellery brands, RCC Diamond Consultants managing director Richard Chetwode predicts.There is real opportunity within the diamond business as a whole to modernise the sales system, said Lucara CEO Eira Thomas. Lucara has also set up an online diamond sales platform.In the meantime, miners are hoping production cuts will help prices recover. With Rio Tintos massive Argyle diamond mine in Australia among those coming offstream soon, global diamond production will likely be reined in until 2025, independent analyst Paul Zimnisky forecasts.For an interactive graphic, click here hereSeveral diamond mines shuttered due to the pandemic have also yet to reopen, including Stornoway Diamonds Renard mine in Canada, Petra Diamonds Williamson mine in Tanzania, and Firestone Diamonds Liqhobong mine in Lesotho, which the company said would likely stay closed until April to preserve cash.Even De Beers is feeling the pain, saying job cuts are likely, as it remains unclear whether supply will shrink enough to meet plunging demand in the global diamond jewellery market, which Bain estimated was worth $80 billion in 2019.Industry hopes that the pandemic would boost sales of engagement rings as people reassessed life priorities and more made plans to get married have not borne out.Overall, fine jewellery sales are expected to drop 19% this year, compared to a 3% rise last year, according to Euromonitor.Graphic: Fine jewellery sales to drop 19% this yearhttps://graphics.reuters.com/HEALTH-CORONAVIRUS/DIAMONDS/gjnvwxrgnpw/chart.png"}