{"text": "NEW YORK At the height of the coronavirus pandemic in New York City in April, physician Michael DUrso was scrambling to care for the seemingly ever-increasing number of patients being wheeled into the emergency room where he worked.In Miami, his identical twin brother Dennis, also an emergency room doctor, listened to Michael's experiences on the front lines, providing support and encouragement, while bracing for the onslaught to hit his own state. hereFor a time, it appeared Florida would avoid New Yorks fate as a pandemic epicenter. But come July, confirmed coronavirus cases and deaths began sky-rocketing in the sunshine state.For the 31-year-old twins, the tables were turned.Now with the focus in Miami, the relationship has mostly flipped, with me calling him with my experiences and the newest treatment protocols we are using, Dennis told Reuters.They speak a few times a week, whenever their schedules allow. Michael is now the one to encourage, dispense advice, and quell his brothers frustration at peoples disregard for social distancing rules and mask mandates.There have been bad days. Those days when Dennis said he felt overwhelmed by the severity of the illness and the sheer number of patients, many needing intubation. Staff at Jackson Memorial Hospital, where Dennis works, have also faced a surge in COVID-19 related cardiac arrests.While New Yorks COVID-19 caseload reached as high 66,000 new cases a week in April, Floridas peak weekly rise was 7,500 during the same month, according to a Reuters tally.By July, however, Florida was struggling to contain the spread of the virus, recording more than 80,000 new cases during one week. In New York, cases had fallen to around 5,000 weekly during the same month.(For an interactive graphic tracking U.S. cases and deaths see here)MARATHON AT A SPRINTING PACEAcross the United States, hospitals are straining to deal with a virus that shows little sign of abating, six months into the pandemic.You can see the effects of time, of just the stress of working so hard and pulling in new resources to keep up taking care of these patients, Dennis said. Its become a marathon and weve been running it at a sprinting pace.There was one distressing trend Dennis wasnt able to glean fully from his brothers experience in New York City: the high numbers of younger, healthy patients flooding the emergency room as the surge hit Miami.One case that stuck with him was that of an otherwise healthy COVID-19 patient in his late 40s. Despite the staffs best efforts to treat him, the patients condition rapidly deteriorated. He died after going into cardiac arrest.To think that you have to tell this family whos not allowed into the hospital for their own safety that now this person, who previously had no medical problems, succumbed to this disease despite of all the treatments that we have available in the emergency room was absolutely shocking, Dennis said.BACK TO NORMALIn New York, life is now flowing at a more manageable pace for Michael, who works at New York-Presbyterian Brooklyn Methodist Hospital.He said the number of coronavirus critically ill patients he tends to has dropped since April and medical professionals have learned some of the hard lessons of the first few months of the pandemic, which have given them a better handle on the disease.And the mere fact that COVID-19 no longer is the perpetual topic of conversation among colleagues, family and friends has been a source of relief.Just having seen the numbers decline and not having every conversation of every shift be about whether this patient has coronavirus and whether were going to save them has relieved a lot of the stress, Michael said.Still, as New York City crawls towards its new normal with more people going back to the office and school due to resume in September, the young doctor urged caution.Even though the numbers are low, theyre still not zero. So, as much as we want to get back to normal we still have to remember that, even in New York City, were still dealing with a pandemic, he said."}