{"text": "London's FTSE 100 ended lower on Monday, as heavyweight mining stocks slipped amid a drop in metal prices and a stronger pound weighed on the export-heavy index, while shares of drug developer C4X Discovery surged after a licensing deal with Sanofi.The blue-chip index (.FTSE) ended 0.4% lower after recording its best weekly performance since early January on Friday.Miners Glencore (GLEN.L), BHP Group (BHPB.L) and Anglo American (AAL.L) fell between 0.9% and 1.8% and were the top drags on the index, tracking lower metal prices.The domestically focussed mid-cap FTSE 250 index (.FTMC) dropped 0.4% even as England's shops, pubs, gyms and hairdressers reopened after three months of strict winter lockdown.  read more There is not much cheer on the reopening as it seems to be already factored in and neither are concerns of cases increasing as shops reopen,\" said Keith Temperton, equity sales trader at Forte Securities.\"Investors seems to be holding back as markets have rallied in a short time, and would wait until the earnings season kicks in.The FTSE 100 has risen 6.6% since the beginning of the year as huge vaccine rollouts coupled with added government stimulus helped boost investor optimism about a faster economic rebound. But a recent drop in metal prices and elevated yield levels have kept gains limited.C4X Discovery (C4XD.L) jumped nearly 8% after the drug developer signed an exclusive licensing deal worth up to $492.12 million with French drugmaker Sanofi (SASY.PA) to develop an oral therapy for treatment of inflammatory diseases. Hammerson (HMSO.L) dropped 2.9% after it confirmed that it was in talks for a possible sale of its retail parks portfolio to Canadian private equity player Brookfield Asset Management (BAMa.TO). AstraZeneca (AZN.L) fell 0.9% and was the third biggest drag on the FTSE 100 as data from a late-stage study to test whether its diabetes drug Farxiga could treat patients hospitalised with COVID-19 and at risk of developing serious complications fell short of its main goals. read more "}