{"text": "NEW YORK The election of Democrat Joseph Biden could create more headaches for the Dakota Access Pipelines (DAPL) owners, who are already embroiled in legal battles to keep the main conduit for flowing oil out of North Dakota running.The $3.8 billion DAPL ships about 40% of the crude oil produced from the Bakken shale region in North Dakota to refiners in the Midwest and exporters in the U.S. Gulf. Without the 557,000-barrel-per-day line, getting oil out of the area, which has about 1 million bpd of output, would be much more difficult left to smaller existing pipelines and rail.DAPLs controlling owner, Dallas-based Energy Transfer LP, is fighting to keep the pipeline running after a judge threw out its permit to run the line under a South Dakota lake that is a water source for Native American tribes that want the pipeline shut.DAPL was a controversial project that sparked massive demonstrations starting in 2016 in North Dakota by native tribes and climate activists opposed to its completion.President Donald Trumps predecessor, Barack Obama, blocked a permit that would have allowed construction under South Dakotas Lake Oahe, a critical water source for the Standing Rock Sioux tribe.The line was finished in 2017 after Trump, upon taking office, approved a final permit allowing construction under the lake to be completed.In July, a U.S. district court judge threw out that permit, and ordered the U.S. Army Corps of Engineers to conduct a new environmental review that is expected to take months.Biden, who defeated incumbent Trump in last weeks election, could bring in new Army Corps leadership. That could increase the chances that the line would be shut. For now, the Corps has allowed DAPL to operate on federal land without a permit.The Biden transition team did not comment on their position.Executives at Energy Transfer do not expect the line to be shut.We really dont envision or see a scenario where we will take the pipeline out of service, Energy Transfer President and Chief Commercial Officer Marshall McCrea said on a quarterly earnings call with investors on Nov. 4, a day after the election. We just dont think thats going to happen.Regulators last month approved a plan to double the pipelines capacity.Dakota Access is appealing the rulings by the U.S. District Court for the District of Columbia ordering an environmental review and vacating the permit. Meanwhile, the district court is considering an injunction to shut the line while the review is carried out.If the court issues a shutdown order before Bidens inauguration, it would significantly increase the odds that his administration kills the project permanently, though he would retain the ability to do so even without such an order, said Glenn Schwartz, director of the energy policy service at Washington D.C.-based consultancy Rapidan Energy Group.The district court is expected to decide in the next couple of months on the shutdown order sought by opponents of the line.This is a major crude oil pipeline crossing unceded tribal land and affecting the water supply for millions of people, said Jan Hasselman, an Earthjustice attorney who represents the Standing Rock Sioux."}