{"text": "The city of Minneapolis on Friday agreed to pay $27 million to settle a lawsuit by the family of George Floyd over his death in police custody, a case that stirred national protests over racial injustice and police brutality.Floyd, a 46-year-old Black man, died in May as Derek Chauvin, a white Minneapolis police officer, kneeled on his neck for nearly nine minutes. Floyds dying pleas for help were captured on widely viewed bystander video, sparking one of the largest protest movements ever seen in the United States.Benjamin Crump, an attorney for the Floyd family, said the agreement was the largest pre-trial settlement of a wrongful death lawsuit in U.S. history.The size signifies that a Black persons death at the hands of police will no longer be written off as trivial, unimportant or unworthy of consequences, Crump said at a news conference where he was joined by Floyds relatives, Minneapolis Mayor Jacob Frey and other officials.Floyds family was pleased that this part of our tragic journey to justice for my brother George is resolved, his sister Bridgett Floyd said in a statement.While our hearts are broken, we are comforted in knowing that even in death, George Floyd showed the world how to live, her statement said.The trial of Chauvin, who was fired by the police force, began earlier this week in Hennepin Countys district court on charges of murder and manslaughter. Chauvin has pleaded not guilty and said he properly followed his police training.Judge Peter Cahill has set aside about three weeks for jury selection in the high-profile case. Five men and two women had been seated as jurors as of Friday afternoon.Last year, Floyds relatives sued the city, Chauvin and three other police officers involved in federal court, saying police used excessive force against Floyd in violation of his constitutional rights.Although Frey promised on Friday that the city would be unrelenting in reforming its police department, it was not clear if the city was admitting wrongdoing as part of the settlement, and city officials did not immediately respond to queries.Every American remembers where they were when they first saw it, Frey said of the video showing Floyds death. Todays settlement reflects our shared commitment to advancing racial justice.The settlement includes a $500,000 contribution from Floyds family to the community at the Minneapolis intersection where Floyd died, which has been barricaded against police access by residents and is filled with flowers and other tributes to Floyd.Chauvin was helping arrest Floyd on the evening of May 25 on suspicion of his using a counterfeit $20 bill to buy cigarettes at the Cup Foods grocery store at the intersection.The other three officers are due to go on trial later this year on charges of aiding and abetting Chauvin in Floyds death, which was ruled a homicide by the medical examiner. The Minneapolis Police Department fired all four officers the day after the deadly arrest."}