{"text": "WASHINGTON The prosecutor investigating whether Donald Trump tried to influence the result of Georgias 2020 presidential election suggested the former president knew what he was doing when he asked a state official to find one more vote than he needed to win.Fulton County District Attorney Fani Willis is investigating Trump after a Jan. 2 telephone call he made pressuring Secretary of State Brad Raffensperger to overturn the states election results based on unfounded voter fraud claims.The investigation is the second known state criminal probe of Trump, whose tax and business affairs are under investigation in New York. The probe was announced amid the second impeachment trial of the Republican former president, who is accused of inciting supporters to storm the U.S. Capitol on Jan. 6In the call with Raffensperger, which was recorded, Trump says: All I want to do is this: I just want to find 11,780 votes, which is one more than we have, referring to the narrow margin of President Joe Bidens victory in the state, one of a handful of swing states that cost Trump the White House.Investigators will examine whether a suspect understood the implications of his actions, Willis, a Democrat, said in an interview with MSNBC on Thursday night, without naming Trump.So, you look at facts to see did they really have intent, did they understand what they were doing? Willis said. Detailed facts become important, like asking for a specific number and then going back to investigate and understand that that number is just one more than the number that is needed.It lets you know that someone had a clear mind, they understood what they were doing.Trump made another call in December to Georgias chief elections investigator, Raffenspergers office has said.Willis sent letters on Wednesday to state officials, including Raffensperger and Governor Brian Kemp, both Republicans, notifying them of the investigation and asking their offices to preserve all records related to the Nov. 3 election.Although most media attention has focused so far on Trumps conversation with Raffensperger, Willis said the investigation will probably go past this one phone call.A grand jury could expect to get subpoenas in the case in March. Willis said investigators can ask a defendant to give a voluntary interview but depositions are not generally sought in criminal cases.Fulton County is Georgias most populous and includes the state capital Atlanta. Willis said her security detail has doubled since the case was opened, and she had been subjected to hostile comments.The comments are always racist, and its really just a waste of time and foolishness, said Willis, who is Black. Its not going to stop me from doing my job."}