{"text": "BERLIN (Reuters) -Germany should make COVID-19 vaccinations mandatory for all adults, Chancellor Olaf Scholz told parliament on Wednesday, brushing off heckling from opposition lawmakers who accused him of fomenting social divisions.Scholzs first question-and-answer session in parliament as chancellor came the same day Germany reported a record 80,430 new infections due to the highly contagious Omicron variant.The leader credited his new governments measures to tighten curbs on public life and step up booster doses for preventing an even worse onslaught. Germanys cases per capita is a third of the European Union average, according to Our World in Data.But infections would likely continue to rise so mandatory vaccination was needed, Scholz said. That was long considered taboo in Germany but is gaining traction as the share of unvaccinated remains resolutely below that of many other western European nations.With the decision not to get vaccinated, one ultimately is not just making a decision for oneself but also for 80 million others, he said of an issue stirring passions around the world as some employers and authorities start to insist on inoculation.FREEDOM PROTESTThe Q&A session was interrupted at the start when lawmakers from the far-right Alternative for Germany (AfD) held up signs reading freedom instead of division.Earlier, German President Frank-Walter Steinmeier met at the Bellevue Palace in Berlin with citizens sceptical of compulsory inoculation and others who were supportive.Compulsory vaccination means compulsory debate, he said.Recent surveys by the Civey Institute and ARD broadcaster show around two thirds of Germans are in favour of making mandatory coronavirus vaccinations.The leader of Scholz's ruling Social Democrats in the legislature, Rolf Muetzenich, had said on Tuesday here the SPD would have a vaccine mandate proposal ready after a parliamentary debate at the end of January.Separately, Scholz said climate change would be a central focus of Germany's presidency of the Group of Seven (G7) this year. In his first New Year's address here, he had said Germany wanted to develop the G7 into a club pioneering efforts to achieve green growth and a socially just world."}