{"text": "Germans desperate to be vaccinated against the coronavirus are becoming increasingly aggressive, doctors said on Wednesday, as frustration mounts after six months of lockdowns even though infection rates are now falling.\"The pressure on vaccination centres and doctors' practices is growing. People pushing for vaccination are becoming more demanding,\" Anke Richter-Scheer, the deputy head of the German association of family doctors, told the Funke media group.As Germany extends priority for vaccines to more groups, it is becoming less comprehensible to many people why they should have to wait behind others, Richter-Scheer said.People are showing up at doctors' practices and trying to get vaccines even though it is not their turn, with the mood getting more aggressive, she said.Some people are also demanding their second shot early so they can go on holiday or profit from advantages such as shopping without needing a COVID-19 test.    Older patients who have been assigned AstraZeneca are also demanding a different vaccine.After a sluggish start, Germany has been ramping up its vaccination campaign and has now given a first dose to a third of the population, with about 10% fully vaccinated.It started by vaccinating its oldest citizens and has been gradually expanding shots to younger groups and other priority professions such as teachers, journalists and those working in critical infrastructure.Several German states, including the capital city Berlin, announced plans on Tuesday planning to loosen coronavirus restrictions in coming days as the number of new infections keeps dropping nationwide.  read more On Wednesday, another 14,909 new cases were reported, bringing the total to 3,548,285, while the death toll rose by 268 to 85,380. However the seven-day incidence per 100,000 people dropped to 108 from 115 on Tuesday.The government should give citizens clear guidelines on whether and where they can go on holiday by the end of May, Finance Minister Olaf Scholz told the Rheinische Post newspaper.Holidays should be possible within Germany and in some other countries due to rising vaccinations and falling infections, he said. The northern state of Mecklenburg-Vorpommern, popular with holidaymakers, will open up its tourism sector from June 14.However, Germany's vaccine committee, known as STIKO, dampened expectations for a speedy approval for vaccination of children and adolescents."}