{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2BqrAMSTERDAM, March 12 Benchmark German government bonds gave up most of the gains they notched a day earlier, when the European Central Bank said it would accelerate the pace of its bond buying, with yields tracking U.S. Treasuries higher on Friday.Investors were watching the market closely for any reaction after ECB chief Christine Lagarde said the increase in the pace of bond buying under the banks Pandemic Emergency Purchase Programme (PEPP) would be implemented as of Thursday.But some of the optimism around the purchases, intended to combat a recent rise in global bond yields spurred on by growth and inflation bets in the U.S., faded on Friday. With 10-year U.S. Treasury yields rising sharply back above 1.60%, their German equivalents, the benchmark for the region, rose as high as -0.298% in early trade.That was above Thursdays peak at -0.308% before the ECB revaled its decision to increase the pace of its bond buying during the next quarter, to keep in check a recent rise in yields.U.S. and German bond yields closely track one another. But that has become a cause of concern as German and other euro zone yields have risen in tandem with U.S. Treasuries, even as the euro area faces a weaker economic outlook. Germanys 10-year yield was last up 2 basis points to -0.31% at 0930 GMT.Italian 10-year yields, which outperformed the market on Thursday as the country is among the top beneficiaries of ECB bond buying, were up 2 basis points to 0.63%After falling as much as 10 bps following the decision, that puts them just 5 bps lower than Thursdays highs before the meeting.The limited market reaction underscores analysts view that the increased buying pace will have a limited impact in holding down the blocs bond yields, as without an increase to the PEPP envelope -- the total purchases permitted under the programme -- it will just mean the programme will have to end earlier.While the ECB is buying some time, the measures will probably not be enough to fully offset the expected further pressure on the term premium from the US long-end, said Michael Leister, head of interest rate strategy at Commerzbank, referring to the additional yield on longer-dated debt relative to shorter-dated debt.While they agreed not to reveal this on Thursday, European Central Bank policymakers agreed on a monthly bond purchase target with a small tolerance band around it, sources told Reuters after the banks meeting.This would not be as high as 100 billion euros a month the bank bought at the height of the coronavirus crisis last spring, but well above the 60 billion euros it bought last month, the sources said. (Reporting by Yoruk Bahceli; Editing by Simon Cameron-Moore)"}