{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2BqrMay 12 German bond yields fell from their highest in over a year as stock markets steadied on Wednesday and the market awaited U.S. inflation data due later in the session.Global financial markets have had a turbulent week. Equities have slumped and bond yields, particularly in the euro area, have risen sharply as investors grew nervous about growing inflationary pressure and stretched market valuations.That sent market expectations of long-term euro zone inflation to its highest since 2018 on Tuesday.This weeks focus is the U.S. April inflation reading due at 1230 GMT. Investors will assess the chance of any change of stance from the Federal Reserve, which says near-term inflation is transitory.On Wednesday, Germanys 10-year yield, the benchmark for the region, was down 1 basis point to -0.17% by 0730 GMT, after rising to the highest since March 2020 at -0.152% on Tuesday.Thirty-year yields also fell to 0.40%, after touching their highest since May 2019 at 0.421%, when they came under specific pressure from a 30-year syndicated green bond sale on Tuesday.Italian bond yields were down 1 bp to 0.93%, below the highest since September 2020 touched on Tuesday.Todays U.S. CPI release should do little to calm things down, Christoph Rieger, head of rates and credit research at Commerzbank told clients.U.S. and euro area bond yields are closely correlated.Besides inflation indications, central bank guidance should thus remain key, Rieger added, referring in particular to a speech by Fed Vice Chairman Richard Clarida on Wednesday.Fed officials grappled on Tuesday with surprisingly weak April employment growth, acknowledging jobs recovery may prove choppier than anticipated, while European Central Bank policymakers have also sounded dovish this week.A Reuters poll expects Wednesdays inflation data to show U.S. consumer prices have increased 3.6% year-on-year in April, and a core reading, which excludes food and energy costs, to have increased 2.3%.Analysts at UniCredit said that a miss in the data would have a bigger impact on the market than data exceeding expectations, given the disappointing U.S. employment data last week and the Feds dovish stance.In the primary market, Portugal will raise up to 1.25 billion euros from bonds due 2031 and 2035 in a regular auction. (Reporting by Yoruk Bahceli; editing by Barbara Lewis)"}