{"text": "German Chancellor Angela Merkel's cabinet approved on Wednesday draft legislation for more ambitious CO2 reduction targets, including being carbon neutral by 2045, after a landmark court ruling last month forced the government to act.Under the new plans, which come as the environmentalist Greens top most polls before a September federal election, Germany will cut its carbon emissions by 65% by 2030 from 1990 levels, up from a previous target of a 55% reduction.Europe's biggest economy will also aim for nearly net zero emissions five years earlier than planned.\"With this law, we are creating more fairness between generations, more planning security and protecting the climate in a way that doesn't stifle the economy, but rebuilds and modernises it,\" said Environment Minister Svenja Schulze.Germany's Constitutional Court ruled in April that Merkel's government had failed to set out how to cut carbon emissions beyond 2030 after plaintiffs, including North Sea islanders fearing rising sea levels, challenged a 2019 climate law.The draft legislation must go to parliament for approval and the government is working on specific measuresto reach the goals. An expansion of renewable energy and an exit from coal before 2038, as currently planned, look likely.Merkel's coalition of her conservatives and the Social Democrats (SPD) has moved quickly to draw up the new plans as parties try toshow a commitment to climate protection and stop the Greens dominating the agenda. [nS8N2D400U]\"Climate protection goals are important, but steps such as renewable expansion, coal phase-out in 2030, CO2 price and energy money are crucial,\" tweeted Greens lawmaker Oliver Krischer.The energy sector will have to curb carbon pollution by nearly two thirds.\"Climate protection does not come about through targets, but through investments,\" said the BDEW energy industry association.\"This must now follow as a matter of urgency,\" it said, adding that investment in onshore wind energy had stalled due to a lack of available land and because approval procedures take too long.In a potential blow for real estate firms, landlords will also have to shoulder half of the additional CO2 price burden related to heating costs. German emissions are about 40% below 1990 levels, but experts say much of that was achieved in the years soon after German unification when industrial factories with high emissions in the former Communist East were shut down."}