{"text": "The German Greens' candidate for chancellor Annalena Baerbock on Wednesday criticised Finance Minister Olaf Scholz's plan to return to strict borrowing limits from 2023, saying Berlin had to invest more in climate protection, health care and education.The Greens are currently riding high in the polls ahead of Germany's Sept. 26 election, with a very good chance of joining the next coalition government or even taking over the chancellery.\"We're all facing the same reality, it's not a Greens reality, that we have a giant hole in the budget due to this coronavirus year,\" Baerbock told ARD public broadcaster.\"That's why I have a different point of view here than the finance minister who has said we'll return to the debt brake as soon as possible. We can't do that,\" Baerbock said.The Greens want to reform the constitutionally enshrined debt brake rule, which limits federal borrowing to 0.35% of economic output per year, by adding an investment rule to secure enough public money for climate protection, infrastructure, health care and education, Baerbock said.\"And since we have low interest rates at the moment, this plan is working out,\" Baerbock added.In their election manifesto, the Greens promise additional 50 billion euros a year in extra public investment over 10 years which would be about 1.5% of 2019 output.  read more However, this would require a reform of the debt brake rule in the constitution - a tricky political task for which two-thirds majorities are needed in both chambers of parliament.Scholz, the candidate for chancellor of the centre-left Social Democrats, on Wednesday presents updated tax revenue estimates for Europe's biggest economy which may be helped by a raising of the government's growth forecast for this year to 3.5%.Germany has temporarily suspended its borrowing limits due to the pandemic, enabling record new debt of 130 billion euros in 2020 and 240 billion euros in 2021 to cushion the impact of the coronavirus on workers and companies.Scholz has suggested to suspend the debt brake for a third year in a row in 2022 to allow net new borrowing of 80 billion euros, but he insists that Germany should return to the strict fiscal rules from 2023 onwards.Still, the impact of the pandemic on public finances is so huge that Germany won't be able to meet the European Union's debt ceiling of 60% of GDP before 2030, Scholz told Rheinische Post newspaper.Germany's debt-financed fiscal splurge has pushed its overall debt to more than 70% last year from below 60% in 2019."}