{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2BqrLONDON, Aug 12 German government bond yields rose to 16-day highs on Wednesday, as market sentiment continued to improve before euro zone industrial production data are released.The move, which saw high-rated euro zone yields up around 2 basis points in early London trading, came the day after the benchmark 10-year Bund had its biggest daily spike in a month as Wall Street rebounded towards pre-pandemic highs.The 10-year U.S. Treasury yield rose the most in two months on Tuesday, before its largest-ever 10-year auction, which will be held later on Wednesday.But markets turned more cautious overnight, with stocks slipping in the Asian session as the political gridlock in Washington over coronavirus aid continued.At 0700 GMT, Germanys 10-year government bond yield was at -0.463%, up around 1 basis point on the day. Its French equivalent was at -0.1858%.Germany is expected to issue 4 billion euros of 10-year government bonds.10y Bunds are trading above the -0.50% resistance again as the mix of global risk-on and fading flow support take their toll, probably compounded by room-making for todays 10y Bund tap and comparable supply pressure on US Treasuries, Commerzbank rates strategists wrote in a note to clients.Italys 10-year yield was flat, at 1.014%. Italian bonds have rallied since the European Unions coronavirus recovery fund was first proposed in May, and boosted further when the package was agreed last month. But the rally has steadied in August, as investors wait for more information about the fund.Russian President Vladimir Putin said on Tuesday that Russia had become the first country to grant regulatory approval to a COVID-19 vaccine after less than two months of human testing. But the announcement was met with scepticism and had limited market impact.German Health Minister Jens Spahn said on Wednesday that the vaccine had not been tested enough.Eurozone industrial production data is due at 0900 GMT. A 10% month-on-month increase in output is expected, according to a Reuters poll, down from the 12.4% increase the previous month. (Reporting by Elizabeth Howcroft, editing by Larry King)"}