{"text": "* Shanghai Composite and blue chip index jump 2%* S&P 500 futures creep higher despite U.S. stimulus doubts* USD/CNH leaps after PBOC tweaks FX policy* Asian stock markets: tmsnrt.rs/2zpUAr4SINGAPORE, Oct 12 Chinese stocks led Asian markets higher on Monday as investors bet on a steady recovery for the worlds no. 2 economy, though caution about the fate of U.S. stimulus kept the dollar firm and a central bank policy tweak unwound some of the yuans gains.MSCIs broadest index of Asia-Pacific shares outside Japan rose 1% to 2-1/2-year highs, buoyed by a 2.4% gain in Chinese blue chips and a 2% rise by Hong Kongs Hang Seng index. Japans Nikkei slipped 0.3% as investors fretted about corporate earnings.If capital is moving on relative growth rates, then China is looking quite attractive, said Chris Weston, head of research brokerage Pepperstone in Melbourne. Equities are cheap, yields advantageous and the outlook solid, he said.From a virus perspective as well, were seeing concerns in Europe, while China is considered a quasi-safe haven.The mood drove S&P 500 futures up 0.2% and futures trade pointed toward a positive start to European trade. EuroSTOXX futures rose 0.5%. FTSE futures and sterling were steady ahead of a Brexit summit later in the week.China has returned from an eight-day Mid-Autumn festival with investors encouraged by a robust rebound in tourism and ebbing coronavirus cases.Qingdao city said on Monday it will conduct COVID-19 tests for the entire population of more than 9 million people over five days after a small number of new cases.In the U.S. midwest, infections are at record levels and the World Health Organization is urging fresh curbs for Europe.Coronavirus aid plans in the United States are also in disarray, with the Trump administration on Sunday calling on Congress to pass a stripped-down relief bill while talks on a more comprehensive proposal were again at an impasse.The economic fallout of COVID-19 has accelerated the relative decline of the U.S. as the worlds economic engine, said ANZ chief economist Richard Yetsenga. It is also increasing the centrality of Asia - and particularly, of China.Chinese blue chips have gained 17% this year, compared with an almost 8% gain by the S&P 500. Foreigners buying of Chinese government bonds hit its fastest pace in more than two years last month.YUAN WOBBLESIn currency markets, a 0.4% drop in the yuan dragged the China-sensitive Australian dollar lower and underpinned small but broad gains for the dollar against other majors.The Peoples Bank of China has scrapped a requirement for banks to hold a reserve of yuan forward contracts, removing a guard against depreciation.Traders said that suggested authorities were discomfited by recent gains in the currency. However the lack of an aggressively weaker setting of the onshore trading band cooled some of those concerns and the yuan pared losses a little.The yuan is up more than 7% since late May and had shot higher on Friday as investors wagered that a Joe Biden presidency would drive smoother Sino-U.S. relations. It last sat at 6.7196 per dollar in onshore trade.We continue to expect a stronger yuan on the back of our expectation of solid Chinese growth and favourable interest rate differentials between China and the U.S., Goldman Sachs analysts said in a note, with a 12-month yuan forecast at 6.50.The euro edged 0.1% lower to $1.1819 and the yen firmed to 105.48 per dollar. The kiwi dipped 0.1% with the softer yuan to sit at $0.6661.In commodity markets, oil prices were back under pressure after the resolution of an oilworkers strike in Norway and the resumption of production after a storm in the Gulf of Mexico.Brent crude futures slipped 1% to $42.41 a barrel and U.S. crude futures fell by the same margin to $40.17.Gold held steep Friday gains at $1,929 an ounce as investors stuck with bets that U.S. stimulus would eventually arrive and drive inflation to the benefit of bullion.The U.S. bond market is closed on Monday for Columbus Day. (Reporting by Tom Westbrook in Singapore. Additional reporting by Luoyan Liu and Winni Zhou; Editing by Shri Navaratnam and Stephen Coates)"}