{"text": "* Asian stock markets: tmsnrt.rs/2zpUAr4* Equities broadly supported by vaccine hopes* Oil continues rally after U.S. crude drawdown* Some analysts warn of market correctionTOKYO/BOSTON, Nov 12 Asian shares pared their gains in choppy trade on Thursday as investors awaited further details on whether drugmakers can develop a coronavirus vaccine.MSCIs broadest index of Asia-Pacific shares outside Japan rose 0.06% to 609.41, which is near its January 2018 high of 617.12. Chinese shares erased early gains and fell 0.02%. Stocks in Japan hit a 29-year high.Australian stocks fell 0.49% as a decline in copper prices hurt shares in miners. S&P 500 stock futures fell 0.55%.Euro Stoxx 50 futures were down 0.58%, German DAX futures fell 0.51%, and FTSE futures lost 0.94% in a sign of a cautious start to European trading.Oil futures traded near two-month highs due to hope for a vaccine and a larger-than-expected drawdown in U.S. crude inventories.U.S. stocks were mixed as investors switched back to technology stocks and away from economically sensitive sectors as they weighed COVID-19 vaccine progress and the likely timing of an economic rebound.The markets are waiting for more news about the virus, so it is difficult for investors to short equities, said Daiju Aoki, regional chief investment officer for Japan at UBS Securities.These expectations can keep equities going for another few weeks, but there are still questions about the effectiveness of a vaccine and about U.S. fiscal policy. We could see a correction early next year.The Dow Jones Industrial Average fell 0.08% on Wednesday, but the Nasdaq closed up 2%, and the S&P 500 gained 0.77%.Encouraging comments from European Central Bank chief Christine Lagarde on continued economic support boosted European shares for the third straight session.Moderna Inc said on Wednesday it is preparing to submit data on its experimental COVID-19 vaccine to an independent safety board, which should help determine the vaccines efficacy.Pfizer also said on Monday that its vaccine was more than 90% effective and it may release safety data later this month.Investors the world over are keenly awaiting details on both drugs, but some analysts said it will still take a long time to distribute an effective vaccine.In the currency market, the New Zealand dollar soared for a second consecutive session to a 19-month high as investors unwound bets on the introduction of negative interest rates.The kiwi got an added boost after Reserve Bank of New Zealand Assistant Governor Christian Hawkesby said the economy required less stimulus than it did in August.The U.S. dollar edged lower against the yen and yuan as traders adjusted positions before U.S. President-elect Joe Biden takes office next year.Global oil benchmark Brent rose 0.02% to $43.81 a barrel, which is near a two-month high. U.S. crude futures also gained 0.14% to $41.51 a barrel.Crude markets remain torn by the bleak near-term picture with curfews, closures and shutdowns becoming more widespread across the U.S. and Europe; and the medium-term picture where vaccines may bring a return to more normal conditions, Westpac analysts for Australia and New Zealand wrote in a note Thursday.Spot gold edged up 0.27% to $1,869.75 an ounce.Benchmark 10-year Treasury yields fell slightly to 0.9357% and the yield curve flattened in Asian trade. The U.S. bond market was closed on Wednesday in observance of Veterans Day after the 10-year yield reached the highest level since March."}