{"text": "BOSTON, Nov 11 Stocks in Asia were set to continue their gains on Thursday, buoyed again by continued global stimulus efforts and hopes of a coronavirus vaccine.Australian S&P/ASX 200 shares rose 0.29% in early trading, while Japans Nikkei 225 futures fell 0.2% and Hong Kongs Hang Seng index futures rose 0.56%. MSCIs broadest index of Asia-Pacific shares outside Japan closed 0.01% higher.The gains in Asia came after a mixed performance for U.S. stocks. The Nasdaq closed up 2% on Wednesday as investors switched back to technology stocks and away from economically sensitive sectors as they weighed COVID-19 vaccine progress and the likely timing of an economic rebound.The Dow Jones Industrial Average fell 23.29 points, or 0.08%, to 29,397.63 and the S&P 500 gained 27.13 points, or 0.77%, to 3,572.66.The momentum of vaccine hopes and encouraging comments from European Central Bank chief Christine Lagarde on continued economic support boosted European shares higher for the third straight session.The pan-European STOXX 600 index rose 1.08% and MSCIs gauge of stocks across the globe gained 0.05%.The U.S. dollar rose and the safe-haven yen weakened again on Wednesday as markets continued to adjust to higher interest rates and prospects for economic growth.The Australian dollar was flat versus the greenback at$0.728.The New Zealand dollar was also muted in early trading after it soared on Wednesday to its strongest in a year and a half as traders scaled back bets that the central bank there would move to negative interest rates.We continue to recommend positioning for a great hawkish shift from the (Reserve Bank of New Zealand) - as it gradually shifts its stance away from the most dovish central bank in the G10 to a more balanced approach emphasizing lower for longer, Morgan Stanley analysts wrote in a note ThursdayThe euro fell to its lowest level against the dollar in a week as yields on U.S. bonds rose compared with those on European bonds.The U.S. bond market was closed on Wednesday in observance of Veterans Day after the yield of benchmark U.S. 10-year Treasuries on Tuesday reached the highest level since March.Global oil benchmark Brent rose on Wednesday, briefly touching a more than two-month high above $45 a barrel on hopes of a COVID-19 vaccine that could boost demand and later pulling back as concerns about rising cases overtook bullish news.Crude markets remain torn by the bleak near-term picture with curfews, closures and shutdowns becoming more widespread across the U.S. and Europe; and the medium-term picture where vaccines may bring a return to more normal conditions, Westpac analysts for Australia and New Zealand wrote in a note Thursday.Spot gold was flat at around $1,865.06 an ounce."}