{"text": "* Chinas CSI 300 index jumps 3%* S&P 500 futures creep higher despite stimulus doubts* FTSE 100, Sterling wobbly ahead of Brexit summit later this week* USD/CNH leaps after PBOC tweaks FX policyLONDON/SINGAPORE, Oct 12 Global stocks hit five-week highs on Monday led by Chinas post-holiday surge as investors bet on a steady recovery for the worlds no. 2 economy, but worries about rising COVID-19 infections capped gains in Europe and the United States.European countries were considering adding fresh travel curbs due to rising coronavirus, a contrast to Asia-Pacific countries including Singapore, Australia and Japan, where a gradual easing of some international travel restrictions was under way.Still, U.S. and European markets were a tad higher as investors hoped for coronavirus aid in the United States, with the Trump administration on Sunday calling on Congress to pass a stripped-down relief bill.European stocks and U.S. stock futures rose 0.2%. FTSE 100 and sterling meanwhile were wobbly ahead of a Brexit summit later in the week.MSCIs broadest index of Asia-Pacific shares outside Japan rose 1% to 2-1/2-year highs, buoyed by a 3% gain in Chinese blue chips and a 2.2% rise by Hong Kongs Hang Seng index.China has returned from an eight-day Mid-Autumn festival with investors encouraged by a robust rebound in tourism and ebbing coronavirus cases.If capital is moving on relative growth rates, then China is looking quite attractive, said Chris Weston, head of research brokerage Pepperstone in Melbourne. Equities are cheap, yields advantageous and the outlook solid, he said.From a virus perspective as well, were seeing concerns in Europe, while China is considered a quasi-safe haven.Chinese stocks were also boosted by rising chances of Joe Bidens victory in the U.S. presidential election -- an administration seen less likely to incline toward tariffs and trade disputes.Chinese blue chips have gained 17% this year, compared with an almost 8% gain by the S&P 500. Foreigners buying of Chinese government bonds hit its fastest pace in more than two years last month.The economic fallout of COVID-19 has accelerated the relative decline of the U.S. as the worlds economic engine, said ANZ chief economist Richard Yetsenga. It is also increasing the centrality of Asia - and particularly, of China.U.S. markets are also gearing up for the earnings season. Major Wall Street banks including JPMorgan, Citi and Bank of America poised to report later this week.YUAN WOBBLESIn currency markets, a 0.4% drop in the yuan dragged the China-sensitive Australian dollar lower and underpinned small but broad gains for the dollar against other majors.The Peoples Bank of China has scrapped a requirement for banks to hold a reserve of yuan forward contracts, removing a guard against depreciation.The yuan is up more than 7% since late May and had shot higher on Friday as investors wagered that a Joe Biden presidency would drive smoother Sino-U.S. relations. It last sat at 6.7115 per dollar in onshore trade.We continue to expect a stronger yuan on the back of our expectation of solid Chinese growth and favourable interest rate differentials between China and the U.S., Goldman Sachs analysts said in a note, with a 12-month yuan forecast at 6.50.The euro edged 0.1% lower to $1.1819 and the yen firmed to 105.54 per dollar. The kiwi dipped 0.1% with the softer yuan to sit at $0.6661.In commodity markets, oil prices were back under pressure after the resolution of an oilworkers strike in Norway and the resumption of production after a storm in the Gulf of Mexico.Gold held steep Friday gains at $1,929 an ounce as investors stuck with bets that U.S. stimulus would eventually arrive and drive inflation to the benefit of bullion.The U.S. bond market is closed on Monday for Columbus Day."}