{"text": "* Equities slump on resurgence of coronavirus infections* Oil futures extend sell-off on demand worries* Euro close to three-month high* Graphic: World stocks market cap loss tmsnrt.rs/30zdOILLONDON/TOKYO, June 12 A slump in global shares extended to its fourth day running on Friday and oil tumbled over growing concerns that a resurgence of coronavirus infections could stunt the pace of recovery from lockdowns.MSCIs 49-country index of world stocks slipped 0.5% to an 11-day low, while MSCIs broadest index of Asia-Pacific shares outside Japan sank 1.3%.In Europe, the STOXX 600 Index swung between gains and losses after opening and was last down 0.6%, extending a run of losses to five days in a row.Oil futures slumped for a second consecutive trading session due to worries about weak global energy demand, which weighed on the currencies of oil producers and countries that rely on exporting commodities.The Chinese yuan headed for its biggest daily decline in two weeks, underscoring investors risk-averse mood in Asia.That was after the three major U.S. stock indexes posted their worst day on Thursday since mid-March, when markets were sent into freefall by the abrupt economic lockdowns put in place to contain the pandemic.Angst about a second wave of infections in several U.S. states and increased uncertainty about U.S. President Donald Trumps re-election prospects were partly to blame, said Eli Lee, head of investment strategy, Bank of Singapore.There was also a feeling that the global stock market rally was running ahead of fundamentals.It seems unlikely in our view that the equity market could revisit the levels of the March bottom, which were reflecting far greater levels of uncertainties, he said. That includes the real risk of a greater financial blow-up stemming from the tremendous liquidity pressures at that time, which is now mostly diminished.U.S. stock futures, the S&P 500 e-minis, rose 1.0%, but that did little to help sentiment.COVID-19 cases in New Mexico, Utah and Arizona rose by 40% for the week ended Sunday, a Reuters tally shows. Florida and Arkansas are other hot spots.The jump in cases has raised concern among experts who say authorities have moved too soon to loosen restrictions put in place to contain the spread.The U.S. Federal Reserve released a gloomy economic outlook at the end of its two-day monetary policy meeting on Wednesday. Chairman Jerome Powell warned of a long road to recovery.Economic data appeared to back up the Feds projections, with jobless claims still more than double their peak during the Great Recession and continuing claims at an astoundingly high 20.9 million.U.S. crude slid 2.7% to $35.35 a barrel, while Brent crude eased 2.49% to $37.59 per barrel, hit by renewed concerns over demand and a large buildup of U.S. crude inventories.The euro rose 0.1% to $1.1315, staying close to $1.1422, the three-month high it reached on Wednesday.The Aussie dollar rose 0.4% to 0.6881, after falling to a 10-day low of 0.6799 in the Asian session.The Norwegian crown advanced the most, rising by 0.6% to 9.5665 against the U.S. currency.In the onshore market, the yuan fell 0.3%, headed for its biggest daily decline since May 27.The 10-year U.S. Treasury yield edged up slightly to 0.6853% on Friday.Bond prices were well supported after they rallied following the Feds commitment on Wednesday to years of extraordinary support to counter the economic fallout from the pandemic."}