{"text": "(Adds oil, gold settlement prices)* U.S. stocks bounce back, but on track for worst week in 3 months* Risky currencies recover as traders stop taking profits* Gold on track for biggest weekly gain since April* Graphic: World stocks market cap loss tmsnrt.rs/30zdOILNEW YORK, June 12 Global equity markets gave back earlier gains on Friday as concerns triggered by the U.S. Federal Reserves less-than-optimistic outlook for an economic recovery and a jump in U.S. coronavirus cases gave investors pause.Trading was choppy, with the three major U.S. stock indexes moving above and below break-even, a day after the markets worst single-day drop in three months. MSCIs gauge of stocks across the globe shed 0.35%.Spot gold prices gained as investors bought the safe-haven metal, with bullion heading toward its biggest gain since the week of April 10. Meanwhile, oil prices fell for the first time in seven weeks.Spot gold added 0.3% to $1,731.81 an ounce. U.S. gold futures settled down 0.1% at $1,737.30.Joe Saluzzi of New Jersey-based trading firm Themis Trading LLC, said investors face broad uncertainties over what an economic recovery will look like and when we will get a vaccine for coronavirus.I was surprised that we were up so much this morning, said Saluzzi, co-founder and co-head of Themis. We were running on euphoria.Earlier this week, the Fed predicted a 6.5% decline in U.S. output this year and said an economic recovery is some time off.Worldwide health officials expressed concerns this week that countries, grappling with the devastating economic impact of lockdowns meant to stem coronaviruss spread, are lifting restrictions too swiftly and risking a resurgence in cases.The Dow Jones Industrial Average rose 180.62 points, or 0.72%, to 25,308.79, the S&P 500 gained 10.03 points, or 0.33%, to 3,012.13 and the Nasdaq Composite added 6.49 points, or 0.07%, to 9,499.22.Despite the rebound, the Dow and S&P 500 were on track to post their worst week in 12 weeks.In Europe, the STOXX 600 Index snapped a four-day losing streak to rise 0.28%. Frankfurts DAX, Pariss CAC40 and Londons FTSE were all in positive territory, the latter shrugging off data showing Britains economy shrank the most on record in April.Spot gold rose 0.2% to $1,730.57 per ounce by 2:10 p.m. ET (1810 GMT) and has jumped about 2.7% so far this week.U.S. crude oil futures settled at $36.26 a barrel, down 8 cents or 0.22 percent. Brent crude futures settled at $38.73 a barrel, up 18 cents or 0.47%.The three major U.S. stock indexes posted their worst day on Thursday since mid-March, when markets were sent into free-fall by the abrupt economic lockdowns put in place to contain the pandemic.In currencies, the pound shed early gains against the dollar after 10 consecutive days of gains. Sterling was last trading at $1.2484, down 0.92%. The dollar index rose 0.537%.The euro was down 0.61% to $1.1228.U.S. Treasury yields rose as stocks clawed back some ground. The 10-year U.S. Treasury yield rose to 0.7067%."}