{"text": "* Chinas CSI 300 index jumps 3%* S&P 500 futures creep higher despite stimulus doubts* FTSE 100, Sterling wobbly ahead of Brexit summit later this week* USD/CNH leaps after PBOC tweaks FX policyLONDON/SINGAPORE, Oct 12 Global stocks hit five-week highs on Monday led by Chinas post-holiday surge as investors bet on a steady recovery for the worlds no. 2 economy, while hopes for stimulus offset worries about rising COVID-19 cases in Europe and the United States.European countries were considering adding fresh travel curbs due to rising coronavirus, a contrast to Asia-Pacific countries including Singapore, Australia and Japan, where a gradual easing of some international travel restrictions is under way.Still, U.S. and European markets were trading higher as investors hoped for coronavirus aid in the United States, with the Trump administration on Sunday calling on Congress to pass a stripped-down relief bill.European stocks and U.S. stock futures rose 0.5%. FTSE 100 and sterling meanwhile were wobbly ahead of a Brexit summit later in the week.U.S. fiscal policy negotiations are starting to look a lot like the EU-UK divorce negotiations, being both tedious and interminable, said Paul Donovan, global chief economist of UBSs wealth management business.MSCIs gauge of stocks across the globe hit early September highs, mainly driven by a 3% gain in Chinese blue chips. China has returned from an eight-day Mid-Autumn festival with investors encouraged by a robust rebound in tourism and ebbing coronavirus cases.China is playing a bit of catch-up still from Golden Week. I actually think as influential was the announcement about the upcoming Shenzhen reform speech by President Xi, said Chris Bailey, European strategist at Raymond James.Chinese President Xi will deliver a key speech in Shenzhen on Wednesday to mark the anniversary of the establishment of the countrys first special economic zone in the southern city 40 years ago, according to state media Xinhua.Chinese blue chips have gained 17% this year, compared with an almost 8% gain by the S&P 500. Foreigners buying of Chinese government bonds hit its fastest pace in more than two years last month.Chinese assets were also boosted by rising chances of Joe Bidens victory in the U.S. presidential election -- an administration seen less likely to incline toward tariffs and trade disputes.Meanwhile, U.S. markets are also gearing up for the third-quarter earnings season, where the S&P 500 companies are expected to report 21% drop in earnings, according to Refinitiv data.Major Wall Street banks JPMorgan and Citi are poised to report results on Tuesday.YUAN FALLSIn currency markets, the yuan was off 0.8%, on track for its worst single day drop since March, hitting the China-sensitive Australian dollar.The Peoples Bank of China has scrapped a requirement for banks to hold a reserve of yuan forward contracts, removing a guard against depreciation.The yuan is up more than 7% since late May and had shot higher on Friday as investors wagered that a Biden presidency would drive smoother relations with the Unites States. It last sat at 6.7487 per dollar in onshore trade.We continue to expect a stronger yuan on the back of our expectation of solid Chinese growth and favourable interest rate differentials between China and the U.S., Goldman Sachs analysts said in a note, with a 12-month yuan forecast at 6.50.The euro edged 0.2% lower to $1.1805 and the yen firmed to 105.48 per dollar. The kiwi dipped 0.1% with the softer yuan to sit at $0.6661.In commodity markets, oil prices were back under pressure after the resolution of an oilworkers strike in Norway and the resumption of production after a storm in the Gulf of Mexico.Gold held steep Friday gains at $1,929 an ounce.The U.S. bond market is closed on Monday for Columbus Day."}