{"text": "* Graphic: Global asset performance tmsnrt.rs/2yaDPgn* Graphic: World FX rates tmsnrt.rs/2egbfVhLONDON, April 12 Global stock markets slid off record highs on Monday as investors waited to see whether U.S. earnings would justify sky-high valuations, while a rally in bonds could be tested by what should be strong readings for U.S. inflation and retail sales this week.MSCIs All Country World Index, which tracks stocks across 49 countries, was down 0.25% after the start of European trading, off Fridays record high. The gauges price-to-earnings ratio is at its highest level since early 2010. Stocks hit record highs across the world last week on optimism that vaccination programmes and the easing of lockdowns to combat COVID-19 would bode well for an economic rebound.Morgan Stanley noted that despite the S&P 500 making new all-time highs, small cap stocks represented by the Russell 2000 small cap index have underperformed the S&P 500 by 8% since peaking on March 12.In my view, the breakdown of small caps and cyclicals is a potential early warning sign that the actual reopening of the economy will be more difficult than dreaming about it, said Michael Wilson, the banks chief U.S. equity strategist and chief investment officer.Small caps and cyclicals have been stellar outperformers over the past year. In essence, they were discounting the recovery and reopening that we are about to experience. However, now we must actually do it and with that comes execution risk and potential surprises that arent priced.Nasdaq futures were down 0.1% on Monday. S&P 500 futures fell 0.2%.European shares eased off record highs as investors held off from making big bets before earnings season. The pan-European STOXX 600 index was down 0.2% by 1003 GMT.Britains domestically focused FTSE mid 250 index held 0.2% below a record high as shops, pubs, gyms and hairdressers re-opened after three months of lockdown.The UKs more export-oriented FTSE 100 fell 0.3%, Germanys DAX and Frances CAC 40 both traded flat. Italys FTSE MIB gained nearly half a percent.The VIX volatility index, also known as Wall Streets fear gauge, ticked slightly higher to 17.48, having hit its lowest level since March 2020 on Friday.Renewed bouts of elevated volatility are likely over the coming months, in our view, said Mark Haefele, chief investment officer at UBS Global Wealth Management. Investors can take advantage of this backdrop, however. Low volatility at present reduces the cost of locking in downside protection.Earlier in Asia, Tokyos Nikkei edged down 0.6%. South Korean stocks were near flat.Indias Nifty 50 index slid 2.4% as the country overtook Brazil with the second highest number of COVID-19 cases globally.Chinese blue chips lost 1.5% ahead of the release of a series of economic data from China.Shares in Alibaba Group Holding Ltd surged 16% after China imposed a record 18 billion-yuan ($2.75 billion) fine on the e-commerce giant.The share surge reflected relief that a key source of uncertainty for the company had been removed and that the fine and steps ordered were not more onerous.Over a third of the stock is held by U.S. investors, and it makes up more than 8% of the MSCI EM index.U.S. growth and tech stocks saw something of a revival last week as U.S. 10-year Treasury yields retreated to 1.65% , from a 14-month top of 1.776%.Low inflation and dovish central banks should limit the rise in bond yields during the recovery, said Andrew Pease, global head of investment strategy at Russell Investments. Over the weekend, Federal Reserve Chair Jerome Powell said the economy was about to start growing faster, though the coronavirus remained a threat.Data out this week is expected to show U.S. inflation jumped in March. Retail sales are seen surging, perhaps even with a double-digit gain. The U.S. Treasury is also set to test demand with offers of $100 billion in debt this week.U.S. banks open first-quarter earnings season with Goldman Sachs, JPMorgan and Wells Fargo scheduled to report on Wednesday.Analysts expect profits for S&P 500 firms to show a 25% jump from a year earlier, according to Refinitiv IBES data. That would be the strongest performance for the quarter since 2018.The pullback in yields was enough to see the dollar come off the boil last week. It was last trading at 92.254 against a basket of currencies, down from a peak of 93.439.It was lower against the yen at 109.39. The euro was holding at $1.1879 and above its recent trough of $1.1702.Gold prices were idling at $1,737 an ounce, having failed to sustain a top of $1,758 last week.Oil prices edged higher in rangebound trade on Monday on optimism over a rebound in the U.S. economy as coronavirus vaccinations accelerate, though rising COVID-19 cases in other parts of the world kept a lid on prices.Brent rose 1% to $63.61 a barrel. U.S. crude rose 0.9% to $59.86."}