{"text": "* Equities rally pauses after eight days* Markets still supported by vaccine hopes* Oil sags as virus cases continue to surge* Government bonds back in favour*LONDON, Nov 12 Global shares were on course on Thursday to end their longest winning streak in over a year, one that has lifted them more than 10%, as the post-U.S. election and coronavirus vaccine bull run paused.Europes main markets opened down 0.7% and Wall Street futures fell. For the first time in November, MSCIs 49-country world index was in the red. Asia had finished flat.Big Tech had rebounded on Wednesday as investors switched back to winners like Amazon and Netflix. In Europe, investors returned to safe-haven government bonds.What we dont really agree with is that you need to rotate out of tech into value stocks, said Willem Sels, chief market strategist at HSBC Private Bank, referring to stocks that do well in normal circumstances when economies are open.We dont think either that a recovery (helped by a vaccine) would lead to a sustained sell-off in U.S. Treasuries. The Fed has signalled it is on hold, he added.In the currency market, the euro was near $1.18, in the middle of the $1.16-$1.20 range its been in since late July. Sterling was down 0.5% amid more Brexit uncertainty and as data showed the UK economy losing speed again.Turkeys lira took a breather after President Tayyip Erdogans promise to overhaul unconventional monetary policy and the replacement of his son-in-law as finance minister caused it to rise 10%.The New Zealand dollar soared for a second session to a 19-month high as investors unwound bets on the introduction of negative interest rates.The kiwi got an added boost after Reserve Bank of New Zealand Assistant Governor Christian Hawkesby said the economy required less stimulus than it did in August.The weakness in broad USD (dollar) and reflationary momentum in equities, which we saw on the back of the U.S. election and improvements in the vaccine situation, seem to be fading across FX and equities, said Christin Tuxen, Head of FX Research at Danske Bank.HOLD GOLDGlobal oil benchmark Brent snapped three consecutive days of gains to dip to $43.46 a barrel, although it remained near a two-month high.Traders were tempering expectations of an early release of a COVID-19 vaccine. The International Energy Agency also raised doubts on Thursday about a quick recovery in demand, amid surging infections in Europe and the United States.Most of Europes main economies are already grappling with a wave of infections and new social restrictions. New York also ordered bars and restaurants to start closing early on Wednesday after U.S. cases hit records.Until the timing of the availability of a vaccine becomes clearer, oil prices downside could turn out to be limited, but serious upside potential is unlikely to develop in the immediate future, said Tamas Varga, analyst at PVM Oil.The Organization of the Petroleum Exporting Countries also revised its demand forecast on Wednesday, saying global oil demand will recover more slowly in 2021 than previously expected because of rising coronavirus cases.Safe-haven gold edged up. Spot gold rose 0.4% to $1,872 per ounce, while U.S. gold futures were 0.3% higher.We still have some gold, HSBCs Sels said. With Europe still in lockdown and some political risks remaining, you cant put all your chips on one colour."}