{"text": "Global investors continued to pour money into equity funds on hopes over global economic recovery and vaccine optimism, shrugging off concerns about inflation levels.Flows into equity mutual funds doubled from last week to $20.4 billion in the week to March 10, data from Refinitiv Lipper showed.However, investors sold a net $2.7 billion in global bond funds, as U.S. Treasury yields touched a 1-year high this week.Graphic: Fund flows into global equities bonds and money markets -https://fingfx.thomsonreuters.com/gfx/mkt/qmyvmrobepr/Fund%20flows%20into%20global%20equities%20bonds%20and%20money%20markets.jpgMeanwhile, investors also put $28.7 billion worth of money into safer money market funds, the data showed.Among equity funds, technology funds faced an outflow for the first time in a year due to the surge in bond yields. Higher yields lower the present value of future cash flows of growth stocks.On the other hand, the financial sector attracted an inflow of $3.14 billion, the biggest in eight weeks, as investor ploughed money into cyclical stocks on rising optimism about a global economic recovery.Graphic: Global bond outflows in the week ended March 10 -https://fingfx.thomsonreuters.com/gfx/mkt/ygdvzgqnqpw/Global%20bond%20outflows%20in%20the%20week%20ended%20March%2010.jpgOther sectors, which rise and fall along with the economic cycles, such as industrials, energy and mining companies, also had inflows in the week.Among commodity funds, precious metal funds saw net sales of $1.74 billion, the fifth consecutive weekly outflow, signalling investors are looking past safer assets such as gold and willing to take higher risks.Graphic: Global fund flows into equity sectors -https://fingfx.thomsonreuters.com/gfx/mkt/dgkvlewbnpb/Global%20fund%20flows%20into%20equity%20sectors.jpgAn analysis of 23,755 emerging-market funds showed equity funds got $2.3 billion in inflows. Bond funds saw net sales of $3.4 billion, their biggest outflow for the latter in about a year.Graphic: Fund flows into EM equities and bonds -https://fingfx.thomsonreuters.com/gfx/mkt/nmovarkwxpa/Fund%20flows%20into%20EM%20equities%20and%20bonds.jpg"}