{"text": "    Nov 12 The global zinc concentrate market is\nforecast to switch back to a surplus in 2021, after a\nshort-lived deficit this year, Chinese metals research house\nAntaike said on Thursday.\n    Rising production could return the world's zinc concentrate\nmarket to a surplus of 82,000 tonnes in 2021, after\ncoronavirus-driven supply disruptions kept the market at an\nestimated deficit of 151,000 tonnes this year, said Xia Cong,\nthe manager of the lead and zinc department at Antaike.\n    \"2021 will be the peak time for overseas projects to\nincrease and resume production. Taking COVID-19 into\nconsideration, it (production) will peak starting from the\nsecond quarter or even from the middle of the year,\" Xia said in\na video of her presentation at the China International Lead and\nZinc conference in Chengdu.\n    The market was also in surplus in 2018 and 2019, according\nto Xia.\n    The overseas supply decline this year dragged treatment\ncharges lower at smelters. \n    Spot treatment charges for zinc concentrate imported into\nChina AM-TC50-ZNCON fell from $305 a tonne in February, the\nhighest since May 2008, to $95 a tonne, the lowest since Sept.\n2018, on Wednesday, as assessed by Asian Metal.\n    China is forecast to have a zinc concentrate surplus until\n2022, before switching to a deficit from 2023, Xia said.\n    The refined zinc market, however, could be in surplus\nglobally until to 2025, while the Chinese market is seen in\nsurplus until 2021 before switching to deficit in 2022-2025,\naccording to Xia.\n    She estimated 2021 average zinc prices at $2,400 a tonne on\nthe London Metal Exchange (LME) and 19,000 yuan ($2,867) a tonne\non the Shanghai Futures Exchange (ShFE).\n    Benchmark three-month LME zinc was at $2,620 a tonne\nat 0641 GMT while ShFE's most-traded December zinc contract\n traded at 20,015 yuan a tonne.\n    \n    LEAD\n    Zinc's sister metal, lead, could be in a deficit in China\nthis year of 28,000 tonnes but switch to a surplus of 77,000\ntonnes in 2021, said Zhang Zhiwei, a senior analyst at Antaike, \nat the conference.\n    Globally, the refined lead market is seen in surplus in both\n2020 and 2021, Zhang added.\n    \n    ANTAIKE FORECASTS    \n       Zinc concentrate (tonnes)\n Balance       2020               2021\n China     +202,000           +132,000\n World     -151,000            +82,000\n         Refined zinc (tonnes)\n Balance       2020               2021\n China      +50,000           +110,000\n World     +290,000           +298,000\n         Refined lead (tonnes)\n Balance       2020               2021\n China      -28,000            +77,000\n World      +21,000            +55,000\n \n($1 = 6.6282 Chinese yuan renminbi)\n\n (Reporting by Mai Nguyen; editing by Christian Schmollinger)\n  "}