{"text": "BOSTON, Aug 12 Asian stocks were set for broad gains on Thursday after Wall Streets S&P 500 index briefly touched record highs, as investors appeared to shrug off worries about stalled U.S. stimulus talks and a shaky economic recovery.Australian S&P/ASX 200 futures rose 0.69% in early trading, while New Zealands benchmark S&P/NZX 50 index gained about 0.4%.Hong Kongs Hang Seng index futures rose 0.42% and Japans Nikkei 225 futures were flat.Those gains came after the S&P 500 jumped on Wednesday, finishing just short of its February record closing high.Analysts said while recent headlines suggest economic risks are growing, they also bolster the case for continued stimulus from Washington, which has given markets something to cheer.In a wide rally led by tech-related stocks, the Nasdaq and Dow also rose sharply. The Nasdaq was the first of the three major indexes to bounce back to an all-time high in June. The Dow remains below its February peak.E-mini futures for the S&P 500 were flat.The gains on Wall Street came despite a continued impasse between lawmakers in Washington over the next economic relief package and a warning from Federal Reserve policymakers that the U.S. recovery will be gradual and slow until the coronavirus is under control.U.S. government bond yields dipped from one-month highs on Wednesday after the Treasury saw good demand for a record $38 billion auction of 10-year notes, but they remained higher on the day ahead of a 30-year bond auction on Thursday.Kim Mundy, an analyst at Commonwealth Bank of Australia, said Washington would continue to support the economy despite a higher then expected inflation report.Monetary policy will remain very accommodative in the U.S. for a long time, she wrote.The dollar index fell about 0.3% amid mixed messages from U.S. markets, and the Australian dollar fell 0.04% versus the greenback at $0.716.Ray Attrill, Head of FX Strategy at National Australia Bank in Sydney, said that the improvement in risk sentiment has carried the day for the Aussie after initially being dragged lower by negative news out of New Zealand and second quarter wage data.The Japanese yen strengthened 0.04% versus the greenback at 106.85 per dollar, while Sterling was last trading at $1.3033, up 0.01% on the day.Oil prices climbed after government data showed U.S. oil inventories fell across the board, bolstering hopes for increased fuel demand in the worlds biggest economy.U.S. crude recently fell 0.19% to $42.59 per barrel and Brent was flat on the day.Save-haven precious metals recouped some of their recent losses in a choppy session.Gold swung from being down 2.5% to add 0.3% to $1,917.16 an ounce, a day after its biggest daily fall in seven years. Silver fell as much as 5.5% and rose as much as 6% after a 15% plunge, the largest in over a decade, on Tuesday.Spot gold dropped 0.3% to $1,912.97 an ounce."}