{"text": "* ASX opens 0.1% higher, futures suggest steady open in Asia* USD/CNH leaps 0.7% after PBOC tweaks FX policy* Asian stock markets: tmsnrt.rs/2zpUAr4SINGAPORE, Oct 12 Asian stock markets began the week with cautious gains on Monday, as investors clung to hopes for U.S. stimulus spending, while the dollar firmed after a Chinese central bank policy tweak unwound some of the yuans steep gains.The Peoples Bank of China has scrapped a requirement for banks to hold a reserve of yuan forward contracts, removing a guard against depreciation, which traders said suggested authorities were discomfited by recent gains.The yuan fell 0.7% to 6.7331 in early trade, pulling the Australian dollar 0.2% lower to $0.7229. The fixing of the onshore trading band at 0115 GMT will be closely watched as a guide to authorities stance on the currencys level.MSCIs broadest index of Asia-Pacific shares outside Japan edged up 0.1% in early trade. Australias S&P/ASX 200 was 0.1% higher and New Zealands NZ50 crept up to a record peak. Japans Nikkei slipped 0.3%.The Trump administration on Sunday called on Congress to pass a stripped-down coronavirus relief bill, as talks on a more comprehensive plan were again at an impasse.A new $1.8 billion White House proposal has drawn criticism from both Democrats and Republicans, yet investors seem optimistic that spending will resume at some point.Markets still have high hopes of a large scale stimulus package, and are indifferent about whether it occurs this side of November or not, said National Australia Bank economist Tapas Strickland.Polls showing Democrat Joe Biden leading Donald Trump in the U.S. presidential race partly underpin that confidence, Strickland said, since the Democrats are pushing harder for spending.Markets should be very sensitive to Senate polling over the coming weeks, given still-high expectations for a large scale U.S. stimulus package, which to some extent if not passed before November is contingent on the Democrats flipping the Senate.Bidens poll lead had also helped drive surging yuan gains on Friday, when Chinese markets re-opened after the Mid-Autumn break and currency jumped more than 1% in onshore trade.Investors figured Biden would be less likely to trigger fresh Sino-U.S. trade disputes. The yuan is up 7.2% since late May as Chinas economy has led the worlds coronavirus recovery.However, Saturdays move from the PBOC to cut forward reserve requirements, making it cheaper to short the yuan or to hedge against a rise, hints further gains could be tempered.The authorities have not stood in the way of yuan strength, but this move could be seen as a sign that they want to slow the pace of appreciation, said ANZ Banks head of Asia research, Khoon Goh.We still see scope for further yuan appreciation, especially with Chinas strong growth momentum...but the authorities want to encourage more two-way flows, and removing the reserve requirement will help.Other currency moves were modest, with early dollar weakness paring a bit. The euro edged 0.1% lower to $1.1819 and the yen was broadly steady at 105.64 per dollar. The kiwi dipped 0.1% with the softer yuan to sit at $0.6666.In commodity markets, oil prices were back under pressure after a ten-day oilworkers strike in Norway was resolved late last week, likely boosting production.Brent crude futures slipped more than 1% to $42.28 a barrel and U.S. crude futures were down about 1.4% at $40.04.Gold held steep Friday gains at $1,930 an ounce as investors stuck with bets that U.S. stimulus would drive inflation to the benefit of bullion.The U.S. bond market is closed on Monday for Columbus Day. (Reporting by Tom Westbrook; Editing by Sam Holmes)"}