{"text": "* U.S. gridlock on stimulus deal dents share prices* Russia vaccine news triggers escape from safe-haven assets* Value-oriented shares bought back globallyTOKYO/BOSTON, Aug 12 Asian stocks dipped on Wednesday on growing uncertainty over whether the U.S. lawmakers would agree on an additional round of big fiscal stimulus to support an economy still struggling with the novel coronavirus.Hopes of vaccine development, however, prompted some investors to reduce safe-haven assets such as gold and government bonds, and to buy back battered stocks of companies hit hardest by the virus.The mixed sentiment has led to choppy trade in Asia with the index of ex-Japan Asia-Pacific shares shedding 0.76% while Japans Nikkei gained 0.2%.On Wall Street, the S&P 500 snapped a seven-day winning streak after coming within reach of its all-time peak hit in February just before the global outbreak of the COVID-19.The declines came as political gridlock between the Republican White House and congressional Democrats over coronavirus relief continued for a fourth day, with each party blaming the other for intransigence.Barring a bipartisan deal, the U.S. economy could be left with measures U.S. President Donald Trump called for on Saturday through executive orders to bypass Congress.We have enormous uncertainty. It appears its getting harder for both sides to compromise as the election is nearing... Trumps proposals would be smaller than markets have expected. Theres question over whether they are viable, too, said Junpei Tanaka, strategist at Pictet.The U.S. election campaigns look set to gather steam after Democratic presidential candidate Joe Biden selected Senator Kamala Harris as his choice for vice president.E-mini futures for S&P500 were little changed after the news.The 10-year U.S. Treasuries yield dipped 2 basis points to 0.636% in Asia after hitting a one-month of 0.661% in previous U.S. trade.On top of hedge selling ahead of the largest-ever 10-year note auction later in the day, bonds have lost some of their safe-haven allure also on rising hopes of vaccines against COVID-19.President Vladimir Putin said on Tuesday that Russia had become the first country to grant regulatory approval to a COVID-19 vaccine after less than two months of human testing.While Moscows decision raised some eyebrows, the news lifted hope some of the vaccines currently in development would become available earlier than expected.Investors bought back hospitality industries stocks and other value-oriented shares, leading the old-economy centric Dow Jones to outperform high-flying Nasdaq.Globally, MSCI Value has risen 1.5% while MSCI Growth lost 1.3% so far this week.As countries around the world seek to support the economy without harsh measures like lockdowns, investors are reviewing if they can keep value shares underweight, said Naoya Oshikubo, senior economist at Sumitomo Mitsui Trust Asset Management.The most dramatic move took place in gold, which suffered its biggest daily fall in seven years on Tuesday. On Wednesday, it fell another 1% to $1,891.Still, Michael Hsueh, Commodities & FX Strategist at Deutsche Bank in New York said, there is a good chance this weeks decline will attract fresh buyers.In todays instance, the vaccine news is likely not sufficient to change the macro narrative, insofar as it is seen as a medical mistake in advancing too quickly through testing procedures, he said, referring to the Russian vaccine.Major currencies were little changed, with the euro almost flat at $1.1728 and the yen also moving little at 107.27 per dollar.The New Zealand dollar slipped 0.4% after the country locked down Auckland following four new cases of COVID-19 and the countrys central bank took a dovish stance.Oil prices were little changed, with Brent up 0.2% at $44.60 a barrel. U.S. crude was up 0.1% at $41.66."}