{"text": "(Adds U.S. market open, byline; changes dateline; previous LONDON)* U.S. stocks bounce back, but on track for worst week in 3 months* Risky currencies recover as traders stop taking profits* Gold on track for biggest weekly gain since April* Graphic: Stock tumble gives brutal reminder of pandemic fear reut.rs/2Yv0GSt* Graphic: World stocks market cap loss tmsnrt.rs/30zdOILNEW YORK, June 12 Global equity markets bounced back on Friday as investors took in stride the U.S. Federal Reserves outlook for a long road to recovery and bet shutdowns to fight the coronavirus pandemic were unlikely to be reinstated widely.All three major U.S. stock indexes rebounded from Thursdays worst single-day drop in three months, regaining a chunk of their losses. In Europe, the STOXX 600 Index snapped a four-day losing streak to add 0.1%.Still, gold was heading toward its biggest weekly gain since early April as a jump in COVID-19 cases in some U.S. states fed fears that new economic shutdowns might be put in place.On Thursday, the S&P 500 slumped 5.9%, its steepest one-session loss since March 16, fueled by the Feds warning that the U.S. economy would contract by 6.5% this year.Despite those concerns, Julie Fox, a managing director for private wealth at UBS Financial Services in New York, saw room for equities to move higher.The Feds comments highlighted the risks that the economic recovery may not be V-shaped, but it also showed that theyre committed to loosening the financial conditions, she said.Fox said markets remain in a volatile environment (due to) uncertainties around the virus (or) just the general growth outlook of how quickly the recovery can happen.The Dow Jones Industrial Average rose 412.6 points, or 1.64%, to 25,540.77, the S&P 500 gained 39.26 points, or 1.31%, to 3,041.36 and the Nasdaq Composite added 114.90 points, or 1.21%, to 9,607.63.Despite the rebound, the Dow and S&P 500 were on track to post their worst week in 12 weeks.Frankfurts DAX, Pariss CAC40 and Londons FTSE were all in positive territory, the latter shrugging off data showing Britains economy shrank the most on record in April.MSCIs gauge of stocks across the globe gained 0.26%, and MSCIs broadest index of Asia-Pacific shares outside Japan closed 0.91% lower.Spot gold added 0.6% to $1,737.83 an ounce and has gained about 3% so far this week.Oil prices were on track for their first weekly fall in seven as new U.S. coronavirus cases spiked.U.S. crude recently fell 0.44% to $36.18 per barrel and Brent was at $38.83, up 0.73% on the day.The three major U.S. stock indexes posted their worst day on Thursday since mid-March, when markets were sent into free-fall by the abrupt economic lockdowns put in place to contain the pandemic.Cases in New Mexico, Utah and Arizona rose by 40% over the week ended Sunday, a Reuters tally showed. Florida and Arkansas are other hot spots.In currencies, the pound shed early gains against a weaker dollar and was 0.6% lower on the day, after it had risen 3.9% against the dollar in 10 consecutive days of gains. Sterling was last trading at $1.2525, down 0.60%. The dollar index rose 0.271%.The euro down 0.42% todown 0.52% to $1.125.The Norwegian crown advanced the most, rising 0.8% to 9.5480 against the U.S. currency.In Chinas onshore market, the yuan fell 0.3%, headed for its biggest daily decline since May 27.The 10-year U.S. Treasury yield rose to 0.7067%.Bond prices were buoyed after they rallied following the Feds commitment on Wednesday to years of extraordinary support to counter the economic fallout from the pandemic."}