{"text": "* European stocks snap four-day losing streak* Oil futures turn positive* Gold on track for biggest weekly gain since April* Graphic: World stocks market cap loss tmsnrt.rs/30zdOILLONDON/TOKYO, June 12 Global shares pared losses on Friday while oil prices reversed course and edged higher as fears of fresh lockdowns of economies to combat the coronavirus faded.In Europe, the STOXX 600 Index snapped a four-day losing streak to add 1.0%. Frankfurts DAX, Pariss CAC40 and Londons FTSE were all in positive territory, the latter shrugging off data showing Britains economy shrank the most on record in April.Recovering some losses sustained in earlier trading, MSCIs 49-country index of world stocks was 0.2% down, extending a four-day losing streak. MSCIs broadest index of Asia-Pacific shares outside Japan was 0.9% lower.Oil prices clawed their way back from earlier losses to turn positive, but were still on track for their first weekly fall in seven as new U.S. coronavirus cases spiked.The three major U.S. stock indexes posted their worst day on Thursday since mid-March, when markets were sent into freefall by the abrupt economic lockdowns put in place to contain the pandemic.We do not expect any second lockdown, significant lockdown anywhere in the world. In that respect we felt risk assets were right to find the bottom in March, said Elliot Hentov, head of Policy and Research at State Street.The lockdown for us was always a one-and-done.That sentiment was echoed in a note by UBS Global Wealth Management, which pointed out that in Europe mobility had picked up and the number of new infections had remained subdued, while in the U.S. new restrictive measures were unlikely.Pointing to a rebound in Wall Street, U.S. stock futures, the S&P 500 e-minis, rose 2.0%.A jump in COVID-19 cases in some parts of the United States has raised concern among experts who say authorities have moved too soon to loosen restrictions put in place to limit contagion.Cases in New Mexico, Utah and Arizona rose by 40% over the week ended Sunday, a Reuters tally showed. Florida and Arkansas are other hot spots.The U.S. Federal Reserve released a gloomy economic outlook at the end of its two-day monetary policy meeting on Wednesday. Chairman Jerome Powell warned of a long road to recovery.Economic data appeared to back up the Feds projections, with jobless claims still more than double their peak during the 2007-09 recession and continuing claims at an astoundingly high 20.9 million.U.S. crude added 0.3% to $36.45 per barrel, while Brent crude added 0.7% to $38.69 per barrel.In currencies, sterling recovered from a disappointing week and was up 0.2% against the U.S. dollar at $1.2631 as investors returned to risk assets.The euro rose 0.1% to $1.1311, staying close to the three-month high it reached on Wednesday.Sentiment towards the dollar has turned negative as investors consider that the U.S. continues to suffer at the hands of the virus, the yield advantage of the dollar has disappeared and the chances of Trump winning (re-election) have fallen significantly, said James Athey, investment director, Aberdeen Standard Investments.When the dollar falls this tends to lead to risk-on at the moment as recent dollar strength had been driven by flight to quality.The Norwegian crown advanced the most, rising by 0.8% to 9.5480 against the U.S. currency.In the onshore market, the yuan fell 0.3%, headed for its biggest daily decline since May 27.The 10-year U.S. Treasury yield rose to 0.7067% on Friday.Bond prices were buoyed after they rallied following the Feds commitment on Wednesday to years of extraordinary support to counter the economic fallout from the pandemic.Spot gold gained 0.3% to $1,732.91 per ounce, and has jumped about 2.8% so far this week, which could be its biggest gain since the week of April 10."}