{"text": "* U.S. gridlock on stimulus deal dents share prices* Russia vaccine news triggers escape from safe-haven assets* Value-oriented shares bought back globally* Gold, silver tumble for two days in row* European shares seen falling 0.6%TOKYO/BOSTON, Aug 12 Asian stocks slipped on Wednesday on growing uncertainty over whether U.S. lawmakers would strike an agreement on an additional round of big fiscal stimulus to support an economy still struggling with the coronavirus pandemic.Hopes of vaccine development, however, prompted some investors to reduce safe-haven assets such as gold and government bonds, and to buy back battered stocks of companies hit hardest by the virus.The mixed sentiment has led to choppy trade in Asia with the index of ex-Japan Asia-Pacific shares shedding 0.76% while Japans Nikkei gained 0.2%.Mainland Chinese shares fell 1.7%, weighed by worries about the economic recovery after data showed a slowdown in the countrys money supply and bank lending growth.European shares are expected to open lower, with Euro Stoxx 50 futures falling 0.6%.On Wall Street, the S&P 500 snapped a seven-day winning streak after coming within reach of its all-time peak hit in February just before the global outbreak of the COVID-19.The declines came as political gridlock between the White House and congressional Democrats over coronavirus relief continued for a fourth day.Barring a bipartisan deal, the U.S. economy could be left with measures U.S. President Donald Trump called for on Saturday through executive orders to bypass Congress.We have enormous uncertainty. It appears its getting harder for both sides to compromise as the election is nearing... Trumps proposals would be smaller than markets have expected. Theres question over whether they are viable, too, said Junpei Tanaka, strategist at Pictet.The U.S. election campaigns look set to gather steam after Democratic presidential candidate Joe Biden selected Senator Kamala Harris as his choice for vice president.The 10-year U.S. Treasuries yield dipped 1 basis points to 0.647% in Asia after hitting a one-month of 0.661% in previous trade.On top of hedge selling ahead of the largest-ever 10-year note auction later in the day, bonds have lost some of their safe-haven allure also on rising hopes of vaccines against COVID-19.Russian President Vladimir Putin said on Tuesday his country was the first to grant regulatory approval to a COVID-19 vaccine after less than two months of human testing.While Moscows decision raised some eyebrows, the news lifted hope some of the vaccines currently in development would become available earlier than expected.Investors bought back hospitality industries stocks and other value-oriented shares, leading the old-economy centric Dow Jones to outperform the tech-focused Nasdaq.Globally, the MSCI Value index has risen 1.6% so far this week while the MSCI Growth index lost 1.2%.The most dramatic move took place in precious metals.Gold fell 1.6% to $1,881.4 per ounce, a day after it suffered its biggest daily fall in seven years. Silver lost 3.2% to $23.99 per ounce, following its 15% plunge on Tuesday.Still, Michael Hsueh, Commodities & FX Strategist at Deutsche Bank in New York said, there is a good chance this weeks decline will attract fresh buyers.In todays instance, the vaccine news is likely not sufficient to change the macro narrative, insofar as it is seen as a medical mistake in advancing too quickly through testing procedures, he said, referring to the Russian vaccine.Major currencies were little changed, with the euro almost flat at $1.1728 and the yen also moving little at 107.27 per dollar.The New Zealand dollar slipped 0.4% after the country locked down Auckland following four new cases of COVID-19 and the countrys central bank took a dovish stance.Oil prices edged up after bigger-than-expected drop in U.S. inventories, with Brent up 0.6% at $44.75 a barrel. U.S. crude was up 0.5% at $41.80."}