{"text": "* Equities slump on resurgence of coronavirus infections* Oil futures extend sell-off on demand worries* Yuan slips against dollar as coronavirus rattles Asian FXTOKYO June 12 Asian shares fell sharply on Friday and oil prices extended losses on growing concerns that a resurgence of coronavirus infections could stunt the pace of recovery in economies reopening from lockdowns, or even lead to fresh restrictions.MSCIs broadest index of Asia-Pacific shares outside Japan slid 1.52%, after a strong run-up in recent weeks. Australian stocks dropped 1.89%, while shares in China fell 0.45%.U.S. stock futures, the S&P 500 e-minis, rose 1.2% in Asian time on Friday after tumbling overnight, but that did little to help sentiment.Oil futures slumped for a second consecutive trading session due to worries about weak global energy demand, which weighed on commodity currencies and boosted the safe-haven dollar.The Chinese yuan headed for its biggest daily decline in two weeks, underscoring investors risk-averse mood in Asia.The U.S. Treasury yield curve flattened, which suggests that a heightened sense of dread about the economic outlook is returning to financial markets.Fear has a nasty habit of feeding on itself, analysts at Mizuho Securities wrote in a research note.So it is not hard to project a second bear wave in markets from a second wave of infections; as economies re-open, especially in markets that have rebounded... in defiance of all the uncertainties that the world is beset with.The three major U.S. stock indexes fell more than 5% on Thursday, posting their worst day since mid-March, when markets were sent into freefall by the abrupt economic lockdowns put in place to contain the pandemic.Japans Nikkei stock index slid 0.82%, and shares in South Korea fell 2.31% as some investors booked profits from the recent rally in global equities, which saw riskier assets rally even as the number of global virus cases and deaths continued to rise.Coronavirus cases have jumped in several U.S. states in recent days, raising concern among experts who say authorities have loosened anti-virus restrictions too early.Cases in New Mexico, Utah and Arizona rose by 40% for the week ended Sunday, a Reuters tally shows. Florida and Arkansas are other hot spots.The U.S. Federal Reserve released a gloomy economic outlook at the end of its two-day monetary policy meeting on Wednesday. Chairman Jerome Powell warned of a long road to recovery.Powell also said central bankers discussed yield curve control, which is a policy used in Japan and Australia to anchor part of the yield curve at very low level to support the economy.For (financial markets to outperform), we need the Fed to move further, especially along on its decision on implementing yield-curve control, Jean-Louis Nakamura, Asia Pacific chief investment officer at Lombard Odier said in a memo.The longer the Fed waits, the higher the risk of the return of short term volatility on markets.The spread between two- and 10-year Treasury yields has narrowed to 49 basis points from a three-month high of 72 basis points reached last week as investors scale back their bets that the U.S. economy will improve.U.S. crude slid 1.49% to $35.80 a barrel, while Brent crude eased 1.19% to $38.09 per on Friday, hit by renewed concerns over demand and a large buildup of U.S. crude inventories.Commodity-linked currencies, the Australian and New Zealand dollars, snapped a three-week run of sharp gains.In the onshore market, the yuan fell 0.3%, headed for its biggest daily decline since May 27.The dollar also rose against the yen and the British pound."}