{"text": "* Equities slump on resurgence of coronavirus infections* Oil futures extend sell-off on demand worries* Yuan slips against dollar as coronavirus rattles Asian FXTOKYO/NEW YORK, June 12 Asian shares fell sharply on Friday after Wall Street and oil tumbled over growing concerns that a resurgence of coronavirus infections could stunt the pace of recovery in economies reopening from lockdowns.MSCIs broadest index of Asia-Pacific shares outside Japan slid 1.3%. Australian stocks dropped 1.74%, while shares in China fell 0.67%.Oil futures slumped for a second consecutive trading session due to worries about weak global energy demand, which weighed on the currencies of oil producers and countries that rely on exporting commodities.The Chinese yuan headed for its biggest daily decline in two weeks, underscoring investors risk-averse mood in Asia.The three major U.S. stock indexes fell more than 5% on Thursday, posting their worst day since mid-March, when markets were sent into freefall by the abrupt economic lockdowns put in place to contain the pandemic.All of a sudden the coronavirus, which has been an also-ran story for some days now, became more important as the virus began picking up in some states, and the market began thinking there may be delays to reopening, said Tim Ghriskey, chief investment strategist at Inverness Counsel in New York.U.S. stock futures, the S&P 500 e-minis, rose 1.1% in Asia on Friday, but that did little to help sentiment.Japans Nikkei stock index slid 1.22%, and shares in South Korea fell 2.24% as some investors booked profits from a recent rally in global equities.Coronavirus cases have jumped in several U.S. states in recent days, raising concern among experts who say authorities have loosened restrictions put in place to contain the spread too early.Cases in New Mexico, Utah and Arizona rose by 40% for the week ended Sunday, a Reuters tally shows. Florida and Arkansas are other hot spots.The U.S. Federal Reserve released a gloomy economic outlook at the end of its two-day monetary policy meeting on Wednesday. Chairman Jerome Powell warned of a long road to recovery.Economic data appeared to back up the Feds projections, with jobless claims still more than double their peak during the Great Recession and continuing claims at an astoundingly high 20.9 million.U.S. crude slid 1.87% to $35.66 a barrel, while Brent crude eased 1.43% to $38.00 per barrel in Asia on Friday hit by renewed concerns over demand and a large buildup of U.S. crude inventories.The Mexican peso and the Norwegian krone fell against the U.S. dollar as the decline in crude prices hurt currencies from oil-producing countries.Commodity-linked currencies, the Australian and New Zealand dollars, snapped a three-week run of sharp gains.In the onshore market, the yuan fell 0.3%, headed for its biggest daily decline since May 27.The 10-year U.S. Treasury yield edged up slightly to 0.6853% on Friday.Bond prices were well supported after they rallied following the Feds commitment on Wednesday to years of extraordinary support to counter the economic fallout from the pandemic."}