{"text": "* Wall Street headed for second straight weekly gain* Bitcoin dips after hitting record high of $49,000 (Updates with midday U.S. markets activity, changes byline, dateline, previous LONDON)NEW YORK, Feb 12 U.S. stocks were mostly higher on Friday as investors awaited progress towards more U.S. fiscal stimulus and the dollar gained after several days of losses, while cryptocurrency Bitcoin eased after hitting a record high.MSCIs gauge of stocks across the globe was on track to post gains for a 10th straight session.U.S. President Joe Biden will meet with a bipartisan group of mayors and governors on Friday as he continues to push for approval of a $1.9-trillion coronavirus relief plan to bolster economic growth and help millions of unemployed workers.Indexes have held near record highs as investors bet on more government spending.There seems to be a pause in the negotiations for the stimulus so that kind of takes a lot of air out of the room, said Kim Forrest, chief investment officer at Bokeh Capital Partners in Pittsburgh.U.S. stock markets will be closed on Monday because of the Presidents Day holiday.The Dow Jones Industrial Average fell 2.31 points, or 0.01%, to 31,428.39, the S&P 500 gained 7.88 points, or 0.20%, to 3,924.26 and the Nasdaq Composite added 28.38 points, or 0.2%, to 14,054.15.The pan-European STOXX 600 index rose 0.64% and MSCIs gauge of stocks across the globe gained 0.25%.Bitcoin, meanwhile, was down 0.8% on the day at $47,613, after hitting a record high of $49,000. It was on track for gains of roughly 20% in a milestone week marked by the endorsement of major firms such as Elon Musks Tesla.The dollar index fell 0.01%, with the euro down 0.02% to $1.2126.U.S. Treasury yields rose and inflation expectations jumped to their highest levels since 2014 after the U.S. Treasury Department on Thursday saw weak demand for new 30-year bonds.The Treasury saw soft demand for $27 billion in 30-year bonds, its final sale of $126 billion in coupon-bearing supply this week.Benchmark 10-year notes last fell 9/32 in price to yield 1.1882%, from 1.158% late on Thursday.Oil prices were higher, helped by the hopes for a U.S. stimulus bill.Spot gold dropped 0.1% to $1,823.96 an ounce."}