{"text": "NEW YORK, Oct 12 Asian stocks were set to rise on Tuesday as a renewed tech rally and fresh optimism that Washington would deliver a coronavirus relief package helped lift global equity markets.Shares in Apple Inc surged 6.4% on Wall Street on Monday ahead of an expected debut of its latest iPhone on Tuesday, helping boost technology stocks, while Amazon rallied 4.8% ahead of its Prime Day shopping event this week.CommSec Senior Economist Ryan Felsman said a COVID-19 resurgence in Europe and the United States is partly fueling the tech rally.Once again, there is a desire to hold the stay-at-home types of technology stocks...which will still generate profits and will be greatly oriented to a more challenging economic environment, Felsman said.On Wall Street, the Nasdaq Composite on Monday staged its biggest one-day rally in a month, jumping 2.56%. The Dow Jones Industrial Average rose 0.88% and the S&P 500 gained 1.64%.The U.S. dollar was pinned near a three-week low and gold, another safe-haven asset, stayed below a three-week high, slapped by investor demand for risk. The U.S. bond market is closed on Monday for Columbus Day.MSCIs broadest index of Asia-Pacific shares outside Japan closed 0.11% higher.Australian S&P/ASX 200 futures rose 1.05% in early trading. Hong Kongs Hang Seng index futures rose 0.11%.E-mini futures for the S&P 500 rose 0.01%.The dollar index fell 0.078%, with the euro unchanged at $1.1813.The pan-European STOXX 600 index rose 0.72% and MSCIs gauge of stocks across the globe gained 0.01%.Bets that more U.S. stimulus was in the offing came despite signs that talks in Washington had stalled again, leading the Trump administration to call on Congress to pass a less ambitious coronavirus relief bill.U.S. Senate Republicans said they will go along with what President Donald Trump wants in coronavirus relief legislation, a White House spokeswoman said on Monday.Focus in Asia swings to China, which is expected to report an increase in exports on Tuesday.Beijings tensions with Washington are also in view after the White House moved forward with three sales of advanced weaponry to Taiwan, sources familiar with the situation said on Monday.The move in the run-up to the Nov. 3 U.S. election is likely to anger China, which considers Taiwan a renegade province.The yuan fell 0.8% on Monday, after the central bank cut foreign exchange forward reserve requirements that effectively lowers the cost of shorting the yuan.Investors are also closely watching the global resurgence in coronavirus cases after British Prime Minister Boris Johnson on Monday announced a new system of restrictions on parts of England. Lawmakers will vote on the move on Tuesday.Gold added 0.1% to $1,923.62 an ounce.In energy markets, oil prices slipped after a force majeure at Libyas largest oilfield lifted, a Norwegian strike affecting production ended and U.S. producers began restoring output after Hurricane Delta.Brent crude settled down $1.13, or 2.6%, to $41.72 a barrel. U.S. West Texas Intermediate CLc1 ended 2.9%, or $1.17, lower at $39.43.U.S. banks JPMorgan and Citigroup will kick off the third-quarter earnings season on before U.S. markets open on Tuesday, followed by Goldman Sachs, Bank of America and Wells Fargo on Wednesday and Morgan Stanley on Thursday. (Reporting by Suzanne Barlyn; Editing by Sam Holmes)"}