{"text": "(Updates to afternoon)NEW YORK, Nov 12 Wall Street sank and U.S. Treasury yields edged lower on Thursday as euphoria over a potential COVID-19 vaccine faded in the face of spiking infections and threat of a new round of economic restrictions to contain the pandemic.The sell-off was broad, with economically-sensitive cyclical stocks, which rallied on Monday and Tuesday, suffering the deepest losses.On Monday, Pfizer Inc announced the COVID-19 vaccine candidate it developed with German partner BioNTech SE appears to be 90% effective at preventing infection, news that sent equity markets surging worldwide.But new coronavirus infections in the United States and elsewhere are reaching record levels and tightening economic restrictions to contain the spread has dampened the prospect of a quick end to the global health crisis.Earlier this week, it was a vaccine is here, but today the trading seems to be the vaccine might not be here for a while, said Chuck Carlson, chief executive officer at Horizon Investment Services in Hammond, Indiana. And the acceleration of new cases seems to be raising the idea that more stringent lockdowns are going to be necessary.The Dow Jones Industrial Average fell 392.7 points, or 1.34%, to 29,004.93, the S&P 500 lost 43.66 points, or 1.22%, to 3,529 and the Nasdaq Composite dropped 84.09 points, or 0.71%, to 11,702.34.A surge in new coronavirus infections prompted a retreat of European shares away from eight-month highs, with banks leading the decline, as hopes waned for a quick economic rebound.The pan-European STOXX 600 index lost 0.88% and MSCIs gauge of stocks across the globe shed 0.78%.Emerging market stocks rose 0.18%. MSCIs broadest index of Asia-Pacific shares outside Japan closed 0.12% higher, while Japans Nikkei rose 0.68%.U.S. Treasury yields, which can be viewed as a gauge of risk appetite, slumped amid the risk-off mood and hit session lows following a tweet from Bloomberg that the Trump administration was backing away from stimulus talks.Benchmark 10-year notes last rose 30/32 in price to yield 0.8897%, from 0.989% late on Tuesday.The 30-year bond last rose 73/32 in price to yield 1.6572%, from 1.76% late on Tuesday.Crude oil prices reversed early gains, snapping a three-day rally on growing doubts over a near-term demand recovery.U.S. crude fell 0.80% to settle at $41.12 per barrel, while Brent settled at $43.53 per barrel, down 0.62% on the day.The dollar was slightly down against a basket of currencies, reflecting oscillating sentiment between vaccine hopes and coronavirus worries.The dollar index fell 0.07%, with the euro up 0.23% to $1.1804.The Japanese yen strengthened 0.27% versus the greenback at 105.15 per dollar, while Sterling was last trading at $1.311, down 0.84% on the day.Risk-off sentiment attracted investors back to gold, which continued to recover some ground that the safe-haven metal lost in Mondays plunge.Spot gold added 0.6% to $1,876.61 an ounce."}