{"text": "(Updates to U.S. market open, changes dateline to NEW YORK from LONDON, changes byline)NEW YORK, Nov 12 The S&P 500 dropped and U.S. Treasury yields edged lower on Thursday as the euphoria over a potential COVID-19 vaccine faded in the face of spiking infections and the threat of a new round of economic shutdowns.The blue-chip Dow was also in the red, but tech stocks helped keep the Nasdaq afloat, a reversal from the shift to economically-sensitive cyclical stocks on Monday and Tuesday.We had an incredible rush to cyclical and value names earlier this week, but the COVID concerns are bouncing and were having a move back to the stay-at-home and tech stocks, said Ryan Detrick, senior market strategist at LPL Financial in Charlotte, North Carolina.On Monday, Pfizer Inc announced the COVID-19 vaccine candidate it developed with German partner BioNTech SE appears to be 90% effective at preventing infection, news that sent equity markets surging worldwide.But new coronavirus infections in the U.S. and elsewhere are reaching record levels and tightening economic restrictions to contain the spread has dampened the prospect of a quick end to the global health crisis.The Pfizer vaccine was wonderful news earlier this week but the continuing soaring new cases is a reminder that were not out of the woods by any means, Detrick added. People are off their sugar high and realizing were likely going to have more shutdowns.The Dow Jones Industrial Average fell 95.37 points, or 0.32%, to 29,302.26, the S&P 500 lost 4.85 points, or 0.14%, to 3,567.81 and the Nasdaq Composite added 38.21 points, or 0.32%, to 11,824.64.A surge in new coronavirus infections prompted a retreat of European shares away from eight-month highs as hopes waned for a quick economic rebound.The pan-European STOXX 600 index lost 0.87% and MSCIs gauge of stocks across the globe shed 0.05%.Emerging market stocks rose 0.57%. MSCIs broadest index of Asia-Pacific shares outside Japan closed 0.39% higher, while Japans Nikkei rose 0.68%.U.S. Treasury yields, which can be viewed as a gauge of risk appetite, slumped amid the risk-off mood.Benchmark 10-year notes last rose 21/32 in price to yield 0.9193%, from 0.989% late on Tuesday.The 30-year bond last rose 1-18/32 in price to yield 1.6893%, from 1.76% late on Tuesday.Hopes that world producers will delay a planned supply increase helped crude oil prices sustain their rally, though the gains were capped by growing doubts over a near-term demand recovery.U.S. crude rose 0.31% to $41.58 per barrel and Brent was last at $44.38 per barrel, up 1.32% on the day.The dollar edged lower against a basket of currencies, reflecting growing caution regarding vaccine expectations.The dollar index fell 0.12%, with the euro up 0.31% to $1.1814.The Japanese yen strengthened 0.28% versus the greenback at 105.14 per dollar, while Sterling was last trading at $1.3143, down 0.59% on the day.The risk-off mood attracted investors back to gold, which continued to recover some ground that the safe-haven metal lost in Mondays plunge.Spot gold added 0.9% to $1,881.16 an ounce."}