{"text": "BOSTON, Aug 11 Asian stocks were set for choppy trade on Wednesday after Wall Street dipped amid growing uncertainty about an additional round of U.S. fiscal stimulus.New Zealand opened the region on a grim note after the Pacific nation reported its first coronavirus infections in more than 100 days, and sent its largest city back into lockdown.Despite the mixed sentiment, safe-haven gold remained under pressure having posted its worst one-day rout in seven years on a broader lift in risk appetite earlier in the session.Elsewhere in Asia, Australias S&P/ASX 200 rose 0.2% and Japans Nikkei 225 was up 0.3%. Hong Kongs Hang Seng index futures lost 0.21%.U.S. stocks closed lower on Tuesday, with the S&P 500 and Dow snapping a seven-day winning streak and falling late in the session on growing uncertainty about a stalemate in Washington over a fiscal stimulus deal.The Dow Jones Industrial Average fell 0.38%, the S&P 500 lost 0.80%, and the Nasdaq Composite dropped 1.69%.The days declines came as political gridlock between the Republican White House and congressional Democrats over coronavirus relief continued for a fourth day, with each party blaming the other for intransigence.The other major political news out of the U.S. was Democratic presidential candidate Joe Biden selecting Senator Kamala Harris as his choice for vice president, making her the first Black woman on a major party presidential ticket in U.S. history.E-mini futures for the S&P 500 rose 0.16% in Asia on Wednesday.The dollar edged higher while the euro gave up earlier gains on Tuesday in choppy trading, as risk appetite soured after the impasse in stimulus negotiations.In New Zealand, the benchmark S&P/NZX 50 index fell nearly 2% and the currency dipped against the dollar as Prime Minister Jacinda Ardern announced she was re-locking down Auckland after four new cases of COVID-19 were discovered in the city.If the lockdowns are removed after three days, the damage to New Zealands economy should be small, Joseph Capurso of Commonwealth Bank of Australia wrote in a note Wednesday.Despite the new cases, New Zealands central bank is expected to hold rates steady at its policy meeting later on Wednesday amid signs of improvement in the economy.The Japanese yen was little changed versus the greenback at 106.48 per dollar, while Sterling was last trading flat at $1.3050.The Australian dollar hardly budged at $0.715.The stronger dollar was no help for already battered precious metals. Spot gold prices fell near 6%, the largest one-day drop in over seven years and silver plunged over 15%, its largest daily drop in over a decade.U.S. Treasury yields jumped to one-month highs on Tuesday, a day before the government sells its largest-ever amount of 10-year notes. Benchmark 10-year note yields jumped six basis points to 0.635%, after earlier reaching 0.661%, the highest since July 13. They are up from a low of 0.504% on Thursday.Oil prices fell about 1% on Tuesday after rising earlier in the session as hopes dimmed for a swift stimulus resolution. Brent crude futures fell 49 cents, or 1.1%, to settle at $44.50 a barrel. U.S. West Texas Intermediate (WTI) crude futures fell 33 cents, or 0.8%, to finish at $41.61 a barrel."}