{"text": "Global shares were flat on Friday but within sight of a record high, while oil edged lower as benchmark debt yields climbed, helping to curb the latest stimulus-driven rally.Gains in Asian stock markets proved tough to match for most European peers, after they hit a one-year high the day before. U.S. stock futures also suggested a lower start for Wall Street later in the day.The note of caution followed the signing of a $1.9 trillion U.S. stimulus bill into law on Thursday and a further dovish tilt from the European Central Bank that had prompted a retreat in bond yields and eased global concerns about rising inflation.The burst of market optimism from those events had helped Asian shares rise - Japan's Nikkei added 1.7% - but this faded out as Europe opened for business, with the STOXX Europe 600 (.STOXX) down around 0.5%.That in turn weighed on the MSCI World Index (.MIWD00000PUS), taking it into the red, down 0.1%, albeit less than 1.5% away from the record high hit last month.\"We have recently seen some erratic market moves across asset classes, as well as within equity market sectors and styles. A period of digestion thus seems logical and healthy,\" Barclays analyst Emmanuel Cau said in a note.Biden had signed the stimulus legislation before giving a televised address in which he pledged aggressive action to speed vaccinations and move the country closer to normality by July 4.  read more Earlier, the European Central Bank had said it was ready to accelerate money-printing to keep a lid on borrowing costs.  read more \"The odds are that European fixed income outperforms as sovereign curves, particularly in the periphery, will flatten and that the spread between the U.S. and European interest rate curve will widen,\" said Nordea analyst Sebastien Galy.Against that backdrop of super-loose monetary policy, analysts largely expect inflation to pick up as vaccine rollouts lead to a reopening, leading to worries that Biden's stimulus package could overheat the economy.  read more \"If inflation remains contained at low levels, then there will be little pressure on the Federal Reserve to raise rates and in such a scenario, robust growth and abundant liquidity may continue to drive markets higher,\" said Mark Dowding, CIO at BlueBay Asset Management.\"However, if inflation trends upwards, then bond yields and policy rates will rise and this may create a much more challenging market dynamic.\"U.S. 10-year Treasury yields rose again on Friday, back above 1.6% and on track to rise for the seventh straight week.Given market moves, all eyes will be on the next meeting of the U.S. Federal Reserve next week for clues to its views on rising yields and the threat of inflation.In currency markets, the dollar gained 0.6% against the yen and 0.5% against the euro and pound , although the latter was helped by news the economy had contracted less than expected in January.The dollar index , meanwhile, which tracks the U.S. currency against a basket of six major rivals, rose 0.5%.Markets are likely to remain volatile in the second quarter, particularly for the dollar, which was much stronger than expected at the start of the year, said Cliff Zhao, chief strategist at China Construction Bank International.\"So I think the strong U.S. dollar may weigh on some liquidity conditions in the emerging markets,\" he said.Oil prices retreated as the dollar gained, with U.S. crude dipping 0.4% to $65.77 a barrel. Brent crude lost 0.2% to $69.47 per barrel.Spot gold prices fell 1.2% to $1,701.9 an ounce."}