{"text": "DETROIT (Reuters) -General Motors Cos marketing and promotional spending will return to normal levels after the COVID-19 pandemic caused that budget to drop last year, the U.S. automakers top marketing officer said on Monday.What we went through in the pandemic was certainly severe and we should be moving back up to our normalized levels, GM Chief Marketing Officer Deborah Wahl said in an online appearance at a Reuters Events conference.Wahl declined to discuss how much GM will spend this year, but GM cut its advertising and promotional spending last year by about $1 billion to $2.7 billion according to the Detroit companys annual report.The pandemic forced the shutdown of the U.S. auto sector for two months last year, and the subsequent global chip shortage has led to further idling of plants, causing vehicle inventories to shrink. That has led to higher prices for both new and used cars, dealers said at the conference.The inventories are working for us, AutoNation Inc executive vice president Marc Cannon said, adding that pricing has risen as supply has shrunk.Cannon, who heads customer service at the largest public U.S. dealer, also cited a whole new attitude for consumers as they accept the higher prices and they are willing to make compromises or wait longer for vehicles.Carvana Chief Executive Ernie Garcia said his company, which sells used vehicles online, has unlocked a different business model that allows lower cost and more availability and diversity of vehicle models compared to traditional dealers with brick-and-mortar operations.Carvanas online model and technology could enable it to expand into other services, Garcia said, but for now the company remains focused on its core business.CarMax Inc CEO Bill Nash said digital sales are a growing business with about 75% of its customers doing some of the deal online, but the used-car dealer is finding consumers coming back to the stores as the pandemic eases.In a separate appearance at the conference, Ford Motor Cos chief customer experience officer, Elena Ford, said the No. 2 U.S. automaker has pushed to deepen relationships with its retail and commercial customers post COVID-19.As people venture back out, we have a real opportunity to re-imagine the entire experience our customers have, she said.Sonic Automotive Inc President Jeff Dyke and other dealers said the key will be using technology and better online tools to offer both the in-dealer and online shopping experience consumers want.Customers want individualized experiences and technology is going to lead to that, Dyke said.GMs Wahl also said the No. 1 U.S. automaker will offer a third-party app that delivers in-vehicle navigation capability to about 900,000 vehicles that lack the feature.The Maps+ app, from Mapbox, will begin the rollout on certain 2018 and newer models on April 30 to customers with select connected services plans, GM said."}