{"text": "DETROIT General Motors Co shares jumped on Tuesday to their highest level since the companys post-bankruptcy IPO in 2010, as the automaker announced its entry into the growing electric delivery vehicle business.After Chief Executive Mary Barra outlined plans for GMs first BrightDrop commercial vans to be delivered to FedEx later this year, GM shares rose as high as $48.95 in morning trading, pushing the companys market cap over $68 billion.The new BrightDrop delivery business will put GM squarely in competition in the commercial sector with cross-town rival Ford Motor Co, as well as startups such as Rivian, Arrival and Canoo that are developing electric commercial vehicles for customers ranging from Amazon to Hyundai Motor.Fueled in part by the COVID-19 pandemic, GM estimates the U.S. market for parcel and food delivery will climb to more than $850 billion by 2025. It is one sector that EV sales leader Tesla has yet to crack.Barra said BrightDrop will offer delivery and logistics customers such as FedEx a range of products and services that leverage the automakers expertise in electrification and fleet management.The BrightDrop EV600 will use a version of GMs Ultium battery system that will power many of the companys future electric vehicles, including the Hummer EV pickup and the Cadillac Lyriq crossover.Barra introduced BrightDrop in an online keynote address at the CES annual tech and gadget show.As part of Barras presentation, GM design chief Mike Simcoe hosted a virtual unveiling of two battery-powered Cadillac concepts: A flying car and a boxy shuttle with sliding doors. Simcoe said Cadillac also is working on a luxury electric two-seater.In a pre-show briefing, Pam Fletcher, GM vice president of global innovation, said the BrightDrop EV600 is a large, purpose-built delivery van that will have a range of 250 miles (400 km) between charges, with a long list of advanced safety features and built-in internet connectivity.Unlike Cruise, the San Francisco self-driving startup that is majority-owned by GM and is developing a robotaxi business, BrightDrop does not plan to operate its own vehicle fleet. It will focus on supplying electric vans and related services to commercial customers.A source familiar with details of the EV600 said it will share basic underbody architecture with the Hummer EV and a variety of other large GM trucks and SUVs that will hit the market over the next three years.The first 500 units will go to FedEx by the end of the year, with deliveries to other customers starting in early 2022, Fletcher said.The BrightDrop commercial van family could eventually include a smaller model designed for medium-distance deliveries and a larger model designed for rapid loading and unloading, she said.In November, GM said it would challenge Tesla with increased spending and accelerated vehicle production targets. The higher investment will be funded by expanded pickup and SUV production.GM said it planned to increase spending on electric and autonomous vehicles to $27 billion by 2023, up 35% from previously disclosed plans. The Detroit automaker will offer 30 EVs globally by 2025 and wants to exceed annual sales of 1 million EVs in China and the United States by then."}