{"text": "Goldman Sachs (GS.N) is aiming to snare a bigger share of the booming number of Special Purpose Acquisition Company (SPAC) deals in Asia by having senior bankers specifically target these blank cheque transactions across the region.    The initiative was put in place towards the end of last year - but has not been reported - when SPACs started taking off in Asia following rapid growth in these deals elsewhere, including in the United States.    A SPAC typically raises money to acquire a private company with the purpose of taking it public, allowing such targets to move more quickly to the public markets than via a traditional initial public offering.Hong Kong-based Raghav Maliah, the global vice chairman of Goldman Sachs investment banking division, leads the initiative together with Vikram Chavali and Edward Byun who are also in Hong Kong.\"We are seeing a great deal of capital markets and M&A activity across the region, including increased SPAC involvement both on the IPO and M&A fronts,\" Maliah told Reuters in an interview.\"SPACs have become an incrementally relevant product for consideration when they think through ways to achieve their goals.\"Indias ReNew Power, in which Goldman Sachs is an investor, announced on Feb. 24 it would go public through an $8 billion merger with a blank-check firm in RMG Acquisition Corp II. Goldman Sachs was also an advisor to the company on the transaction.  read more Chavali, an investment banking managing director, covers technology, media and telecom (TMT) sectors for Goldman Sachs across Asia Pacific ex-Japan.Byun is an Equity Capital Markets (ECM) managing director specialising in TMT and high growth sectors across the region.\nGoldman's specialist team contrasts with most other \"bulge bracket\" investment banks operating across Asia, which carry out SPAC work primarily through their ECM businesses.In Asia, SPAC deal volumes are some way behind those in the United States.There have been $2.64 billion worth of SPAC deals in Asia so far in 2021, which is already more than $2.46 billion for 2020, based on Dealogic data.Globally, there have been $79.3 billion worth of SPACs issues since the start of the year, almost eclipsing the $83.3 billion raised in total for 2020, the Dealogic data showed.Citigroup (C.N) is the most active SPAC bookrunner with a 14% share of the market worldwide, ahead of Goldman Sachs at 12% and Credit Suisse (CSGN.S) at 9%, based on Dealogic data."}