{"text": "AUGUSTA, Ga. Two weeks after wading into turbulent political waters by publicly supporting President Donald Trump in the U.S. election and warning the country against turning socialist, Jack Nicklaus clubbed away a question about the matter on Thursday.The 80-year-old Nicklaus, the most prolific major winner of all-time with 18 titles in the four biggest championships, had earlier hit the ceremonial first tee shot with fellow great Gary Player at the Masters at Augusta National.At a later news conference, it did not take long for a reporter to raise the issue of Nicklaus support for Trump.Most major news organizations have declared Democratic Party candidate Joe Biden the winner of the election, but Trump has yet to concede.The President has instead brought a flurry of lawsuits in close-run states to try to back his unsupported claims of widespread electoral fraud.You are known as the ultimate gracious sportsman in the game of golf and really throughout sports... the way youve handled victory and defeat and the like, the reporter said.Im just curious, what is your advice to President Trump on how to accept defeat?A stony-faced Nicklaus shut down the questioner with a short, terse reply.I think Ive said enough about that. I dont think this is the place for politics, he said, clearly intent on not giving the issue any further oxygen.Nicklaus has long been known for his generally conservative political views, par for the course for American golfers of his generation, but has rarely gone out of his way to publicise them, until now that is.On Oct. 28, Nicklaus posted an open letter to his 481,000 Twitter followers with his thoughts on the Nov. 3 vote.If we want to continue to have the opportunity to pursue the American Dream, and not evolve into a socialist America and have the government run your life, then I strongly recommend you consider Donald J. Trump for another 4 years, Nicklaus wrote.You might not like the way our President says or tweets some things -- and trust me, I have told him that! -- but I have learned to look past that and focus on what hes tried to accomplish."}