{"text": "Gordon Hayward scored 28 of his 34 points in the first half and the Charlotte Hornets picked up their fourth consecutive victory by defeating the visiting New York Knicks 109-88 on Monday night.Devonte Graham added 19 points, P.J. Washington and Miles Bridges each provided 13 points and Terry Rozier had 12 points for the Hornets. Charlotte committed only 10 turnovers. Hayward shot 11-for-17 from the field, hitting both of his 3-point attempts.Charlotte rookie guard LaMelo Ball, a 19-year-old who became the youngest player in NBA history to produce a triple-double two nights earlier, pulled in a game-high 14 rebounds to go with eight points, seven assists and three steals in a reserve role.This was the first meeting of the season between the teams, though Charlotte has won five straight matchups with the Knicks, including a three-game sweep last season.Kevin Knox II, coming off the bench, poured in 19 points to lead the Knicks. Elfrid Payton posted 15 points, Austin Rivers had 13, Mitchell Robinson scored 12 and Julius Randle and RJ Barrett both contributed 11. Barrett shot 5-for-18 from the field, missing all five of his 3-point attempts.Robinson had 11 rebounds, part of New Yorks 49-37 edge on the boards.The Hornets (6-5) are above .500 for the first time this season.The Knicks (5-6) were coming off a 1-2 homestand. They lost their third game in a row, including two the past two nights. New York shot only 9-for-37 (24.3 percent) from 3-point range and failed to reach the 90-point level for the third game in a row.The Hornets built a 17-point lead in the first quarter only to have the Knicks pull ahead 38-37 in the second quarter on a Barrett hoop. That was a short-lived advantage for New York.Charlotte held a 57-50 halftime lead, aided by Haywards 10-for-10 free-throw shooting before the break. Knox drained five first-half 3-pointers, and his 17 points before the break helped keep the Knicks within range.The Hornets closed the third quarter on an 8-1 run for an 82-68 edge.--Field Level Media"}