{"text": "U.S. cash crude differentials mostly weakened on Monday as the spread between benchmark U.S. crude futures and Brent contracted, dealers said.Coastal grades including Louisiana light Sweet (LLS) and Mars eased as the Brent/WTI spread narrowed by 7 cents a barrel. A narrow spread typically makes U.S.-crude linked coastal grades less attractive to international buyers compared to Brent-linked grades.Among inland grades, WTI Midland eased by 5 cents on signs of increased production from the Permian basin.Output from the Permian, the top-producing basin in the country, is expected to rise by 52,000 bpd to about 4.47 million bpd, the highest since April 2020, the EIA said in a monthly forecast.Overall, U.S. oil output from seven major shale formations is expected to rise for a third straight month, climbing by about 13,000 barrels per day (bpd) in May to 7.61 million bpd.Bakken crude at Clearbrook, Minnesota traded at 65 cents a barrel above benchmark futures, dealers said.The U.S. Army Corps of Engineers said last week it will allow Energy Transfer LPs Dakota Access crude oil pipeline to keep running without a federal permit, frustrating activists who wanted the line shut after a key environmental permit was scrapped last year.DAPL is the biggest pipeline transporting crude out of North Dakota, shipping up to 570,000 barrels of North Dakotas crude production daily. The Corps, which could have shut DAPL during an environmental review of the line, instead deferred to a U.S. district court to make a call on whether flows on the line should be temporarily halted.Meanwhile, inventories at Cushing, Oklahoma, the delivery point for U.S. crude futures, rose by 138,000 barrels in the week through Friday, traders said, citing Wood Mackenzie data.In refinery news, Repairs to the gasoline-producing fluidic catalytic cracker (FCC) at Total SEs 225,500 barrel-per-day (bpd) Port Arthur, Texas, will take five weeks, said sources familiar with plant operations.* Light Louisiana Sweet for May delivery fell 10 cents to a midpoint of $1.85 and traded between $1.75 and $1.95 a barrel premium to U.S. crude futures.* Mars Sour fell 5 cents to a midpoint of 15 cents a barrel and traded between 5 cents and 25 cents a barrel premium to U.S. crude futures.* WTI Midland fell 5 cents to a midpoint of 35 cents a barrel and traded between 15 cents and 55 cents a barrel premium to U.S. crude futures.* West Texas Sour was unchanged at a midpoint of 40 cents a barrel, trading between 30 cents and 50 cents a barrel discount to U.S. crude futures.* WTI at East Houston, also known as MEH, traded at 90 cents a barrel over WTI.* ICE Brent June futures rose 33 cents to settle at $63.28 a barrel.* WTI May crude futures rose 38 cents to settle at $59.70 a barrel.* The Brent/WTI spread narrowed 7 cents to settle at minus $3.53, after hitting a high of minus $3.49 and a low of minus $3.73."}