{"text": "    * Wheat down for second week as U.S. Plains set for relief\n    * Soybeans ease from near 7-year high, S. America weather eyed\n    * Corn subdued as U.S. planting indications awaited\n\n (Updates with European trading, changes byline/dateline)\n    By Gus Trompiz and Naveen Thukral\n    PARIS/SINGAPORE, March 12 Chicago wheat futures extended losses\non Friday to a one-month low as rain forecast for dry parts of the U.S. Plains\neased supply concerns.\n    Soybean edged lower as it moved back from a near seven-year high this week,\nwith the market weighing increased estimates of Brazil's soybean harvest against\na declining outlook for Argentina.\n    Corn also eased, with traders awaiting indications about U.S. spring\nplanting trends and fresh signs of Chinese demand.\n    The most-active wheat contract on the Chicago Board Of Trade (CBOT)\nwas down 0.4% at $6.40-1/4 a bushel by 1026 GMT, after earlier touching its\nlowest since Feb. 12 at $6.38.\n    \"The upcoming rainfall to the U.S. Hard Red Winter wheat regions, including\nthe very western third, continues to weigh on prices,\" Tobin Gorey, director of\nagricultural strategy at the Commonwealth Bank of Australia in Sydney, said.\n    Significant rain expected in the coming days in a swathe of the U.S. Plains\ncould bring relief for parched crops as they enter the key spring growth phase.\n    The improved moisture outlook for U.S. wheat coincides with reports of\nbetter growing conditions in top exporter Russia, along with a favourable\nsituation in the European Union. \n    An import tender by Egypt on Thursday also tempered supply concerns, as it\nshowed a large number of offers, including bids of Russian wheat despite a\nrecent export tax.\n    Egyptian state buyer purchased 360,000 tonnes of Romanian wheat in the\ntender.\n    CBOT soybeans were down 0.3% at $14.08-3/4 a bushel, on course for their\nfirst weekly loss in five.\n    CBOT corn was down 1.0%.\n    The Buenos Aires Grains Exchange lowered its estimates of Argentina's\nsoybean harvest to 44 million tonnes and its corn forecast to 45 million tonnes,\nbelow its previous forecasts of 46 million tonnes for each crop, citing dry\nconditions.\n    But several forecasters have increased estimates for Brazil's ongoing\nsoybean harvest, despite rain delays.\n    Concern that renewed outbreaks of African swine fever in China could weaken\ndemand for livestock feed like soy has weighed on the market, countering support\nfrom a global rally in vegetable oils including soyoil.\n    \n    \n Prices at 1026 GMT                                                \n                              Last  Change    Pct      End  Ytd Pct\n                                             Move     2020     Move\n  CBOT wheat                640.25   -2.25  -0.35   640.50    -0.04\n  CBOT corn                 533.25   -5.25  -0.97   484.00    10.18\n  CBOT soy                 1408.75   -4.75  -0.34  1311.00     7.46\n  Paris wheat May           224.00   -0.50  -0.22   210.50     6.41\n  Paris maize Jun           215.75   -1.00  -0.46   198.75     8.55\n  Paris rape May            517.75   -1.25  -0.24   412.00    25.67\n  WTI crude oil              65.93   -0.09  -0.14    48.52    35.88\n  Euro/dlr                    1.19   -0.01  -0.58   1.2100    -1.54\n Most active contracts - Wheat, corn and soy US cents/bushel, Paris\n futures in euros per tonne\n \n    \n\n (Reporting by Gus Trompiz in Paris and Naveen Thukral in Singapore; Editing by\nRashmi Aich and Alexander Smith)\n  "}