{"text": "    * USDA forecast curbed corn prices \n    * Soybeans firm as big Brazil crop set against tight U.S. stocks\n    * Market impetus restrained by Lunar New Year holiday \n\n (Updates with European trading, changes byline/dateline)\n    By Gus Trompiz and Colin Packham\n    PARIS/CANBERRA, Feb 12 U.S. corn futures edged higher on Friday,\nconsolidating after a volatile week in which prices retreated from a 7-1/2 year\nhigh as a higher than expected U.S. supply forecast tempered support from recent\nChinese demand.\n    Soybeans were also firm, with expectations for bumper South American\nproduction set against tight U.S. stocks, while wheat was little changed.\n    A week-long holiday in China for the Lunar New Year was also removing some\nimpetus from grain markets.\n    The most active corn futures on the Chicago Board of Trade (CBOT) were\nup 0.5% at $5.43-3/4 a bushel by 1317 GMT.\n    After reaching their highest since June 2013 early this week, corn futures\ntumbled when the U.S. Department of Agriculture made a smaller than anticipated\ncut to its monthly U.S. corn stocks forecast before prices regained some ground\nfrom Thursday.\n    The USDA's stocks projection surprised traders who had expected recent\nmassive export sales to China to absorb more of the U.S. surplus.\n    \"Consolidation perhaps suggests the looser longs have been shaken out for\nnow,\" said Tobin Gorey, director of agricultural strategy at Commonwealth Bank\nof Australia.\n    \"U.S. export sales were solid over the past week but not startlingly so,\" he\nsaid, referring to weekly export data published on Thursday.\n\n    Despite early rain delays to Brazil's soybean harvest, prospects for large\nsoybean and corn crops in South America also curbed grain markets this week.\n    Soybean production in Brazil is expected to reach a record 133.817 million\ntonnes in 2020/21, while corn output is forecast to be bigger than previously\nprojected, agricultural statistics agency Conab said on Thursday.  \n    Harvest prospects in Argentina have also been boosted by rainfall after\ndrought.\n    However, soybean futures remained underpinned by the USDA's monthly forecast\nof U.S. 2020/21 soybean stocks, which was below market consensus.\n    CBOT soybean futures were up 0.4% at $13.72-1/4 a bushel while wheat\n edged up by a quarter of a cent to $6.33-3/4 a bushel.\n    The wheat market was monitoring the risk of frost damage to U.S. wheat crops\nthis week in areas lacking protective snow cover.\n    \n    \n Prices at 1317 GMT                                                 \n                               Last  Change    Pct      End  Ytd Pct\n                                              Move     2020     Move\n  CBOT wheat                 633.75    0.25   0.04   640.50    -1.05\n  CBOT corn                  543.75    2.75   0.51   484.00    12.35\n  CBOT soy                  1372.75    5.25   0.38  1311.00     4.71\n  Paris wheat Mar            222.25   -0.25  -0.11   213.25     4.22\n  Paris maize Mar            219.50    1.25   0.57   198.50    10.58\n  Paris rape May             448.50    1.75   0.39   412.00     8.86\n  WTI crude oil               57.90   -0.34  -0.58    48.52    19.33\n  Euro/dlr                     1.21    0.00  -0.21   1.2100     0.02\n Most active contracts - Wheat, corn and soy US cents/bushel, Paris\n futures in euros per tonne\n \n    \n    \n    \n\n (Reporting by Gus Trompiz in Paris and Colin Packham in Canberra\nEditing by Krishna Chandra Eluri and David Goodman\n)\n  "}