{"text": "LONDON Optimism for a recovery in oil demand as COVID-19 vaccines are rolled out while producers rein in supply has pushed the market structure for Brent and U.S. crude into the deepest backwardation since the start of the pandemic.Backwardation means the current value is higher than prices for later months and encourages traders to draw down oil supplies and sell promptly.Brent crude futures hit a 13-month high above $61 a barrel this week.Keeping pace, Brent backwardation was at its deepest since late January 2020 this week at $2.80. That structure encourages financial investors to hold large positions in oil futures because it makes it cheaper to roll over monthly contracts.Graphic: Brent backwardationhttps://fingfx.thomsonreuters.com/gfx/mkt/yxmvjxkxjvr/lcoc17.JPGData from the U.S. Energy Information Administration forecasting sharp draws on stocks and declining domestic output put U.S. oil market backwardation at $2.54 this week.Graphic: WTI Backwardationhttps://fingfx.thomsonreuters.com/gfx/mkt/qmyvmwowxvr/clc17.JPGThe structure has pushed some traders from longer-dated futures contracts to more prompt ones, according to the International Energy Agency, at the same time encouraging producer hedging to avoid exposure to sudden price drops.The combination of moves boosted backwardation, in a self-reinforcing trend, according to the IEA.Global implied stock draws sped up from 1.56 million barrels per day (bpd) in the third quarter of 2020 to 2.24 million bpd in the fourth, it added in its monthly report on Thursday.Graphic: OECD total oil industry stocks hereGraphic: Floating storagehttps://fingfx.thomsonreuters.com/gfx/mkt/jznpnobogvl/floating.JPGGraphic: Stock changeshttps://fingfx.thomsonreuters.com/gfx/mkt/gjnvwzyznpw/Stockchangesfeb.JPGMuch of the cheer from the supply side comes from top exporter Saudi Arabia unilaterally reducing supply in February and March amid cuts agreed by Organization of the Petroleum Exporting Countries members and allies, a group known as OPEC+.Higher futures prices and reduced stocks point to a balance between supply and demand, but likely producer moves towards more production could upset the equilibrium.As jolly as the mood currently is, the extra Saudi cuts only last for another 50 days, said Rystad Energy oil markets analyst Louise Dickson.The current bullish backwardation of the Brent curve indicates that the market has already priced in OPEC+ doing the right thing and staying disciplined with supply management. Which is a risk."}