{"text": "Greek Tourism Minister Harry Theoharis said on Wednesday he was hopeful Britain would include Greece on its \"green list\" of quarantine-free holiday destinations when the list is reviewed at the end of this month.Greece was kept off an initial list of just 12 countries and territories that Britain said travellers could visit from May 17 without having to quarantine on their return home.  read more \"I am moderately optimistic that in the next review, if not our whole country, at least our islands should be on the green list,\" Theoharis said on Greek state TV.Theoharis is currently on a visit to Britain, one of the three largest markets for its vital tourism sector, meeting government officials, tour operators and airlines ahead of the official start of the tourism season on May 15.His comments came as Greek authorities announced a further easing of restrictions after organised beaches, museums, bars and restaurants were allowed to reopen from last week.From Friday, travel between regions including to the islands will be allowed for people with negative COVID-19 tests or vaccinations. Shoppers will also be allowed to go to stores without an appointment, Akis Skertsos, deputy minister to the prime minister said.Greece came out of the first wave of the pandemic last year in better shape than many European countries but it has suffered heavily in recent months as a surge in cases forced it back into lockdown and put health services under severe strain.However, with authorities aiming to vaccinate the population of its islands by the end of June, the government says vaccines and rapid testing as well as warmer weather allowing more outdoor activities mean visitors can now travel safely.Tourism accounts for about a fifth of the Greek economy and employs one in five workers. A collapse in arrivals last year because of the pandemic slashed revenues to 4 billion euros from 18 billion in 2019.Holiday company TUI Group  said earlier on Wednesday that it expects countries such as Spain and Greece to be included in Britain's \"green list\" of low-risk destinations at the end of the month.  read more "}