{"text": "JAKARTA (Reuters) -Indonesian police arrested firebrand Islamic cleric Rizieq Shihab on Saturday on suspicion of breaching coronavirus restrictions by staging several mass gatherings since his return from self-exile last month.The controversial and politically influential cleric has called for a moral revolution since returning on Nov. 10, fueling tension with President Joko Widodos administration in the worlds most populous Muslim-majority country.His arrest came after six members of his Islamic Defenders Front (FPI) were killed on Monday in a shootout with police investigating the violation of coronavirus protocols amid rising infections and deaths.After Rizieq reported to police and was questioned through most of Saturday, police spokesman Argo Yuwono told a news conference the cleric had been detained in custody for 20 days because the charges he faces could lead to five years in prison.There was also a risk that Rizieq could flee, destroy evidence or breach the restrictions again, Argo added.Rizieqs lawyer, Aziz Yanuar, who is also an FPI official, earlier said that his team would file a motion to seek his release. Reuters was unable to reach the lawyer for comment following the detention decision.The law needs to be upheld. Prominent people need to face the legal consequences if they break the law whatever their role or the support they have from the masses, chief security minister Mahfud MD told Reuters.With a reputation for raiding bars, brothels and violently cracking down on religious minorities, the FPI has gained political influence in the country of 270 million people in recent years.In 2016, Rizieq was the figurehead of a mass movement against Jakartas former Christian governor, who was jailed on blasphemy charges for insulting Islam.Rizieq left the country a year later after facing charges - later dropped - over sending pornographic messages and insulting state ideology.Tens of thousands of his supporters greeted him on his return last month, many of them ignoring social distancing and other coronavirus protocols. A health ministry official said 95 people who gathered at the airport had subsequently tested positive for coronavirus.Indonesias daily death toll hit a high of 175 on Friday. The country has recorded 18,650 deaths since the start of the outbreak, with more than 611,000 infections."}