{"text": "WASHINGTON Democratic senators including vice presidential nominee Kamala Harris on Monday painted President Donald Trumps Supreme Court nominee Amy Coney Barrett as a threat to the Obamacare healthcare law during a deadly pandemic and denounced the Republican drive to approve her before the Nov. 3 U.S. election.As the Senate Judiciary Committee began its four-day confirmation hearing for Barrett, Democrats voiced their opposition even though they have little hope of derailing her nomination in the Republican-led Senate.Republican senators praised Barrett, an appellate court judge and a favorite of religious conservatives, as well qualified for a lifetime job on the high court and a worthy successor to the late liberal Justice Ruth Bader Ginsburg.Barrett wore a black protective face mask and sat at a table with bottles of water, hand sanitizer and disinfectant wipes within reach as senators - some present in the room and some on video links because of COVID-19 concerns - made opening statements. Barrett, who had a bout with the coronavirus earlier in the year, removed her mask when she was sworn in to deliver her own opening statement.I believe Americans of all backgrounds deserve an independent Supreme Court that interprets our Constitution and laws as they are written, Barrett said, with her husband and six of her seven children sitting behind her as she read from prepared remarks that had been made public on Sunday.Barretts confirmation would give the court a 6-3 conservative majority that could roll back abortion rights, expand religious and gun rights, and uphold Republican-backed voting restrictions, among other issues.But it was the fate of the 2010 Affordable Care Act (ACA), Democratic former President Barack Obamas signature domestic policy achievement that has enabled millions of Americans to obtain medical coverage, that was the focus of the Democrats. Barrett has criticized a 2012 Supreme Court ruling authored by conservative Chief Justice John Roberts that upheld Obamacare.Harris, the running mate of Trumps Democratic election opponent Joe Biden, said the hearing should have been postponed because of COVID-19 worries and called the confirmation process so near an election rushed and illegitimate.I do believe this hearing is a clear attempt to jam through a Supreme Court nominee who will take away healthcare from millions of people during a deadly pandemic that has already killed more than 214,000 Americans, Harris said, speaking via a video link.A clear majority of Americans want whomever wins the election to fill this seat, and my Republican colleagues know that. Yet they are deliberately defying the will of the people in their attempt to roll back the rights and protections provided under the Affordable Care Act, Harris said.Republican efforts to repeal Obamacare in Congress have failed.Barrett could be confirmed in time to participate in a case to be argued on Nov. 10 in which Trump and Republican-led states are seeking to invalidate Obamacare. Some legal experts doubt the justices, even with Barrett confirmed, would strike down Obamacare.Democrats displayed posters of patients who could lose their medical coverage if Obamacare is invalidated, with senators recounting their individual stories. Obamacare bars insurance companies from denying coverage to people with pre-existing medical conditions.Barrett will face questioning from senators on Tuesday and Wednesday in a hearing that sets the stage for a full Senate vote by the end of October on confirming her. Republicans have a 53-47 majority so Barretts confirmation seems almost certain.WORLD IS WATCHINGRepublican Senator Ted Cruz said the Democratic focus on healthcare and other policy issues showed they were not contesting Barretts qualifications to serve as a justice.Republican committee Chairman Lindsey Graham implored senators to keep the hearing respectful, saying, Lets remember, the world is watching.This is probably not about persuading each other, unless something really dramatic happens. All Republicans will vote yes and all Democrats will vote no, Graham said.Graham defended the Republicans approach even while acknowledging that four years earlier they had refused to act on Obamas nominee to fill a Supreme Court vacancy because it was an election year. There was nothing unconstitutional about proceeding now, Graham said.Senator Patrick Leahy condemned the mad rush to fill the vacancy, accusing Republicans of trying to turn the courts into an arm of the far right and the Republican Party.Republican Senator Mike Lee personally attended the hearing nine days after revealing he had tested positive for COVID-19.More than 20 people were arrested at the Supreme Court and Senate office buildings amid demonstrations for and against Barrett.Christian conservative activists hope the court will overturn the 1973 Roe v. Wade ruling that legalized abortion nationwide. Barrett is a devout Catholic who has expressed opposition to abortion.Democratic Senator Cory Booker said Senate Republicans have found a nominee in Judge Barrett who they know will do what they couldnt do - subvert the will of the American people and overturn Roe v. Wade.Republicans sought to portray the Democrats as attacking Barrett on religious grounds, though the Democrats steered clear of doing so.Speaking to reporters in Delaware, Biden, who is Catholic, said Barretts Catholic faith should be off limits.This nominee said she wants to get rid of the Affordable Care Act. The president wants to get rid of the Affordable Care Act, Biden said. Lets keep our eye on the ball."}