{"text": "(This August 12, story corrects to remove natural gas in para 8; adds background on fracking in para 10)WASHINGTON By bringing U.S. Senator Kamala Harris onto the ticket, Democratic presidential candidate Joe Biden has signaled support for the enforcement of U.S. anti-pollution laws and for suing companies that pollute, environmental groups said.Biden emphasized Harris environmental credentials when he announced the senator from California as his choice for vice president on Tuesday, noting lawsuits she had launched both as San Franciscos district attorney from 2004 to 2011 and then as the states attorney general until January 2017.As Attorney General, Kamala sued corporations like Chevron and BP for damaging the environment, and won, said a fact sheet detailing Harris experience released by Bidens campaign. The sheet also noted that Harris had sued companies for their alleged roles in exposing Californians to excessive levels of diesel exhaust.Over the last month, Harris has sought to highlight how low-income and minority communities are disproportionately affected by pollution. Last week, Harris co-sponsored legislation with U.S. Representative Alexandria Ocasio-Cortez that would require federal agencies to consider impacts of U.S. environmental legislation on all communities equally, a concept known as environmental justice.Biden also has pledged that his $2 trillion plan for combatting climate change here would support environmental justice by directing clean energy spending toward communities living in the shadow of refineries and power plants.But Harris has gone beyond Bidens climate position in some ways. As a presidential candidate herself last year, she was an early endorser of the progressive Green New Deal, a congressional platform that envisions a 10-year, government-led process for decarbonizing the economy.Her stance on polluter accountability and stopping handouts to the fossil fuel industry are at the top of the list for the climate voter, said Tamara Toles OLaughlin, environmental group 350.orgs director of North America.Harris also said she would ban fracking in the United States - starting with federal lands - on day one of a new administration, making her an early target of President Donald Trump and his re-election campaign team.She is against fracking, Trump said in the White House briefing room on Tuesday. I mean, how do you do that and go into Pennsylvania or Ohio or Oklahoma or the great state of Texas? She is against fracking; fracking is a big deal.The process known as fracking, or hydraulic fracturing, revolutionized the U.S. energy industry, making the country the worlds top oil producer and turning around decades of decline in oil output.U.S. Senator Ted Cruz of Texas and Senator Cory Gardner of Colorado, both Republicans, also blasted Harris on Tuesday for threatening fracking jobs.Every worker who is working on a pipeline or working on an oil field, theyre going to do everything they can to take those jobs away, Cruz said of Biden and Harris.But environmentalists and Democrats praised Harris for her record as a foe to the fossil fuel executives.Senator Harris has a record of taking Big Oil and other polluters to court for the damage they have caused, even proposing giving the Department of Justice enhanced power to prosecute polluters, said Jamal Raad, campaign director of the political action group Evergreen Action.Green campaigners say Harris biggest environmental victory as state attorney general was in 2016, when a grand jury indicted Plains All American Pipeline LP on criminal charges related to an oil spill off the coast of Santa Barbara, California.That same year, Harris also reportedly launched an investigation into whether Exxon Mobil Corp lied to the public and to shareholders about the risks of climate change, though her office has never confirmed the probe. Since then both New York and Massachusetts have made similar arguments in lawsuits filed against the oil company. Exxon prevailed in December in its legal battle with New York over claims it had misled investors about climate change."}