{"text": "California's effort to extradite Harvey Weinstein on rape and sexual assault charges was delayed on Friday, and the convicted former movie producer will have another 30 days to challenge its latest effort to bring him to court.Erie County Court Judge Kenneth Case said prosecutors could arrange for Weinstein's transfer to Los Angeles on May 30.But Weinstein's lawyer Norman Effman said he intended to file a new legal challenge to the extradition, and Weinstein might also ask New York Governor Andrew Cuomo to intervene.Weinstein wore a long-sleeve, button-down brown shirt as he watched the hearing quietly from the maximum security Wende Correctional Facility near Buffalo.He is serving a 23-year prison term following his February 2020 conviction in Manhattan for sexually assaulting a production assistant in 2006, and third-degree rape of an aspiring actress in 2013.Weinstein is appealing his conviction and sentence, and has denied having non-consensual sex with anyone.His conviction was seen as a watershed moment in the #MeToo movement against sexual abuse and harassment by men, including many with powerful jobs and influence.A New York prosecutor, Colleen Curtin Gable, told Case that filing new extradition paperwork might speed up the process because Weinstein's opposition to the earlier paperwork could result in \"extended litigation.\"Gable appeared on behalf of the Los Angeles County District Attorney, who first sought Weinstein's extradition last July.Effman said prosecutors \"have agreed to basically go back to Groundhog Day, and start the process over.\"Weinstein's 11-count indictment in California concerns alleged attacks on five women from 2004 to 2013 in the Los Angeles area.The charges include forcible rape, forcible oral copulation, sexual battery by restraint, and sexual penetration by use of force.If convicted, Weinstein could spend the rest of his life in prison. His lawyers have said they would expect an acquittal.Weinstein, a diabetic, has suffered from cardiac, dental and back problems, and Effman has called him \"almost technically blind.\""}