{"text": "Hedge fund managers on Wednesday recommended buying stocks of companies they believe will benefit from the movement of many services online, even though society is expected to return to more human contact after the global coronavirus pandemic ends.Investors presented ideas ranging from food delivery to  copper mining at the virtual Sohn Investment Conference, which gathers hedge fund managers annually to pitch their top bets and raise money for a charity funding research in pediatric cancer treatments.Andrew Nunneley at Glenernie Capital said he believed German's HelloFresh (HFGG.DE) had a huge opportunity to capture market share with meal-kit delivery companies currently accounting for a mere 1% of the grocery market.\"It's possibly the best business model I've seen in 20 years,\" he told attendees. \"HelloFresh differentiate themselves by owning the whole value chain.\"Ram Parameswaran, founder at Octahedron Capital, pitched Peloton (PTON.O), another subscription fee-based business.\"Our core insight is fitness is undergoing a once in a generation structural shift from offline to online,\" he said.Larry Robbins, chief executive at multi-billion-dollar Glenview Capital Management, said he liked Walgreens Boots Alliance, Inc. (WBA.O) since new CEO Rosalind Brewer took over in March.\"She was on Amazon's board and left Amazon's board, and we know Amazon has interest in pharmacy, and she came to be the CEO of Walgreens,\" he said.\"We are excited to see Walgreens under Ros's leadership,\" he said, adding that the company was trading at 10 times earnings.David Einhorn, who runs Greenlight Capital, on Wednesday advocated for Canadian company Teck Resources (TECKb.TO), a position which he added last year. \"We need lots of copper,\" he said. \"Batteries and electric motors require lots of copper, chargers require several pounds of copper, wind and solar installation need tons of copper.Teck, be said, is poised to benefit with a major copper mine expansion in Chile and the company has five other copper projects in the works."}