{"text": "TOKYO Japans Nissan Motor cut its annual operating loss forecast by 28% on Thursday, albeit to a still record $3.2 billion, helped by a rebound in demand from the coronavirus crisis, particularly in China.The new forecast, which brings it into line with analysts estimates, comes as Nissan pursues a turnaround drive that is reversing the rapid expansion led by ousted Chairman Carlos Ghosn. The company is cutting production and its vehicle line-up by a fifth, and slashing costs by $2.9 billion over three years.We are confident we are on track with restructuring plans, Chief Operating Officer Ashwani Gupta told a briefing. He said global car sales volume in September was on a par with last year.In July-September, Nissans second quarter, it sold 390,000 cars in China, 4% more than the same period last year. The worlds biggest auto market grew by 12.8% in September.Nissans sales fell elsewhere in annual terms, but showed a recovery from the pandemic-ravaged previous quarter, with North America up 35.1% quarter-on-quarter to 300,000 vehicles.That rebound is benefiting other carmakers too, including local competitors Toyota Motor Corp and Honda Motor Co. , which have pushed ahead of Nissan in China and are, for now, also better positioned to tap a North America recovery.AGING LINE UPNissan, Japans third-largest automaker, is striving to recover from the scandal surrounding the ousting of Ghosn on financial misconduct allegations, which he denies.But it has been hobbled by an ageing model line-up as drivers tastes in North America shift to sport-utility vehicles and large pickups.Toyota and Honda last week both more than doubled their full-year operating profit forecasts to 2.47 trillion yen and 420 billion yen respectively.Nissan Chief Executive Makoto Uchida said on Thursday the company had to restore the faith of suppliers and dealers.I am committed to building models that embody Nissan-ness, he said, without elaborating.Nissan, Gupta said, was on track to launch six new models in North America within 20 months, including electric cars and models that feature its latest autonomous driving technology.The company, which has slashed its poorly-performing U.S. fleet business, cut overall inventories by a quarter during the most recent quarter compared with a year earlier, he added.The maker of the Leaf, the worlds first mass-produced electric vehicle, will try to lure consumers in China with nine new models planned over the next five years as demand there increases for mid-sized and large luxury vehicles.Amid the pandemic, Nissan said it was also changing the way it sells cars with a shift to online sales, which now account for around a third of sales in China.ROSIER NUMBERSNissans new prediction for a full-year operating loss of 340 billion yen compares with the 470 billion yen loss it forecast three months ago.For the second quarter, it posted a 4.83 billion yen loss compared with a 30 billion yen profit last year. But that was much less than the 80.6 billion yen loss forecast on average in a Refinitiv poll of five analysts.Nissan is 43% owned by Renault and its second-quarter loss will have a negative impact of 30 million euros ($35 million) on the French carmakers third-quarter net income.Nissan, once viewed as a symbol of Japanese manufacturing prowess, raised its forecast for full-year global vehicles sales to 4.165 million units from 4.13 million units, although that still represents a decline from the previous year.To weather the coronavirus downturn, Nissan said it had issued $8 billion and 2 billion euros in debt, and had a 2 trillion yen credit line with lenders.($1 = 105.2600 yen)($1 = 0.8472 euros)"}