{"text": "If the bets of Thailands farmed cannabis promoters pay off, Thais could soon be chowing down on hempburgers, washed down with cannabis-derived drinks, before freshening up with shower gel and toothpaste infused with a compound from the plant.Far from a pipe dream, a wide range of Thai firms are investing in cannabis, seeking to be first movers in a budding multi-billion dollar industry in Asia after Bangkok legalised use of hemp and cannabidiol (CBD), a compound that doesn't create a 'high', in consumer goods earlier this year.Cosmetics makers, drinks companies and rubber products business are all now investing in developing domestic cannabis farming and products using the plant: importing hemp and derivatives is allowed only for research purposes. Only companies that are majority-owned by Thais can receive licences to use hemp, under government rules. It's a business that analysts at Prohibition Partners could be worth about $660 million in Thailand alone by 2024 - and about $8.5 billion across Asia. With Thailand having moved quicker than regional peers like Malaysia and Singapore - still debating legalisation - enthusiastic executives are embracing the chance to build a position of strength.\"This is a golden opportunity,\" said Tan Passakornnatee, chairman of beverage company Ichitan Group Pcl (ICHI.BK), who has made CBD-infused drinks a centrepiece of his company's strategy.\"Taking top market position will be important for companies because it's rare that a product has, not only national, but global buzz,\" he said, speaking to Reuters this week in an interview.To be sure, companies involved and analysts alike agree the path to profitability could be tricky to navigate. Raw materials will be in short supply since there are only a limited number of growers with licences, while the science of extracting compounds may prove another costly hurdle.\"There will be glitches along the way,\" said Maria Lapiz, head of institutional research at Maybank Kim Eng. \"It will not be smooth and (some) will be anticipating earnings that will not come.\"Still, Lapiz said, if there are opportunities for export, the farm income growth would boost Thailand's economy.SIGNATURE PRODUCT?Thailand has a history of using cannabis in traditional medicine to relieve pain, as well as a condiment, and in 2018 legalised the plant for medical use and research.Hemp is in demand among consumer goods makers because it is widely considered to be a superfood with health benefits, and has higher concentrations of the non-psychoactive compound CBD, now being researched for various medical applications.Beverage maker Ichitan is already launching drinks made with terpene, a government-approved compound that is also found in cannabis, in what it says is a move to gain public recognition for products of this kind ahead of regulatory approval for its CBD drinks, expected this year.In cosmetics, the brand Smooth E, hopes to be the first to have CBD products and expects approval in August.\"We can call it Smooth CBD,\" said chief executive Sangsuk Pithayanukul, speaking in Bangkok, adding there was potential for CBD shower gel, shampoos and toothpaste under his oral care brand Dentiste.\"Every country has a signature product. Thailand's should be cannabis,\" he said.'F1 RACE'Tropical climate, water and tradition makes Thailand suitable for growing cannabis, says Kris Thirakaosal, a former investment banker who now runs Golden Triangle Group.His company has so far invested 120 million baht ($3.92 million) to build a 500 square metre genetics lab and has even developed its own variety of hemp named Raksa, meaning 'to heal'.\"This is an F1 race,\" said Thirakaosal, using the motor racing analogy to emphasise the speed and precision needed to stay ahead.Golden Triangle's chairman, Chatchaval Jiaravanon, is a member of the billionaire family that controls one of the country's largest agro-industrial conglomerates, Charoen Pokphand Group, which also advised Golden Triangle on models for co-op farming.Elsewhere, rubber maker Sri Trang-Agro Pcl (STA.BK) said it expects to grow its first cannabis crop once it has received approval this year, with potential for more than 790 acres of the plant, said Tipwadee Sudwayha, head of investor relations. At an investment of around 100 million baht, she said the cost was not high because the company already owned the land.Some, like plant-based food company NR Instant Produce Pcl (NRF.BK), are choosing to buy existing cannabis operations, rather than start from scratch, counting on the buzz around the use of hemp in food to generate demand.\"It changes the consumer perception when I tell them, 'This is a hempburger',\" said chief executive Dan Pathomvanich.($1 = 30.6200 baht)"}