{"text": "DOHA Afghan government representatives and Taliban insurgents, along with U.S. diplomats and other dignitaries gathered in Doha on Saturday for the start of historic peace talks aimed at ending decades of war that have killed tens of thousands of combatants and civilians in Afghanistan.Here are the highlights, including from speeches at the event:U.S. SECRETARY OF STATE MIKE POMPEO:It took hard work and sacrifice to reach this moment, and it will require hard work and sacrifice to keep it alive, and to take advantage of it so that the talks result in a durable peace.I urge you to engage the representatives of all Afghan communities - including women, ethnic and religious minorities, and the victims of your countrys long war.The choice of your future political system is, of course, yours to make ... The United States does not seek to impose its system on others. We believe firmly that protecting the rights of all Afghans is the best way for you to break the cycle of violence.As you make your decisions, you should keep in mind that your choices and conduct will affect both the size and scope of future U.S. assistance.HEAD OF AFGHANISTANS PEACE COUNCIL ABDULLAH ABDULLAH:We must seize the exceptional opportunity for peace and jointly define a new future that is accepted and supported by all Afghan citizens.We do not have to agree 100% on each of the issues before us. We can come up with different options and intermediate solutions that provide the basis for agreement on the core and central points.We call for a humanitarian ceasefire ... This will enable humanitarian aid and development programs to reach all parts of Afghanistan and benefit our people.TALIBAN POLITICAL CHIEF MULLAH ABDUL GHANI BARADAR:The peace talks process may have difficulties, but our wish is that the talks go ahead with patience and tolerance.We want Afghanistan to be a free, independent, united and developed country, and to have an Islamic system in which all tribes and ethnicities of the country find themselves without any discrimination and live their lives in love and brotherhood.AFGHAN WOMENS RIGHTS ACTIVIST MARIAM ATAYEEI really wonder whether the Taliban have changed or not. in the Taliban negotiating team that there is not a single woman to be heard, which means that the Taliban do not believe in the participation of women and the position of women in all processes. This creates concerns for Afghan women.PAKISTAN FOREIGN MINISTER MAKHDOOM SHAH MAHMOOD QURESHI:A long night is ending. A new dawn is upon us. This journey has not been easy. There have been obstacles and setbacks; moments of doubt and despair. Yet, progress has been made, and preserved ... This success belongs, first and foremost, to the Afghans.NATO SECRETARY GENERAL JENS STOLTENBERG:After decades of conflict, these talks are the best chance of peace. We have to embrace them wholeheartedly and keep in mind the ultimate goal: to end the violence ... A peaceful and stable Afghanistan is in everybodys interest.NATO is committed to training and funding Afghan security forces to help safeguard the Afghan people.UNITED NATIONS SECRETARY GENERAL ANTONIO GUTERRES:An inclusive peace process in which women, youth and victims of conflict are meaningfully represented offers the best hope of a sustainable solution.Women must be allowed to participate in a variety of roles and that the peace process reflects the experience & expertise of Afghan women in all their diversity.It is my hope that progress towards peace can lead to the return of millions of Afghans displaced internally and across borders to their homes.CHINA STATE COUNCILLOR AND FOREIGN MINISTER WANG YI:Cessation of violence and durable peace is the strongest wish of over 37 million Afghan people and the shared expectation of the regional countries and the international community.TURKEYS FOREIGN MINISTER MEVLUT CAVUSOGLU:A humanitarian ceasefire must be the priority at the beginning. Fighting and talking cannot go together.Afghanistan will need the international communitys support more than ever ... We are ready to contribute to this process in every possible way including hosting one round of the talks.INDIA EXTERNAL AFFAIRS MINISTER SUBRAHMANYAM JAISHANKAR:Any peace process must be Afghan-led, Afghan-owned and Afghan-controlled ... The interests of the minorities, women and the vulnerable must be ensured.The rising levels of violence cannot be allowed to continue, and like others we support an immediate comprehensive ceasefire.SPAIN FOREIGN AFFAIRS MINISTER ARANCHA GONZALEZ:We call on the Taliban to ensure a ceasefire and a reduction of violence.We stress the importance of inclusive negotiations - all stakeholders are to be heard and allowed to contribute. The distinctive role of women and girls is essential for the future of Afghanistan.EUROPEAN UNION TOP DIPLOMAT JOSEP BORRELL:We urge the parties to accompany the start of the peace talks with an immediate, comprehensive, nationwide and unconditional ceasefire. With this new chapter opening, a mere reduction of violence is no longer enough.The talks must preserve & build on the political, economic and social achievements of the citizens of Afghanistan since 2001, especially on womens rights."}