{"text": "YUZAWA, Japan Yoshihide Suga, used to suits, a lectern and the trappings of the Japanese government, now finds himself on hip hop T-shirts and bags in his hometown, where the locals are celebrating the man expected to become prime minister in a few days.Designer Ippei Fujita and Suga, Japans chief cabinet secretary, both hail from the rural city of Yuzawa in northern Japan. The prospect of Suga completing the rise from humble beginnings to the nations highest office is a source of pride for local townsfolk.Suga, 71, is widely expected to win the ruling Liberal Democratic Partys leadership race on Monday and become premier thanks to the partys majority in the lower house of parliament.I heard the news he might become prime minister and then it became a high possibility, Fujita told Reuters at his store Marble in central Yuzawa. I thought Yuzawa would also attract attention. Suga is from Yuzawa - me too. And together I wanted to get people excited.Many Japanese leaders have come from prominent political families, including outgoing Prime Minister Shinzo Abe, who is stepping down because of health problems.By contrast, Suga grew up in the Yuzawa farming community of Akinomiya in Akita prefecture, before moving to Tokyo after high school, where he worked part-time to pay for university.A tote bag Fujita designed reads in English, SUGA Represent Akinomiya, Yuzawa, JAPAN. The hip hop design-inspired T-shirts read, SUGA YOSHIHIDE REP AKITA YUZAWA.Im doing hip hop activities and I wanted to bring out the hip hop style. Like in a flyer for a hip hop event, or the cover of a magazine, those kind of designs, Fujita said.He said the merchandise would go on sale on Wednesday, the day Suga is expected to become prime minister, with prices ranging from 3,900 yen ($36) for the T-shirts to 1,200 yen for the smallest bag.Japans love of cuteness also played a factor in some designs.The chief cabinet secretary isnt cute, but when I created these products I thought cute would probably sell better, he said with a laugh.($1 = 106.1400 yen)"}