{"text": "A boom will follow Covid-19s baby bust. The factors behind birth-rate declines in rich countries are likely to ease as vaccination drives ramp up and lockdowns give way to partying. Companies including Reckitt (RKT.L), Nestl (NESN.S) and Procter & Gamble (PG.N) stand to benefit from the return to getting it on.Being stuck at home gave couples ample opportunity for amorous congress and conception. But across advanced economies with access to contraception, twosomes delayed having children amid the uncertainty caused by the pandemic. Nine months after its first lockdown began, France recorded a 13% annual decline in the number of new babies. In Italy and Spain birth rates fell by around a fifth. The Brookings Institution estimates 300,000 fewer American newborns this year.Some couples  especially in countries like Japan where few babies are made outside marriage  wanted to wait until after a wedding. Others baby-making plans were iced because fertility treatments were less available as hospitals grappled with the virus.The 2008 financial crisis also caused a sharp decline in birth rates. They kept falling because the economic malaise dragged on for years, unlike the sharp recovery the International Monetary Fund is predicting this time, with global GDP expected to surge 6% this year. Other factors behind this drop are also more temporary, suggesting the patter of tiny feet may return sooner.Depending on the speed of vaccination efforts, rich-nation economies should rebound rapidly. Weddings will return and a revived dating scene will increase the chances of finding procreative partners. And fertility clinics will be back to normal business as infections decrease.Consumer goods giants plan to reap the rewards. Around a fifth of Reckitts sales come from infant and child nutrition. The $65 billion group led by Laxman Narasimhan will also score from increased socialising driving Durex condom sales. Sales of $340 billion Nestls infant formula outside China still rose last year and will enjoy a further boost when birth rates recover. Huggies diapers producer Kimberly-Clark (KMB.N) and Pampers maker P&G can also look forward to the proverbial storks return to the skies.In the meantime, these groups will invest in pricier premium products to offset lower quantities sold. After all, families are least likely to economise on their children and pets, even when budgets are stretched. As consumers get their grooves back, they can rely on a baby bump to the bottom line.On Twitter https://twitter.com/dasha_reutersCONTEXT NEWS- Births in Italy in December, nine months after the country went into Europes first lockdown, fell by 22% compared to the previous year, according to figures from a sample of 15 Italian cities by statistics agency ISTAT. In Spain, 20% fewer babies were born in December. Brookings Institution researchers in December predicted that there will be 300,000 fewer births in the United States in 2021.- For previous columns by the author, Reuters customers can click on"}