{"text": "Bill Reith felt the blast of February's freak cold snap in Texas almost immediately - from inside his office in northern Indiana.As head of the largest recreational vehicle division of REV Group Inc (REVG.N), a Milwaukee-based producer of specialty vehicles, he watched helplessly as the power grid in Texas buckled under some of the coldest temperatures seen in the state in decades, hobbling shipments of a mundane, but vital, commodity used in every one of his company's RVs: foam.Petrochemical plants of all types shut down in Texas because of the power cuts, including the only five in North America that produce propylene oxide - a critical raw material for the foam that goes into seat cushions and other RV components.The disruptions are expected to linger into May and are slowing and even halting operations for U.S. manufacturers.Chemical plants in Texas were shut for a few days, but it will take weeks to get them fully functional again as workers fix burst pipes and clean materials from clogged equipment. And that delay is being felt in the wider U.S. economy.Automakers Toyota Motor Corp (7203.T) and Honda Motor Co Ltd(7267.T) have cited shortages of plastic components and petrochemicals - as well as semiconductors - for recent North American production shutdowns, while the Container Store Group Inc (TCS.N), which sells many plastic products, has warned the shortages could hit its profit margins.RV producers have also highlighted the challenge.\"It hasn't created enough disruption to stop production, but it has caused delays,\" said Bob Martin, chief executive of Thor Industries Inc (THO.N). On a visit to the Elkhart, Indiana-based company's newly acquired operation in Alabama last week, Martin said he saw 100 motor homes that couldn't be shipped because workers were still waiting for the arrival of the plush driver chairs that needed to be installed.He expects, however, that the delays will ease in the coming weeks. \"By later this spring, we'll be in good shape,\" Martin said.The Texas shutdowns swiftly pushed up prices for some key raw materials just as markets and Federal Reserve policymakers were refocusing their attention on inflation amid widespread supply chain disruptions that have nothing to do with weather in the Lone Star State.NEWEST HURDLEManufacturers in recent years have sought to limit the stock of materials they keep on hand, part of the push to the \"just-in-time\" strategy that is meant to make the production system more efficient. One upshot of that is that when a storm or other sudden disruption hits, there's little opportunity to grab buffer stocks.\"It was almost instantaneous,\" said Reith, of the impact of the freeze on supplies and prices. \"Plants shut down, they announced force majeure, and everyone was put on allocation,\" describing the legal move producers take when they can't deliver on contracts and start limiting shipments.Reith said he was only getting half the furniture he needed for three weeks after the Texas disruptions and is only receiving about 80% now. Reith said he's also seeing shortages on the foam used to insulate walls and doors on RVs.His division - REV Recreation Group - hasn't curbed production yet, but instead has been pushing RVs through its factories and waiting to install furniture at the last step. It takes about six to eight weeks for an RV to be built in Reith's factories, depending on the size and complexity of the vehicle.\"What we're doing is continuing to build, so when furniture arrives, we're installing it at the end of the process,\" he said, adding that the production crunch would come later this month if supplies don't quickly recover.Finding enough fiberglass is also a problem. The product, which REV Recreation Group uses to mold the nose cones and rear ends of its motorhomes, was in short supply even before the Texas cold blast. \"This just exacerbated it,\" Reith said.So far, prices of that material have gone up nearly 15% as a result of the Texas storm.The shortfalls come at a tough time for the RV industry, which employs nearly 94,000 workers in the United States in its network of manufacturers and suppliers, and was already stretched thin by the coronavirus pandemic.Over the past year, RV manufacturers have struggled to produce enough vehicles as stuck-at-home Americans sought ways to travel without having to enter hotels and other public accommodations. The industry is still predicting record sales this year despite the latest supply disruptions. Foam shortages are just a new hurdle.RV manufacturers don't report how much product is sitting outside factories waiting for foam or other missing parts. But the build-up is visible as parking lots around factories quickly fill up.Jason Lippert, chief executive of LCI Industries (LCII.N), the industry's largest parts supplier, said his Elkhart, Indiana-based company is scrambling to find substitutes for hard-to-get materials. Lippert has sharply increased imports of RV furniture, for instance.And in some cases, LCI has shifted to using different materials. Lippert said the company has at times substituted woven fiber for foam in the 4,000 mattresses it makes each day.The other response, he said, is to raise prices. \"Everybody is doing it,\" Lippert said, \"all through the supply chain.\""}