{"text": "HSBC (HSBA.L) has banned customers of its online share-trading platform from buying or moving into their accounts MicroStrategy Inc (MSTR.O) stock, a message seen by Reuters showed, calling it a \"virtual currency product\".The bank will not facilitate the buying or exchange of products related to or referencing the performance of virtual currencies, the message to an HSBC InvestDirect client said. Bitcoin is the largest and best-known virtual currency.MicroStrategy declined to comment. The U.S. business software firm is led by bitcoin proponent Michael Saylor and owns bitcoin worth billions of dollars.While HSBC will allow the holding, sale and outgoing transfer of MicroStrategy shares, it will forbid new purchases or incoming transfers, said the message dated March 29.\"HSBC has no appetite for direct exposure to virtual currencies and limited appetite to facilitate products or securities that derive their value from VCs (virtual currencies),\" HSBC said in a statement.HSBC InvestDirect is available to customers in countries including Canada and Britain.The bank said its policy towards cryptocurrencies had been in place since 2018 and is kept under review. It could not immediately say which countries the ban applied to.The move comes amid a growing embrace of cryptocurrencies by large financial firms, companies and investors seeking yield in a world of ultra-low interest rates.Goldman Sachs Group Inc (GS.N) said last month it would offer investments in bitcoin and other digital assets to its wealth management clients. Morgan Stanley (MS.N) has also started offering clients investments to the emerging asset class.  read more MicroStrategy has along with Tesla Inc (TSLA.O) and payments firm Square Inc (SQ.N) become one of several publicly listed U.S. companies to buy large amounts of bitcoin for its treasury.MicroStrategy said last week it owns around 91,579 bitcoins. Its holdings, worth around $5.5 billion according to a Reuters calculation, are equal to around 80% of its $6.8 billion market capitalisation. "}