{"text": "SEOUL Hyundai Motor Co is set to triple the number of recalled Kona electric cars over battery cell fire risks with plans to recall around 51,000 vehicles in North America, Europe, China and other markets, Yonhap news agency reported on Sunday.The recalls would come after the South Korean automaker announced last week a voluntary recall plan for 25,564 Kona EVs at home starting Oct. 16.Hyundai said in a statement on Monday it is in the final stages of filing a voluntary recall notice with the NHTSA (National Highway Traffic Safety Administration) for U.S. Kona EVs and will start the process of informing owners of these vehicles.Hyundai will recall 37,366 vehicles and 11,137 vehicles in Europe and North America, respectively, according to Yonhap.The Hyundai statement did not mention the other markets, the total number of additional electric vehicles (EVs) it intends to recall or the dates of the recalls.South Koreas transport ministry said last week Hyundai will voluntarily recall its Kona EVs as a possible short circuit due to what may be faulty manufacturing of its high-voltage battery cells could pose a fire risk.LG Chem Ltd, which supplies batteries for Kona EVs, said last week faulty battery cells were not the cause of fires in Kona EVs, and the exact cause had not been determined.It said a re-enactment experiment conducted jointly with Hyundai had not led to a fire, so the fires could not be attributed to faulty battery cells. LG Chem declined on Monday to comment beyond what it said last week.Recalled Kona EVs in South Korea will undergo software updates for all affected models and battery replacements of select models after inspections.KB Investment& Securities said in a report on Monday it could cost Hyundai as much as 600 billion won ($522.10 million) if they offer battery replacements for the nearly 77,000 affected vehicles identified worldwide so far.Shares of Hyundai Motor and LG Chem fell 0.8% and 2.0%, respectively, on Monday while the broader KOSPI market was up 0.3% as of 0430 GMT."}