{"text": "Ice on the Tanana River in the Alaska community of Nenana melted enough on Friday to send a wooden tripod adrift, tripping an alarm and adding another valuable data point to a century-old record of climate change in America's far north.The ice broke up at 12:50 p.m. Alaska Standard Time, and those who correctly guessed the frozen river's precise moment of thaw this year in the famous Nenana Ice Classic betting pool will split a $233,591 jackpot, officials announced.It is expected to take about a week to sort through the ticket stubs of all the bets that were placed to determine who won, a spokeswoman for the event said.The April 30 breakup was typical for recent years, but it would have been considered an early melt prior to the 1980s, said Rick Thoman of the Alaska Center for Climate Assessment and Policy at the University of Alaska at Fairbanks.The quirky Nenana tradition started in 1906 as a private wager among Alaska Railroad engineers. It became a public betting pool in 1917. It is now considered an important part of the Alaska climate record showing a long-term trend of spring river melt.It is valuable to scientists \"because it's been done in the same weird way that no one would ever design today,\" Thoman said. For a century, the tripod has been set in exactly the same spot, and Nenana, a town of a few-hundred residents some 55 miles (89 km )southwest of Fairbanks, has remained about the same size, he added.\"It's as close to a clean climate record as we could have, even though we would have never designed that particular system,\" he said.The earliest ice breakup on record was in 2019, when the tripod set off an old-fashioned siren alarm in town on April 14. The latest Nenana Ice Classic breakups occurred on May 20 in 1964 and 2013.In early decades, typical melt dates fell between May 6 and May 11. In recent years, April melt-outs have been common, and nine of the 10 earliest ice breakups have occurred since 1990, according to Nenana Ice Classic records."}