{"text": "NEW DELHI After his 92-year-old grandmother started coughing and her blood oxygen levels plummeted, Varunn Kaushik took her to two top private hospitals in New Delhi on Monday. Neither took her in, even after one of them found her positive for COVID-19.Kaushik said several other hospitals told him and his family on the phone that they did have free beds, but not in the intensive care units (ICU) his grandmother needed. He finally admitted her to a non-ICU COVID bed in a government hospital, 10 hours after leaving home.Her condition was stable as of Thursday, according to Kaushik.The familys ordeal is a warning sign for a city where infections are surging even though they are dropping elsewhere in the country.Delhis 20 million residents celebrate their biggest festival, Deepavali or Diwali, this weekend. Despite a ban, thousands of fireworks are likely to be set off, increasing already bad air pollution and raising the risk posed by COVID-19.The capital reported 8,593 new COVID-19 infections on Wednesday, its highest daily tally yet. The average pollution reading was 299 on Thursday on a scale of 500, where any number above 300 is classified as very poor and can cause respiratory illnesses.ICU facilities in the city are in such short supply that some hospitals are squeezing more beds into existing wards ahead of the weekend.We are firefighting because Diwali is looking like a super spreader event in front of us and the public just doesnt see the threat, said a senior health department official in Delhi, declining to be named.New Delhis sprawling bazaars have been swarming with shoppers ahead of Diwali and the wedding season after the government relaxed regulations in a bid to breathe life into the lockdown-hit economy. Mask-wearing is common but social distancing is not, and infections may spike in coming days.The city was one of the first in the country to restart economic activity after the lockdown that started in March, letting restaurants, malls and other businesses restart to avoid spiralling joblessness.MORE BEDSIndia has so far reported around 8.6 million coronavirus infections - the worlds second highest after the United States - and 127,571 deaths. But overall, it has been adding fewer cases daily since a mid-September peak, and its fatality figure of 92 per million people is well below the worlds tally of 160 and the United States 711.Still, the state-run Indian Council of Medical Research says the recent fall in cases nationally could be undone if there is a resurgence in infections around Diwali.Federal authorities have asked the local government in the capital to prepare resources to handle as many as 15,000 cases a day and test more aggressively.Over half of the citys 16,511 COVID hospital beds were occupied as of Wednesday, government data showed, with more than 24,000 other patients isolating at home. There is no separate data for ICU beds.Delhis government said hundreds of more beds have been reserved for COVID-19 patients in nearly two dozen private and government hospitals. More than 100 ICU beds are also being added in government setups.Most of the cases are coming from working class people, those aged between 20 and 50, those who are very active, Delhi Health Minister Satyendar Jain told Reuters partner ANI, indicating these victims may not need critical care.He did not respond to e-mailed questions from Reuters.All ICU beds at Sir Ganga Ram Hospital, one of the top private hospitals in the city, are now occupied, said Dhiren Gupta, a senior pulmonologist.In government-run Ram Manohar Lohia Hospital, doctors have packed beds into ICU wards to the closest permissible limit.We have increased the number of beds but there are limitations of distancing and ventilation, said Desh Deepak, a senior pulmonologist. Were operating at almost full capacity in ICUs.The experience of Kaushiks grandmother has left him worried about himself and the rest of his family, as they wait to get tested for the coronavirus themselves.God forbid, if anyone else needs hospitalisation ... what would happen two days down the line? he said. That is even more scary."}