{"text": "LONDON Oil demand is already outstripping supply and the shortfall is expected to widen even if Iran boosts exports as vaccinations against COVID-19 bolster the global economy, the International Energy Agency (IEA) said on Wednesday.\"The anticipated supply growth through the rest of this year comes nowhere close to matching our forecast for significantly stronger demand beyond the second quarter,\" the IEA said in its monthly report, citing increased pumping from OPEC+ countries. (Graphic: Call on OPEC+ crude vs. production, ) (Graphic: Global oil supply, )https://fingfx.thomsonreuters.com/gfx/mkt/jbyvryqddpe/OPECcrudecall.PNGhttps://fingfx.thomsonreuters.com/gfx/mkt/xlbvgaldxvq/globaloilsupplies.PNGOutput from the Organization of the Petroleum Exporting Countries (OPEC) and allies including Russia, the so-called OPEC+ group of producers, lagged demand by around by 150,000 barrels per day (bpd) in the second quarter, IEA said.That shortfall is expected to widen to a 2.5 million bpd by years end, the Paris-based watchdog said.OPEC+ producers have been curbing output since 2017 but have eased since imposing record high cuts last year, with more easing agreed from this month.The widening supply and demand gap paves the way for a further easing of OPEC+ supply cuts or even sharper stock draws, the IEA said, noting that storage of oil had ebbed to nearly the five-year-average after soaring amid the pandemic.Getting inventories back down to the five-year average was, along with supporting prices, one of the aims of the OPEC+ cuts to begin with.Irans possible full reentry into the oil market, if indirect U.S.-Iranian nuclear talks succeed, would still leave production from OPEC+ producers at 1.7 million bpd short of demand, it added.Supply recovery outside OPEC+ was recovering more slowly than the IEA expected as the virus delayed projects in Brazil and the Gulf of Mexico and hampered maintenance in Canada.While new waves of infections in Brazil and Thailand and even India - the worlds third-largest consumer suffering record-breaking cases - were not enough to derail the trend but could continue to affect the market, it added.\"India's COVID crisis is a reminder that the outlook for oil demand is mired in uncertainty. Until the pandemic is brought under control, market volatility is likely to persist.\" (Graphic: Oil supply response, )https://fingfx.thomsonreuters.com/gfx/mkt/rlgvdyoezpo/oilsupplyresponsea.PNG"}