{"text": "TOKYO Japanese nurse Arisa Tsubata has trained around her work shifts for over a year to prepare for a final Olympic boxing qualifier in the hope of making it to the Tokyo Games this summer.That dream was shattered after the International Olympic Committee (IOC) cancelled the boxing qualifier due to take place in June and said it would allocate spots to athletes based on their world rankings in recent years.The change in criteria has effectively shut the door on many Olympic hopefuls such as Tsubata, whose rankings are not good enough to earn them an automatic qualification for the Olympic Games in Tokyo. Other qualifying competitions for the Olympics have also been cancelled.(Open reut.rs/3faWtf1 in an external browser to see a picture story on the Japanese boxing nurse)In order to focus on her boxing, the 27-year old quit her job at a major hospital in January to take on a less demanding and lower paid position at a smaller psychiatric clinic.Since then, she has trained over three hours a day during the week and extra hours on Saturdays, only taking Sundays off to rest or to get a massage.Its very disappointing, said Tsubata, who currently works at the Life Support Clinic in Tokyo. I had been working so hard for a year after the postponement of the Olympics, and its so frustrating that I dont even have the right to compete.Japan has said the Olympic Games, delayed in 2020 due to COVID-19, will go ahead but questions remain over how it will hold the massive sporting event mid-pandemic. The country is currently fighting a fourth wave of coronavirus infections.Why did I aim for the Olympics when the coronavirus happened? I asked myself, she said, also wondering who knew the coronavirus pandemic would come at this time?Her feeling of frustration and uncertainty is shared by many athletes globally whose careers have been thrown into limbo, after the pandemic dashed some peoples life-long dreams of participating in the global sporting event.The IOC has a June 29 deadline to wrap up qualifications for this years Olympics and with the cancelled qualifiers, it now has to allocate about 53 spots in boxing across several regions based on ranking points since 2017.In COVID-ravaged India, the head coach of the countrys national boxing team Santiago Nieva also remembers the heartbreaking moment when he delivered the news to four boxers.You feel like youre taking away their dreams, Nieva said. They became depressed.... they were empty, felt empty in the head and body.MIXED FEELINGSTsubata got into boxing about three years ago to lose weight, but her training coaches quickly encouraged her to compete in the sport and she went on to win Japans national boxing championship for the middleweight division in 2019.As a nurse and a boxer, she has mixed feelings about whether the Olympics due to start in July should go ahead as cases rise.As an athlete, considering fellow athletes waiting for this moment, and especially seeing my chance being taken away, I think the Olympics should happen, she said.But, as a nurse, she said it might be difficult for Japan to hold the Olympic Games if the spread of the coronavirus is not contained.For now, Tsubata is trying to stay positive, and is preparing for her international debut at a tournament in Russia this month.She says it is too early to think about the Olympic Games in Paris in 2024 and worries she may be too old by then to keep up with the physical strength needed to compete.I cant say I am aiming for the next Olympics in Paris, but what I can do is try to keep working hard step by step, at any competitions ahead, small or big, Tsubata said."}