{"text": "WASHINGTON The U.S. militarys Joint Chiefs of Staff, the uniformed leaders of the military branches, on Tuesday put out a rare message to service members saying the violent riots last week were an assault on Americas constitutional process and against the law.The joint message broke nearly a week of silence by the military leaders after the assault on the Capitol by supporters of President Donald Trump sent lawmakers into hiding and left five people dead.While a number of Trumps cabinet members including acting Defense Secretary Chris Miller condemned the storming, the top U.S. general, Chairman of the Joint Chiefs of Staff General Mark Milley, was silent until now.The violent riot in Washington D.C. on January 6, 2021 was a direct assault on the U.S. Congress, the Capitol building, and our Constitutional process, the seven generals and one admiral said in an internal memo to troops, adding that the military remained committed to protecting and defending the Constitution.The rights of freedom of speech and assembly do not give anyone the right to resort to violence, sedition and insurrection, the memo, seen by Reuters, said.The military leaders said that President-elect Joe Biden would be inaugurated on Jan. 20 and become their commander in chief.Any act to disrupt the Constitutional process is not only against our traditions, values, and oath; it is against the law.U.S. officials said Milley had not commented on last weeks events because he wanted to stay out of politics.The silence was in sharp contrast to June, when Milley made a controversial walk to a church with Trump after law enforcement officers backed by National Guard troops used tear-inducing chemicals and rubber bullets to clear the area of peaceful protesters.Some service members have privately expressed concern that senior leaders did not provide direction in the aftermath of the attack on American democracy on Wednesday.On Twitter, the head of U.S. forces in South Korea said that what happened occurred in Washington D.C. on Wednesday was an attempted insurrection.If you are serving in uniform and think it was something else, I would encourage (you) to sit down and read the constitution that you swore an oath to support and defend, General Robert Abrams said.There has also been a renewed focus on extremism within the U.S. military after the Capitol storming.The Army told Reuters on Tuesday that it was working with the FBI to see if any attackers were current service members and with the Secret Service to see if any of the nearly 10,000 National Guard troops securing Bidens inauguration would need additional screening."}