{"text": "A Japanese-Australian venture has begun producing hydrogen from brown coal in a A$500 million ($390 million) pilot project that aims to show liquefied hydrogen can be produced commercially and exported safely overseas.The plan is to create the first international supply chain for liquefied hydrogen and the next big step will be to ship a cargo on the world's first liquefied hydrogen carrier.\"We have the potential here to be world leaders in the production and export of hydrogen and this project is developing up that technology to do exactly that,\" Australian Energy Minister Angus Taylor told Reuters on the sidelines of a ceremony marking the event.Australia, already dominant in global liquefied natural gas (LNG) trade, is hoping liquefied hydrogen will give it a greener market for its coal and gas.Run by Kawasaki Heavy Industries (7012.T) and located in the state of Victoria, home to a quarter of the world's known brown coal reserves, the project is key to helping Japan meet its target of net zero carbon emissions by 2050.The world's fifth-largest energy consumer aims to boost its annual hydrogen demand tenfold to 20 million tonnes by 2050, equivalent to about 40% of its current power generation.Brown coal is considered the lowest rank of coal due to its relatively low energy content and has fuelled some of Australia's dirtiest power stations, some of which have already shut or are slated for closure. \"The important thing is hydrogen should be cost competitive, and Victorian brown coal is a cheap source of hydrogen,\" said Hirofumi Kawazoe, general manager of Kawasaki's Hydrogen Engineering Australia unit.The project is producing hydrogen by reacting coal with oxygen and steam under high heat and pressure in a process that also yields carbon dioxide and other gases. If the project goes commercial, the carbon dioxide would be buried off the coast of Victoria. The Australian and Victoria state governments are running a parallel project to test transporting and injecting carbon dioxide under the seabed.Studies show hydrogen produced from coal with carbon capture and storage is half to one-third the cost of producing green hydrogen, said Jeremy Stone, a J-Power (9513.T) director on the project.Green hydrogen is produced using wind and solar power to split water and unlike hydrogen produced from coal is dependent on the weather.Groups campaigning to end the use of brown coal say, however, that the project is a waste of money.\"The technology will be superseded in the next few years by clean hydrogen sourced from renewable energy. Any investment in coal-to-hydrogen infrastructure will quickly become a white elephant,\" said Environment Victoria campaigns manager Nicholas Aberle.The hydrogen produced in the 70 kilograms a day demonstration plant will be transported by trailer to a port site where it will be liquefied for export.The first cargo to Japan has been delayed to the second half of this year due to COVID-19 restrictions which have slowed final checks on the tanker.  read more Partners in the project include Iwatani Corp (8088.T), Marubeni Corp (8002.T), Sumitomo Corp (8053.T) and AGL Energy Ltd (AGL.AX), whose mine is supplying the brown coal.($1 = 1.2922 Australian dollars)"}