{"text": "BENGALURU Indian shares tumbled more than 3% and the rupee hit an eight-month low on Monday as a relentless surge in COVID-19 cases and a possible lockdown by a large state threatened to derail a recovery in Asias third-largest economy.India reported another record daily surge in coronavirus infections and overtook Brazil to be the second worst-hit country by the health crisis on Monday.The state of Maharashtra, home to the countrys financial capital, Mumbai, is considering a lockdown and could take a final decision this week, a senior government official said.The NSE Nifty 50 index closed 3.53% lower at 14,310.80, while the S&P BSE Sensex ended down 3.44% at 47,883.38. The Nifty 50 has now retreated about 7% and the Sensex is down 9% from their mid-February record highs.The rupee weakened to a more than eight-month low of 75.1375 against the dollar.Reliance and HDFC Bank closed Mondays session more than 3% lower and were the biggest two drags on the Nifty 50.The Nifty PSU bank index, which plunged the most among sub-indexes, closed down 9.26%, its worst day in more than a year.The Nifty auto index closed down 5.11%. The Society of Indian Automobile Manufacturers on Monday warned that the pandemic had set back an already bruised auto industry by many years.Pharma stocks saw limited losses. The Nifty Pharma index closed down 0.26%, compared with the 1.96% to 9.26% losses for the other sub-indexes.Dr Reddys shares jumped 7.56% in the last few minutes of trade after India approved the use of Russias Sputnik V COVID-19 vaccine. Sputnik V is being marketed in India by Dr. Reddys.Market participants awaited the start of another corporate earnings season. The countrys largest software exporter, Tata Consultancy Services, closed down 2.28% ahead of its March-quarter results later in the day.Investors also watched out for data on the countrys retail inflation for March scheduled later in the day. A Reuters poll of economists predicted that the reading likely edged up to a four-month high in March."}