{"text": "Indias Foreign Minister Subrahmanyam Jaishankar said on Tuesday that trust with China had been deeply impaired after last summers border clash which resulted in the first combat deaths in 45 years.Ties with the United States, on the other hand, were converging and were likely to expand under the new administration in Washington, Indias top diplomat told the Reuters Next conference.Tensions with China erupted in June, when 20 Indian soldiers were killed in brutal hand-to-hand fighting, while China suffered an unspecified number of casualties in the clash on a disputed section of the border in the western Himalayas.Both sides have deployed heavily in the contested area, and the escalation poses the most serious military crisis between the nuclear-armed neighbours for decades.After 45 years, youve actually had bloodshed on the border. And thats had a huge impact on public opinion and politically. ...really the impact of trust and confidence in India where China and their relationship is concerned. That has been profoundly disturbed, Jaishankar said.The two countries fought a border war in 1962, but until last summer they had largely kept a lid on tensions along the Line of Actual Control, the de facto border, while expanding commercial ties.Now last year, for reasons which are not clear to us, the Chinese really brought an enormous military force to one part of the border. And then at the Line of Actual Control, obviously we moved up when we saw them coming and that has sort of created, friction points along the Line of Actual Control, Jaishankar said.Several rounds of military and diplomatic negotiations have taken place but there has been no pullback of forces from the frontline. India expects the talks to lead to an amicable solution, the Indian army chief Manoj Mukund Narvane said on Tuesday.TIES WITH US ON UPSWINGJaishankar said relations with the United States were on the upswing and he was confident about its direction under the incoming Biden administration.When I look at many of the challenges we face, the U.S. is going to be much more open looking for partners and Im confident about where we are going with the relationship.India has built close defence ties with Washington, buying more than $20 billion of weapons over the last 15 years, as it diversifies away from traditional supplier Russia.Together with U.S. allies Japan and Australia, it has participated in naval exercises in the Indian Ocean which security analysts say is part of attempts to balance Chinas assertive actions in the region.Structurally the relationship with the U.S. is very very sound, it has very unique elements, there is political convergence, growing security and defence convergence, Jaishankar said.On trade though, the two countries got bogged down in details and lost the wood for the trees, he said. Negotiators have been working toward a mini trade pact for months without making headway.Jaishankar said India would respond positively to any offer or invitation from the Biden administration to restart some kind of free-trade talks.For more coverage from the Reuters Next conference please click hereTo watch Reuters Next live, visit here"}