{"text": "NEW DELHI Indias Enforcement Directorate has recently asked Amazon.com Inc for information related to its operations in the country, as the agency continues to investigate the U.S. e-commerce giant, a senior agency source told Reuters on Friday.Last month, the source at the countrys federal financial-crime fighting agency said the Directorate will examine the findings in a recent Reuters special report which revealed the company has for years given preferential treatment to a small group of sellers on its India platform and used them to circumvent the countrys foreign investment rules.Amazon has for several years been under investigation by the agency for possible violation of foreign investment rules. Such probes typically take years in India, and in most cases details are not made public.The Reuters special report was based on internal Amazon documents dated between 2012 and 2019. It provided an inside look at the cat-and-mouse game Amazon has played with India's government, adjusting its corporate structures each time the government imposed new restrictions aimed at protecting small traders. To read the special report click reut.rs/2OCOT2WOn Friday, the senior Enforcement Directorate source told Reuters obviously we have sought information from Amazon.Asked if the agency had sought documents from the company, the source said: information means information and documents.The source declined to comment further on what type of documents had been sought, or if any company executive had been summoned for questioning.An Amazon spokeswoman in India declined to comment.In the Reuters report published last month, Amazon said it was confident of its compliance with Indian law. It added that it does not give preferential treatment to any seller on its marketplace, and that it treats all sellers in a fair, transparent, and non-discriminatory manner.Indian retailers, which are a crucial part of Prime Minister Narendra Modis support base, have long alleged that e-commerce giants like Amazon and Walmarts Flipkart flout federal regulations and that their business practices hurt small traders. The companies deny the allegations.The documents reviewed by Reuters showed that Amazon helped a small number of sellers prosper on its India platform, giving them discounted fees and helping one cut special deals with big tech manufacturers such as Apple Inc.The company has also exercised significant control over the inventory of some of the biggest sellers on Amazon.in, the documents showed, even though it says publicly that all sellers operate independently on its platform."}