{"text": "NEW DELHI Indias new oversight of digital news platforms is drawing protest from the media industry and activists who fear the rules will curb press freedom in the worlds largest democracy.India, which has one of the worlds biggest and most diverse media industries, last month announced the Intermediary Guidelines and Digital Media Ethics Code, aimed at pushing Big Tech firms such as Facebook to comply with content takedown orders. However, it also extends to news websites.The rules impose a three-tier regulatory mechanism, requiring a grievance officer to resolve complaints and a government panel to have broad oversight. The most senior government official in the information and broadcasting ministry will also have emergency powers to order content be blocked.Media executives fear such oversight could lead to censorship of content seen as critical of the government, and three digital news outlets have approached state courts.These...rules will signify the death of media independence in India, said Siddharth Varadarajan, editor of independent news website The Wire. Its publisher has challenged the regulation in the Delhi High Court.LiveLaw, a legal news website, has challenged the rules in the Kerala High Court, which this week said no coercive action should be taken against the website for non-compliance.The government says the new rules are aimed at achieving parity between digital media and print and TV news regulations. Referring to the rules for digital media, information and broadcasting minister Prakash Javadekar last month said every freedom has to be responsible freedom.The number of online media outlets in India has increased in recent years, but some journalists have complained they face intimidation for reporting stories critical of Prime Minister Narendra Modi and his administration.Modi's administration says it favours press freedom. (reut.rs/3tcKuml)I think these rules will restrict and constrain press freedom, as indeed freedom more generally, said Zoya Hasan, a former professor of political science at New Delhis Jawaharlal Nehru University.This whole regulation is about control of digital media and other platforms as theres little tolerance for dissenting voices.U.S. think tank Freedom House recently said Modi and his party are driving India toward authoritarianism, adding political rights and civil liberties had deteriorated since he came to power in 2014. The government called the report misleading, incorrect and misplaced.On Thursday, Javadekar said on Twitter that a group representing leading newspapers and TV channels had welcomed the new regulation and asked that their members be treated differently from digital-only news publishers.That has drawn criticism from some smaller digital news outlets, which have questioned why they are being ignored while seeking exemptions."}