{"text": "NEW DELHI India has won plaudits for gifting and selling COVID-19 vaccines around the world, but it will have to crank up the pace of immunisations at home to meet its targets.Having reported the worlds second-highest number of COVID-19 cases after the United States, India wants to innoculate 300 million people - a fifth of its population - against the virus by August.However, in four weeks health workers vaccinated only 7.5 million frontline workers on priority, a rate at which it would take India several years to reach its goal.Vaccination programmes usually start off slow and then ramp up as logistic and operational issues are sorted out, said Gagandeep Kang, Professor of Microbiology at the Christian Medical College in Vellore.In India, we are fortunate that supply of vaccines is not a rate-limiting step, but to meet the timelines set by the government, we will have to immunise somewhere between 4 and 5 times more people each day than we are doing today.The government says it is ready to step up vaccinations from next month, including by roping in more private hospitals, once identified groups from the general public are given the shots. A government online vaccine platform told Reuters it could handle 10 million inoculations a day.The health ministry also says India is the fastest to reach the 7 million milestone, though immunisation relative to population has been much higher in many other countries.Several big Indian states, such as Tamil Nadu and Punjab, have covered fewer than 40% of their high-risk people such as nurses, doctors and hospital cleaning staff, worrying the federal government.New Delhi has urged states to accelerate vaccinations after a review found substantial room for improvement, though the government thinks involving too many private players in the campaign might be tricky.Administering vaccines needs a system because of the nature of the disease, said a senior government official involved in the process, declining to be named citing service rules.They have to take details of the person taking it, record and monitor it.STOKING INHIBITIONSIndia, which makes 60% of all vaccines in the world, has gifted or sold COVID-19 shots to 17 countries and has requests from five more. The government, however, told here parliament this week it was coordinating with the manufacturers to ensure adequate supplies for its own campaign.It also says here infrastructure such as cold storage and special vehicles are not an issue, while acknowledging vaccine hesitancy among some beneficiaries.India has deployed the COVAXIN shot developed by Bharat Biotech in partnership with the state-run Indian Council of Medical Research, as well as a vaccine licensed from AstraZeneca and Oxford University.Some doctors and the opposition-ruled state of Chhattisgarh, however, are worried about COVAXIN, which was approved last month for emergency use without any efficacy data from a late-stage trial.The health ministry has chastised Chhattisgarh for stoking inhibitions over vaccines during a pandemic. India recorded 9,309 daily new cases of COVID-19 on Friday, increasing the total number to 10.88 million cases since the pandemic began. Deaths rose by 87 to a total of 155,447.In such unprecedented times, you should help address any vaccine hesitancy and do whats in the best interest of people, not further vested interests! Health Minister Harsh Vardhan said on Twitter in response to a letter from his Chhattisgarh counterpart.Bharat Biotech has said efficacy data from the late-stage clinical trial will be out by next month. The government has called the shot safe and effective.India is also expected to approve other shots in coming months, including Russias Sputnik V and products from Cadila Healthcare, Novavax and Johnson & Johnson."}