{"text": "India will be able to decide on exports of coronavirus vaccines within the next few weeks, Foreign Minister Subrahmanyam Jaishankar said on Tuesday, as governments abroad seek to shore up supplies.India, one of the worlds biggest producers of vaccines and generic drugs, is expected to be a key manufacturing centre for COVID-19 vaccines.Jaishankar told the Reuters Next conference that India understood the anxieties of foreign governments about getting the vaccines delivered to their populations.We will get clarity pretty soon on what our own consumption is going got be, (what) deployments are going to be. And we will keep our global role very much, he said.Last week, Brazilian President Jair Bolsonaro wrote a letter to Indian Prime Minister Narendra Modi asking to expedite a shipment of AstraZenecas COVID-19 vaccine, which is being made by Serum Institute of India, the worlds biggest producer of vaccines.Bangladesh this week said it expected to receive initial shipments of the vaccine from SII by Jan. 25.India has to balance the needs of its own population, which is set to receive the first shots this weekend, with that of foreign countries, Jaishankar said, speaking from Delhi at the virtual conference.The policy of course is we will start the rollout in India. We have our own challenges, Jaishankar said.A number of countries are in touch with us... and what we are telling them is, look, this is the first month, he added. The production is now coming into stream. There is a certain amount of stock taking going on.Along with AstraZenecas locally branded COVISHIELD, Indias drug regulator also cleared an indigenous vaccine developed by Bharat Biotech, jointly developed with a government institute.Four more vaccines are in clinical trials, Jaishankar said.Zydus Cadilas ZyCoV-D and Russias Sputnik V are among those being tested.Jaishankar said India had done well to control the pandemic, beating grim forecasts about the virus tearing through the worlds second-most-populous country.We surprised ourselves, probably the world as well. And if you recall the kind of apocalyptic scenarios around the summer of 2020, at the end of the year, it is very visible who came through better, and who came through less, he said.India, which has the worlds second highest number of coronavirus infections - nearly 10.5 million - after the United States, has among the lowest coronavirus fatality rates.For more coverage from the Reuters Next conference please click hereTo watch Reuters Next live, visit here"}