{"text": "NEW DELHI Indias retail inflation stayed within the central banks target range for the second consecutive month as it fell to a 16-month low in January, helped by a sharp decline in food prices.Januarys annual retail inflation was 4.06%, down from 4.59% in December to the lowest since September 2019, and below the 4.45% forecast in a Reuters poll of economists, data released by Ministry of Statistics showed on Friday.Inflation in Asias third largest economy returned toward the Reserve Bank of Indias (RBI) 2%-6% inflation target range last month after remaining stubbornly above the central banks comfort range for eight consecutive months.Retail food prices, which comprise nearly half of Indias inflation basket, increased 1.89% in January from a year earlier, against 3.41% in December.Low inflation is unlikely to lead to an RBI interest rate cut in the next policy announcement, but will offer comfort in keeping the market flushed with liquidity to help the large borrowing programme announced by the government for the next fiscal period, analysts said.On Feb. 1, India announced its annual budget for 2021/22 that starts on April 1 and vowed to increase infrastructure and healthcare spending to pull the economy out of its deep, coronavirus-induced slump.It also announced much larger than expected gross borrowings of 12 trillion rupees to fund its expenditure programme for 2021/22.An explicit rate action remains unlikely in the near term, said Siddhartha Sanyal, economist at Bandhan Bank.The RBI held policy rates steady at its last meeting on Feb. 5 with an accommodative stance, saying inflation was expected to remain within the targeted range over the next few quarters.However, the RBI said core inflation remains high and record high pump prices for petrol and diesel were adding to worries. It said India needed to create conditions that result in durable disinflation.Core inflation, excluding food and fuel costs, was estimated in the range of 5.5%-5.70% for the month by four economists following the data release, close to the level estimated by economists in December.India does not give official core inflation data."}