{"text": "Indias retail inflation accelerated to a three-month high in February on higher fuel prices, which could challenge the central banks accommodative stance and record-low key policy rates adopted to boost the pandemic-hit economy.Annual retail inflation rose 5.03% in February, up from 4.06% in January, data released by the Ministry of Statistics showed on Friday. Analysts in a Reuters poll had predicted annual inflation of 4.83% for February.COMMENTARYRADHIKA RAO, ECONOMIST, DBS BANK, SINGAPOREImproving growth expectations and firm crude prices are complicating monetary policy expectations. The one-year implied rate has risen this year, as have 5-year overnight index swaps, as markets build policy tightening risks.Bounce in Februarys inflation ... adds to this debate. Much of the increase stemmed from a sequential uptick in staple vegetables and commodity price pressures. With part of the pass-through also seeping into services (transport), core inflation hardened to 5.9% y/y, spurred also by a return in the demand impulse and return in producers pricing power.To douse premature rate tightening expectations, the RBI is likely to reassert its accommodative stance on rates as well as place liquidity normalisation on a slow gear. Firmer USD induced currency weakness has also partially eased intervention pressures.KUNAL KUNDU, INDIA ECONOMIST, SOCIETE GENERALE, BENGALURUWhile the low statistical base effect is partly responsible for this uptick, there are telltale signs of price pressures building up, notably through petro (petroleum) product prices bus and airfare segment.Price pressure is also building up from manufactured product price (driven by a sharp rise in commodity prices) and house price channel. Continued stickiness of core inflation adds to the concern.Also, despite weak business, recreation and amusement prices continue to move up as service providers needs factor in rising costs to prepare for the pandemic-engendered new normal. If the underlying price pressure continues to remain elevated even when the base effect normalises, there is a high possibility of RBI opting for a rate hike sooner than we expect.SAKSHI GUPTA, SENIOR ECONOMIST, HDFC BANK, GURUGRAMInflation inched higher in the month of February to 5% from 4.06% in January on the back of rising fuel prices and inflationary pressures in certain food items like onions, meat and eggs. As we had suspected, perhaps the low point for inflation is behind us for some months to come.From a monetary policy perspective, the rising inflationary risks although still nascent could trigger some caution from the RBI.That said, we continue to see the central bank keeping monetary policy accommodative and focus towards managing yields and supporting growth for now. We expect CPI to average at 5-5.5% in H1 FY22.MADHAVI ARORA, LEAD ECONOMIST, EMKAY GLOBAL FINANCIAL SERVICES LTD, MUMBAIThe February CPI inflation uptick after having seen downward surprises would imply that the revised Q4 FY21 estimate of RBI at 5.2% could see further downside of 30 bps or so.If food inflation normalizes in the next year to sub-3% (from 8%+ in FY21E), the headline inflation could average comfortably below 4.5% in FY22E, compared with ~6.2% in FY21E. However, risks of increasing input costs, higher commodity prices and seasonal upside in food prices and better pricing power remain key risks to inflation.We see core inflation outdoing headline inflation through most parts of FY22. While this could worry the policymakers, the policy stance will likely remain accommodative both on rates and liquidity front in CY21.GARIMA KAPOOR, ECONOMIST - INSTITUTIONAL EQUITIES, ELARA CAPITAL, MUMBAITodays CPI print clearly reflects the impact of higher fuel prices and lower sequential decline in food prices amid waning effect of seasonality. While the headline CPI numbers post March-2021 will begin to moderate amid base effect, core inflation is expected to remain firm amid higher commodity and especially crude prices.We expect global crude oil prices to remain elevated at least for another 4-5 months owing to the widening gap between global oil demand and supply. Given that the government is likely to overachieve its FY21 revenue target, a likely cut in excise duty may be on the cards.SUJAN HAJRA, CHIEF ECONOMIST, ANAND RATHI SECURITIES, MUMBAIThe numbers were slightly higher than expected. We see CPI around 4%-5% this year and broadly speaking the numbers are in that range.While food inflation is our major concern going forward, we see a selective increase in the non-food category, especially transport and communication due to higher fuel prices and their impact on other manufactured products.However, the 5% range is pretty much in the comfort zone of RBI, and expect them to maintain the rate pause as well as accommodative liquidity stance.SUMAN CHOWDHURY, CHIEF ANALYTICAL OFFICER, ACUIT RATINGS & RESEARCH, MUMBAIThe sharp reversal in the CPI inflation trajectory to 5.03% in Feb 2021 from 4.06% in the previous month reflects the potential inflationary pressures in the economy.The sharp drop in food inflation to 2.67% in January 2021, which was largely on account of a favourable base (high vegetable prices in January 2020), has been partly reversed to 4.25% due to continuing high inflation in edible oil, animal protein and pulses.The CPI print reinforces concerns on a further increase in core inflation amidst the ongoing economic revival. RBI is expected to keep a close eye on the inflation trajectory despite its strong focus on economic revival, and suitably calibrate its monetary policy.ADITI NAYAR, PRINCIPAL ECONOMIST, ICRA, GURUGRAMWe expect the CPI inflation to rise further in March 2021, before recording a base-effect led dip in April 2021, reflecting the impact of the spike in inflation during the lockdown.We continue to expect a status quo on the repo rate through 2021, with a rapidly dimming likelihood of an early change in stance from accommodative to neutral.RUPA REGE NITSURE, GROUP CHIEF ECONOMIST, L&T FINANCIAL HOLDINGS, MUMBAIAt this juncture, the decision of the monetary policy committee will be driven more by weak growth, high unemployment & large sized govt borrowings programme than by cost push inflationary pressures."}