{"text": "Starting with just one plane in 2003, Indonesia's Sriwijaya Air has become the country's No.3 airline group, aided by its strategy of acquiring old planes at cheap prices and serving routes neglected by competitors.    \n    The mid-market airline, which has few international flights, was thrust into the spotlight this week when a nearly 27-year old Boeing Co (BA.N) 737-500 crashed into the Java Sea on Saturday with 62 people on board.  read more [nL1N2JN08I]Brothers Chandra and Hendry Lie, whose family was involved in tin mining and the garment industry, and their business partners launched Sriwijaya 17 years ago with a single plane that flew from their hometown of Pangkal Pinang on Bangka Island to Indonesia's capital Jakarta.Its focus on second and third-tier routes gave it a loyal customer base and helped it snare nearly 10% market share behind Lion Air and national carrier Garuda Indonesia (GIAA.JK).\"They had a reasonable business approach,\" an industry source who was not authorised to speak publicly said of Sriwijaya's founders. \"They are not flamboyant people like many you see running airlines.\"They used a conservative business model of acquiring older planes on the cheap rather than taking advantage of low-cost financing to purchase large fleets of new aircraft like other fast-growing carriers such as Lion Air, Malaysia's AirAsia Group Bhd (AIRA.KL) and Vietnam's VietJet Aviation JSC (VJC.HM).    The fleet of Sriwijaya and regional offshoot NAM Air is nearly 20 years old on average - nearly three times older than Lion Air group, according to website Planespotters.net.The plane involved in the crash, a 737-500, was one of only 77 remaining in service globally, aviation data provider Cirium said. Other current operators including the likes of Nigeria's Air Peace and Kazakhstan's SCAT Airlines.   Two former Sriwijaya employees told Reuters there were strategic reasons for keeping such an old model in service beyond the cheaper acquisition cost.The smaller seating capacity of 120 was more appropriate for certain routes like Jakarta to Pontianak on Borneo flown by the plane that crashed on Saturday and the 737-500 could land at airports that were otherwise served by turboprops due to short runway lengths, they said on condition of anonymity.Sriwijaya did not respond immediately to a request for comment.   STRATEGY TESTEDThe crashed jet's black boxes have not yet been recovered so the cause of the accident remains unclear.    Older jets can be operated just as safely as newer ones if maintained properly, though the cost of doing so is higher, as are the operating costs because they are less fuel efficient. Indonesia's Transport Ministry said on Tuesday the Sriwijaya plane that crashed had passed an airworthiness inspection in December.Rising upkeep costs and low fare prices due to heated competition meant that by 2018 Sriwijaya had accrued large debts owed to Garuda's maintenance arm, GMF AeroAsia (GMFI.JK). \n    As of Sept. 30, 2020, Sriwijaya and NAM owed around $63 million in unpaid bills to GMF AeroAsia and Garuda had warned of impairment losses on $37.5 million owed by Sriwijaya as part of a failed cooperation agreement, according to GMF AeroAsia and Garuda.The status of its financial position since the start of the pandemic is unclear, but a Sriwijaya pilot, speaking on condition of anonymity, said there were salary cuts and a reduction in the number of planes operating during the pandemic in line with many other airlines globally. The pilot added the airline had been complying with all training and maintenance requirements throughout the pandemic.Sriwijaya and NAM together have 34 planes for operations and half of them are in service, according to Planespotters.net. \n    \"The question now is whether Sriwijaya, already in poor financial health, is able to overcome this accident as COVID-19 has crippled all airlines,\" said Shukor Yusof, head of Malaysian aviation consultancy Endau Analytics."}