{"text": "Indonesia has deployed a remotely operated underwater vehicle to help divers search for the remains of victims and recover the flight recorders from a Sriwijaya Air jet that crashed into the sea three days ago soon after takeoff.The Boeing 737-500 plane with 62 people on board plunged into the Java Sea Saturday afternoon, four minutes after taking off from Jakarta's main airport.  read more Indonesian police made the first identification of a victim from the crash on Monday. Flight attendant Okky Bisma was identified by his fingerprints, said a police official.\"My super kind husband... Heaven is your place... Until we meet again darling,\" Okky's wife, who is also a flight attendant, wrote on her Instagram account. The Boeing 737-500 jet was headed on a domestic flight to Pontianak on Borneo island, about 740 km (460 miles) from Jakarta, before it disappeared from radar screens.It was the second major air crash in Indonesia since 189 passengers and crew were killed in 2018 when a Lion Air Boeing 737 MAX also plunged into the Java Sea soon after taking off. The jet that crashed on Saturday is a largely different design.\"Today we are focusing on finding the victims,\" Yusuf Latif, a spokesman for search and rescue agency Basarnas, said on Tuesday.    Divers have narrowed down an area where they believe the flight recorders, known as black boxes, are believed to be but search efforts have been hindered by debris, officials said. A remotely operated underwater vehicle has been deployed to help scour the seabed, while navy vessels with sonar search from the surface.Once the flight data and cockpit voice recorders are found, Indonesia's National Transportation Safety Committee (KNKT) expects to be able to read the information in three days.With few immediate clues on what caused a catastrophic loss of control after take-off, investigators will rely heavily on  the flight recorders to determine what went wrong.The Sriwijaya Air plane was nearly 27 years old, much older than Boeing's problem-plagued 737 MAX model. Older 737 models are widely flown and do not have the stall-prevention system implicated in the MAX safety crisis."}