{"text": "Indias retail inflation stayed within the central banks target range for the second consecutive month as it fell to a 16-month low in January, data released by the government showed on Friday, helped by a sharp decline in food prices.Analysts in a Reuters poll had predicted retail inflation at 4.45% in January, but that it would remain within the Reserve Bank of Indias target range for a second month.COMMENTARYADITI NAYAR, PRINCIPAL ECONOMIST, ICRA, GURUGRAMWith inflation expected to resume an uptrend in February-March 2021, we do not think that the softer-than-anticipated print creates room for an imminent rate cut. Unless a cut in indirect taxes on fuels results in a sharp softening of the inflation trajectory, we expect the rate-cut cycle to have ended.We anticipate an extended pause for the repo rate through 2021, with the CPI inflation expected to average 4.6% in FY2022, exceeding the mid-point of the MPCs (Monetary Policy Committee) target range of 2% to 6% for the third consecutive year.MADAN SABNAVIS, CHIEF ECONOMIST, CARE RATINGS, MUMBAIConsumer Price Index (CPI) inflation has come close to our expectations. The declining inflation in food was on expected lines as was the increasing trend witnessed in the miscellaneous category including health, personal care, transport and communications.Inflation at 6.5% would be part of core inflation that will continue to worry policy makers. The base effect was also helpful in this month. Hence, there will be a tendency for inflation to rise as the base effect wanes and core inflation components increase. Food inflation too may show some upward movement as prices of vegetables have been increasing.KUNAL KUNDU, INDIA ECONOMIST, SOCIETE GENERALE, BENGALURUWhile low inflation would likely bring expectations of rate cut back to the table (we continue to expect a cut in 2Q21), the Reserve Bank of India (RBI) would likely keep a hawks eye on core inflation and want to be confident of its easing momentum before delivering a cut.Core inflation still remains quite elevated, although it is showing signs of easing, having peaked at 5.8% in November.We have highlighted earlier how pandemic has impacted headline inflation in the past months, especially the core. Continued opening up of the economy could potentially help ease the core inflation further, thereby, bringing down headline inflation to a more comfortable level.ANAGHA DEODHAR, CHIEF ECONOMIST, ICICI SECURITIES, MUMBAIAlthough high base partly contributed to lower inflation, there are clear signs of softening sequential momentum as well. Transport inflation has increased sharply in January 2021, reflecting rising fuel prices while services inflation has also remained high. As a result, while headline inflation has eased, core inflation remained elevated.Inflation could inch up in the next two months due to base effect but overall in H1FY22, it could undershoot the MPCs expected trajectory by at least 50 bps.YUVIKA SINGHAL, ECONOMIST, QUANTECO RESEARCH, NEW DELHIThe strength of downdraft in CPI inflation has caught us and markets by surprise for sure. If you look at the internals, broadly the Dec. 20 narrative has continued into CY21.Softening of food prices is yet again the primary ingredient of the inflation elixir, led by vegetables. This has offset the second month of sharp rise seen in the category of fuel and light, reflecting the rise in retail fuel prices.We will watch cost-push pressures emanating from hardening of global commodity prices closely as an upside risk. PRITHVIRAJ SRINIVAS, CHIEF ECONOMIST, AXIS CAPITAL, MUMBAIThe core CPI remains above comfort at over 5%. Besides, the outlook for core is worrying due to an uptrend in commodity prices. The RBI will hope for government to absorb some of these price pressures so that it can keep market interest rates lower for longer.SHASHANK MENDIRATTA, ECONOMIST, IBM, NEW DELHIThe sharp decline in headline inflation is likely to provide some relief to the central bank. This is expected to impart downward bias to the RBIs CPI estimate of 5.2% for Q4FY21. The decline is due to a collapse in food inflation, primarily on account of winter arrivals of vegetables and soft poultry demand.RUPA REGE NITSURE, GROUP CHIEF ECONOMIST, L&T FINANCIAL HOLDINGS, MUMBAIThe data shows an improvement in the growth-inflation dynamics. Despite a contraction in core industrial production, overall industrial production growth is positive in December on the back of improving outlook for consumer goods. This is certainly encouraging.While urban inflation remains elevated at 5.06%, a fall in rural inflation has brought down the overall inflation. However, a core inflation at 5.38% will keep the RBI vigilant.SREEJITH BALASUBRAMANIAN, ECONOMIST AT IDFC AMC, MUMBAIThe January CPI print was slightly below our expectations, as the rise in real-time prices of cereals in January did not fully feed into the CPI print, but it was mainly driven by the ongoing strong deflation in vegetables and fall in prices of meat, fish and eggs. Sequential momentum in core inflation has risen, following the highest-ever WPI-Core reading in December, which needs to be watched.The base effect, which helped recent lower prints, will wane in February and March and the magnitude of disinflation in vegetables would also most likely ease, while the price movement in pulses and vegetable oils needs to be watched closely. SIDDHARTHA SANYAL, CHIEF ECONOMIST AND HEAD OF RESEARCH, BANDHAN BANK, KOLKATAThe focus on CPI numbers is somewhat less at the moment, given the expectations of a long hold by the MPC. Still, the lower-than-expected CPI print should offer additional comfort on the monetary policy front.While an explicit rate action by the RBI remains unlikely in the near-term, it is important, especially after the announcement of the large-market borrowing by the government, that the RBIs liquidity operations provide support in anchoring market interest rates. The inflation print should offer a tad additional comfort on the rates front.SAKSHI GUPTA, SENIOR ECONOMIST, HDFC BANK, GURUGRAMInflation cooled off in January with a moderation in vegetable prices, animal proteins and a favourable base effect. Core inflation, however, continues to remain sticky at 5.7% with a rise in categories such as health, recreation and amusement.A number of inflation risks remain, including rising commodity prices, higher global food prices and expansionary fiscal policy leading to a pick-up in demand.Therefore, the January print could be the low point for inflation for some months to come and we expect inflation to average between 5% and 5.5% in H1 FY22."}