{"text": "CHICAGO The U.S. Department of Agriculture raised its forecasts of U.S. 2020/21 corn and soybean production more than most analysts expected on Wednesday.The governments projection of the U.S. corn crop was 15.278 billion bushels, a record high if realized and above an average of analyst expectations for 15.174 billion. The USDA put soybean production at 4.425 billion bushels, topping a range of analyst expectations.COMMENTS:* Jim Gerlach, president, A/C Trading:Weve known were going to have surpluses since the pandemic hit, really. Weve known for a pretty good amount of time, at least several weeks, that we have a pretty good crop on our hands. I see todays reports as being confirmation of that. I think the market was looking for something similar and it got it, so youre seeing kind of a vanilla reaction.* Terry Reilly, senior analyst, Futures International:We see this report as less influential on price reaction, unlike other August report years. The trade will shift back to their focus on U.S. weather developments and impact from the recent derecho that could cause a massive loss of acreage from Iowa and Illinois.* Jack Scoville, Price Futures Group:Even with the super-strong demand showing from China and others, it will be hard to move enough crop to materially dent the impending stocks, because there is so much of it around.* Ted Seifried, chief ag market strategist, Zaner Group:For the (corn) ending stocks number to come in slightly below the trade expectations, even with a yield number that came in slightly above trade expectations, that is a little bit friendly report.* Don Roose, president, U.S. Commodities:This report is not factoring in (Mondays Midwest) storm damage, which early estimates are anywhere from 100 million to 400 million bushels of corn. But even if you take the top end of the yield damage, thats still not a game-changer, given how big this corn crop is expected to be. Historically, when the crop size in the August USDA report goes up, it goes up again in September and in October. Big crops get bigger.* Charlie Sernatinger, ED&F Man Capital:The USDA ramped up new crop Chinese bean imports to 99 million tonnes, up 3 million (from July), but incredibly left (Chinas) corn imports unchanged at 7 million tonnes. They should be getting some flak on that one. Interestingly, the (U.S.) spring wheat numbers were bearish, but the market is taking it in stride ... with a near record large spec short.* Bob Utterback, Utterback Marketing :I dont think the yield will grow, because of the storm, but the yield is going to be good. These are the nicest August growing conditions Ive ever seen."}