{"text": "BENGALURU, May 12 Indias retail inflation rose 4.29% in April from a year ago, government data released on Wednesday showed. Analysts in a Reuters poll had predicted annual inflation at 4.20% for the month.COMMENTARYPRITHVIRAJ SRINIVAS, CHIEF ECONOMIST, AXIS CAPITAL, MUMBAIApril CPI fell as expected, largely on weaker food and non-food prices, except for fuel, housing and health. We had projected a sharper decline to 4%.This dip is due to base effects and will prove short-lived, with subsequent CPI readings coasting near 5% in coming months. The biggest risk to CPI staying within RBIs comfort band comes from COVID-19 infections in the hinterland impacting market supply. We remain watchful.SAKSHI GUPTA, SENIOR ECONOMIST, HDFC BANK, GURUGRAMInflation moderated further to 4.3% in April as expected, aided by a high base from last year. Food inflation remained muted indicating that lockdown-related supply disruptions in April had little bearing on food prices. However, core inflation remained high at 5.4%, above the headline inflation print.Going ahead, while the inflation reading is benign for now, risks related to input cost pressures, any supply disruptions and revival in demand once the pandemic peaks continue to remain elevated. We could see inflation readings bounce back above 5% over the coming months.For now, the bond market is likely to find further support from todays inflation print and the 10-year yield is expected to trade between 5.90%-6.05% in the near-term.RUPA REGE NITSURE, GROUP CHIEF ECONOMIST, L&T FINANCIAL HOLDINGS, MUMBAIPrints for both the headline CPI inflation rate and IIP growth have been impacted by a favourable statistical base. Any comfort from this could be illusory. The real build up of inflationary pressures will be reflected in the WPI prints due on May 14th.Second wave of COVID-19 and its rapid spread to rural areas pose risk to overall growth projections for FY22. In view of this, RBI is likely to revise its growth projections downwards in the upcoming MPC meet.KUNAL KUNDU, INDIA ECONOMIST, SOCIETE GENERALE, BENGALURUIndias April CPI print of 4.3% year-on-year was slightly higher than expectation. However, the sharp drop from 5.5% in March does not in any way indicate easing pricing pressure. We attribute a high statistical base effect for this sharp retreat in headline inflation.Make no mistake, price pressure continues to persist as is reflected in the 0.7% month-on-month increase in headline inflation. That said, like RBI, we too believe that inflation will rise once again as high base effect caused by imputed inflation slowly starts to fade away.With multiple localised lockdowns resulting in supply disruptions, inflation is expected to remain on the boil although we do not expect headline CPI to exceed RBIs upper band of 6%.GARIMA KAPOOR, ECONOMIST - INSTITUTIONAL EQUITIES, ELARA CAPITAL, MUMBAIHigh base effect dragged the CPI inflation lower for the month of April, even though the trend of food prices reversed on sequential basis. Localised lockdowns, rising mercury and higher global prices of oilseeds will keep domestic food prices firm in the near term.The trend of sharp rise in WPI inflation too doesnt offer much comfort. We expect CPI inflation to average ~5.2% in FY22 and expect policy normalisation from RBI only towards end of Q4FY22.ADITI NAYAR, CHIEF ECONOMIST, ICRA, GURUGRAMGiven the high base related to supply disruptions seen during the nationwide lockdown in April 2020, the CPI inflation dipped to a three-month low of 4.3% in April 2021, while printing somewhat higher than our expectations. Overall, the prevailing localised restrictions appear to have had a limited impact on prices in April 2021.As the lockdown base fades away, we expect the CPI inflation to bounce back to an average of 5% in the remainder of H1 FY2022, ruling out the possibility of further rate cuts to support economic activity and sentiment. However, with the economic outlook remaining uncertain in light of the continuing pandemic, we expect the monetary policy stance to remain accommodative for much of 2021.ANUBHUTI SAHAY, HEAD OF SOUTH ASIA ECONOMIC RESEARCH, STANDARD CHARTERED BANK, MUMBAIThe April CPI was slightly higher than our expectation. Food inflation was soft. We expect CPI to inch higher and average at 5.3% in H1 FY22 before moving below 5.0% in H2.However higher inflation prints over next few months are unlikely to impact monetary policy as focus remains on supporting sentiment and growth amid ongoing second COVID-19 wave.We believe window for policy normalisation is unlikely to open before Q3 FY22. The proportion of vaccinated population will be a key driver of any policy normalisation. (Reporting by Chris Thomas, Shivani Singh, Rama Venkat, Chandini Monnappa, Anuron Kumar Mitra and Sethuraman N.R. in Bengaluru; Editing by Shounak Dasgupta)"}