{"text": "SAN FRANCISCO The head of Intel Corps self-driving car subsidiary said on Tuesday the company wants to shift toward using its own radar-based technology and use a single lidar sensor per vehicle by 2025 in a bid to lower the cost of autonomous driving.Mobileye has taken a different strategy from many of its self-driving car competitors, with a current camera-based system that helps cars with adaptive cruise control and lane change assistance. Those systems are on the road today and are gathering data to help Mobileye map the roads in new cities.For more advanced systems, the company plans to add both radar sensors, which use radio waves to detect distance from objects, and lidar, a laser-based system that helps self-driving vehicles gain a three-dimensional view of the road. For a planned fleet of so-called robotaxis, which are commercial vehicles meant to ferry around passengers, the company is tapping sensors from Luminar Technologies Inc.In a presentation a the Consumer Electronics Show, Chief Executive Amnon Shashua said on Tuesday that Mobileyes robotaxis will use multiple Luminar units to gain 360-degree lidar, radar and camera coverage all around the vehicle. The robotaxis rolling out in at least eight cities starting in 2022 will each have four Luminar units, Shashua said in a subsequent question and answer session.But Mobileye is also developing its own lidar sensor that it plans to start using in 2025 for cars aimed at consumers.That 2025 consumer system will feature a single lidar unit facing the front of the vehicle, while cameras and a new radar-based system that Mobileye is also developing will cover the entire vehicle. Shashua said Mobileye is developing new ways to process radar data with software that will make radar more powerful. Radar sensors are cheaper than lidar but give a less detailed image.The difference between radars and lidars in terms of cost is an order of magnitude, he said. No matter what people tell you about how to reduce the cost of lidar, radar is ten times lower. We are building lidars, so I know exactly the cost of the lidars.In a statement, Mobileye said it plans to continue to use Luminar lidars as much as possible after introducing its own lidar sensors. Mobileye plans to offer its self-driving technology to automakers as separate components, meaning that automakers could choose a Mobileye system but use Luminar sensors for the lidar units.Luminar declined to comment."}