{"text": "SINGAPORE/SHANGHAI/BOSTON Investors face uncertain rules and could miss out on promising opportunities after index makers cut some blocked Chinese firms from their books, according to money managers and attorneys.The exclusions, a response to a ban on American investment in companies named on a Pentagon list, could weigh on prices for some stocks - though only for as long as it takes for foreign buyers to pick up the spoils.Tariq Dennison, managing director at GFM Asset Management in Hong Kong, said the index exclusions were understandable but had created a headache for investors.Its been more than the average annoyance because some of those names are names we own, he said, referring to China Mobile, which is on the Defense Department list and which he still considers a good investment.The executive order by U.S. President Donald Trump, published last month, barred U.S. investors from buying securities of restricted firms starting in November 2021, based on their alleged ties to the Chinese military.Most selling will probably come from passive managers who track major indexes and exchange-traded-funds, since FTSE Russell and S&P Dow Jones Indices have said they will drop certain companies from their products.S&P is also culling blocked firms bonds from its credit indexes, and other index providers including MSCI and Nasdaq are expected to take similar steps.But several investors said they are waiting for the U.S. Treasury to publish more details about the sanctions to fully assess the market impact.As the executive order sits there is no required forced selling per se, said Salman Niaz, a bond fund manager and head of Asian credit at Goldman Sachs Asset Management in Singapore, When the detailed regulations come out we will know exactly what it means.Niaz points out that the risk premium on Chinese securities had not changed since the announcements. Chinese borrowers have more than $600 billion of bonds outstanding in offshore markets, he said, of which about 75% is rated investment grade and just $29 billion of that was from issuers on the list of blocked companies. This leaves a sufficiently deep investible opportunity set of bonds that global investors can participate in.Jamieson Greer, a former Trump administration trade official who is now a partner at law firm King & Spalding in Washington and represents investment firms, said one question is how the prohibitions will affect indirect holdings such as those in index funds.The White House orders deadline of next November gives investors time to wait for more guidance, he said, which may come from the incoming administration of U.S. President-Elect Joe Biden.Because many of the concerns raised by the United States are bipartisan, Greer said, I dont think there is going to be a lot of political or popular pressure to roll this back quickly.A U.S. Treasury Department official did not immediately comment on the questions of how the rules would affect indirect holdings.The Defense Departments list covers a range of companies that it says have ties to the Chinese military, including Hangzhou Hikvision Digital Technology Co Ltd, Semiconductor Manufacturing International Corp (SMIC),, oil giant China National Offshore Oil Corp (CNOOC) and telecom operator China Mobile Ltd.Hikvision has repeatedly said that it considers its targeting by the executive order to be groundless.The restrictions have hurt some individual firms valuations, with CNOOCs Hong Kong shares down by nearly a quarter since it was named in late November. Others have fared better: Hikvisions shares have risen more than 50% from lows following its blacklisting last October.Chetan Seth, Asia-Pacific equity strategist at Nomura in Singapore, said the bigger risk is an escalation in the U.S. pushback against Chinese firms, noting that the impact of targets to date has been relatively minor.I think the bigger risk here is if the administration were to target some of the big boys. The obvious ones, like (Ali)Baba, Tencent, he said.But in the event of a sudden rush of divestments by U.S. investors, global appetite for increasing exposure to fast-growing Chinese names is likely to provide price support despite the blockings.We suspect a lot of ... non-American investors would take that opportunity to accumulate because the fundamental story doesnt change, said Seth."}