{"text": "NEW YORK Investors are watching next weeks earnings reports from hotels, cruise lines and other businesses that have been hard hit by COVID-19 for indications of which companies could be the first to bounce back when the pandemic recedes.For nearly a year, money managers have largely looked past earnings in the travel and leisure sector, where coronavirus-fueled lockdowns and travel restrictions battered companies businesses and crushed their stock prices: shares of Marriott and Norwegian Cruise Lines, for example, are down 12% or more in the last year, compared to a nearly 17% gain for the S&P 500 through Friday afternoon.Next weeks numbers, however, may offer clues on which companies are in the best financial health and would benefit the most from economic reopening, while also allowing investors to better gauge where companies should be valued.The results across the board are going to be bad, but its really going to be about who is coming back, said Adam Trivison, a portfolio manager at Gabelli Funds.The focus on travel and leisure companies comes as investors more broadly gauge the effectiveness of the U.S. vaccination effort and the degree to which it will help the economy get back on track.The White House announced Feb. 2 that it will start shipping vaccines directly to retail pharmacies alongside regular shipments to states, increasing weekly supplies of shots to 11.5 million. Approximately 10.5% of the U.S. population through Feb. 11 had received at least one of the two shots required for full vaccination, according to estimates by the Centers for Disease Control and Prevention.Will Hilkert, portfolio manager of the Fidelity Select Leisure fund, said that earnings results over the next two quarters will serve as a gut check for investors who had bet on the leisure sector as a play on the economy reopening.Over the next six to nine months youre going to get a chance to make sure that what you think the world is going to look like after the pandemic is being matched by company fundamentals, he said.Hilton Worldwide Holdings Inc and Hyatt Hotels Corp are expected to release their results on Feb. 17, followed by Marriott, Norwegian Cruise Lines and TripAdvisor on Feb. 18.Trivison, of Gabelli Funds, said he will be keeping an eye on hotel bookings in the group meeting business, which he expects to offer clues on the scale of employee travel in the week ahead. Business travelers typically make up 25% of a hotel chains customers, though that number may be higher in destinations such as Orlando and Las Vegas.Historically high valuations in the hospitality sector may give some potential investors a pause before buying at current levels, said Daniel Kane, a portfolio manager at Artisan Partners who bought shares of Marriott while its stock was tumbling last March and April.Most stocks in the hospitality sector are now trading based on estimates of their 2023 results, pushing their current valuations well above their long-term averages, said Robin Farley, an analyst at UBS.Marriott, for example, trades at a trailing price to earnings multiple of 240.7, while Hilton is currently unprofitable but trades at 515.7 its current fiscal years full year earnings, according to Refinitiv data.Cruise lines, meanwhile, are not expected to become widely profitable again until 2022, when most international travel restrictions should be eased. Norwegian, for instance, trades at 35.2 times its 2022 estimated earnings, while Royal Caribbean trades at 40.4 times its 2022 estimated earnings, according to Refinitiv. Marriott was trading at a trailing P/E of about 16 before widespread economic restrictions were put in place in March.Chris Terry, a portfolio manager with Hodges Funds, has been paring back a position in Norwegian after shares of the company rallied following the vaccine approvals. He is now watching for the company to show incremental improvement in its upcoming earnings report to confirm that business is rebounding.Going back a year ago, quarterly earnings were basically irrelevant, he said. Now we want to see that theres progress on the timetable to get revenues back to where they were in a meaningful way."}