{"text": "SHANGHAI/HONG KONG Stock investor Zhu Haifeng halved his once-cherished holdings in Chinese tech giants Tencent and Alibaba after the United States announced on Friday sanctions against some Chinese firms in the latest escalation between the worlds two top economies.I was envisioning a global Tencent, a global Alibaba. Now, I can only think of Southeast Asian versions, said Zhu, who has several million yuan in overseas-listed Chinese companies.The room for imagination evaporates. Valuation should be cut by one third.Like other investors, he worries that Washingtons move to restrict mainland technology companies could curb their growth potential.That concern drove shares of Tencent and Alibaba down some 5% each on Friday, but they were still up roughly 39% and 17% respectively so far this year after Fridays losses.Under Trumps executive order, any transaction related to WeChat and TikTok would be banned in the United States.The Trump administration last week also announced the expansion of the Clean Network initiative which aims to prevent various Chinese apps and telecom firms from accessing sensitive information on American citizens and businesses, targeting firms like Tencent, Alibaba and Huawei [HWT.UL].The latest blow comes as the relationship between the two powerhouses has nosedived since the outbreak of the coronavirus pandemic.Fundamentally, its not a big shock to the earnings. But right now, I think the market is still trying to digest this information because of the political backdrop, said Paul Sandhu, Asia Pacific head of multi-assets quant solutions at BNP Paribas Asset Management.Theres a lot of ambiguity concerning the so called Clean Network, he said, forecasting more market volatility ahead.DOWNSIDE RISKSBrokerage CLSA said the fall in Tencent and Alibaba shares represented a buying opportunity, expecting the U.S. ban to only have a small impact because the U.S. only contributes less than 3% to each firms overall revenue.But Morgan Stanley said there was significantly amplified downside risk to Chinese internet gaming companies if the U.S. ban expands to cover more businesses, or prohibits investment in the United States by Chinese tech firms.Globalisation is one of the key growth drivers for China internet stocks as user growth decelerates and competition intensifies in China, Morgan Stanley wrote.Tencent, which derives more than a third of its revenues from gaming, has invested in a number of overseas video game studios such as Riot Games and Supercell, and has also partnered with many Western gaming firms in China and Asia.A fund manager based in Shanghai, who owns Tencent shares, also said the sanctions cast a shadow over share trading.If we see the U.S. take actions against China from time to time, I think share price volatility in Chinese tech companies will continue, he said on condition of anonymity.He expected the future growth of Tencent to be mainly driven by domestic e-ecommerce, fintech and short-video businesses."}