{"text": "The International Olympic Committee said on Friday it is not a super world government that can resolve political issues in China ahead of the Beijing 2022 Olympic Games even though activists say the IOC has ignored Tibetan and Uighur claims of human rights violations.Beijing will become the first city to host summer and winter Games next year after also staging the 2008 summer Games. But the IOC has been criticised for awarding the 2022 winter Olympics to China given the countrys human rights record.Representatives of Tibetan and Hong Kong groups as well as the worlds largest group of exiled ethnic Uighurs said earlier on Friday the IOC had not acted on their concerns after meeting them in October.They also said any assurances from China to the IOC were of no value.We are taking this very seriously, IOC President Thomas Bach told a news conference when asked specifically about claims of rights violations in China. Human rights and labour rights and others are and will be part of the host city contract.We are working very closely with the organising committee. We are monitoring supply chains, labour rights, freedom of press and many other issues. This is our responsibility, he said at the end of a virtual IOC session.The United States earlier on Friday condemned Chinas abuse of ethnic and religious minorities, including what it called crimes against humanity and genocide in Xinjiang against Muslim Uighurs and severe restrictions in Tibet.We are not a super world government where the IOC could solve or even address issues for which not a United Nations security council, no G7, no G20 has a solution, Bach said.This is in the remit of politics. We have to live up to our responsibilities in our areas of responsibility.China rejects U.S. charges that it has committed genocide against Uighur and other Muslims in the remote western region, where activists say more than 1 million are held in internment camps.Beijing says the complexes it set up in Xinjiang provide vocational training to help stamp out Islamist extremism and separatism. Allegations of forced labour and human rights violations are groundless rumour and slander, the Chinese foreign ministry says."}