{"text": "DUBAI/LONDON An Iranian official said on Wednesday that Tehran exported up to 700,000 barrels per day (bpd) of oil since March, but was later quoted by an Iranian news agency casting doubt on the figure which had been kept secret as the country fights U.S. sanctions.Irans oil exports have shrunk from more than 2.5 million bpd since 2018, when the United States withdrew from Tehrans 2015 nuclear deal with six world powers and reimposed sanctions that have hammered the countrys economy.The average oil sales so far this (Iranian) year have been 600,000 to 700,000 barrels per day, Hamid Pourmohammadi, deputy head of the budget and planning organisation, told semi-official Fars news agency, without providing further details.Pourmohammadi later in the day withdrew his comments and said the figure referred to Irans plan for exports of oil next year. The Iranian year begins on March 20.Fars published the denial in a separate story, but did not change Pourmohammadis quotes in the first interview.No one is allowed in the Iranian government to give any figure on the crude oil sales during sanctions, an industry source told Reuters.The source said the figure, however, could include both crude and petroleum product sales. It seems the Iranian official is talking based on the dollar amount received by Iran and he might be mixing crude and petroleum products.Irans oil minister Bijan Zanganeh and other officials have said that Tehran would not disclose its oil exports data as it fights to skirt U.S. sanctions which targets its vital energy industry.Iranian authorities have said Washingtons maximum pressure policy aimed at halting Irans oil exports have failed as Tehran has been working to get around the measures.Citing three assessments based on tanker tracking, Reuters reported that Iranian oil exports had risen sharply in September, although the figures fall into a wide range of between 400,000 and 1.5 million bpd.U.S. President-elect Joe Biden, who was vice president in the U.S. administration which negotiated the 2015 nuclear deal with Tehran, has said he would return to the nuclear pact if Iran resumes compliance.The prospect of a rise in supplies from Iran, an OPEC member, have worried some members of the Organization of the Petroleum Exporting Countries and their allies, a group known as OPEC+ that has cut output to prop up oil prices.Iran has ruled out talks with the United States unless Washington returns to the nuclear deal and lifts sanctions.We will not miss any opportunity, ... whenever there is an opportunity, to have the sanctions lifted, President Hassan Rouhani said in a televised speech on Wednesday."}