{"text": "DUBAI An Iranian container ship was damaged in an attack in the Mediterranean, the state-run shipping company said on Friday, adding it would take legal action to identify the perpetrators of what it called terrorism and naval piracy.The ship, Shahr e Kord, was slightly damaged in Wednesdays incident by an explosive object which caused a small fire, but no one on board was hurt, the spokesman, Ali Ghiasian, said, according to state media.Such terrorist acts amount to naval piracy, and are contrary to international law on commercial shipping security, and legal action will be taken to identify the perpetrators through relevant international institutions, Ghiasian said.The vessel was headed to Europe when the attack occurred and will leave for its destination after repairs, he added.The Iranian-flagged vessel last reported its position off Syrias coast on March 10 as it headed for the Syrian port of Latakia, Refinitiv ship tracking data showed.Two maritime security sources said initial indications were that the Iranian container ship had been intentionally targeted by an unknown source.The incident comes two weeks after an Israeli-owned ship the MV HELIOS RAY was hit by an explosion in the Gulf of Oman.The cause was not immediately clear, although a U.S. defence official said the blast left holes in both sides of the vessels hull. Israel accused Iran of being behind the explosion, a charge the Islamic Republic denied.On Friday, Israeli officials did not provide comment when asked if Israel was involved in the Shahr e Kord incident reported by Iran.The vessel, which is among Iranian ships that have been designated by the U.S. under tough sanctions measures, was detained in Libya in 2019 although the ship was later released.A third maritime security source told Reuters that three other Iranian ships had been damaged in recent weeks by unknown causes when sailing through the Red Sea.SMUGGLINGMeanwhile the Wall Street Journal reported that Israel has targeted at least a dozen vessels bound for Syria and mostly carrying Iranian oil out of concern that petroleum profits are funding terrorism in the Middle East.Iran, which often threatens strong retaliation for any Israeli attack, has often declined to point the finger at Israel over repeated air strikes on Iranian-backed forces in Syria, in an apparent effort to avoid all-out war with Israel.Israeli officials declined comment on the report, which cited unnamed U.S. and regional officials and came as the Biden administration reviews policy on Iran. The U.S. Embassy in Jerusalem had no immediate comment.In a speech to Israeli navy cadets in 2019, Prime Minister Benjamin Netanyahu accused Iran of increased oil smuggling by sea to circumvent U.S. sanctions, and said the navy corps would have a more important role in blocking these Iranian actions.He did not elaborate on what that might entail.Israel has separately said it is waging a covert campaign between wars to deny Iranian allies on its borders arms and other support from Tehran.We do not comment on the campaign we are waging, in the operational regard, Israeli security cabinet minister Tzachi Hanegbi told Tel Aviv radio 102 FM when asked about the Journal report.But we always emphasize (that) we must be poised against Iranian belligerence on all fronts...and I suppose this also includes the air and sea arenas, as well as on land.The Israeli navy, whose largest vessels are missile corvettes and five diesel-fuelled submarines, is mostly active in the Mediterranean and Red seas."}