{"text": "Iranian dissident journalist Ruhollah Zam, who was convicted of fomenting violence during anti-government protests in 2017, was executed on Saturday, Irans state television reported.France reacted with anger to the hanging of the Paris-based journalist, which it called barbaric and unacceptable and said ran counter to Irans international obligations.Iran said on Tuesday its Supreme Court had upheld the death sentence against Zam, who was captured in 2019 after years of living in exile in France. His Amadnews feed had more than 1 million followers.State TV said Zam, director of the counter-revolutionary Amadnews network, was hanged this morning.The French foreign ministry said in a statement: France condemns in the strongest possible terms this serious breach of free expression and press freedom in Iran. This is a barbaric and unacceptable act that goes against the countrys international commitments.Press advocacy group Reporters Without Borders (RSF) condemned the execution.RSF is outraged at this new crime of Iranian justice and sees (Supreme Leader Ayatollah) @ali_khamenei as the mastermind of this execution, the group tweeted.Amnesty International said it was shocked and horrified by Irans action.We call on the international community, including member states of the UN Human Rights Council and the EU, to take immediate action to pressure the Iranian authorities to halt their escalating use of the death penalty as a weapon of political repression, the rights group said in a statement.The son of a pro-reform Shiite cleric, Zam fled Iran and was given asylum in France.In October 2019, Irans Revolutionary Guards said it had trapped Zam in a complex operation using intelligence deception. It did not say where the operation took place.Nour News, a news agency close to the Revolutionary Guards, said last week that Zam was detained by Guards agents after he travelled to Iraq in September 2019 and brought to Iran.Iranian officials have accused the United States, as well as Tehrans regional rival Saudi Arabia and government opponents living in exile, of stoking the unrest that began in late 2017 as regional protests over economic hardship spread nationwide.Officials said 21 people were killed during the unrest and thousands were arrested. The unrest was among the worst Iran has seen in decades, and was followed by even deadlier protests last year against fuel price rises.Zams Amadnews feed was suspended by messaging service Telegram in 2018 for allegedly inciting violence, but later reappeared under another name."}