{"text": "JERUSALEM Israeli defence electronics firm Elbit Systems reported higher quarterly profit on Thursday, boosted by a jump in revenue, and said it had received interest in a new airborne laser defence system it was developing.Elbit, a maker of drones, pilot helmet displays and cyber security systems, said it was working with Israels military on the high-powered laser that would intercept missiles, drones and other flying targets.We see a lot of interest and demand from customers who are looking to join and acquire such capabilities, Elbit Chief Executive Bezhalel Machlis told Reuters after reporting big gains in second-quarter profit and revenue.I believe it will change the whole way countries are defending themselves against missiles, he said, adding that trials on the system were recently conducted with the army.The Defence Ministry said in June a prototype would be ready by 2025.Machlis said the system, which will deal with both short and long-range threats, is another layer of protection, which can defend the country before implementing Israels Iron Dome anti-missile system.Elbit said it earned $2.11 per diluted share excluding one-time items in the second quarter, up from $1.56 a year earlier. Revenue rose to a record $1.3 billion from $1.08 billion.Sales were partly helped by its $380 million acquisition of Florida-based Sparton Corp in April aimed at gaining a foothold in the naval sector. Finance chief Joseph Gaspar said Sparton should provide $200 million in annual revenue.Its backlog of orders rose to $13.6 billion at the end of June from $11.8 billion at the end of March. Some 51% of the backlog is scheduled to be performed during the remainder of 2021 and in 2022.The results pushed Elbits shares up 5.2% in Tel Aviv trading.Machlis said he expected the backlog to bolster revenue and profit growth through 2021. Defence spending, he said, was strong globally and Elbit has capitalised on the companys strategy of being a global firm with units in many countries.Our dozens of subsidiaries around the world really help us because customers are looking to support their economies and to create more jobs and the subsidiaries we have helps us to get contracts with local players in different markets. This has helped us to grow, Machlis said.Elbit declared a dividend of 46 cents per share for the second quarter, up from 44 cents in the first quarter."}