{"text": "JERUSALEM Israels cabinet approved a normalisation deal with the United Arab Emirates on Monday and Prime Minister Benjamin Netanyahu said he and Abu Dhabis crown prince had spoken and agreed to meet soon.The U.S.-brokered treaty of peace establishing full relations with the Gulf Arab country broke new diplomatic ground in the region, where concern over Iran is high, even as Palestinians condemned the pact as betrayal of their quest for statehood in Israeli-occupied land.Abu Dhabi Crown Prince Mohammed bin Zayed al-Nahyan, the UAEs de facto leader, tweeted on Monday that he and Netanyahu had discussed strengthening bilateral ties and the prospects for peace in the area.In an official statement that coincided with an Israeli cabinet vote approving the Sept. 15 agreement with the UAE, Netanyahu said he and Sheikh Mohammed would meet soon, without specifying a date.At the weekend, I spoke with my friend, the crown prince ... and invited him to visit Israel, Netanyahu said. He invited me to visit Abu Dhabi. But first, we will see a UAE delegation here and another one of our delegations will go there.A source familiar with plans for the delegations visits said Israeli representatives accompanied by U.S. officials will fly to Bahrain on Oct. 18 and travel on to the UAE the next day before returning to Israel with a UAE team on Oct. 20.Commenting on his conversation with Sheikh Mohammed, Netanyahu said: We spoke about cooperation that we are promoting in investment, tourism, energy, technology and other spheres.In a sign of burgeoning Israel-UAE cooperation, a ship from the UAE docked on Monday at Israels port of Haifa, carrying a cargo of 15 containers along a shipping line between India, the UAE, Israel and the United States.While the normalisation accord has already inspired commercial deal-making with the Gulfs trade, finance, tourism and travel hub, Israeli officials have objected to the UAEs potential purchase of U.S.-made F-35 stealth fighter jets in a separate side deal.Israel is the only Middle East country flying the advanced warplane and has voiced concern its supply to other nations in the region could jeopardise its military edge.Israel has also said it would oppose any sale of the plane to Qatar, whose Iran links trouble Israel, after a Reuters report that Doha had submitted a formal request to Washington to buy the Lockheed Martin Corp. stealth jet.Israeli cabinet approval of the accord with the UAE opened the way for Israels parliament to ratify it, in a vote likely to be held later this week.In the UAE, the federal cabinet must still approve the accord, following which the government would issue a decree.Israel and Bahrain, which signed a declaration of peace at the White House ceremony last month, are still discussing details of a full accord."}