{"text": "MILAN (Reuters) -Alitalias successor ITA Airways is looking for a partner ready to invest in the Italian carrier, Chairman Alfredo Altavilla said on Wednesday, adding that the airline could seal an alliance by June.Speaking at a parliamentary hearing, Altavilla said that the state-owned carrier had already started informal talks with some potential partners, both in Europe and overseas, but did not name any suitors.We dont need code sharing or a commercial joint venture. If you put money on the table, you play; if you dont put money on the table, you can avoid asking for access to the data room, he said. We are looking for an equity partnership.Two sources close to ITA Airways told Reuters that the Italian carrier has been in contact with Germanys Lufthansa, British Airways and United States-based Delta, adding that formal talks could start by the end of March.A Lufthansa spokesman reiterated that the German carrier was open to the possibility of a partnership with ITA. A Delta representative was not available for comment and British Airways declined to comment.ITA Airways started flying on Oct. 15 with nearly 2,300 employees and a fleet less than half the size of that operated by Alitalia.FLEXIBLEWe are flexible, have cut costs and we have a fleet and network that can be integrated into that of a bigger partner, Altavilla said, adding that the Italian carrier was not interested in an alliance that would make ITA merely a junior partner and hold back growth at its Rome and Milan airports.The final decision on any tie-up would depend on the Italian government, which is in favour of a partnership but has not made clear whether it would be ready to relinquish control of the carrier.The option of a partner entering ITA Airways is the path desired from the outset for ITAs survival ... there is no official position on (a partnership with) Lufthansa, but we dont hide the hope for such a partnership, a source within Italys industry ministry told Reuters.ITA Airways reported revenue of 86 million euros ($98.1 million) for the period from Oct. 15 to Dec. 31, well below estimates given in its business plan, Altavilla said.But the airline started 2022 with a higher than expected 400 million euros in cash, helped by cost cuts, a smaller workforce and some flight suspensions because of the continuing coronavirus crisis, the chairman added.($1 = 0.8763 euros)"}