{"text": "A bid for Atlantia's (ATL.MI) motorway unit from a consortium led by Italian state lender CDP looked more likely to succeed after getting the backing of a top governance adviser.International Shareholder Services (ISS) has recommended shareholders support the sale of infrastructure group Atlantia's 88% stake in Autostrade per l'Italia to the consortium.The ISS recommendation, contained in a report seen by Reuters on Wednesday, boosts the chances of the bid being accepted after Benetton family holding Edizione and banking foundation CRT flagged a preference for it. Edizione owns more than 30% of Atlantia, while CRT owns nearly 5% of the Italian company.\"The opinion of ISS increases the probability (of a) disposal... to CDP as passive funds usually vote in line with the indications of the proxy advisors,\" Kepler said in a note.The CDP-led consortium has been negotiating to buy the Autostrade stake since last year as Atlantia tried to end a dispute triggered by the 2018 collapse of a bridge in Genoa run by the motorway operator, which killed 43 people.Although a sweetened offer at the end of April lifted the valuation of Autostrade to 9.3 billion euros, it still falls short of some minority shareholder expectations. These include activist hedge fund TCI which has said Autostrade is worth no less than 12.5 billion euros.Germanys Allianz and funds DIF, EDF Invest and Chinas Silk Road Fund own 12% of Autostrade.Atlantia has called a shareholder meeting on May 31 to vote on the proposed sale to CDP and its co-investors Blackstone (BX.N) and Macquarie (MQG.AX).In its report, ISS said the CDP price was below fair value, assuming a settlement and clear regulatory and tariff conditions, but added that this was not currently achievable.\"Based on the lack of compelling alternatives, a value that approaches the bottom of fair values under normal circumstances, and the benefit of releasing capital and management time, support for the transaction is warranted,\" it said."}