{"text": "* Italy 30-year yields drop to fresh record low of 1.60%* Spain, Portugal 10-year yields drop below 0.20%* Bund-Treasury spread widens as U.S. powers ahead* Euro zone periphery govt bond yields tmsnrt.rs/2ii2BqrLONDON, Oct 12 Southern European government bond yields are hovering near record lows as investors anticipate a fresh round of European Central Bank stimulus to help jumpstart an economy that has had a bumpy recovery from the depths of the COVID-19 crisis.Italian 30-year government bond yields hit a new record low on Monday while Spanish and Portuguese borrowing costs were also hovering around one-year lows, with their 10-year yields heading back towards zero.This reflects a slower-than-expected economic recovery in Europe and remarks from key policymakers that suggest the need for further monetary and fiscal stimulus, analysts said.The main reason is the ever rising probability of ECB support, especially an extension of quantitative easing, said ING rates strategist Antoine Bouvet. Recent remarks by (ECB chief economist) Philip Lane and (ECB executive board member) Isabel Schnabel does suggest this is an environment for duration and spreads, he added.Indeed, the long end of Italian and Spanish bond curves have been particular performers, with Italian 30-year yields dropping seven basis points on Friday alone to 1.60% and down about 40 basis points over the past month.It hit a new record low of 1.598% on Monday.Benchmark 10-year yields for Spain and Portugal are at 0.17% and 0.18% respectively, with analysts refusing to rule out a first-time dip into negative territory for this debt.Pictet Asset Management chief economist Frederic Ducrozet pointed out that the ECBs Lane used the word uncertainty 11 times and the word fiscal 16 times in a recent Wall Street Journal interview.Thats all you need to know about the ECBs outlook right now, he said on Twitter.Meanwhile, the economic divergence with the United States continues apace, and bond markets are reflecting this.The spread between German Bund yields and their U.S. Treasury counterparts is at its widest since March on 132 basis points.The U.S. has been doing a lot better economically in this recession than Europe, but there is a lot of hard data this week that should give us a better picture, said Bouvet of ING.It will take awhile for the effects of the upcoming presidential election and mooted fiscal package to make themselves clear, he added.Later this week, theres bond auctions from Italy, the Netherlands, Germany, Portugal, France and Spain in a busy week for debt supply."}