{"text": "Italian prosecutors have concluded a probe into Vivendi's Vincent Bollore and Arnaud De Puyfontaine for alleged market manipulation and obstruction of regulators in a case involving stake building in Italian broadcaster Mediaset, tax police said.The probe involved allegations the two executives were involved in a deal to buy the pay TV unit of Mediaset (MS.MI) to drive down its share price and raid its stock, the police said in a statement.A lawyer representing the two men did not respond to an email request for comment. Vivendi (VIV.PA) denied any wrongdoing in a statement on Saturday.  read more In a probe closure document seen by Reuters, prosecutors allege the real aim of the pay-TV deal was \"to reach a relevant share holding, at least 24.99%, in the capital of Mediaset.\"They allege three Vivendi statements issued in 2016 were written to convince the market the deal had fallen through because of \"wrong representation by Mediaset of the economic-financial situation\" of the pay-TV unit.They also allege the two executives failed to tell the market they had hired Italian bank Mediobanca (MDBI.MI) to study ways of building a stake in Mediaset.A few months after Vivendi scrapped its bid for the pay-TV unit it bought a stake of almost 30% in Mediaset in an attempted takeover. Vivendi, the French media group which is Mediaset's No 2 investor behind the family of former prime minister Silvio Berlusconi, also owns a 24% stake in Italys largest phone carrier Telecom Italia (TLIT.MI).According to the probe document the two executives considered involving Telecom Italia in a plan to build a media holding company with Vivendi and Mediaset as the main shareholders, without informing local market regulator Consob.The latest development in the long-running case comes amid tension between the Paris-based media company and Italy over a law potentially curbing its interests in the country. Fininvest, the holding company that controls Mediaset, originally filed a complaint over Vivendi's stake-building at the end of 2016, accusing it of never intending to honour the pay-TV deal.Prosecutors later placed the then Vivendi chairman Bollore and chief executive officer De Puyfontaine under investigation for alleged market manipulation over the French group's stake-building in Mediaset.Prosecutors are now expected to ask a judge to send Bollore and De Puyfontaine to trial. Vivendi, which questioned the pay-TV units profit forecasts when it ditched the deal, has previously said its aim was to forge an alliance to create a European media company.    The U-turn on the pay-TV purchase by Vivendi, whose main investor is Bollore, prompted Mediaset and Fininvest to seek multi-billion euro damages. A legal case has been ongoing ever since, while attempts to clinch a wider settlement and break the stalemate have so far proved unsuccessful. In Italy, investigations do not imply guilt and does not necessarily mean charges will be laid.Mediaset and Fininvest declined to comment. Mediobanca was not immediately available for a comment."}