{"text": "One U.S. Federal Reserve official says there is now a clearer focus about the economys path forward and a horizon for a fuller recovery. Another says the pandemics endgame is here. A third predicts 2021 will prove impressive.After a catastrophic spell when economic conditions were so confounded by the coronavirus that the Fed stopped making projections altogether, U.S. central bankers now like what they see.Even as they concede the riots by supporters of President Donald Trump that shut down Congress last week and concerns about continued violence pose a risk, officials say the transition to a new administration on Jan. 20 and a likely accelerating vaccine rollout have left them optimistic.The incoming administration of President-elect Joe Biden has said it plans to speed vaccine distribution, and the outgoing Trump administration urged states to loosen rules and offer vaccines to all Americans over age 65 or with chronic health conditions. read more For the Fed, even though the country's short-term political and health risks seem great, they have focused on the more positive prospects of the medium term - with some suggesting the strength of the ensuing recovery may accelerate their plans to pull on some of the steps taken this year to battle the coronavirus recession. Even those arguing policy will likely remain on hold point to consumers' still-amply-stuffed war chests from last year's federal relief efforts, including a $900 billion re-topping of aid approved just before year end.\"We have a trillion (dollars) in excess savings. We have checks coming in the mailbox. There will be enough demand\" from consumers to keep the recovery on track, Fed Vice Chair Richard Clarida said last week in forecasting an \"impressive\" 2021.If 2020 was when shutdowns and disease took the economy to \"new and unfamiliar places,\" Richmond Fed President Thomas Barkin said, \"the future has finally come into clearer focus,\" with vaccines likely leading to a fuller reopening by midyear.'DIRECTLY LINKED'Since the Fed last met in mid-December, there has been a whipsaw sequence of events around both the pandemic and U.S. governance, matters both critical to the economy's performance.A massive surge in coronavirus cases has been offset by optimism over the initial distribution of two vaccines. Confirmation of the Democratic Party's control of both the executive and legislative branches was offset by outgoing President Trump's effort to subvert the electoral outcome, reaching a crescendo in last Wednesday's assault on the Capitol.Part of the upside scenario seen by Fed policymakers in recent days is based on the incoming Biden administration working more smoothly with a Congress controlled by his party to put additional fiscal support in place and fix what has been a rocky start to the vaccine's distribution.It is a unique challenge - managing the national security, legal and political fallout from last week's events alongside the health and economic policy concerns looming over the country.But the more the vaccine agenda slips, the worse the economy will fare, say economists who agree that when it comes to the immunization program, speed matters.While they believe the initial slow vaccine distribution will accelerate and eventually end the health crisis, a faster versus slower vaccination rate translates directly into a faster or slower job recovery. It means the difference between less labor market \"scarring\" or more long-term harm for unemployed workers; between fewer defaulted loans and failed businesses or more bankruptcies and shuttered businesses; and between greater overall acceleration in output or a notably shallower rebound.\"The recovery is directly linked to the pace of vaccinations and its effectiveness both in terms of numbers, but also in terms of the confidence it instills in consumers,\" Atlanta Fed President Raphael Bostic said on Monday. A disappointing rollout \"could push us back several quarters\" in returning the economy to its pre-pandemic level.EVEN MODEST DELAYS MATTERIn a real-time reminder of how that dynamic works, as a new surge in the virus took hold in December, consumer confidence plunged, small businesses and restaurants appeared to cut back, and the economy lost 140,000 jobs.Oxford Economics economist Gregory Daco said both his optimistic and pessimistic projections see the country fully vaccinated this year. But the vaccinated share of the population hits 92% in August if things go fast versus 68% if they go slow. For the economy, that's the difference between growth of 5.2% for the year versus just 3%, a gap of about $800 billion.\"You gain two months,\" Daco said. \"If the speed of improvement in the health situation is increased then you are going to see people spend more freely much earlier and it'd be a story of much stronger growth.\"Goldman Sachs economists estimated the initial stumble with inoculations has already cost developed nations more than half a percentage point of growth for the year.WEST VIRGINIA VS CALIFORNIAAs of Tuesday the Centers for Disease Control and Prevention said about 2.8% of the U.S. population had received at least one vaccine dose, with the two formulations approved so far in the U.S. both requiring a second shot.But that obscures a broad divergence among states that could pose an economic challenge of its own if economically more important parts of the country are slower to immunize. The current national leader in terms of vaccination rates, at 5.8% of its population, is West Virginia, a state that ranks near the bottom in terms of economic output.California, accounting for about 10% of gross domestic product, lags the national average in terms of vaccinations, with 2.1% of its population immunized so far. Arkansas has the lowest current vaccination rate at 1.4%.To maximize growth \"you need homogenous response and diffusion,\" Oxford's Daco said. Otherwise, \"You are going to see people be much more cautious going to some regions, travel is still impacted, and generally you see a multi-speed economy.\""}