{"text": "TOKYO Japanese Chief Cabinet Secretary Yoshihide Suga, widely expected to become prime minister next week, said on Saturday he will consider topping up payouts to households and companies to cushion the economic blow from the coronavirus pandemic.Suga also defended his experience in diplomacy, an area where experts say his resume is rather thin, while steering clear of clues to whether he would call a snap election if he takes over from outgoing Prime Minister Shinzo Abe.Suga repeated that Japan must focus on reviving the economy before considering ways to fix its tattered finances, ruling out another rise in the national sales hike for a decade.If economic woes deepen, we will do whatever it takes and deploy further steps to protect jobs and businesses, Suga said.Given current economic circumstances, the government will take such measures if necessary, he said, when asked whether he would give additional payouts to households and companies suffering from shrinking income due to the pandemic.Suga made the remarks at a televised debate among candidates running in a ruling Liberal Democratic Party (LDP) leadership election to be held on Monday to pick a successor to Abe.Abe said last month he would resign due to ill health, after nearly eight years in office.The winner of the party vote is virtually assured to become prime minister because of the LDPs parliamentary majority.Rival candidate Shigeru Ishiba said the Bank of Japan should not make any immediate changes to its ultra-easy monetary policy, as doing so would destabilise markets.But he said the central bank should reexamine its policy framework in the long run to adapt to structural changes in Japans society, without elaborating.The BOJs biggest mandate is not to push up inflation but to maintain price stability. As such, it should stick to its 2% inflation target, Ishiba said. It shouldnt rush in doing this, but a reexamination of its policy may be necessary.When asked about monetary policy, Suga replied: My view is completely the same as that of Ishiba.Suga, 71, a long-time loyal Abe aide, said he would seek solid communication with neighbouring countries such as China and South Korea. Abe oversaw an improvement in ties with Beijing but those with Seoul have been chilled by rows over the wartime past.He added it was not the right time to discuss a planned visit by Chinese leader Xi Jinping, postponed because of the outbreak. Some LDP hardliners have urged the visit be cancelled because of Beijings maritime assertiveness near disputed islands in the East China Sea and its crackdown on Hong Kong.Suga defended his diplomatic experience, noting he was present at and helped prepare for Abes telephone chats with U.S. President Donald Trump, with whom Abe forged warm ties.I think Prime Minister Abes top diplomacy is truly excellent. I dont think I can do the same, but I also believe I have my own way of conducting diplomacy. I plan to hold onto my own style, he said.Speculation is mounting that Suga, who has seen his popularity rise in opinion polls since announcing his bid for the top job, may call a general election as early as next month to improve his chances of winning a full three-year term as LDP leader in a party election that must be held in September 2021.But he gave little clue to whether that was likely.What the people want is proper coronavirus policies and revitalisation of the economy, he said. But it (whether to call a snap election) is up to the next prime minister."}