{"text": "TOKYO In just a week, the metamorphosis was complete: former Japanese prime minister Yoshiro Mori went from being a political asset seen as vital to the Tokyo Olympics success to a liability threatening the already cloudy outlook for the Summer Games.Mori, 83, resigned on Friday as head of the Tokyo 2020 organising committee after an apology for sexist comments failed to quell domestic and overseas outrage.The groundswell of criticism from athletes, sponsors, volunteers, diplomats, media and ordinary Japanese pierced what one newspaper described as the village mentality of Moris allies, including Prime Minister Yoshihide Suga, who had hoped an apology would put the controversy to rest.His colleagues sought to protect him, and if the criticism had only been in Japan, an apology might have worked, said independent political analyst Atsuo Ito. But the reaction was global.The resignation of such a powerful figure signals Japanese leaders determination to do whatever it takes to stage the Games, despite persistent concerns about the COVID-19 pandemic.The hope is that Japan gets it, that the powers that be are not rigid and tone deaf and that yes, Japan will do what it takes, for a successful Games, said Jesper Koll, senior adviser to asset manager WisdomTree Investments.But Sugas handling of the affair could further dent his already battered public support, weakened by his response to rising COVID-19 cases.At a Japanese Olympic Committee meeting on Feb. 3, Mori commented that women talk too much, causing discussions to drag on. He first apologised, but initially declined to resign and said he didnt listen to women that much lately.DONT REALLY GET ITMoris tenure as prime minister in 2000-2001 ended after a series of gaffes slashed his ratings to single digits. Still, the onetime head of the ruling Liberal Democratic Partys (LDP) biggest faction retained considerable clout.Despite the outrage over his remarks, Olympic and ruling party officials initially told Reuters that few were willing to oust Mori, whose network of politicians and Olympic officials was thought key to pulling off a successful Games.Suga has dubbed Moris comments unacceptable and said they were not desirable for Japans national interests, but did not call for his resignation.I dont think they (ruling politicians) really get the issue about gender, its significance. Gender equality is very important but they take the issue lightly and just focus on internal politics, said Machiko Osawa, a professor at Tokyo Womens University.Overseas media kept up prominent coverage of the controversy and foreign diplomats posted support for gender equality on social media.Twitter was alight with domestic and foreign criticism - tennis star Naomi Osaka called his remarks ignorant - and an online petition calling for action against Mori garnered more than 140,000 signatures.On Wednesday, Tokyo Governor Yuriko Koike said she would not join a meeting of organisers with Mori because it would not send a positive message, and a day earlier the International Olympic Committee issued a statement condemning Moris remarks.Moris handpicked successor, former Japan Football Association president Saburo Kawabuchi, 84, was derided as another grandpa by some on social media. News reports on Friday said he declined the job after publicly accepting it earlier.The choice had threatened to keep alive the controversy, as Japans deeply entrenched gender bias clashes with changing attitudes. Japan ranked 121st out of 153 countries in the World Economic Forums 2020 gender gap report.Among those being considered to succeed Mori is Olympics Minister Seiko Hashimoto, one of only two women in Sugas cabinet. She also holds the portfolio for female empowerment."}