{"text": "Technical problems derailed Japans coronavirus vaccination booking system on Wednesday, compounding frustration over the governments handling of new outbreaks of infections and an inoculation drive that critics say has been woefully slow.The online system to book a vaccine crashed in many places including parts of Tokyo and the western city of Minoh because of a global problem with U.S. cloud computing vendor Salesforce.com Inc, public broadcaster NHK reported.Salesforce chief technology officer Parker Harris said on Twitter that the company was experiencing a major disruption, later updating to say services had been mostly restored.Making an appointment for a vaccination seems to be a tall order for the elderly, wrote Twitter user @obachan66972352.Please consider making it possible to get the vaccine without an appointment.A representative of the health ministrys vaccine office was not immediately available when contacted by Reuters.The ministry has faced numerous technical problems throughout the pandemic, from a contact tracing application that failed to pass on vital information to a cumbersome database that health workers were reluctant to use. [nL1N2K90NZ] [nL4N2GR1EP]Japan has only inoculated 2.8% of its population, the lowest rate among wealthy countries despite an ambitious government target of giving shots to its 36 million elderly people by July, when the Olympics Games are due to open in Tokyo.But according to government projections, about 86% of Japans 1,741 cities and towns would meet that goal.Health Minister Norihisa Tamura said to meet the target, about 1 million shots a day had to be delivered, about three times the current pace. [nT9N2H201P]Japans inoculation campaign was initially slow because of tight supplies of imported doses of Pfizer Incs <PFE.N> vaccine but has since been plagued by a shortage of manpower and other logistical snags. [nL4N2MU0RF] [nL1N2MM0L6]Taro Kono, the minister in charge of vaccines, has urged the public to be patient and to take steps to streamline the booking process.Christophe Weber, chief executive of Japans biggest drugmaker Takeda Pharmaceutical Co <4502.T>, acknowledged on Tuesday that the country was behind on its inoculation push and needed to accelerate. [nL1N2MY0GM]Some 75% of Japanese are dissatisfied with the vaccine rollout, and they had the lowest opinion of their governments handling of the pandemic among six major economies in a survey by global consultancy Kekst CNC released on Wednesday."}