{"text": "TOKYO The pessimism hanging over Japans manufacturers lifted slightly in October, suggesting businesses were emerging from the coronavirus pandemics heavy blow to activity and earnings but at a glacial pace.Some sub-manufacturing sectors, however, believed conditions would stabilise in the next few months, according to the monthly Reuters Tankan, which tracks the Bank of Japans (BOJ) closely watched tankan quarterly survey.The result underlines the daunting task Prime Minister Yoshihide Suga, who rose to power last month, faces in reviving growth and bringing corporate and consumer sentiment back to levels seen before the COVID-19 crisis.In the poll of 485 large- and mid-sized companies, in which 251 firms responded on condition of anonymity, many complained about the slow pace of recovery from the economic crisis, reporting weakening orders and capital spending.The recovery in manufacturing is delayed, a manager at a chemicals maker wrote in the survey.A textile maker wrote: Auto sales are stagnating globally, while private consumption within Japan is growing only slowly.The Reuters Tankan index readings are derived by subtracting the percentage of respondents who say conditions are poor from those who say they are good. A negative reading means that pessimists outnumber optimists.The Reuters Tankan sentiment index for manufacturers in October rose for the fourth straight month, coming in at minus 26 from minus 29 the previous month. The index has been in negative territory for 15 straight months.The service-sector index stood at minus 16, up from minus 18 in September, with sentiment among wholesalers, transport and utilities weighing on broad business confidence.The BOJs latest tankan survey released on Oct. 1 showed Japanese business sentiment improved in July-September from a 11-year low hit three months earlier, in a sign economic activity was gradually recovering, though it also remained deeply negative.The central bank will hold its first policy review since the release of those figures on Oct. 28-29.In the Reuters Tankan survey, a manager at a chemicals producer said conditions in the domestic market remained poor, while those in Asian markets were showing signs of a pickup in recovery.Private capital spending is stalling, a manager at a construction firm wrote in the survey.Manufacturers saw conditions recover to minus 17 in January, the survey showed, with machinery and transport equipment makers as well as processed food producers expecting conditions to stabilise or move close to stabilisation.Non-manufacturers especially expected the mood to approach stabilisation, with sentiment seen rising to minus 10 in January."}