{"text": "Japanese wholesale prices marked their first annual increase in more than a year in March, a sign that rising commodities costs are pinching corporate margins and adding inflationary pressure to the world's third-largest economy.Analysts, however, expect the impact on consumer inflation to remain more modest in Japan than in the United States, as soft wage growth and a slow vaccine rollout are seen weighing on household spending.That would add to reasons for the Bank of Japan (BOJ) to maintain its massive stimulus programme and meet a pledge to keep its money tab wide open until inflation exceeds 2% in a stable manner.\"Risks to Japan's prices remain skewed to the downside, which means monetary policy must stay ultra-loose,\" said a source familiar with the BOJ's thinking, a view echoed by another source.Japan's corporate goods price index (CGPI), which measures the price firms charge each other for their goods and services, rose 1.0% in March from a year earlier, BOJ data showed on Monday, marking the first rise in 13 months.The jump in wholesale prices, which was at the fastest pace since January 2020, exceeded a median market forecast for a 0.5% increase and followed a 0.6% fall in February.\"While there's still a lot of uncertainty on the outlook, global economic activity is picking up and keeping commodities prices high,\" said Kouta Fujiwara, an economist at NLI Research Institute.\"Given the base effect of last year's sharp fall, Japan's wholesale inflation may spike to around 3% from April,\" he said.Most of the gain in Japan's March wholesale prices was driven by a spike in non-ferrous metals and oil goods costs, highlighting how rising raw material costs were pinching firms.Compared with a month ago, wholesale prices soared 0.8% in March to mark the biggest gain since October 2019.\"The increase is driven mostly by recoveries in U.S. and Chinese economies, which are pushing up global commodities prices, rather than a rebound in domestic demand,\" said Shigeru Shimizu, the head of a BOJ division overseeing price moves.\"It's too early to say price levels have fully returned to pre-pandemic levels,\" he told a briefing.LOOSE POLICYGlobal recovery hopes and rising commodities costs have recently pushed up inflation in advanced economies, forcing some central banks to offer reassurances a brief uptick in prices won't trigger a withdrawal of stimulus.There is uncertainty on whether rising input costs would accelerate inflation in Japan, where companies had traditionally held off on price hikes and instead absorbed the costs by keeping wage low or streamlining operations.Japan's core consumer prices fell 0.4% in February from a year earlier, remaining distant from the BOJ's 2% target despite years of aggressive monetary easing. Under its current projections, the BOJ expects core consumer prices to rise 0.5% in the year that began in April and accelerate to 0.7% the following year.The wholesale price data will be among factors the BOJ will scrutinise when it conducts a quarterly review of its growth and price forecasts at its next interest rate review on April 26-27.While the BOJ may paint a rosier view of the economy than three months ago, it is unlikely to mark up its inflation forecasts much, analysts say.Japan's sticky deflationary mindset was among factors that drove the BOJ to conduct a review of its tools to make them sustainable enough to weather a prolonged battle to meet its price goal.  read more \"Japan continues to face an environment where inflation struggles to accelerate,\" BOJ Governor Haruhiko Kuroda said in a speech last month. \"It's taking time. But by keeping monetary policy loose, it's possible to achieve our price goal.\""}