{"text": "Japan will release more than 1 million tonnes of contaminated water from the destroyed Fukushima nuclear plant into the sea, the government said on Tuesday, a move China called extremely irresponsible, while South Korea summoned Tokyos ambassador in Seoul to protest.The first release of water will take place in about two years, giving plant operator Tokyo Electric Power (9501.T) time to begin filtering the water to remove harmful isotopes, build infrastructure and acquire regulatory approval.Japan has argued the water release is necessary to press ahead with the complex decommissioning of the plant after it was crippled by a 2011 earthquake and tsunami. It says similarly filtered water is routinely released from nuclear plants around the world.Nearly 1.3 million tonnes of contaminated water, or enough to fill about 500 Olympic-sized swimming pools, is stored in huge tanks at the plant at an annual cost of about 100 billion yen ($912.66 million) -- and space is running out. \"Releasing the ... treated water is an unavoidable task to decommission the Fukushima Dai-ichi Nuclear Power Plant and reconstruct the Fukushima area,\" Prime Minister Yoshihide Suga said of the process that will take decades to complete.The decision comes about three months ahead of the postponed Tokyo Olympic Games, with some events to be held as close as 60 km (35 miles) from the wrecked plant. Former Japanese Minister Shinzo Abe in 2013 assured the International Olympics Committee in pitching for the games that Fukushima \"will never do any damage to Tokyo.\"Tepco plans to filter the contaminated water to remove isotopes, leaving only tritium, a radioactive isotope of hydrogen hard to separate from water. Tepco will then dilute the water until tritium levels fall below regulatory limits, before pumping it into the ocean. Tritium is considered to be relatively harmless because it does not emit enough energy to penetrate human skin. Other nuclear plants around the world routinely pump water with low levels of the isotope into the ocean.The United States noted that Japan has worked closely with the International Atomic Energy Agency in its handling of the site.\"In this unique and challenging situation, Japan has weighed the options and effects, has been transparent about its decision, and appears to have adopted an approach in accordance with globally accepted nuclear safety standards,\" the U.S. Department of State said in a statement on its website.NEIGHBOURLY CONCERNJapans neighbours reacted strongly, however, with both China and South Korea calling for more consultation on the plan. \"This action is extremely irresponsible, and will seriously damage international public health and safety, and the vital interests of people in neighbouring countries,\" China's foreign ministry said in a statement on its website.South Korea's government summoned Japan's ambassador to Seoul to protest at the move.\"The decision can never be accepted and would not only cause danger to the safety and maritime environment of neighbouring countries,\" a senior official told a briefing after vice-ministers held an emergency meeting to discuss the issue.\"It was also made unilaterally without sufficient consultations with our country, which is the closest neighbour to Japan,\" Koo said.At a briefing in Tokyo later in the day a government official told reporters that Japan had consulted neighbours.Taiwan has also expressed concern.Fishing unions in Fukushima have urged the government for years not to release the water, arguing it would have a \"catastrophic impact\" on the industry. A Scientific American article reported in 2014 that when ingested tritium can raise cancer risks, while some experts are worried about other contaminants. The water currently contains significant amounts of harmful isotopes despite years of treatment, according to Tepco.\"My concern is about non-tritium radioactive contaminants that still remain in the tanks at high levels,\" said Ken Buesseler, a senior scientist at the Woods Hole Oceanographic Institution in Massachusetts.\"These other contaminants are all of greater health risk than tritium and accumulate more readily in seafood and sea floor sediments,\" added Buesseler, who has studied the waters around Fukushima.The Japanese government has been keen to stress the filtering and dilution processes. A senior government public affairs official emailed media outlets on Monday to request the term \"contaminated\" not be used in reporting, arguing it was misleading.Fishing communities and others suffering reputational harm from the release will be compensated, Tepco said."}