{"text": "An earthquake with a magnitude of 6.8, revised up from an earlier estimate of 6.6, jolted northeast Japan on Saturday, shaking buildings 400 kilometres away in Tokyo and raising the possibility of landslides closer to the epicentre.No tsunami alert was issued after the quake, which struck at 10.27 am Japan time (0127 GMT) off the coast of Miyagi prefecture at a depth of 51 kilometres (32 miles), the Japan Meteorological Agency (JMA) said. The JMA earlier estimated its depth at 60 kilometres.There were no reports of serious injuries caused by the quake, but the JMA warned of the potential for strong aftershocks for about a week, as well as the heightened risk of landslides.Tokyo Electric Power (9501.T) reported there were no issues at the devastated Fukushima Daiichi nuclear plant, wrecked by a massive earthquake and tsunami in northeast Japan in March 2011, and sited some 105 kilometres from the epicentre of Saturday's quake. Likewise it said there were no issues at the Fukushima Daini facility, just to the south of the wrecked plant.Closer to the epicentre, there were no issues at the Onagawa nuclear station, according to operator Tohoku Electric Power Co Inc (9506.T).Bullet train services throughout northern Japan were suspended for several hours, but had resumed by late afternoon.The coast off northeast Japan has been hit by multiple earthquakes in recent months, including a magnitude 7.2 quake in March and a similar sized one in February - both said by scientists to be aftershocks from the magnitude 9 quake a decade ago that ravaged Fukushima Daiichi and was one of the strongest temblors on record.Eneos Holdings Inc, (5020.T) Japan's biggest refining company, said its Sendai refinery, also located close to the epicentre, automatically shut down as the quake struck. Engineers were making checks after confirming there were no injuries, it said.The 145,000 barrels per day refinery had only restarted in April after being damaged by the February earthquake. That quake knocked out one fifth of Japan's refining capacity. "}