{"text": "WASHINGTON The twin surprises of weak jobs growth and strong inflation in April has not dented the U.S. central banks plans to keep its support for the economy wide open, Fed vice chair Richard Clarida said on Wednesday, adding it will still be some time before the economy is healed enough for that to change.The U.S. Labor Department on Wednesday reported that the consumer price index rose 4.2% in the 12 months through April. That was the largest gain since September 2008 and a number that Clarida said was well above what he had anticipated.Its the second time in a week Fed policymakers have had their expectations foiled on a major piece of economic data: the economy added just 266,000 jobs in April, about one quarter the gain expected by Fed officials and many economists.In remarks to a National Association of Business Economics symposium, Clarida called it the biggest miss in history.He said, however, that he still anticipates the rise in prices will prove temporary, while the weak employment report makes the pace of the jobs recovery more uncertain and proves the wisdom of keeping monetary policy loose.We would not hesitate to act to bring inflation down, if needed, Clarida said. But this is one data point, as was the labor report ... We have been saying for some time that reopening the economy would put some upward pressure on prices.The collision of higher inflation and weaker job growth has echoes of the damaging stagflation of the 1970s, potentially the worst of both worlds for a central bank charged with maintaining both high levels of employment and stable prices.It is also stoking debate over whether ongoing pandemic aid programs are out of step with the economys current condition. That issue has prompted several Republican governors to say they will stop an enhanced federal unemployment benefit because they feel it is encouraging people not to work. Members of the Biden administration say fears of the pandemic and practical issues like child care are the factors keeping people from taking jobs.The White House and the Fed are keeping close watch on the details -- and it could be a headache for both in the months to come.Republican officials jumped on the inflation report to blame the Biden administration for funneling too much stimulus into an economy that would, they say, be recovering on its own. Atlanta Fed president Raphael Bostic meanwhile said it may not be until the fall before it is clear whats happening.For the next four or five months there is going to be a lot of noise, both on prices and the pace at which workers return to a potentially changed job market, Bostic said.For the central bank, the fact that market and household expectations about future inflation have so far moved to its 2% target - as hoped - but not far above it lends confidence that rising prices will not persist.Graphic: Fed inflation expectations index,https://graphics.reuters.com/USA-FED/EXPECTATIONS/xklvywnxyvg/chart.pngStill, market and economic analysts have begun to question whether the Fed is falling behind an inflation cycle that may be developing precisely because workers are reluctant to return to jobs even as a demand surge and supply bottlenecks push prices higher.The question is how quickly that gets resolved in the midst of what Clarida said was a rebalancing of U.S. labor markets and possible mismatches between the jobs being demanded by companies and what workers are willing to do.Based on inflation alone, the Fed might be planning its first rate hike around now but apparently this wont happen for some time, said John Leiper, chief investment officer at Tavistock Wealth. (Fed Chair Jerome) Powell is running the Fed like hes a football manager going into extra time ... But he hasnt heard the final whistle.Stocks on Wall Street fell and bond yields rose after the data on Wednesday. Interest rate futures traders renewed bets the Fed could start raising rates by the end of 2022.The breakeven rate on 10-year Treasury Inflation-Protected Securities (TIPS) rose to 2.58%, the highest level since early 2013.Graphic: U.S. inflation gauges,https://graphics.reuters.com/USA-STOCKS/yzdvxzqdrvx/inflation.pngNECESSARY REBALANCINGFrances Donald, global chief economist with Manulife Investment Management in Toronto, said it wont be until this summer until there is a clear signal on whether higher inflation will persist.This inflationary pressure in April is not driven by broad-based inflationary pressure, Donald said, but rather by comparison to the weak prices seen at the start of the pandemic last spring.The Fed certainly expects it to abate, allowing it to maintain policies it hopes encourages higher levels of employment.At the recent current pace of job growth, Clarida noted, it would be August of 2022 before the United States returns to its pre-pandemic level of jobs, even as the level of overall output likely gets back to that level this year.Graphic: Jobs lagging GDP,https://graphics.reuters.com/USA-FED/JOBGROWTH/rlgpdyjlevo/chart.pngIn the meantime, we are committed to using our full range of tools to support the economy for as long as it takes until the job is well and truly done, Clarida said of reaching maximum employment, adding it would be some time before employment is recovered fully enough for the Fed to consider paring back its $120 billion in monthly bond purchases.The Fed has said any move to raise its near-zero benchmark overnight interest rate would come even later.While the recovery of overall output is expected to pick up steam this year, Clarida said, the near-term outlook for the labor market appears to be more uncertain.What this necessary rebalancing of labor supply and demand means for wage and price dynamics will depend importantly on the pace of recovery in labor force participation as well as the extent to which there are post-pandemic mismatches between labor demand and supply in specific sectors of the economy and how long any such imbalances persist, Clarida said."}