{"text": "LONDON World heavyweight champion Anthony Joshua produced a devastating finish to knock out Bulgarian Kubrat Pulev near the end of the ninth round to retain his IBF, WBO and WBA belts at Wembley Arena on Saturday.The 31-year-old Briton had looked close to winning when he floored Pulev in the third round but the challenger recovered to test the home favourite in front of a limited crowd of 1,000.But there was no escape for the challenger in the ninth round as Joshua landed a clubbing right upper-cut which sent Pulev to the canvas. The 39-year-old got up but Joshua connected with another straight right hand to end the contest.The champions 24th win from 25 professional fights sets up the prospect of a mouth-watering unification clash next year with fellow Briton Tyson Fury who holds the WBC belt.I stuck to what I know best, looking at where Im going to put my shots, Joshua said at ringside. When they are successful they are successful. Its less talk and more action.Asked about fighting Fury, Joshua put the question to the audience: Who wants to see Anthony Joshua fight Tyson Fury in 2021, he said, to which the crowd roared their approval.The 32-year-old Fury, whose brother Hughie was fighting on the undercard, was quick to respond on Twitter.I want the fight, I want the fight next, Ill knock him out inside three rounds, he said.Joshuas promoter Eddie Hearn was eager to get the pair together, saying: Starting from tomorrow, we make the Tyson Fury fight straight away. Its the only fight to be made in boxing. It is the biggest fight in British boxing history.FASCINATING FIGHTThe Joshua-Pulev fight, which was originally scheduled for the Tottenham Hotspur Football Stadium in June but postponed due to the COVID-19 pandemic, was fascinating, if not a classic.Pulevs only defeat in his previous 29 contests came in 2014 against Wladimir Klitschko and the gritty Bulgarian proved a worthy challenger for Joshuas belts.After a cagey opening round, Joshua unleashed a powerful combination in the second, which was greeted with a smirk by Pulev. There was no smiling from the Bulgarian in the third round though as he walked onto a right upper cut.Joshua looked one punch away from finishing it but Pulev somehow survived an onslaught to make it to the bell.Pulev regained his poise in the fourth, however, and Joshua looked slightly hesitant, despite his superior firepower.Joshua was caught by a couple of rights in the fifth but by the time the ninth began he had won every round.Still, it was going to take something special to stop Pulev and that moment arrived near the end of the ninth as Joshua produced a devastating finish to a fight that was a potential tricky hurdle to a Battle of Britain showdown with Fury."}