{"text": "A federal judge on Wednesday rejected Citigroup Inc's (C.N) request to extend a freeze on about $504 million it accidentally sent a group of Revlon Inc (REV.N) lenders, while it appeals his decision that they can keep the money.U.S. District Judge Jesse Furman in Manhattan said it was \"tempting\" to extend the freeze, given the large dollar amount and the bank's argument that lenders should \"do the right thing\" rather than enjoy a windfall from its unprecedented mistake.But he said an appeal would face an \"uphill battle\" and Citigroup had not demonstrated irreparable harm absent a freeze.\"Armed with a final judgment in their favor, defendants and their clients are entitled to use the money without interference,\" he wrote.Furman gave Citigroup seven days to appeal, and said if it did the defendants must wait for a ruling before using the money.The dispute arose after Citigroup, acting as Revlon's loan agent, accidentally used its own money last August to repay an $894 million loan for the cosmetics company that was not due until 2023, when it intended to make a small interest payment.Citigroup sought the extended freeze after Furman ruled on Feb. 16 that 10 asset managers, whose clients include the Revlon lenders, did not have to return the $504 million.  read more \"We disagree with the district court's decision and will file an expedited motion with the court of appeals to ensure the funds are preserved,\" Citigroup said in a statement.The asset managers, including Brigade Capital Management, HPS Investment Partners and Symphony Asset Management, have said they had no reason to believe the \"sophisticated\" New York bank would blunder so badly.Their lawyer Adam Abensohn was pleased with Furman's decision, saying Revlon's lenders \"received what they were owed\" and under binding New York law could keep it.Citigroup had argued that ending the freeze would convert its secured interest in the disputed funds into an unsecured interest, and could force it to bring dozens of lawsuits against individual lenders.Furman's Feb. 16 decision led Citigroup to lower previously-reported fourth-quarter profit.  read more The case is In re Citibank August 11, 2020 Wire Transfers, U.S. District Court, Southern District of New York, No. 20-06539."}