{"text": "June 12 A Kansas regulatory commission has disclosed that it is considering an investigation into whether power utility Evergy Incs agreement with hedge fund Elliott Management could end up costing consumers.The accord with Elliott established a committee within Evergys board of directors that is exploring whether the company should be sold or implement a significant cost-cutting program. The committee is due to make a recommendation to the companys board by July 30.Kansas Corporation Commission (KCC) staff petitioned the utility regulator to launch a probe into Evergys ability to provide efficient service at just and reasonable rates as a result of any transaction the company pursues, according to a Thursday filing.A commission spokeswoman said on Friday the regulators leadership will decide on the staffs request as early as next week.Staff is very concerned that Elliotts focus on increasing shareholder value will place Evergys customers at a high risk of paying higher rates or receiving lower quality service in order to support an increase in shareholder value, the KCC filing said, laying out questions it wants Evergys management to answer.Evergy serves 1.6 million customers in Kansas and Missouri. Its stock was flat on Friday, giving it a market capitalization of $13.8 billion.An Evergy spokeswoman said the company was reviewing the KCC filing and agreed on the importance of a robust and transparent process allowing input from all stakeholders.Elliott declined to comment.Should the KCC launch a probe, it would mark the second major intervention in the companys dealmaking in recent years.Evergys creation followed a two-year regulatory battle. First announced in 2016 as Great Plains Energy buying Westar Energy for $8.6 billion, the transaction was restructured as a merger-of-equals after the KCC objected to how a Great Plains purchase would impact the combined companys finances and customer bills. (Reporting by David French in New York and Svea Herbst-Bayliss in Boston; Editing by Will Dunham)"}