{"text": "WASHINGTON Entertainer and Trump supporter Kanye West recently met with White House adviser and the presidents son-in-law Jared Kushner, a source familiar with the meeting said on Wednesday as the entertainer pursues his efforts to appear on the presidential ballot this November.The New York Times, which first reported the meeting, said it took place in Colorado last weekend and also included President Donald Trumps daughter Ivanka, Kushners wife and another top White House adviser.West appeared to confirm the meeting in a tweet late Tuesday night, saying they discussed a book on empowering Black Americans, and he offered to do a live interview with the Times.Representatives for West could also not be immediately reached.A rapper and clothier, West announced his last-minute presidential campaign last month, followed by a series of rambling public remarks that have raised questions about his intentions and his mental health.West has been open about his struggle with bi-polar disorder, and his wife, Kim Kardashian has asked the public and media to grant him compassion.Wests appearance as an independent on the ballot could possibly disrupt the race between Trump, a Republican who is seeking re-election, and former Democratic Vice President Joe Biden if he were able to garner any votes in U.S. states where the contest is close.The Washington Post last week reported that Wests campaign has so far filed petitions to appear on the presidential election ballot in 10 U.S. states and that Republican operatives, including some with ties to Trump, were involved in efforts to support his candidacy in at least five of them, including Arkansas, Ohio and Wisconsin.Trump on Tuesday told syndicated radio host Hugh Hewitt that he had not talked with West about the entertainers campaign. Representatives for Trumps campaign could not be immediately reached but told the Post they were not involved.West, 43, one of the biggest celebrity and most prominent Black supporters of the president, met with Trump during the 2016 presidential race and again in 2018 at the White House wearing a red Make America Great cap. Last month, he told Forbes that he was taking the red hat off.Trump told Fox News last month that West cant drop his support, adding: Hes always going to be for us."}