{"text": "Kentucky walk-on basketball player Ben Jordan has died at age 22.His death Monday night was confirmed by the university. The cause of death was not announced.Jordan, from Olive Hill, Ky., primarily was a baseball player at Kentucky. But the 6-foot-9, 250-pound athlete, who also played hoops in high school, walked on with the Wildcats basketball team last season when the squad needed more post players for practice.He appeared briefly in three games -- he played just one total minute -- and didn't score. But he made a lasting impression on coach John Calipari.\"Our hearts are broken today,\" Calipari said in a statement. \"It is difficult for me to express and to put into words what a tragedy it is to lose a young person too early. Ben impacted our team last season in so many ways with his kind heart, his big smile and his wonderful personality.\"He cared so deeply about this place and it meant so much to him to be a part of this team. We are grieving today over the loss of a teammate and a brother, but Ben will not be forgotten.\"Jordan gave up basketball this season to concentrate on baseball. He was rated the No. 97 overall prospect and No. 33 right-handed pitcher in the high school Class of 2017.At West Carter High School, he was an all-area selection in both baseball and basketball in three seasons. When he graduated, he was the school's all-time leading rebounder and shot blocker and ranked eighth all-time in points.A right-handed pitcher, Jordan redshirted the 2018 season at Kentucky while recovering from an injury. In 2019, he threw 8 2/3 innings over 10 games, allowing eight hits and seven runs while striking out eight.\"There are no words to express the shock and heartache our team is feeling with the loss of Ben. He was an absolute joy to coach and be around,\" Wildcats baseball coach Nick Mingione said. \"His coaches, teammates and brothers loved him dearly. His smile, his sense of humor and love for this university will never be forgotten. He will be missed beyond measure.\"--Field Level Media"}