{"text": "A U.S. appeals court said a man who created a mayonnaise-ketchup blend he called \"Metchup\" cannot sue Kraft Heinz Co (KHC.O) for selling a similar condiment called \"Mayochup,\" but ordered reconsideration of whether to cancel his trademark registration.The 5th U.S. Circuit Court of Appeals said there was little chance consumers would confuse Mayochup, sold in groceries nationwide under the Heinz brand, with Metchup, sold in the lobby of Dennis Perry's nine-room Star Motel in Lacombe, Louisiana, next to his used-car lot.But the three-judge court said Kraft Heinz had not met its \"heavy burden\" to show Perry abandoned his Metchup trademark, citing Perry's testimony that he hoped to improve Metchup's packaging and sell millions of bottles.Perry's efforts could be \"seen as a foundering business venture rather than a trademark trap,\" Circuit Judge James Graves wrote.Metchup blended Walmart-branded mayonnaise and ketchup, or mustard and ketchup, depending on the batch. Perry produced 60 bottles and sold at least 34.Perry's lawyer Brad Harrigan said he was pleased with the partial reversal, but \"understandably confused\" about how \"Mayochup\" might not be confused with \"Metchup.\"Kraft Heinz spokesman Michael Mullen said the company was pleased Perry's complaint had been dismissed. The appeals court returned the case to a New Orleans federal judge.Perry sued Kraft Heinz following the September 2018 U.S. launch of Mayochup, after learning the Chicago-based company used a mock-up \"Metchup\" bottle in an internet campaign to name its new condiment.Fans submitted at least 95 names including \"Metchup,\" \"Best Sauce Ever,\" \"Saucy McSauceFace\" and \"It's Fry Sauce You Monsters,\" while Kraft Heinz's marketing team proposed \"Ketchonnaise\" and \"Tomayo.\" Kraft Heinz never used these names.Mayochup was an effort to reinvigorate Kraft Heinz's product portfolio, which includes Oscar Mayer and Jell-O, as more consumers turn to healthier and less-processed products.Recent results have improved as the COVID-19 pandemic caused people to buy more packaged foods. Warren Buffett's Berkshire Hathaway Inc (BRKa.N) owns 26.6% of Kraft Heinz.The case is Perry v H.J. Heinz Co Brands Inc et al, 5th U.S. Circuit Court of Appeals, No. 20-30418."}