{"text": "French Open champion Barbora Krejcikova was at Jana Novotna's bedside as the 1998 Wimbledon champion lay terminally ill and it was fitting that the Czech's first thoughts were for her former mentor before lifting the Suzanne Lenglen Cup on Saturday.The world number 33 beat Russian Anastasia Pavlyuchenkova, who is ranked one place higher, 6-1 2-6 6-4 to claim her maiden singles Grand Slam title at Roland Garros.  read more Speaking of Novotna, who died in 2017 aged 49, Krejcikova said: \"We just had a really special bond and when I found out that she was sick and when... like later on I found out it's not going to end up really well... I just felt at the end of her life I have to be there. I just have to really support her.\"Even when I knew it was going to be really bad, I wasn't really handling the situation well. My parents just were telling me not to go, because they've seen how it's actually ruining me. But I just felt like I have to go and I have to support her.\"I just felt that if I'm going to go through this process and I'm going to just help her and support her, it's going to give me a lot of strength. Then I'm going to appreciate a lot of things more,\" the 25-year-old added.Novotna took Krejcikova under her wing in 2014 and while the youngster \"never tried to imitate\" her, the 2018 French Open and Wimbledon doubles champion drew inspiration from her mentor.\"I also think that she was also happy that I was there. That's why she's looking after me right now,\" added Krejcikova, who had never got past the second round in a singles Grand Slam before.\"That's actually why I have this many Grand Slams, because she's just from somewhere above looking after me. She wants me to win. She knows what it means to me, and I know what it would mean to her.\"Krejcikova swore she would not change, because Novotna taught her to be humble.\"She always told me, like, it doesn't matter how many titles you're going to win, you always have to come and say hello, please, and thank you. It's very important to behave very nice,\" she explained.\"I take all of this and I really appreciate it because that's what she was actually doing. She was a great athlete. She was still very humble. She was a big role model. I just want to be the same as she was.\""}