{"text": "MOSCOW Jailed Kremlin critic Alexei Navalny on Friday appeared in court on slander charges he denounced as politically motivated amid mounting tensions between Russia and the West over his treatment.Navalny, President Vladimir Putins most prominent critic, was jailed last week for almost three years for parole violations he said were trumped up. The West has condemned the case and is discussing possible sanctions on Russia.Russian Foreign Minister Sergei Lavrov said earlier on Friday that Moscow was ready to sever ties with the European Union if the bloc hit it with painful economic sanctions. Moscow has accused the West of hysteria over the case.Navalny paced around inside a glass cage nicknamed the aquarium in the Moscow courtroom, railed against the slander case in several heated exchanges with the judge, and at one point told her she didnt know the law and needed legal courses.The judge reprimanded the 44-year-old lawyer at least 15 times and threatened to have him removed from the hearing.Navalny stands accused of defaming a World War Two veteran who took part in a promotional video backing constitutional reforms last year that let Putin run for two more terms in the Kremlin after 2024 if he wants.Navalny described the people in the video as traitors and corrupt lackeys. He accuses authorities of using the slander charges to smear his reputation and said his comment was not specifically directed against the veteran in question.At the hearing, the grandson of the veteran, who is in his 90s, asked Navalny for a public apology, prompting Navalny to refuse, saying the veteran was being exploited for political ends.Everyones grandfather here fought in the war! But youre the only one whos pimping him out, Navalny said.Although the charge, if proven, is punishable by up to two years in jail, his lawyer has said that Navalny cannot face a custodial sentence because the alleged crime was committed before the law was changed to make it a jailable offence.It remains unclear whether the judge in the case agrees with that analysis. News agency RAPSI cited a lawyer as saying he could face up to a 30-day jail sentence.Security at Fridays court hearing was heavy. Police and state bailiffs wearing body armour and carrying weapons were deployed inside the court and around it and the state prosecutor arrived for the hearing with three bodyguards.Navalnys arrest and jailing has sparked nationwide street protests in Russia.His allies plan to stage a new kind of protest on Sunday and are urging his followers to gather for 15 minutes in residential courtyards across the country, shining their mobile phone torches and lighting candles."}