{"text": "TOKYO Bank of Japan Governor Haruhiko Kuroda stressed on Monday his readiness to take additional monetary easing steps, saying the central bank had not run out of tools to cushion the economic blow from the COVID-19 pandemic.Kuroda said Japans economy had hit the bottom in April-June and that the general picture looked much better than a few months ago, with exports, output and capital expenditure fairly robust.But consumption, particularly for services, was quite weak and likely to stay so for some time, unless the world gets hold of an effective vaccine to contain COVID-19, he added.We will closely monitor the impact of COVID-19 and not hesitate to take additional easing measures as necessary, Kuroda told an online seminar hosted by the Institute of International Finance.The BOJ hasnt run out of policy tools. We have a lot of policy tools to counter (the damage from COVID-19). We are flexible, innovative when considering measures to take.Japan suffered its biggest economic slump on record in the second quarter as the pandemic crippled demand. Analysts expect any rebound to remain modest as fears of a big second wave of infections weigh on consumption.Kuroda said Japans inflation rate would likely remain negative for some time as COVID-19 suppressed consumer demand considerably. But he added that prices would likely rebound next year as the economy recovered.He defended the BOJs negative interest rate policy, saying the -0.1% rate was imposed on only a limited portion of commercial banks reserves parked with the central bank.Under a policy dubbed yield-curve control, the BOJ guides short-term interest rates at -0.1% and 10-year Japanese government bond (JGB) yields at around zero.We maintain 10-year JGB yields around zero. But at the same time, 20-, 30-, 40-year JGB yields are quite positive, Kuroda said. We have been allowing longer-term interest rates to move in a positive range. That would certainly help pension funds, life insurance companies and institutional investors.The BOJ has eased monetary policy twice this year, mainly by boosting asset-buying and pumping money into the economy with a new lending facility.Many analysts say the central bank has effectively exhausted its policy options, with short-term interest rates already in negative territory and hitting financial institutions margin."}