{"text": "Merck KGaA (MRCG.DE) on Wednesday said that U.S. regulations that give priority to U.S. government contracts to purchase COVID-19 vaccines are a challenge as it seeks to meet soaring demand for its lab equipment and supplies across the globe.\"We are actively expanding our capacity to be able to supply this unprecedented and ever increasing demand. Is this being a challenge? Obviously it is being a challenge,\" Chief Executive Belen Garijo said in a media briefing when asked what impact the U.S. Defense Production Act is having on its ability to serve vaccine makers elsewhere in the world.She said U.S. law required that a preference be given to so-called rated state orders for COVID-19 programmes over any other orders.\"For us, all our customers and all the other COVID-19 programmes are very crucial and we are making capacity expansion a top priority of our agenda,\" she said, pointing to investment projects both in the United States and Europe.Under the U.S. priority access programme, the government has laid claim not only to finished COVID-19 vaccines but also to vaccine components and equipment. read more Germany's CureVac (5CV.DE), which is gearing up to publish results of a COVID-19 vaccine trial, said last week that U.S. export restrictions on already tight supplies of materials were making it impossible to predict its short-term production ramp-up in Europe. read more Merck in March unveiled plans to invest 25 million euros ($29.9 million) to make disposable plastic materials for bioreactors in France, an essential input for COVID-19 vaccine manufacturing.  read more The new site, Merck's first such facility in Europe, will likely come on stream at the end of this year, Garijo reiterated on Wednesday.Merck in December announced a combined $47 million investment at U.S. production facilities in Massachusetts and New Hampshire, also to produce supplies for makers of COVID-19 vaccines and therapies.Merck, which competes in lab equipment with Thermo Fisher (TMO.N) and Sartorius (SATG.DE), has another site for single-use plastic bags for bioreactors in Wuxi, China."}