{"text": "LONDON, May 12 (Thomson Reuters Foundation) - A Maltese lawmaker made history on Wednesday by calling for the decriminalisation of abortion in the Mediterranean island, which has one of the worlds strictest bans.In the first such move to amend the countrys tough abortion laws, independent MP Marlene Farrugia presented a bill which would remove criminal sanctions for women who seek terminations.Its a historic moment, said Lara Dimitrijevic, a lawyer and director of the Womens Rights Foundation which campaigns on abortion rights in Malta.It is not legalising abortion, but it is a very important first step.Malta is one of five countries in the world that outlaw abortion in all circumstances, even when a womans life is at risk. The others are El Salvador, Nicaragua, Dominican Republic and Vatican City.Procuring an abortion, or helping someone to do so, is punishable by up to three years in jail under Maltas criminal code.A doctor carrying out a termination faces up to four years in prison and a permanent ban on practising medicine.Abortion opponents in the Catholic country say life begins at conception. But campaigners say the law does not stop women having terminations and Malta must stop criminalising them.The online newspaper MaltaToday described the bill as a bolt from the blue, adding Farrugia was not known as a pro-choice politician.Dimitrijevic said the surprise bill had immediately sparked a huge outpouring of support on social media and many people had started gathering outside parliament.There is no date for when the bill will be debated in parliament.Although prosecutions are rare, campaigners say the law impacts womens health and creates a climate of fear and silence.Abortion has long been a taboo issue in Malta, but attitudes are becoming more liberal in the country, which has legalised same-sex marriage and banned gay conversion therapy.Social attitudes are changing, particularly among the young, and the Catholic Church does not have the influence it once had, Dimitrijevic said.Campaigners estimate 300 to 500 women in Malta seek abortions every year. Many buy pills online while others travel overseas for terminations, mostly to Britain and Italy.With the COVID-19 lockdown preventing most travel, Dimitrijevic said more women had resorted to buying abortion pills online, which can be dangerous if they need medical support and leaves them open to prosecution.Women on Web, a Canadian organisation providing abortion pills by post following online consultations, said it shipped 220 sets of pills to Malta last year.About 60 women a year travel from Malta to Britain for an abortion, according to UK government data.Others pay about 2,000 to 3,000 euros ($2,400 to $3,620) for an abortion in the Italian island of Sicily, to its north, via a tour guide who takes them to a clinic after meeting them off the ferry or plane, according to campaigners.They say such abortions are probably illegal under Italian law, which states terminations can only be performed in public hospitals. ($1 = 0.8287 euros) (Reporting by Emma Batha @emmabatha; Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, which covers the lives of people around the world who struggle to live freely or fairly. Visit news.trust.org)"}