{"text": "Thousands of law students and lawyers are calling for the disbarment of two Republican senators, outraged by their efforts last week to block Congress certification of Democratic President Joe Bidens election victory.A petition circulating on the internet, which organizers said had amassed more than 9,000 signatures as of Monday night, called on lawyer-licensing authorities in Missouri, Texas, and the District of Columbia to disbar Republican Senators Josh Hawley of Missouri and Ted Cruz of Texas.Representatives for the senators offices did not respond to requests for comment.According to the petition, Hawley and Cruz helped foment the events of January 6, when thousands of followers of President Donald Trump mobbed the Capitol as Congress met to certify his defeat to Democrat Joe Biden. Crowds breached the building, forced the evacuation of both chambers, and left a police officer and four others dead in their wake.The senators actions violated the states and the District of Columbias versions of the American Bar Association Model Rules of Professional Responsibility, which govern lawyers conduct, the petition asserts. Hawley is a member of the bar in Missouri, Cruz is a member in Texas, and both are members of the District of Columbia bar.Experts say that most states ethics rules are not limited to lawyers conduct solely when practicing law. Missouri, Texas, and the District of Columbia prohibit lawyers from any conduct involving dishonesty, fraud, deceit, or misrepresentations, which the petition alleges the senators committed by repeating false claims about voter fraud. Missouri prohibits conduct that is prejudicial to the administration of justice, while the District of Columbia bars conduct that seriously interferes with the administration of justice, and Texas prohibits conduct that constitutes the obstruction of justice.Richard Painter, former chief ethics lawyer in Republican President George W. Bushs White House, who signed the petition Sunday, said the speech-and-debate clause of the U.S. Constitution will protect members of Congress from liability for comments they make on the floor of the House of Representatives or Senate. But that immunity generally will not shield statements made elsewhere such as in the media, including on social media, making some of the members possibly vulnerable to ethics charges, said Painter, a law professor at the University of Minnesota.Besides Cruz and Hawley, 27 other members of Congress, who are also lawyers, voted for formal objections to certification of the electoral votes in Arizona and Pennsylvania.To see a list of the lawyers who objected, click here.Of 99 senators who voted on the Arizona certification, six opposed it, including three lawyers. Of 99 who voted in the Senate on the Pennsylvania certification, seven opposed it, again including three lawyers. Cruz and Hawley opposed certification as to both states.Meanwhile in the House, 121 members voted to oppose certification of the Arizona results, including 22 lawyers. And 138 House members voted to block the Pennsylvania results, including 25 lawyers.Reuters identified the lawyers in Congress by using profiles compiled by CQ Roll Call.Depending on what other actions they took aside from floor votes, these members of Congress could be vulnerable to ethics complaints, according to Painter.Michael Downey, a legal ethics lawyer and author in St. Louis, says he doubts any state ethics authority will pursue discipline against the members of Congress given the speech-and-debate clause and First Amendment concerns, but says the administration-of-justice violation is a strong allegation.At some point, we have to say that if youre making statements that undermine the legitimacy of our government, then youre making statements that undermine the administration of justice, Downey said.The petition was started by law students Yale Law School, Hawleys alma mater. Prominent signers include former U.S. Senator Russ Feingold, a Democrat from Wisconsin, Harvard Law School Professors Laurence Tribe and Michael Klarman, retired U.S. Court of Appeals judge H. Lee Sarokin, and civil rights activist Valarie Kaur.Editors Note: This story has been corrected to reflect that Painter signed the petition and that the petition was started solely by students at Yale Law School."}