{"text": "The two lead lawyers for Lisa Montgomery, the only woman on federal death row, asked a U.S. judge on Thursday to delay Montgomerys execution next month because they have contracted COVID-19 after traveling to meet with her to prepare her clemency petition.The lawyers, Kelley Henry and Amy Harwell, are both too sick to meet the deadline set for this Sunday to file Montgomerys clemency petition, and the Department of Justice has denied their request for an extension, according to the complaint filed in the U.S. District Court in Washington.The complaint says the Justice Department is denying Montgomerys right to counsel and her constitutional right to due process, and that Attorney General William Barr was reckless to schedule executions during a pandemic.A department spokeswoman declined to comment, but provided a copy of an email sent by the departments Office of the Pardon Attorney to Montgomerys lawyers saying it had no power to reprieve an execution date but would extend the clemency deadline by a day if the lawyers wanted to file a placeholder petition.The Justice Department announced in October that it would execute Montgomery on Dec. 8, the first time the federal government has executed a woman since 1953. The Trump administration has already carried out seven executions since reviving the punishment at the federal level this year after a 17-year hiatus.Montgomery was convicted in 2007 in Missouri for kidnapping and strangling Bobbie Jo Stinnett, who was eight months pregnant when she was killed. Montgomery butchered Stinnett to cut the fetus from her womb. The child survived.Montgomerys lawyers say she has long suffered severe mental illness, exacerbated by being repeatedly gang raped by her stepfather and his friends during an abusive childhood.Her lawyers say her mental health has noticeably deteriorated since she learned of her execution date, and that they intended to cite this as part of the basis for her clemency petition to President Donald Trump.Montgomery is at the Federal Medical Center in Carswell, Texas, a prison for inmates with mental illness. Texas is grappling with one of the worst coronavirus outbreaks in the country, reporting hundreds of thousands of new cases within a single week.The two lawyers developed COVID-19 symptoms within days of their most recent flight from Tennessee to Texas to visit Montgomery, and both are now virtually bed-ridden with debilitating fatigue, the complaint says.This week, 41 current and former prosecutors wrote to Trump asking him to reduce Montgomerys sentence to life in prison.Although Lisa committed terrible crimes, her lifetime of extreme suffering and abuse weighs heavily in favor of clemency, the letter said.(This story was refiled to add title and first name of President Donald Trump in paragraph 8)"}