{"text": "SHANGHAI Chinas move to cool a rising yuan stands little chance of stopping further gains, international banks say, as the strength of the worlds second-biggest economy and a near-record yield advantage drive big and steady inflows.Over the weekend, the Peoples Bank of China (PBOC) scrapped a requirement for banks to hold a reserve of yuan forward contracts, removing a guard against depreciation and sending the currency down 1% for its steepest drop since March.However, an identical move three years ago ultimately proved ineffective and investors say the conditions this time are even more likely to buoy the yuan, perhaps as far as 6.50 per dollar.In all previous instances, the impact of the regulatory change was temporary, said Eugenia Victorino, head of Asia strategy at Swedish bank SEB in Singapore.We continue to expect the yuan to remain on an appreciation trend, with USD/CNY approaching 6.60 by end-2021, she said.Goldman Sachs forecasts the yuan, last quoted at 6.7450, will hit 6.50 per dollar in 12 months.Much as in 2017, the PBOCs move follows a long spell of appreciation. The yuan has strengthened more than 6% since late May and just closed its best quarter in a dozen years as China leads the world out of the coronavirus pandemic and soaks up capital flows.Foreign holdings of Chinese government debt rose at the fastest pace in more than two years last month, with the spread between Chinese and U.S. 10-year government bond yields holding near record peaks scaled in July.In another nudge for the yuan to weaken, Beijing granted $3.4 billion in outbound investment quotas last month, the first fresh permission for such flows since April 2019.Yet analysts say Chinas economy - projected to keep growing as the rest of the world shrinks - could attract enough capital to fuel a self-perpetuating yuan rise.Macquarie Banks head of China economics, Larry Hu, suggested continued bond market inflows combined with limited unaccounted for outflows could keep lifting the currency and in turn draw more inflows.The million-dollar question now is whether the latest surge in the CNY marks the tipping point. Maybe, but no one knows for sure, he wrote in a note."}