{"text": "BEIRUT Germanys foreign minister said on Wednesday that Lebanon needed a government able to fight corruption and enact reforms as he toured Beirut port, scene of the devastating explosion that has kindled protests and led the government to resign.The Aug. 4 blast at a warehouse storing highly explosive material killed at least 172 people, injured some 6,000, left around 300,000 without habitable housing and wrecked swathes of the Mediterranean city, compounding a deep economic and financial crisis.It is impossible that things go on as before, Foreign Minister Heiko Maas said. The international community is ready to invest but needs securities for these investments. It is important to have a government that fights the corruption.Many in Europe have a lot of interest for this country. They want to know that there are economic reforms and good governance, Maas added.The resignation of Prime Minister Hassan Diabs government has deepened uncertainty. His cabinets talks with the International Monetary Fund for a bailout had already stalled over internal differences about the scale of financial losses.Forming a new government could be daunting amid factional rifts and growing public discontent with a ruling class that many Lebanese brand as responsible for the countrys woes.The foreign ministers of Russia and Saudi Arabia agreed on Wednesday on the importance of creating beneficial external conditions for the formation of a new Lebanese government, the Russian foreign ministry said.Humanitarian aid has poured in but foreign countries have made clear they will not provide funds to help pull Lebanon from economic collapse without action on long-demanded reforms to tackle systemic graft, waste, mismanagement and negligence.INVESTIGATIONSome 30-40 people are still missing more than a week after the blast. The Lebanese army said on Wednesday that rescue teams pulled another body from the wreckage of a silo in the port.Aoun has promised a swift investigation into the detonation of what authorities say was more than 2,000 tonnes of ammonium nitrate stored at the port for years without safety measures.Reuters reported that the president and prime minister were warned in July about the warehoused ammonium nitrate, according to documents and senior security sources.The presidency said on Wednesday that as soon as Aoun received a state security report on the ammonium nitrate on July 20, the presidents military consultant instructed the secretary general of the Supreme Defence Council to do the necessary.He later tweeted estimated losses from the blast exceed $15 billion, a bill Lebanon cannot pay given its financial crisis.Sitting amid the debris, Lebanese said the state had abandoned them.Who knows what will happen. How will we get back to business? said Antoinne Matta, 74, whose safe and lock store was heavily damaged by the blast. Five employees were wounded.A donor conference raised pledges of nearly 253 million euros ($298 million) for immediate relief. Maas gave a cheque for more than 1 million euros to the Lebanese Red Cross, part of 20 million euros in humanitarian aid from Germany.EVERYTHING IS GONEThe central bank has instructed local banks to extend interest-free dollar loans to individuals and businesses for essential repairs, and said it would in turn provide those financial institutions with the funding.Bandali Gharabi, whose photo studio was destroyed, said local authorities had only given him a compensation sheet to fill out. Everything is gone, he said. I just want someone to rebuild my shop.Volunteers and construction workers with bulldozers were still clearing wreckage from neighbourhoods, where rows of cars were flattened.Nagy Massoud, 70, was sitting on the balcony when the blast gutted his apartment. His pension is frozen in a bank account he cannot access due to controls prompted by the economic crisis.Where is the government? he said, looking around his shattered apartment."}