{"text": "The agreed deal reverses Sunrises failed bid to buy Libertys Swiss business last year and marks a strategic reversal by the U.S. company which has been divesting European assets.The all-cash 6.8 billion Swiss franc ($7.43 billion) deal will see Liberty Global, set up by U.S. cable pioneer John Malone, pay 110 francs per share for Switzerlands No. 2 telecoms company, a 32% premium to the companys average share price over the past 60 days.Sunrise shares rose by more than a quarter to just below the offer price in early trade on Wednesday.On Wednesday Freenet, which owns 24% of Sunrise, committed to tender its shares for Liberty Globals bid.Its a fair valuation, Freenet CEO Christoph Vilanek told Reuters. We believe that a merger on sensible terms makes sense.The deal, which is subject to regulatory approval, is the latest sign of consolidation in the telecom industry as companies try to cut costs and ramp up investments in technology.Liberty Global said it approached Sunrise in July with the proposed offer and got a positive response.Ive always said the market requires rationalisation and we remain opportunistic about strategic developments there, Liberty Global Chief Executive Mike Fries told reporters. The industrial logic of this deal is undeniable.Together, the combined business would have 3.17 billion Swiss francs in revenue, 2.1 million mobile subscribers, 1.2 million broadband subscribers and 1.3 million TV subscribers, reflecting approximately 30% market share in each segment, Liberty Global said.PUTTING CAPITAL TO WORKLiberty had been divesting European assets on a view that the sector is expensive in light of its high capital costs and low growth prospects.The biggest deal, the sale of its cable networks in Germany and central Europe to Vodafone, netted $22 billion last year.Fries said Liberty Global had pulled out of Austria and Germany because its operations there lacked scale, while elsewhere it was looking to expand its footprint.In Belgium it bought a mobile operator, while in the Netherlands and UK it was creating joint ventures, he said.Libertys takeover of Sunrise follows the 24 billion pound ($31.32 billion) tie up between Liberty Globals Virgin Media and Telefonicas O2 and the taking private of Spains Masmovil by private equity investors.Fries said Liberty Global wanted to use its strong balance sheet.We are sitting on $10 billion of liquidity right now, he said. We felt this is a great market and a great opportunity to put capital to work.Credit Suisse, JP Morgan and LionTree acted as financial advisers to Liberty Global while Homburger and Shearman & Sterling provided legal advice.Deutsche Bank acted as financial adviser and Lenz & Staehelin as legal adviser to Sunrise."}