{"text": "LONDON The cost of shipping liquefied natural gas (LNG) from the United States to Asia hit a record high on Tuesday as appetite for the fuel from buyers there and delays through the Panama Canal reduced the amount of ships for hire.Freezing temperatures across Asia and Europe have pushed up LNG prices and lifted wider gas prices as buyers grapple with shrinking inventories and the shortage of tankers.Shipping sources said an apparent ban on Australian coal imports into China, which has been reported by Chinese media, had also bolstered demand by Chinese buyers for LNG tankers to carry cargoes to Asia.Average daily tanker rates on the U.S. Gulf to Japan route rose to $253,270 on Tuesday, its highest since earnings were first published in 2019, Baltic Exchange data showed. This compared with $174,000 a day at the end of last year, the Baltic data showed.The sector continues to establish new all-time highs with no slowdown in activity, shipbroker Clarksons Platou Securities said on Tuesday.Shipping sources said new build LNG tankers hitting the water were being pulled into service to meet the demand.The United States, a major LNG producer, ships LNG cargoes through the Panama Canal waterway to buyers in Asia.Toby Dunipace, with shipbroker SSY, said Panama Canal congestion had led to waiting times of seven to 10 days or more for LNG vessels.This bottleneck for shipping has an immediate impact on the demand for gas. Storage supplies are low and therefore, demand is high, he said in a report this week.If we see a cold February and March, then the shipping market could see an overall positive (first quarter).Shipping sources said delays through the Panama Canal had been compounded of late by weather disruptions, higher than expected LNG traffic as well separate tanker shipments of liquefied petroleum gas (LPG), which were also trying to sail through the waterway.LNG tanker rates from the U.S. Gulf to Europe softened this week to $310,691 a day from a high of over $320,000 a day last week, Baltic Exchange data showed."}