{"text": "U.S. consumer sentiment unexpectedly fell in early February amid growing pessimism about the economy among households with annual incomes below $75,000, even as the government is poised to deliver another round of COVID-19 relief money.The ebb in sentiment reported by the University of Michigan on Friday was also despite a decline in new coronavirus cases and an improvement in the distribution of vaccines. It underscored the so-called K-shaped recovery, where better-paid workers are doing well while lower-paid workers are losing out.The government provided nearly $900 billion in additional fiscal stimulus in late December, which included direct cash payments to mostly lower-income households and an extension of a weekly unemployment supplement. The U.S. Congress is working on President Joe Biden's proposed $1.9 trillion recovery plan, which would see more stimulus checks sent to poor families. \"The decline in confidence is a bit of a surprise since it was driven by the outlook,\" said John Ryding, chief economic advisor at Brean Capital in New York. \"It appears ... (to) be another page in the tale of two economies or K-shaped recovery theme.\"  The University of Michigan's consumer sentiment index slipped to a reading of 76.2 in the first half of this month, attributed entirely to households with incomes below $75,000. That was down from a final reading of 79 in January. Economists polled by Reuters had forecast the index little changed at 80.8.The survey's measure of current economic conditions dipped to a reading of 86.2 this month from 86.7 in January. Its gauge of consumer expectations dropped to 69.8 from 74.0 in January.Among lower-income households, only 23% reported improved finances, the lowest since 2014. That compared to 54% among higher-income households. Just 17% of lower-income families reported income gains this month, compared with 44% of upper-income households.About 53% of consumers expected the economy will continue to perform poorly in the year ahead, up from 51% in January.Stocks on Wall Street were little changed. The dollar rose against a basket of currencies. U.S. Treasury prices fell. STRONGER GROWTHEconomists expect the pessimism to abate in the coming months, given the encouraging developments on the virus, which together with the planned additional fiscal stimulus are seen allowing more parts of the economy to reopen by the summer.\"We expect consumers will become more upbeat as the next fiscal package, which distributes much of its benefits to lower-income households, comes online, and as vaccine dispersion increases,\" said Nancy Vanden Houten, lead U.S. economist at Oxford Economics in New York. \"Improved sentiment should support the strong pickup in consumer spending we expect around mid-year.\" Indeed, a separate survey by the Federal Reserve Bank of Philadelphia on Friday showed forecasters expected stronger economic growth over the next three years than they did when they were polled last quarter. They, however, anticipated slower job growth. The findings were similar to a Reuters survey.  read more The University of Michigan survey also showed consumers this month appeared to anticipate higher inflation in the near-term. The survey's one-year inflation expectation rose to 3.3%, the highest since July 2014, from 3.0% in January.  That broadly fits in with inflation expectations on Wall Street, with the massive fiscal stimulus and pent-up demand for services as COVID-19 cases subside seen unleashing faster economic growth. Higher inflation is also expected by the spring as price declines early in the coronavirus crisis wash out of the calculations, but there is no consensus on whether it would stick beyond the so-called base effects.    Federal Reserve Chair Jerome Powell said on Wednesday while he expected base effects and pent-up demand when the economy fully reopens to boost inflation, that was likely to be transitory, citing three decades of lower and stable prices.The survey's five-to-10-year inflation outlook was unchanged at 2.7%. The Fed, which has a 2% inflation target, focuses on long-term inflation expectations.\"We think Fed officials will welcome that steady rise as evidence that inflation expectations are returning to a level consistent with their 2% average inflation target,\" said Michael Pearce, a senior U.S. economist at Capital Economics in New York. "}