{"text": "BRUSSELS/WASHINGTON U.S. Secretary of State Mike Pompeo cancelled his Europe trip at the last minute on Tuesday after Luxembourgs foreign minister and top European Union officials declined to meet with him, European and U.S. diplomats familiar with the matter said.The extraordinary snub of the top U.S. diplomat, first reported by Reuters, came days after the storming of the U.S. Capitol by supporters of President Donald Trump, an unprecedented attack on American democracy that stunned many world leaders and U.S. allies.Pompeo, a close ally of Trump, had sought to meet Jean Asselborn in Luxembourg, a small but wealthy NATO ally, before meeting EU leaders and the blocs top diplomat in Brussels, three people close to the planning told Reuters.But the initial plan to go to Luxembourg, which had not been officially announced, was scrapped after officials there showed reluctance to grant Pompeo appointments, a diplomatic source said. The Brussels leg was still on until the last minute.But the thin itinerary of Pompeos final visit to Brussels raised questions about the merit of the trip. There were no meetings on his schedule with EU officials or any public events at NATO. A third diplomatic source said allies were embarrassed by Pompeo after the violence in Washington last Wednesday that left five dead.Trump encouraged his supporters at a rally earlier that day to march on the building that houses the Senate and the House of Representatives while lawmakers were certifying Democratic President-elect Joe Bidens Nov. 3 election victory. The Republican president claims, without evidence, that the election was stolen from him.Pompeo condemned the violence but made no reference to the role that Trumps baseless claims played in galvanizing the march on the Capitol.Appalled by the violence, Luxembourgs Asselborn had called Trump a criminal and a political pyromaniac on RTL Radio the next day.Luxembourgs foreign ministry confirmed the previously planned stop there was cancelled, but declined to give further details. The EU declined to comment.The U.S. State Department, in a statement, attributed the cancellation to transition work before Biden takes office on Jan. 20, even if Pompeo had been reluctant until recently to unequivocally recognize Bidens win. The State Department declined further comment on European officials rejection of meetings with Pompeo.In Brussels, Pompeo was due to have a private dinner with NATO Secretary-General Jens Stoltenberg on Wednesday evening at Stoltenbergs private residence, before meeting Belgian Foreign Minister Sophie Wilmes, whose country is a NATO ally.One of the sources said the lack of any public events at NATO was another reflection of European officials questioning the point of the trip. It was not immediately clear why Pompeo sought to go to Brussels so near to the end of Trumps term.EAGER TO BUILD TIES WITH BIDENThe cold shoulder was a contrast with Pompeos previous visits to Brussels, which is home to NATO and EU headquarters, over the past three years, where he has given keynote speeches on U.S. policy and met the EUs chief executive, even as Europe balked at Trumps foreign policy.In 2018, Pompeo said in Brussels that Trumps America First policy was reshaping the post-World War Two system on the basis of sovereign states, not institutions such as the EU.EU officials, who say they were exhausted by Trumps unpredictability, are eager to build fresh ties with Biden.One source, while explaining why Pompeo chose to remain in Washington, cited his eagerness to roll out planned foreign policy tasks until the end of the term and help keep the continuity of government.For nearly three years, Pompeo proved a loyal executor of Trumps unconventional style.His tenure did not include obvious successes in such long-standing U.S. foreign policy challenges as reining in the Iranian and North Korean nuclear programs, ending the U.S. war in Afghanistan or containing an increasingly assertive China.Nevertheless on Jan. 1, Pompeo kicked off a daily Twitter thread, saying the United States was much safer today than four years ago thanks to what he saw as the foreign policy accomplishments of the Trump administration.He said he would showcase the results. Over the coming days, Im going to lay out the mission set, the huge wins, personal stories, and a lot more. Just me, Mike, he said.The tweets, along with some of his foreign trips, have been largely seen as part of his bid to lay the groundwork for his much-anticipated 2024 run for the Republican nomination for president."}