{"text": "LONDON/BRUSSELS French President Emmanuel Macron on Thursday welcomed the prospect of U.S. President-elect Joe Biden rejoining the Paris climate accord, saying countries now had a chance to make our planet great again.His comments follow those of other leaders who have welcomed Bidens victory as a boost to global cooperation on tackling climate change, after four years of climate policy inaction under President Donald Trump.In contrast to Trump, who questioned climate science and withdrew the United States from the 2015 accord, Biden has pledged to rejoin the pact and to invest $2 trillion to wean the country off planet-warming fossil fuels.Macron said having the United States rejoin the pact, after officially exiting on Nov. 4., would vindicate faith in the agreement aimed at preventing catastrophic climate change and signed by nearly 200 countries.It is proof that we had to stand firm against all the headwinds, Macron said on Thursday during an online summit hosted by the French government.Make our planet great again is a possibility, not just in words but also in deed, Macron said.Make America Great Again was a Trump election slogan. In 2017, Macron launched an initiative called Make our planet great again which offered U.S. climate scientists multi-year grants to relocate and conduct climate research in France.Biden has pledged to convene world leaders for climate talks within his first 100 days in office. Already, climate change has been a featured topic in his first calls with U.S. allies and Pope Francis since being elected.However, the Democrat may face constraints on his ability to pass ambitious climate policies if the Republican Party remains in control of the Senate.European leaders hope a Biden administration focus on climate change will encourage other countries to pledge deeper emissions cuts ahead of a U.N. climate conference in Glasgow in November 2021.British Prime Minister Boris Johnson, whose government is hosting the gathering, discussed climate change in a post-election call with Biden and invited him to attend.NET ZERO PLEDGESEuropean Union climate chief Frans Timmermans told an online event on Monday that he hoped U.S. leadership on climate change would prompt China, the worlds biggest emitter of greenhouse gases, to strengthen its commitment to a low-carbon future.Chinese President Xi Jinping in September pledged that his country would become carbon neutral by 2060. Beijing has made no official comment since the U.S. election.Climate change was also on the agenda in calls Biden held Thursday with the leaders of Japan, South Korea and Australia, according to summaries provided by Bidens aides.Japanese Prime Minister Yoshihide Suga said he and Biden had agreed that Japan and the U.S. would work closely together to resolve pressing global issues such as the novel coronavirus and climate change.Japan and South Korea, big emitters of greenhouse gases from their coal-fired coal plants, both pledged in October to target net-zero emissions by 2050 in line with the Paris accord.Australian Prime Minister Scott Morrison, who has faced fierce criticism from environmental campaigners on his climate record, said he and Biden spoke about emission reduction technology, but did not discuss a net-zero target.India, which has yet to commit to pursuing net-zero emissions, said it would welcome Washingtons rejoining the Paris deal, noting that the United States has historically contributed the most to emissions accumulated in the atmosphere.Therefore, they have a significant role to play in combating climate change, Ravi S. Prasad, additional secretary at Indias environment ministry, told Reuters.Not all national leaders were pleased with Bidens climate focus, though.In Brazil, which has been under international pressure to halt the burning of the Amazon, President Jair Bolsonaro this week criticised Bidens call for the Latin American country to protect the rainforest with foreign help, or face unspecified economic consequences.And how can we deal with all that? Just diplomacy is not enough, said Bolsonaro, who has portrayed himself as a close friend of Trump. When saliva runs out, one has to have gunpowder, otherwise it doesnt work."}