{"text": "KUALA LUMPUR Malaysias king declared a nationwide state of emergency on Tuesday to curb the spread of COVID-19, a move that the opposition decried as an attempt by Prime Minister Muhyiddin Yassin to retain control amid a power struggle.In a televised address on Tuesday, Muhyiddin said the parliament will be suspended for a stipulated period of time and that elections would not be held in the Southeast Asian nation during the emergency, which could last until Aug. 1.Let me assure you, the civilian government will continue to function. The emergency proclaimed by the king is not a military coup and curfew will not be enforced, Muhyiddin said in an attempt to dispel alarm over the measures.Muhyiddin also gave his commitment that elections would be held as soon as it was safe to do so.The move should reduce, at least for now, some of the political uncertainty hovering over Muhyiddin since his unelected alliance came to power with a razor thin majority in March following the collapse of the previous coalition led by Malaysias veteran leader Mahathir Mohamad.Some lawmakers in the ruling coalition have pulled support for the premier and have called for early elections, while opposition leader Anwar Ibrahim said last year that he had a majority to form a new government.In a statement, Anwars coalition Pakatan Harapan accused Muhyiddin of using the pandemic to avoid a collapse of his administration and questioned the need for an emergency, saying existing laws were sufficient to tackle the virus spread.We also see the move to suspend parliament and state legislatures... as affecting checks and balance, inhibiting the nations democracy and denying the peoples voices, they said.The emergency declaration, which allows the Muhyiddin government to introduce laws without parliamentary approval, comes a day after the premier announced a nationwide travel ban and a 14-day lockdown in the capital Kuala Lumpur and five states.The healthcare system for the country of 32 million people was at a breaking point, the premier said. The number of new daily infections hit a record high on Tuesday with 3,309 cases. Total coronavirus cases passed 141,000 with 559 deaths.Under the emergency, the military can be given powers to help carry out functions related to public health, he said, adding that the police can also be given extra powers.Economic activities will be unaffected, he said.Malaysias benchmark share index fell as much as 1.6% and the ringgit currency lost as much as 0.5% after the emergency announcement.CRITICAL STAGEMalaysias economy took a hit from measures taken to curb the epidemic last year, posting its first economic contraction in over a decade in the second quarter of 2020.Economists warned the emergency and new lockdown measures will harder for the expected economic recovery to meet the governments 2021 growth target of 6.5-7.5%.Malaysias palace said King Al-Sultan Abdullah agreed to Muhyiddins request to declare emergency due to the critical stage of the pandemic.The emergency will last until Aug. 1 or earlier depending on whether coronavirus infections have been brought under control, the palace said.The king had rejected a similar request from Muhyiddin in October. Opposition leaders had then criticised the request as a move to cling to power.Malaysia is a constitutional monarchy in which the king has a largely ceremonial role, carrying out his duties with advice from the prime minister and cabinet. But, the monarch also has the power to decide if an emergency should be declared, based on threats to security, economy or public order."}