{"text": "LONDON (Thomson Reuters Foundation) - Keeping girls in school and taking young climate leaders seriously are keys to tackling climate change, Nobel Peace Prize winner Malala Yousafzai said on Friday.Speaking to a virtual panel, Malala, 23, said educating girls and young women, particularly in developing countries, would give them a chance to pursue green jobs and be part of solving the climate crisis in their communities.Girls education, gender equality and climate change are not separate issues. Girls education and gender equality can be used as solutions against climate change, Malala told an online event by British think-tank Chatham House.Before the COVID-19 pandemic, some 130 million girls worldwide were already out of school, according to the United Nations cultural agency UNESCO, which said more than 11 million may not return to classes after the pandemic.When we educate girls ... they can become farmers, conservationists, solar technicians, they can fill other green jobs as well. Problem-solving skills can allow them to help their communities to adapt to climate change.From sexual violence in displacement camps to extra farm work, women and girls shoulder a bigger burden from worsening extreme weather and other climate pressures pushing people to move for survival, global aid group CARE International says.Scientists expect forced displacement to be one of the most common and damaging effects on vulnerable people if global warming is not limited to an internationally agreed aim of 1.5 degrees Celsius.Climate disasters have also been linked with early marriage, school drop-outs and teen pregnancies, says U.N. childrens agency UNICEF.Malala also called on world leaders to pay attention to youth climate activists, citing movements like Mock COP in November when young people launched a two-week event designed to mirror the format of the delayed U.N. climate talks.Listen to young people who are leading the climate movement. Young people are reminding our leaders that climate education and climate justice should be their priority.Earlier this week, Malala expanded her partnership with Apple Inc to produce dramas, childrens series, animation and documentaries that will air on the tech giants streaming service.Apple produced a documentary about Malala in 2015 and teamed up with her Malala Fund in 2018 to promote secondary education to girls across the globe.In 2009 at age 12, Malala blogged under a pen name for the BBC about living under the rule of the Pakistani Taliban. In 2012 she survived being shot in the head by a Taliban gunman for campaigning against its attempts to deny women education.In 2014, she became the youngest-ever Nobel Peace Prize laureate at age 17. In 2018 she launched Assembly, a digital publication for girls and young women available on Apple News. She graduated from Oxford University in June."}