{"text": "BAMAKO Malis ruling junta pushed through a political charter on Saturday that could lead to the appointment of a soldier as interim president despite objections from the coalition that led anti-government protests before last months coup.Approval for the roadmap, meant to chart the countrys course after the Aug. 18 coup that toppled President Ibrahim Boubacar Keita, came after three days of negotiations between the junta, political leaders and civil society groups.International powers, fearful that political instability will undermine a fight against Islamist militants across West Africas Sahel region, have pushed for a swift transition back to civilian rule.The charter says the interim president can be a civilian or a soldier and will preside over a transitional period of 18 months before elections are held, said Moussa Camara, the spokesman for the talks.The interim president will be selected by electors chosen by the junta, Camara said.A previous draft of the charter had said the transition would last two years and the interim president would be directly chosen by the junta, the National Committee for the Salvation of the People (CNSP).What awaits us now is the hard work, the implementation of these resolutions, said CNSP president Colonel Assimi Goita.Even as some participants touted the consensual nature of the talks, the M5-RFP coalition that spearheaded protests against Keita before the coup criticised the charters failure to ensure civilian rule of the transition.Its the people who overthrew IBK. Its up to them to choose the new president, said Youssouf Maiga, an M5-RFP supporter, referring to Keita by his initials.The charter also puts the junta on a collision course with Malis West Africa neighbours, who have insisted that the interim president be a civilian and that the transition last no longer than one year.Leaders from the Economic Community of West African States (ECOWAS), which imposed economic sanctions after the coup, will meet on Tuesday to discuss the situation in Mali.It was not clear if the interim president would be named by ECOWASs deadline of Tuesday. The body has not said what it will do if its demands are not met."}