{"text": "Manhattan District Attorney Cyrus Vance Jr said on Friday he will not seek re-election in November, making it likely that his criminal investigation into former U.S. President Donald Trump will be left for his successor.The decision by Vance, 66, not to seek a fourth term raises questions about the potential timing for the probe into Trump, who remains popular among many Republicans and if indicted would be the first former president to face criminal prosecution.That probe has accelerated since Republican Trump lost his bid for a second term to President Joe Biden, a Democrat.It got a big boost last month when Vances office finally obtained eight years of Trumps tax returns after an 18-month court battle, including two trips to the U.S. Supreme Court.Trumps accountants at Mazars USA LLP turned over millions of pages of documents including the tax returns, business records and communications.Michael Cohen, Trumps former lawyer and fixer, told Reuters he was going on Wednesday for a seventh interview with Vances office as part of the investigation.Vances office has said in court filings it was investigating possibly extensive and protracted criminal conduct at the former presidents Trump Organization, including tax and insurance fraud and falsification of business records.At least nine candidates have said they want to succeed Vance, who won his first term in 2009.Vance gave no specific reason for his decision not to run again. I never imagined myself as District Attorney for decades like my predecessors, he said in a statement. He had succeeded Robert Morgenthau, who over 35 years made the office a major crime-fighting agency in the country.Vance has overseen many high-profile cases, including last years conviction of Hollywood film producer Harvey Weinstein on rape and sexual assault charges.Trump is also being investigated in Georgia for allegedly trying to overturn that states 2020 election results, a step that could lead to a criminal investigation by state and local authorities."}