{"text": "The yuan's hot start to 2021 has been met with unease from Chinese authorities, raising investor expectations that officials will closely manage the currency to prevent it moving too far or fast from current levels.The yuan  leapt 1% against the U.S. dollar on the first trading day of the year to two-and-a-half-year highs, and logged its biggest weekly rise in two months last week, even as the People's Bank of China (PBOC) signaled its preference for a slower pace of appreciation. Li Wei, senior China economist at Standard Chartered, points to the likelihood of that yuan appreciation causing slower exports, tighter financial conditions and other business impact.\"Authorities will continue to focus on keeping the yuan at a basically stable level,\" he said.The foreign exchange regulator indicated as much last week when it said it would avoid disorderly fluctuations in the currency market. In an interview with the official Xinhua news agency published on Friday, PBOC Governor Yi Gang said China would \"focus on guiding expectations to allow the yuan to remain basically stable at reasonable and balanced levels.\"Some investors expect a bumpy ride despite the official commitment to stability.\"I believe the yuan's movement in 2021 will be very volatile, unlike the one-sided appreciation in 2020,\" said Josh Sheng, chief investment officer at Shanghai Tongshengtonghui Asset Management, noting what he called the PBOC's \"very clear\" intention to keep the yuan within a range. The yuan finished 2020 at 6.5283 per dollar, up 6.7% from a year earlier. It rose to a high of 6.4292 early last week before retreating a bit.Li at Standard Chartered views 6.4 per dollar, which the yuan has not breached since June 2018, as a likely \"red line\" for authorities in the short-term, though continuing dollar weakness in the first half could see the yuan strengthen past it. But some analysts and traders say officials are likely to be more concerned about the pace of change than any specific level.\"The way the authorities regulate the yuan now is similar to A-shares,\" said Ken Cheung, chief FX strategist at Mizuho Bank. \"In general, policymakers want to promote a slow bullish trend for the yuan.\"One difficulty for regulators is the widespread expectation that the yuan will continue to strengthen as the dollar weakens. An early exit from coronavirus lockdowns last year gave the PBOC room to tighten policy, widening the yield gap between Chinese and U.S. debt and luring in foreign investors into Chinese bonds. That created a positive feedback loop that supported the yuan, said Chaoping Zhu, global market strategist at J.P. Morgan Asset Management in Shanghai.\"China might still be the safest region in terms of the development of COVID-19, and Chinese economic growth is still leading the world. So we believe capital inflows will still continue in the first half,\" he said.Faced with such persistent inflows, investors expect China to continue to remove restrictions on capital outflows and to encourage individuals and institutions to invest abroad."}