{"text": "The Masters, which brings together the worlds best golfers in one of the sports four majors, will be held without patrons in November because of the COVID-19 outbreak, Augusta National Golf Club said on Wednesday.Organizers had been examining how best to host the global sporting event ever since the pandemic forced the postponement of the tournament, traditionally held during the first full week of April at Augusta National.Throughout this process, we have consulted with health officials and a variety of subject matter experts, Augusta National Chairman Fred Ridley said in a statement.Ultimately, we determined that the potential risks of welcoming patrons and guests to our grounds in November are simply too significant to overcome.Ridley said Augusta National, which will host the Masters from Nov. 12-15, will hopefully be able to welcome patrons back in April 2021.Golf is coming off its first major championship of the COVID-19 era, played without fans at last weeks PGA Championship in San Francisco.The Sept. 17-20 U.S. Open in Mamaroneck, New York, will also have no fans on site while this years British Open, scheduled to be held in July at Royal St Georges in Kent, was canceled.The PGA Tour has yet to allow fans attend any tournament since it returned to action in June from a three-month COVID-19 hiatus, a move that will carry though the circuits 2019-20 season finale at the Sept. 4-7 Tour Championship.The Masters, known for the beauty of its layout and deafening roars that echo through towering pines lining a pristine course, attracts spectators from all over the world.As the only permanent home for one of golfs four majors, the allure of the Augusta National has made tickets to the Masters among the most coveted in all of sports.Even in the current circumstances, staging the Masters without patrons is deeply disappointing, said Ridley. The guests who come to Augusta each spring from around the world are a key component to making the tournament so special.Augusta National has the responsibility, however, to understand and accept the challenges associated with this virus and take the necessary precautions to conduct all aspects of the tournament in a safe manner."}