{"text": "NAIROBI Mauritius Prime Minister Pravind Jugnauth said on Wednesday nearly all remaining oil had been removed from a damaged Japanese ship, which leaked about 1,000 tonnes in a threat to tourism already hurt by the coronavirus pandemic.At the time Im talking to you, almost all the oil has been removed from the ship, Jugnauth told reporters, according to remarks shared by his office.All fuel had been removed from tanks, but there was some residue in parts of the ship, his office added.Tourist operators fear the spill will further damage businesses already reeling from the epidemic and could cost jobs if pristine beaches are spoiled.Tourism generated 63 billion rupees ($1.6 billion) for the economy last year. In May, the central bank said that in the past two months alone, the nation had lost 12 billion rupees in foreign exchange due to the fall in tourism.It is really going to affect the communities down there, especially for the fisherman, the local guys that live there, you know thats how they make money from tourists, said Willow River-Tonkin, who owns a kite-surfing business.Taking them out to go diving, to go snorkelling, to go wakeboarding, to go see dolphins and all that sort of thing you know, and all of that is going to affect it, if we dont get it under control very soon.The MV Wakashio, owned by Nagashiki Shipping and operated by Mitsui OSK Lines Ltd, struck a reef and went aground off the Indian Ocean islands southeast coast on July 25.It began leaking oil last Thursday.Romina Tello, the 30-year-old founder of sustainable tourism agency Mauritius Conscious, said border closures due to the coronavirus had already battered tourism.Mauritius shut its borders on March 19 and has had only 344 cases of COVID-19, with 10 deaths.The southeast coast where the oil spill happened is famous for snorkelling, kite surfing, sailing, sea flora and fauna, Tello said. We are trying to activate domestic tourism. But now, it is impossible for me to recommend for people to travel to the southeast coast due to the smell and they cant swim because of the spill, she told Reuters."}