{"text": "BANGKOK Water levels in the Mekong River have fallen to a worrying level in part due to outflow restrictions from Chinese hydropower dams upstream, the Mekong River Commission (MRC) said on Friday, calling on Beijing to share all of its water data.The vital waterway has turned blue along the Thai-Laos border, from its usual murky brown colour - signaling shallow water and low levels of nutrition-rich sediment - partially from outflow restrictions from the Jinghong dam in Chinas Yunnan province, the inter-governmental MRC said.Fridays statement said low rainfall and dams on the Lower Mekong and tributaries also contributed to the drop in levels.There have been sudden rises and falls in water levels immediately downstream of Jinghong and further down to Vientiane, said Winai Wongpimool, director of the MRC Secretariats Technical Support Division.Such fluctuations affect fish migration, agriculture and transportation that nearly 70 million people rely on for their livelihoods and food security.To help the Lower Mekong countries manage risks more effectively, we call on China and the Lower Mekong countries themselves to share their water release plans with us, Winai said.The MRC said normal conditions may be restored if large volumes of water are released from Chinese dams reservoirs.Chinas Ministry of Foreign Affairs disputed the MRCs findings, adding that there are many causes of downstream drought.China last year pledged to share data from it dams with MRC member countries Laos, Thailand, Cambodia and Vietnam.In January, Beijing notified neighbours that its dams were filling reservoirs until Jan. 25.Outflow levels at Jinghong Dam were 785 cubic metres per second in early-January before rising to 1,400 cubic metres per second in mid-January, the MRC said.However, levels dropped again in February and were 800 cubic metres per second as of Thursday, the MRC said. The statement did not mention any recent notification from Beijing.China said the dams outflow has been consistently more than 1,000 cubic meters per second since the end of January, a level it says is nearly twice the natural flow of the river. It called on the MRC to avoid causing public misunderstanding."}