{"text": "SYDNEY Australias second-most populous city will enter a five-day snap coronavirus lockdown, authorities said on Friday, banning spectators for much of the Australian Open tennis tournament.A fresh COVID-19 cluster linked to a quarantine hotel in Melbourne, the capital of Victoria state, reached 13 cases as of Thursday midnight, as authorities rushed to quash the spread of the virus. All of those infections were linked to the highly contagious UK variant.Victoria Premier Daniel Andrews announced the lockdown for the state, starting at midnight on Friday, calling it a short, sharp circuit breaker banning public gatherings, home auctions, weddings and religious gatherings.We must assume that there are further cases in the community than we have positive results for, and that it is moving at a velocity that has not been seen anywhere in our country over the course of these last 12 months, Andrews told reporters, noting the high transmission rate of the UK variant.Asked about the Australian Open, which runs through Feb. 21, the premier said the Grand Slam tournament, one the biggest events in the countrys sports calendar, was considered a workplace, subject to lockdown restrictions.There are no fans. There are no crowds. These people are essentially at their workplace, he said. The minimum number of staff for it to be run safely - not just for the virus but other reasons - will be there.The event had already been limited to 50% of usual capacity and was dogged by earlier complaints from some international players, who were forced to spend critical preparation time in quarantine.The tournament will proceed without crowds over the next five days with no fans allowed at the match sites, organisers said. Spectators will be able to attend games scheduled for Friday, while those who had bought tickets to restricted events will get a refund, they said in a statement.BITTER DISAPPOINTMENTVictoria suspended international passenger flights from Saturday, excluding those already in transit, until further notice.We will continue to assess the impact of the UK strain of the virus on our programme and international arrivals, and will provide more information on the duration of this pause soon, the state government said in a statement.All states and territories, except New South Wales - which includes Sydney and is the nations most populous state - closed their borders to Victoria on Friday citing the high risk of transmission.New South Wales, which on Friday recorded a 26th day with no community cases, said its borders with Victoria will remain open while it monitors the situation.Victoria endured one of the worlds strictest and longest lockdowns last year after an outbreak that killed more than 800 in the state, the vast majority of the national death toll.The head of Australias business lobby group expressed frustration at the fresh lockdown, calling it a bitter disappointment for the whole community.This is the second lockdown caused by Victorias hotel quarantine system, it must not be as long and destructive as the last, Business Council Chief Executive Jennifer Westacott said. We must get hotel quarantine working properly.More broadly, Australia has been among the worlds most successful countries in handling the pandemic, largely because of decisive lockdowns and borders sealed to all but a trickle of travellers. The nation has recorded some 22,200 community cases and 909 deaths.But its quarantine hotels, where all international arrivals have to spend two weeks, have been a weak link in its defences, with the latest Melbourne cluster another example.Premier Andrews proposed tightening Australias citizen repatriation program to compassionate reasons only, a move that could get some support from other states that have had the UK strain.Ahead of the lockdown announcement, Prime Minister Scott Morrison offered his governments full support for Victorias decisions on containing the outbreak."}