{"text": "Microsoft Corp on Wednesday said the Surface Duo, its dual-screen smartphone powered by Alphabet Incs Android operating system, will start at a price of $1,399 and arrive in stores beginning Sept. 10.The Surface Duo folds closed like a book. Unlike devices such as Samsung Electronics Co Ltds Galaxy Z Fold 2 that use special flexible glass to create a single display, the Duo has two traditional screens separated by a hinge but synchronized to work together.At a media briefing ahead of the Surface Duo announcement, Microsoft executives positioned the phone as a tool for getting work done with its productivity apps, similar to how many business users employ dual-monitor setups with PCs.In the companys Teams chat app, for example, a video chat occupies one screen while the other screen displays chats. In Microsofts Outlook email app, clicking a link in the body of an email opens the link on the opposite screen, so the user can continue reading or responding to the email.Im not trying to reinvent the phone, Panos Panay, Microsofts chief product officer, told reporters. But I do believe this is a better way to get things done.The dual-screen setup also allows users to pair up non-Microsoft apps, such as running social networks Twitter and Instagram side by side. Panay said that one of Microsoft Chief Executive Satya Nadellas favorite combinations was using Amazon.coms Kindle app to read books while taking notes with a stylus in Microsofts OneNote app on the other screen.Panay said Microsoft chose Googles operating system because it would give users access to Androids large ecosystem of mobile apps. Having the Play Store is critical, he said.Microsoft said pre-orders for the device begin Wednesday at its own site, AT&T Inc and BestBuy Co Inc.Devices will work on wireless networks from AT&T, Verizon Communications Inc and T-Mobile US Inc.The device does not have 5G connectivity and is only available in the United States at launch. Microsoft gave no timeline for other markets."}