{"text": "Microsoft Corp (MSFT.O) said on Monday it would buy artificial intelligence and speech technology firm Nuance Communications Inc (NUAN.O) for about $16 billion, as it expands cloud solutions for healthcare customers.The deal comes after the companies partnered in 2019 to automate clinical administrative work such as documentation. It shows Microsoft's ambition to extend its leadership into an industry where digital transformation has picked up speed during the pandemic. Healthcare providers have invested more in technology to improve productivity and digital health services.\"This acquisition brings our technology directly into the physician and patient loop, which is central to all healthcare delivery. The acquisition will also expand our leadership in cross-industry enterprise AI and biometric security,\" Microsoft CEO Satya Nadella said on an investor call.Microsoft's offer of $56 per share represents a premium of 22.86% to Nuance's closing price on Friday. The shares gained 16% to close at $52.85 on Monday.Nuance, known for pioneering speech technology and helping launch Apple Inc's (AAPL.O) virtual assistant, Siri, has gone through strategic reviews led by Chief Executive Mark Benjamin. Once offering voice recognition technologies across industries, the company now focuses on healthcare and enterprise AI after spinning off and selling a number of less profitable business units.The company said it serves 77% of U.S. hospitals, providing intelligent solutions including clinical speech recognition, medical transcription and medical imaging.\"Nuance's strong position at the edge (medical dictation and transcription) will ultimately tie healthcare customers more strongly into Microsoft's Azure Cloud and intelligent services, Forrester analyst J.P. Gownder wrote in a note on Monday.With operations in 28 countries, the Burlington, Massachusetts-based company reported $1.5 billion in revenue in fiscal-year 2020, with two-thirds of it coming from healthcare.Benjamin will remain CEO of Nuance and will report to Scott Guthrie, executive vice president of Cloud & AI at Microsoft, the company said. (https://refini.tv/3a5Ux5z)The deal follows Microsoft's recent $7.5 billion acquisition of gaming company ZeniMax Media, and reports that Microsoft was in talks to buy messaging platform Discord, which also allows live audio events.Once closed, the deal for Nuance would be Microsoft's second-biggest, after its $26.2 billion acquisition of LinkedIn in 2016. Including net debt, the all-cash transaction is valued at $19.7 billion.Goldman Sachs is the financial adviser to Microsoft, while Evercore advised Nuance."}