{"text": "WASHINGTON Ransom-seeking hackers have begun taking advantage of a recently disclosed flaw in Microsofts widely used mail server software, the company said early Thursday - a serious escalation that could portend widespread digital disruption.The disclosure, initially made on Twitter by Microsoft Corp security program manager Phillip Misner and later confirmed by the Redmond, Washington-based company, is the realization of worries that have been coursing through the security community for days.Since March 2, when Microsoft announced the discovery of serious vulnerabilities in its Exchange software, experts have warned that it was only a matter of time before ransomware gangs began using them to shake down organizations across the internet.Misner didnt immediately respond to follow-up messages and Microsoft did not return emails seeking further comment. The U.S. Cybersecurity and Infrastructure Security Agency and the FBI also didnt immediately respond.Even though the security holes announced by Microsoft have since been fixed, organizations worldwide have failed to patch their software, leaving them open to exploitation. Experts attribute the sluggish pace of many customers updates in part to the complexity of Exchanges architecture and lack of expertise. In Germany alone, officials have said that up to 60,000 networks remained vulnerable.All manner of hackers have begun taking advantage of the holes - one security firm recently counted 10 separate hacking groups using the flaws - but ransomware operators are among the most feared.Those groups work by locking users out of their devices and data unless the victims cough up big chunks of digital currency. They now potentially have access into a huge number of vulnerable systems, said Brett Callow of cybersecurity company Emsisoft.He said more modest companies - many of which lack the ability or awareness to update their software - could be particularly affected by the latest variant of ransomware.This is a potentially serious risk to small businesses, he said."}