{"text": "NEW YORK Demand for the $96 billion in new Treasury notes sold Monday was average, but substantial enough to prevent a jump higher in yields ahead of Tuesdays inflation data.The U.S. Treasury Department on Monday sold $58 billion in three-year notes to solid demand, while the results of the $38 billion 10-year note auction were slightly weaker. Both were watched closely by investors looking to see if the auctions would restart the dramatic rise in yields of the first quarter. [US/]The flood of new Treasury supply - estimated to be around $4 trillion this year to pay for pandemic stimulus endeavors - has contributed to the move higher in yields this year. Historically weak auctions, in particular Februarys seven-year offering, were responsible for sparking dramatic selloffs in Treasury debt that pushed yields to pre-pandemic highs.The stabilization in yields that began in April will therefore continue going into the publication of consumer price index data on Tuesday morning.The three-year was good, the 10-year was okay, said Andy Brenner, head of international fixed income at National Alliance Securities.I dont think its going to have much of an effect on rates just on this alone. I still think the jury is out as to what the next big move is, said Brenner, who does believe the rise in yields will resume, and expects the 10-year yield to reach 2% before the end of the second quarter.The benchmark 10-year yield rose more than 80 basis points in the first quarter. Since the start of the second quarter on April 1, the 10-year yield has dropped 6.8 basis points and was last trading around 1.678%.U.S. consumer price data for March, due Tuesday, might also drive yields higher. Yields on longer-dated securities rise with inflation expectations, as higher consumer prices can erode their value over time. U.S. producer prices notched their largest annual gain in 9-1/2 years last month, Labor Department data showed Friday, likely marking the start of higher inflation as the economy reopens.In order for yields to move significantly higher, I think you would have to have a CPI number tomorrow out of line, outside of expectations, similar to what the PPI was on Friday, said Brenner.The Treasury will also be auctioning $24 billion of 30-year bonds on Tuesday and a total of $151 billion in bills throughout the week."}