{"text": "MONTERREY, Mexico These days, Martin Salgados migrant shelter in the city of San Luis Rio Colorado on Mexicos border with the United States feels more like an hourly hotel. His guests, many of them from Central America, often dont even bother to spend the night.Salgado said he has never seen people cycle through as repeatedly as he has in recent months, after the United States began expelling almost all migrants caught on the Mexican border rather than returning them to their homelands. Now, human smugglers often attempt to get migrants back across the border the very same day they are deported, he said.Previously, Central American migrants apprehended at the border would be processed in the U.S. immigration system and would often be held for weeks, if not months, before being deported back to their home country.We never saw this before, said Salgado, who runs the shelter near Arizonas western limits founded by his mother in the 1990s. Some Central Americans who arrive at the shelter after being deported eat, bathe, and suddenly they disappear.U.S. President Donald Trumps administration in March announced that it would begin to quickly expel nearly all migrants caught at the border under the authority of an existing federal public health act, known as Title 42, saying the move was necessary to prevent coronavirus spreading into the United States.But the order appears to be having unintended effects.Its led to an increase in repeated border crossing attempts, data from U.S. Customs and Border Protection shows. And its benefiting the illegal networks that move people from Central America to the United States, according to interviews with more than a dozen migration experts, shelter directors, immigrant advocates and human smugglers.That is because U.S. authorities are depositing the migrants on the border, rather than returning them home, which allows smugglers to eliminate some of the costs of repeat border crossings, said three smugglers working with transnational networks. The price migrants pay smugglers, which can be $7,000, or double that, often includes two or three attempted border crossings to offset the risks of being intercepted by Mexican or U.S. authorities, according to the three smugglers, as well as migration experts.Not all migrants travel with smugglers, but even those braving the dangerous journey alone or in small groups often turn to coyotes at the border for the final stretch of the journey. Since they too are now being returned at the Mexican border when caught they now often pay for a second or third try, in another boon for the smuggling networks, said migrant experts and a guide tied to a smuggling network in the Sonora region.U.S. border officials say the program, which has resulted in migrants being returned in an average of less than two hours, is crucial for protecting U.S. agents, health care workers and the general public from COVID-19 by avoiding the potential spread of coronavirus if migrants were apprehended, processed, and then sent to U.S. detention centers, as per previous policy.It would take just a small number of individuals with COVID-19 to infect a large number of detainees and CBP personnel and potentially overwhelm local healthcare systems along the border, the U.S. Customs and Border Protection (CBP) said in a statement.Joe Biden clinched the U.S. presidency following the Nov. 3 election, though Trump has not acknowledged defeat and has launched an array of lawsuits to press claims of election fraud for which he has produced no evidence. The president elect has not laid out specific plans about the Title 42 program. A senior advisor to the Biden campaign in August told Reuters that Biden would look to public health officials for guidance on pandemic-related border closures.MAKING MORE MONEYSeeking safe passage on the perilous trek north, migrants often pay thousands of dollars to smugglers - known as coyotes - linked to gangs that control territory in Mexico.The three men who identified themselves as smugglers from different transnational networks told Reuters they save about $1,000 or more each time U.S. Border Patrol expels one of their Central American clients at the Mexican border rather than returning them back by plane to their home countries.Its great for us, said Antonio, a Salvadoran smuggler who is part of a network that he said charges migrants $14,000 a head for three runs at getting from Central America to the United States.Antonio, like the others involved in the smuggling trade that Reuters interviewed, declined to give his last name.He said his network spends at least $800 per migrant paying off drug cartels for the right to transit through their turf, then there are additional costs such as food, shelter, transportation, and occasional bribes to Mexican authorities.In the past, when Central American migrants were caught by U.S. Border Patrol and sent home, his network would have to pick up that tab again on migrants second or third attempts.Mexicos immigration agency in August vowed to eradicate the collusion between public servants and human smugglers as it ousted hundreds of officials for work-related offenses.Pablo, a Guatemalan who ferries migrants across Guatemalas border into Mexico, estimated that the network he works for saves at least $1,300 for every Central American who is returned at the U.S. border rather than sent back to their homeland.Were making more money because we dont have to pay the mafia again in Mexico, he said. So, theres an advantage.REPEATED ATTEMPTSMigration numbers are returning to pre-pandemic levels, following steep declines this spring after Central American countries slammed their borders shut in an effort to halt the spread of coronavirus. The U.S. Customs and Border Protection agency said it conducted nearly 55,000 expulsions and apprehensions of migrants at the southwest border in September. That is more than triple the figure for April and is slightly higher than the 40,507 a year earlier, according to CBP data.And, apprehensions and expulsions continued to climb in October, said a U.S. official with knowledge of the numbers.Still, migration numbers for the 12-month period ended in September were down from the previous year. The Title 42 order does not change deportation policy for Mexicans, who made up about two thirds of people expelled by the United States during August and September, according to the CBP. Hondurans, Guatemalans, and Salvadorans account for the next three largest groups.Meanwhile, the number of repeated attempts has sharply increased, indicating that fewer people are migrating than last year but more of those who are trying to cross the border multiple times.Between April and September, the proportion of people caught crossing the border more than once surged to 37%, up from 7% for the 12-month period ended in September 2019, according to the CBP.The president of the Border Patrol union in Laredo Texas, border agent Hector Garza, said the Title 42 order was helping limit the exposure of the border workforce to COVID-19 and avoid overwhelming local hospitals in communities in Texas, which are already experiencing a surge of coronavirus cases.But with any benefit there is a downside, and in this case, were seeing people coming back and forth, trying to cross multiple times within a 24-hour period, he told Reuters.In the border city of Ciudad Juarez on Oct. 31, across from the Texas city of El Paso, Cuban Alexander Garcia stood by the port of entry to the United States. Garcia, who identified himself as a doctor, said he had just been deported after his sixth attempt at crossing the border without authorization.Theyre returning us in less than three hours! exclaimed Garca. We cross, and they just grab us and push us back into Juarez.U.S. Border Patrol Chief Rodney Scott, during a news conference last month, said the pandemic had reduced the ability and willingness of authorities to prosecute because detaining people potentially involved additional risk of spreading COVID-19 in the United States.IT MOTIVATES YOUAbout 125 miles east of Salgados shelter, Jesus, a guide linked to a local smuggling network, and his Guatemalan girlfriend, Yolanda, have been biding their time in a chilly trailer serving as a migrant stash house along the Mexican border.They said nearby clashes between rival gangs have delayed Yolandas departure across the Sonoran desert into the United States.But Jesus said hes heartened by the new U.S. policy - and so are the towns smugglers that hes worked for over the years.Its better because if people get caught, they come right back, he said. So its like, were still in business.Yolanda was also encouraged when, upon reaching the border, she found out that if she was caught, she would only be sent to Mexico, rather than likely being deported back home.It motivates you, she said, explaining that she left Guatemala after she was forced to close her clothing shop when pandemic restrictions crippled the economy.She racked up debts, fell behind on her mortgage, and lost her home, she said, joining a small but growing number of Central Americans fleeing the economic crisis triggered by pandemic-related restrictions across the region.While Title 42 has encouraged some people to risk the crossing after being turned back, some human rights organizations say it erodes migrants rights because they are being rapidly returned to Mexico before having an opportunity to explain why they fled their countries or to present a case for why they would qualify for asylum under U.S. law.CBP said in a statement the agency remains committed to our obligations to provide safe haven to those who claim persecution."}