{"text": "Jacob deGrom threw six scoreless one-hit innings, delivered a two-run single and earned the win but departed with right flexor tendinitis Friday night as the host New York Mets edged the San Diego Padres, 3-2.But deGrom (6-2) was at just 80 pitches when he headed into the tunnel after a consultation with Mets trainers as the team batted in the bottom of the sixth. Miguel Castro relieved him to start the seventh.deGrom retired the first 13 batters on 57 pitches before Wil Myers singled through the shift-vacated second base area. Fellow former Cy Young Award winner Blake Snell matched deGroms zeroes until the fifth, when Kevin Pillar and Billy McKinney doubled on back-to-back pitches to give the Mets a 1-0 lead.Snell (2-3) then walked Jose Peraza and balked before deGrom laced an opposite-field, two-run single. The run-scoring hit gave deGrom more RBIs (five) than earned runs allowed (four). Edwin Diaz allowed a two-out single in the ninth to Machado before locking down the four-out save, his 11th of the season.Giants 1, Nationals 0Anthony DeSclafani tossed his second shutout of the season and visiting San Francisco defeated Washington in the opener of a four-game series as Nationals starter Max Scherzer left early due to injury.Buster Posey homered for the Giants, who have won nine of 12. DeSclafani (6-2) allowed two hits and a walk while striking out eight with 103 pitches. He threw a three-hitter against the Colorado Rockies on April 26. It was his third career complete game.Scherzer left with an injury in the first inning after throwing just 12 pitches. In the final season of a seven-year contract, Scherzer appeared to squat briefly and wince after a pitch to Brandon Belt. After manager Dave Martinez and the Nationals trainer came to the mound, the right-hander threw one warmup pitch before leaving the game.Cubs 8, Cardinals 5Joc Pederson drove in three runs to help host Chicago rally back from a 5-1 deficit to defeat St. Louis, knocking a solo home run in the fourth inning to cut into the Cardinals lead and notching a two-run double in the seventh to give the Cubs the lead for good.Cubs starter Kohl Stewart allowed five runs on six hits and two walks in four-plus innings. Reliever Tommy Nance (1-0) got the win, while Craig Kimbrel earned his 16th save. The Cubs have won four of their last five, while the Cardinals have dropped seven of their last eight.Cardinals starting pitcher Johan Oviedo allowed four runs on five hits and one walk in 4 1/3 innings. Reliever Genesis Cabrera (1-2) took the loss.Red Sox 6, Blue Jays 5Alex Verdugo hit a walk-off single high off the Green Monster in left field with no outs in the ninth inning as Boston rallied past visiting Toronto.Enrique Hernandez reached and advanced to second on a throwing error by Blue Jays shortstop Bo Bichette to open the inning. Verdugo then hit a 1-2 pitch off Toronto reliever Rafael Dolis (1-2) to drive in pinch runner Danny Santana and give Boston its second walk-off victory of the season.Bobby Dalbec and Christian Arroyo both hit solo home runs for the Red Sox, who overcame a four-run deficit to win for the seventh time in nine games. Toronto slugger Vladimir Guerrero Jr. hit his major-league-leading 19th home run and became the first in the majors to reach 50 RBIs this season.Indians 7, Mariners 0Right-hander Aaron Civale allowed one hit over eight scoreless innings and struck out a career-high 11 to become the American Leagues first nine-game winner as host Cleveland blanked Seattle.Bobby Bradley homered for the Indians and drove in three runs in the opener of a three-game series. Amed Rosario had four hits and scored twice, and Jose Ramirez reached base five times on three hits and two walks. He drove in a run and also scored twice.Civale (9-2) allowed two baserunners in the first inning but retired the final 22 batters he faced. Seattle right-hander Justin Dunn (1-3), activated from the 10-day injured list earlier in the day after experiencing right shoulder inflammation, allowed runs in each of his three innings as the Indians built an early 5-0 lead.White Sox 5, Tigers 4 (10 innings)Yoan Moncada hit a sacrifice fly in the top of the 10th and visiting Chicago held on against Detroit as Adam Engel homered for the White Sox and Danny Mendick supplied two hits, scored a run and knocked in another.Chicago starter Lucas Giolito gave up two runs on five hits and struck out nine in six innings. Liam Hendricks (3-1) picked up the win despite blowing his third save of the season by giving up two runs in the ninth.Mendick started the 10th at second base. After Jose Cisnero (0-4) walked Tim Anderson, Mendick moved to third on a long fly out. Mendick then scored on Moncadas sacrifice fly. Daz Cameron hit his first career homer, a game-tying two-run blast in the ninth, for Detroit. Isaac Paredes and Nomar Mazara hit solo homers.Astros 6, Twins 4Martin Maldonado ripped a tiebreaking double in the ninth inning and Jose Altuve homered for the third straight game to help Houston beat Minnesota at Minneapolis.Yuli Gurriel also homered, Alex Bregman had two RBIs without a hit and Michael Brantley went 4-for-4 with an RBI as the Astros won for the ninth time in the past 12 games.Right-hander Jose Urquidy gave up three runs -- on three solo homers -- and four hits over seven innings. He struck out eight and walked one and left with the lead, but wound up with a no-decision. Ryne Stanek (1-1) got the win despite giving up the lead in the eighth, and Ryan Pressly struck out two in a perfect ninth for his 10th save.Brewers 7, Pirates 4Christian Yelich hit a two-run double during a five-run seventh inning to help Milwaukee top visiting Pittsburgh.Jackie Bradley Jr. added an RBI single and a bases-loaded walk for the Brewers, who are 7-1 in their past eight games. Milwaukees Brandon Woodruff (5-2) gave up two runs and four hits in seven innings, and Josh Hader pitched the ninth for his 15th save.Ben Gamel, Gregory Polanco and KeBryan Hayes homered for the Pirates, who have lost five straight. Pittsburgh starter Chase De Jong pitched five innings, allowing two runs and four hits.Rays 4, Orioles 2Brandon Lowe belted a two-run homer and Ryan Yarbrough tossed six strong innings as Tampa Bay beat visiting Baltimore in St. Petersburg, Fla., despite going 2-for-11 with runners in scoring position.Yarbrough (4-3) allowed two runs, both unearned, on three hits and no walks with six strikeouts. It was his first start since he threw his first career complete game on June 3 in a 9-2 win over the New York Yankees.Andrew Kittredge and J.P. Feyereisen each pitched a scoreless inning in relief before Pete Fairbanks retired the Orioles in order in the ninth for his second save.Reds 11, Rockies 5Five different Cincinnati batters homered in each of the first five innings, and starter Tyler Mahle went six innings as the host Reds routed road-weary Colorado.Homers from Nick Castellanos, Scott Heineman, Joey Votto, Kyle Farmer and Tyler Stephenson off Rockies starter Kyle Freeland (0-2) marked the first time in Reds franchise history that five different batters went deep in each of the first five innings.Mahle (6-2) yielded a leadoff single to Raimel Tapia and a two-out walk to Charlie Blackmon to open the game but then retired the next 12 batters in winning his fourth straight start. Ryan McMahon and Brendan Rodgers homered for the Rockies.Marlins 4, Braves 3Sandy Alcantara pitched six strong innings and Jazz Chisholm Jr. hit a go-ahead two-run single, leading host Miami over Atlanta.Alcantara (4-5) struck out six and allowed five hits, two walks and two runs while winning his second straight start. Yimi Garcia, the fourth reliever used by the Marlins, stranded two baserunners in a scoreless ninth, earning his 11th save in 14 chances. Miami won for the third time in four games.For the Braves, who have lost three consecutive games, Ozzie Albies went 2-for-4 with two RBIs, and Ronald Acuna Jr. doubled twice, walked and scored twice while also swiping a base. Charlie Morton (5-3) had his personal three-game win streak snapped, losing his first game since May 7.Dodgers 12, Rangers 1Max Muncy, Justin Turner and Gavin Lux hit home runs in a six-run first inning and Los Angeles went deep five times on the way to a blowout over visiting Texas.The Rangers lost their 16th consecutive road game to match a franchise record set by the Washington Senators during their debut season of 1961. Texas last won on the road May 6 at Minnesota.The news was not all positive for the Dodgers, as Muncy left the game immediately after his home run with right side tightness. He was replaced at first base by Albert Pujols, who added a home run in the fourth inning. Los Angeles Cody Bellinger departed in the fifth inning due to left hamstring tightness after hitting an RBI single.Angels 6, Diamondbacks 5 (10 innings)Shohei Ohtani allowed two runs over five innings and doubled twice to help Los Angeles earn a 10-inning win over Arizona in Phoenix. Ohtani struck out eight, walked two and yielded five hits. He also drove in a run and scored another.Kurt Suzuki had three hits, including a home run, was twice hit by a pitch and drove in two runs for the Angels, who have won a season-high four straight games.Eduardo Escobar sent the game into extra innings with a two-out, two-strike homer in the ninth for the Diamondbacks, who have lost eight straight.Athletics 4, Royals 3Elvis Andrus followed a one-out double by Matt Chapman and an intentional walk with a walk-off single in the bottom of the ninth inning, allowing Oakland to beat visiting Kansas City despite blowing a late three-run lead.Chapman had three hits and scored twice for the As, who won for the seventh time in their last nine games. Andrus added two of Oaklands eight hits. As starter Cole Irvin was charged with just one earned run (two total) on six hits in six-plus innings.Salvador Perez hit two home runs for the Royals, giving him 16 for the season. Perez also singled as part of a 3-for-4 night.--Field Level Media"}