{"text": "G7 leaders agreed on Sunday to raise their contributions to meet an overdue spending pledge of $100 billion a year by rich countries to help poorer countries cut carbon emissions and cope with global warming, but only two nations offered firm promises of more cash.Alongside plans billed as helping speed infrastructure funding in developing countries and a shift to renewable and sustainable technology, the world's seven largest advanced economies again pledged to meet the climate finance target.But climate groups said the promise made in the summit's final communique lacked detail and the developed nations should be more ambitious in their financial commitments.In the communique, the seven nations - the United States, Britain, Canada, France, Germany, Italy and Japan -  reaffirmed their commitment to \"jointly mobilise $100 billion per year from public and private sources, through to 2025\".\"Towards this end, we commit to each increase and improve our overall international public climate finance contributions for this period and call on other developed countries to join and enhance their contributions to this effort.\"After the summit concluded, Canada said it would double its climate finance pledge to C$5.3 billion ($4.4 billion) over the next five years and Germany would increase its by 2 billion to 6 billion euros ($7.26 billion) a year by 2025 at the latest. There was a clear push by leaders at the summit in southwest England to try to counter Chinas increasing influence in the world, particularly among developing nations. The leaders signalled their desire to build a rival to Beijings multi-trillion-dollar Belt and Road initiative but the details were few and far between. Johnson, host of the gathering in Carbis Bay, told a news conference that developed nations had to move further, faster.\"G7 countries account for 20% of global carbon emissions, and we were clear this weekend that action has to start with us,\" he said as the summit concluded.\"And while it's fantastic that every one of the G7 countries has pledged to wipe out our contributions to climate change, we need to make sure we're achieving that as fast as we can and helping developing countries at the same time.\"PLEDGE OVERDUESome green groups were unimpressed with the climate pledges.Catherine Pettengell, director at Climate Action Network, an umbrella group for advocacy organisations, said the G7 had failed to rise to the challenge of agreeing on concrete commitments on climate finance.\"We had hoped that the leaders of the world's richest nations would come away from this week having put their money their mouth is,\" she said.Developed countries agreed at the United Nations in 2009 to together contribute $100 billion each year by 2020 in climate finance to poorer countries, many of whom are grappling with rising seas, storms and droughts made worse by climate change.That target was not met, derailed in part by the coronavirus pandemic that also forced Britain to postpone the U.N. Climate Change Conference (COP26) until later this year.The G7 also said 2021 should be a \"turning point for our planet\" and to accelerate efforts to cut greenhouse gas emissions and keep the 1.5 Celsius global warming threshold within reach.European Commission President Ursula von der Leyen said the G7 leaders had agreed to phase out coal.The communique seemed less clear, saying: \"We have committed to rapidly scale-up technologies and policies that further accelerate the transition away from unabated coal capacity, consistent with our 2030 NDCs and net zero commitment.\"The also pledged to work together to tackle so-called carbon leakage - the risk that tough climate policies could cause companies to relocate to regions where they can continue to pollute cheaply.But there were few details on how they would manage to cut emissions, with an absence of specific measures on everything from the phasing out of coal to moving to electric vehicles.Pettengell said it was encouraging that leaders were recognising the importance of climate change but their words had to be backed up by specific action on cutting subsidies for fossil fuel development and ending investment in projects such as new oil and gas fields, as well as on climate finance.British environmentalist David Attenborough appealed to politicians to take action.\"We know in detail what is happening to our planet, and we know many of the things we need to do during this decade,\" he said in a recorded video address to the meeting.\"Tackling climate change is now as much a political and communications challenge as it is a scientific or technological one. We have the skills to address it in time, all we need is the global will to do so.\"($1 = 1.2153 Canadian dollars)"}