{"text": "A look at the day ahead from Dhara Ranasinghe, senior markets correspondent, EMEA. The views expressed are her own. A week, it appears, is a long time in the world of financial markets. Hopes for a swift economic recovery, propelled by massive monetary and fiscal stimulus, have been replaced by fears over a resurgence in coronavirus infections -- wiping $3 trillion off the value of world stock markets.And so to the day after the night before, when all three major U.S. stock indexes lost well over 5%, posting their worst one-day percentage drop since mid-March. Asian shares have slumped more than 1%; oil prices are down more than 2% and the Chinese yuan is headed for its biggest daily decline in two weeks in a further sign of investors risk-averse mood.Europes main markets have opened 1% lower, although U.S. stock futures suggest a rebound for Wall Street later on.Still, just a week after markets globally were riding high on upbeat U.S. jobs data, a heavy dose a fear is back. After rallying hard since mid-May, markets are now facing a reality check over the prospects of V-shaped recovery.The CBOE volatility index, a barometer of investor anxiety, on Thursday posted its largest one-day point gain since March 16. The S&P 500, Europes Stoxx 600 index and the MSCI world equity index are all down around 6% this week. They are on track for their biggest weekly drop since March, when coronavirus-induced lockdowns sparked panic across markets.The pandemic is once again the source of the unease -- new infections of coronavirus in the United States are rising after five weeks of declines, according to a Reuters analysis.Economic data remain poor. Britains economy shrank by a record 20.4% in April from March as the country spent the month in a tight coronavirus lockdown, data on Friday showed.The cyclical segments of European markets are on the front line this morning, with banks, autos, travel and leisure under pressure, along with oil and gas. Among stocks under the spotlight is Ryanair after CEO Michael OLeary says the company is likely to book a net loss of 200 million to 300 million euros in the fiscal year ending on March 31 2021.Teleperformance will replace Sodexo in Frances CAC-40 index. Italys Moncler is teaming up with Frances Interparfums to start selling perfumes.Italian infrastructure group Atlantia swung to a net loss in the first quarter as the coronavirus impact compounded the fallout from a political dispute over its motorway concession. Still in Italy, the government is working on a plan to create a single national fiber optic network. Italian state lender Cassa Depositi e Prestiti may increase its stake in Telecom Italia to facilitate a plan to merge TIMs network assets with that of rival Open Fiber.Wednesdays sobering economic outlook from the U.S. Federal Reserve has not helped the mood, with Fed Chair Jerome Powell warning of a long road to recovery. Unsurprisingly, traders have resumed betting the Fed funds rate will fall below zero.The U.S. 10-year Treasury yield, which a week ago looked set to test 1%, is back down around 0.7%. In Europe, Germanys benchmark 10-year bond yield has tumbled 15 bps this week and is set for its biggest weekly drop since late Feb.In currency markets, there are signs of stabilisation this morning. After a 2% drop on Thursday, the risk-sensitive Aussie dollar is a touch stronger. So is the euro.Emerging markets also began to steady after a brutal sell-that off that sparked the South African rands worst day since 2016 and battered other currencies from Mexicos peso to Russias rouble. Indonesias rupiah was the worst hit of Southeast Asias emerging-market currencies on Friday on rising domestic coronavirus infections. The rupiah sank as much as 1.5% against the dollar and is on course for its biggest intraday fall since early May."}