{"text": "May 12 - A look at the day ahead from Julien PonthusGlobal equity markets continue their retreat from the record highs reached at the beginning of the week on the back of a stellar first-quarter earnings season and higher inflation.Asian shares fell to seven-week lows, with European and U.S. stock futures trading lower.With fiscal and monetary stimulus in full swing backing the economic recovery, theres no shortage of sell-side analysts pitching to buy the dip and ignore short-term inflation jitters.But no matter how good todays batch of corporate results turns out to be, theres little chance investors will rush to drastically change the direction of travel before todays U.S. CPI.The indicator is expected to show a 3.6% rise year-on-year and any sign inflation is getting out of the toothpaste tube faster than feared could knock equity risk premiums hard.The yield on benchmark 10-year Treasuries is currently at 1.62% but could test the 1.77% high seen at the end of March on strong data.For many pundits, theres a fat risk that the sell tech and growth knee jerk reaction to inflation might morph into an ugly sell everything correction.In the meantime there were no surprises from Germanys inflation data this morning and Britains economy shone, growing a firm 2.1% in March from February. In China, vehicle sales rose 8.6% in April -- a 13th consecutive month of gains.On the commodities front, oil prices edged up after a drop in U.S. crude inventories reinforced OPECs robust demand outlook, while the market awaited fresh updates on the Colonial Pipeline outage.In terms of corporate earnings, theres nothing to spoil the mood in the upbeat European banking scene with Germanys Commerzbank swinging to a first quarter profit and Dutch bank ABN Amro, hit by a hefty fine for money laundering, landed results in line with analysts average expectations.For emerging markets, Taiwan may take the spotlight. Its stock market slid more than 8%,set for their worst day in over 26 years as authorities mulled tighter restrictions to tackle a rise in domestic COVID-19 cases.Key developments that should provide more direction to markets on Wednesday:- Zurich Insurance posts a solid first quarter- SoftBank reports a $37 bln profit at its Vision Fund unit- U.S. 10-year Treasury auction- Fed: Vice Chairman Richard Clarida, Philadelphia President Patrick Harker speak - Bank of England Governor Andrew Bailey at ISDA event"}