{"text": "Top U.S. Food and Drug Administration regulators said on Saturday that most Americans with allergies should be safe to receive the COVID-19 vaccine developed by Pfizer Inc and Germanys Biotech SE.The FDA, which authorized the nations first COVID-19 vaccine on Friday night, said that only people who have previously had severe allergic reactions to vaccines or ingredients in this particular vaccine should avoid getting the shot.Were telling people that unless theyve had a severe allergic reaction to the vaccine, or one of its components, they can receive it, Dr. Peter Marks, director of the FDA division that authorized the vaccine, said at a press conference.After Britain began inoculations this week, two people with severe allergies reported side effects and the British medicine regulator advised that anyone with a history of anaphylaxis to a medicine or food should not get the Pfizer-BioNTech vaccine.About 1.6% of the population has had a severe allergic reaction of some sort or another to a food or some environmental aspect and we would really not like to have that many people not be able to receive the vaccine, Marks said.The vaccine is seen as a key tool in stemming the coronavirus pandemic that has killed nearly 300,000 people in the United States.The FDA advised people with allergies to consult with their doctors to make sure that they are not allergic to any of the component of the vaccine.Pfizer executives said on Friday that there had been no cases of severe allergic reactions to the vaccine during its nearly 44,000 volunteer late-stage clinical trial. That trial excluded people with a history of severe allergic reactions to any vaccine or to the Pfizer-BioNTech vaccines ingredients.They said there were no anaphylactic episodes related to the vaccine in the trial, which did include about 6,000 participants respectively in both the vaccine and placebo groups with a range of allergic conditions such as pollen allergies and food allergies. Those participants had a history of symptoms including anaphylaxis."}