{"text": "Lewis Hamilton said he had been moved by a letter from the son of a man facing the death penalty in Bahrain and assured activists on Saturday he would not let human rights issues go unnoticed.Campaigners sent letters to the seven-times Formula One world champion last month before the first of two grands prix in Bahrain.Hamilton had said then that he needed time to digest the content.Asked for an update ahead of the season-ending Abu Dhabi Grand Prix, Hamilton said he had hoped to meet Bahrains Crown Prince but testing positive for COVID-19 had ruled that out. It had given him more time to read the letters, however.Ultimately, it isnt necessarily my responsibility to speak out on the places that I dont know everything about but I think we together always have to work to push for change and improvements, he said.I think the saddest thing for me was that there is a young man on death row and its not clear... when his son writes me a letter, that really hits home. All lives matter. I think theres definitely work to be done in the background.I definitely wont let it go unnoticed, he added.When I get some time now, I will definitely try and speak to those (people) and see how I can positively impact that (race) weekend (in future).Sayed Alwadaei, director of the London-based Bahrain Institute for Rights and Democracy (BIRD), said 11-year-old Ahmed Ramadhan had written to Hamilton for help.His father Mohammed, a security guard, was sentenced in 2014 over the death of a policeman. Human rights groups say the conviction was based on confessions extracted through torture.Bahrains government has said the case met all requirements of a fair trial, and the initial judgment was followed by a second trial that looked into the allegations of abuse.Hamilton was also sent a photograph, through the Mercedes team, of Ahmed holding a drawing of his racing car.Hamilton has urged Formula One to do more to push for human rights, saying the issue was a massive problem in some of the sports host countries.Bahrains 2011 race was called off due to civil unrest in the island kingdom and the grand prix, the countrys biggest sporting event, regularly draws criticism from rights campaigners.The sport is also set to race in neighbouring Saudi Arabia for the first time next year, a move criticised by Amnesty International.Formula One chairman Chase Carey said before the Bahrain Grand Prix that the sport was a force for good in the countries it visits.Campaigners have accused the government of using the positive publicity surrounding the race to sportswash the situation.Alwadaei said Hamiltons latest words were a watershed moment for international sport.When world champions like Lewis Hamilton choose to speak out, lives can change forever, he said."}