{"text": "(Reuters) -Seven-times world champion Lewis Hamilton said he was still feeling the after-effects of COVID-19 after qualifying third for Formula Ones Abu Dhabi season-ender but vowed to give his all in Sundays race.The 35-year-old Mercedes driver has returned after testing positive for the new coronavirus and missing the Sakhir Grand Prix in Bahrain last weekend. He has tested negative repeatedly this week.The Briton did not want to go into medical detail but said the virus had to be taken seriously and he felt for all those who had suffered from it or were mourning loved ones.I am not 100%, I still have some feeling within my lungs, he said.Normally, I would drive even if one of my arms was hanging off. Thats what we do as racing drivers and luckily thats not the case, he added.It definitely wont be the easiest of races physically but I will manage and give it absolutely everything Ive got.Hamilton clinched his record-equalling seventh championship in Turkey last month and is the most successful F1 driver of all time.He has won 11 of 16 races this year, equalling his best season performance, and had been aiming for a 99th career pole on Saturday.A 12th win of 2020 would be the icing on the cake of another stellar season that has seen Mercedes take both titles for the seventh year in a row.One of the (COVID) symptoms is it really drains you so Im trying to sleep as much as I can, said Hamilton. Recharging is not as easy as it perhaps normally has been in the past.Mercedes team boss Toto Wolff defended his driver when asked whether he should be racing.I think thats expected after 10 days of COVID-19, you are not going to be on your A game. But I think absolutely good enough to race, he said.Pressed further on whether there was still a chance Hamilton might not start, the Austrian said it was Hamiltons call to decide whether he was fit enough.Hes a very experienced driver, he knows very well about his health and hes been tested negative. And sometimes drivers are not perfectly well but they still race and I think this is the situation."}