{"text": "MUMBAI Millions went without power in Indias financial capital Mumbai and surrounding areas for hours on Monday, after a grid failure triggered its first major blackout in more than two years.The outage stranded thousands of train passengers, disrupted online college exams and affected mobile telephone services before power was restored to most parts of the city of some 20 million.The grid failure was caused by technical problems during maintenance work, the energy minister of Mumbais home state of Maharashtra said. In mid-2018, a fire at a transformer sparked similar power cuts in the city and its suburbs.Throughout Mondays breakdown, Mumbais international airport and the countrys two main stock exchanges located in the city, the National Stock Exchange and BSE, operated normally, their spokespeople said.Power supply to all essential services in Mumbai, suburbs ... have been restored. Non-essential services will also be restored shortly, Maharashtra energy minister Nitin Raut said on Twitter.The government-run Brihanmumbai Electric Supply and Transport agency, Adani Power Ltd and Tata Power Co Ltd - the three main suppliers to Mumbai - had all been affected by the outage that extended to hospitals, many of which are treating COVID-19 patients.Hospitals and other institutions in India have over the years banked on emergency diesel power generators as a backup due to frequent outages caused by demand outstripping supply. The situation has improved in the big cities but the countryside still has to live with frequent power cuts.Mumbais trains, which are generally packed and move more than seven million people a day to their offices and factories, have resumed operations after more than two hours of inactivity due to the power failure.Train services in the city have been curtailed due to the COVID-19 pandemic and they are carrying far fewer passengers than usual. Still, social media was splashed with pictures of people stranded inside lightless trains and in railway stations.The Times of India said final-year online exams across Mumbai colleges have been postponed due to the blackout."}