{"text": "Anastasia Pavlyuchenkova came close to claiming a maiden Grand Slam title in her 52nd appearance in the main draw of a major, but after Saturday's French Open final she said she was ultimately betrayed by her own body.She had her left leg wrapped in tape in the second set, and the Russian revealed that she had been suffering from a knee problem since the third round.She fought throughout but bowed out with a 6-1 2-6 6-4 defeat as her Czech opponent, Barbora Krejcikova, won her first Grand Slam title.\"My leg, I have to be honest, I wasn't mentioning because I was still in the tournament. I didn't want my opponents to hear. But the Sabalenka match (in the third round), I was actually in a really bad shape physically,\" Pavlyuchenkova told reporters.\"I don't know how I even won that match because I also had a medical treatment there, I had to wrap my leg. I've struggled with my knees for a while, with my left knee.\"That caused a lot of pain in my knee after because I compensate a lot in my body. Actually in the third set during the Sabalenka match, I said to myself, 'If I win this match, I'm going to cry'. It's such a shame, I play so good, but my body says this to me: 'I don't want to continue'.\"It left Pavlyuchenkova with problems on her service games, and she was broken six times by Krejcikova.\"When I was landing on my serve, I felt a lot of pain on the back of my leg. It was almost like pulling, so I had to wrap it up. Then I lost that game 4-3 (in the third set) because it was against the wind,\" she explained.\"I always felt like she was pushing on my serve. I felt like I needed to do a little bit more with my serve.\"Pavlyuchenkova, however, was grateful that she had reached the final, after never making it beyond the last eight at any Grand Slam before.\"I want to believe that the best is yet to come, so I think that's how I should approach the whole situation,\" she said.\"I said to myself today, watching my friends, that at the start of course I was close to cry, it's always sad to lose, but then when I looked at my friends, I think there are much more important stuff in life than sometimes even this trophy.\"I feel loved. I think that's the best thing you can have is friends and a life outside tennis, as well, which is actually even meant more than the trophy today.\""}