{"text": "Supporters of ousted Myanmar leader Aung San Suu Kyi clashed with police on Friday as hundreds of thousands joined nationwide pro-democracy demonstrations in defiance of the military juntas call to halt mass gatherings.The United Nations human rights office said more than 350 people, including officials, activists and monks, have been arrested in Myanmar since the Feb. 1 coup, including some who face criminal charges on dubious grounds.The U.N. rights investigator for Myanmar told a special session of the Human Rights Council in Geneva that there were growing reports, photographic evidence that security forces have used live ammunition against protesters, in violation of international law.Special Rapporteur Thomas Andrews urged the U.N. Security Council to consider imposing sanctions and arms embargoes.Myint Thu, Myanmars ambassador to the United Nations in Geneva, told the session that Myanmar did not want to stall the nascent democratic transition in the country, and would continue international cooperation.Fridays mostly peaceful protests were the biggest so far, and came a day after Washington imposed sanctions on generals who led the takeover.Three people were wounded when police fired rubber bullets to break up a crowd of tens of thousands in the southeastern city of Mawlamyine, a Myanmar Red Cross official told Reuters.Footage broadcast by Radio Free Asia showed police charging at protesters, grabbing one and smashing him in the head. Stones were then thrown at police before the shots were fired.Three got shot  one woman in the womb, one man on his cheek and one man on his arm, said Myanmar Red Cross official Kyaw Myint, who witnessed the clash.Several people in Mawlamyine were arrested but later released when a thousands-strong crowd stood outside the police station and demanded they be freed, according to live footage broadcast by Radio Free Asia.A broadcast by state-run Myanmar Radio and Television (MRTV) said police had fired 10 rubber bullets because protesters were continuing violent acts without dispersing from the area. The report made no mention of any people being wounded.Doctors have said they do not expect a 19-year-old woman shot during a protest in the capital Naypyitaw on Tuesday to survive. She was hit in the head with a live round fired by police, witnesses said.In the biggest city Yangon on Friday, hundreds of doctors in white duty coats and scrubs marched past the golden Shwedagon pagoda, while in another part of town, football fans wearing team kits marched with humorous placards.Other demonstrations took place in Naypyitaw, the coastal town of Dawei, and in Myitkyina, the capital of northern Kachin state, where young men played rap music and staged a dance-off.Social media giant Facebook said it would cut the visibility of content run by Myanmars military, saying they had continued to spread misinformation after seizing power.The generals have sought to justify their takeover by saying there was fraud in an election last November won by Aung San Suu Kyis National League for Democracy (NLD), a claim rejected by the countrys election committee.In a letter read out to the U.N. rights council in Geneva, some 300 elected parliamentarians from Myanmar called on the United Nations to investigate gross human rights violations committed by the military since its coup.The 47-member council later adopted a resolution calling on Myanmar to release Suu Kyi and other officials from detention and refrain from using violence on protesters. Myanmars envoy said before the vote that the resolution was not acceptable.CALL FOR MORE ACTIONSSupporters of the NLD welcomed the U.S. sanctions but said tougher action was needed.We are hoping for more actions than this as we are suffering every day and night of the military coup here in Myanmar,  Suu Kyi supporter Moe Thal, 29, told Reuters.Myint Thu, Myanmars U.N. ambassador in Geneva, told the special rights council session that his government wanted better understanding of the prevailing situation in the country, and constructive engagement and cooperation from the international community.The United Nations Myanmar office said on Friday it was essential that lifesaving humanitarian assistance continues unimpeded in the country and that humanitarian partners are given timely and safe access to the populations in need.Fridays protests marked the seventh consecutive day of demonstrations, including one on Thursday outside the Chinese Embassy where NLD supporters accused Beijing of backing the junta, something Beijing has denied.Security forces carried out more arrests overnight Thursday.The junta remitted the sentences of more than 23,000 prisoners on Friday, saying the move was consistent with establishing a new democratic state with peace, development and discipline and would please the public.The protests have revived memories of almost half a century of direct army rule, punctuated by bloody crackdowns, until the military began relinquishing some power in 2011.The generals have promised to stick to the 2008 constitution and hand over power after elections. No date has yet been set for the vote."}