{"text": "Nasdaq (NDAQ.O) said on Friday it will remove shares of four Chinese construction and manufacturing companies from indexes it maintains in response to a U.S. order restricting purchase of their shares.The securities, which are not traded on the Nasdaq exchange,  will be removed from the indexes on Dec. 21. They include China Communications Construction Co (601800.SS), China Railway Construction Corp (601186.SS), CRRC Corp (601766.SS) and Semiconductor Manufacturing International Corp (0981.HK), Nasdaq said in a statement.A White House executive order last month barred U.S. investors from buying securities of blacklisted firms, starting in November 2021. The administration of President Donald Trump alleged the companies were linked to China's military.China condemned the move, saying the effort ran counter to principles of market competition. \"The U.S. should stop abusing national power and national security concepts to suppress foreign companies,\" Foreign Ministry spokeswoman Hua Chunying said on Dec. 4. A spokeswoman for index provider MSCI Inc (MSCI.N) said via e-mail on Friday the firm has spoken with clients about possible changes and will communicate \"any necessary changes\" soon.Index FTSE Russell said on Dec. 4 it would delete shares of eight Chinese companies in light of moves by the White House.S&P Dow Jones Indices said on Dec. 10 it would remove mainland-listed A-shares, Hong Kong-listed H-shares and American Depositary Receipts (ADRs) of 10 companies including Hangzhou Hikvision Digital Technology Co Ltd (002415.SZ) from all equity indexes prior to the market open on Dec. 21.     The steps by the index providers show the practical impact of the U.S. order. U.S. investors often hold their China equity exposure in passive products built on broad indexes.The four Chinese companies being removed by Nasdaq are the only ones among those on the White House list that appear in Nasdaq indexes, a spokeswoman said. Nasdaq leaders were not immediately available for further comment. "}