{"text": "Dutch-listed technology investor Prosus NV (PRX.AS) plans to raise its stake in South African parent Naspers (NPNJn.J) to nearly 50% in a share swap deal that will move part of their huge holding in China's Tencent to Amsterdam from Johannesburg.Naspers is Africa's biggest listed company because of its Tencent (0700.HK) holding but its shares trade at a steep discount to the value of its stake, which led it to list Prosus in 2019.Under the deal announced on Wednesday, Prosus will issue new shares to buy up to 45.4% of Naspers shares, effectively moving part of Naspers from the Johannesburg bourse to Euronext in Amsterdam, another fillip for the Dutch market which has won ground from London following Brexit.\"We expect the transaction will create value for both Naspers and Prosus shareholders, both at the point of execution and for the long term,\" Bob van Dijk, CEO of both companies, said on a call with reporters.Naspers, which will retain a controlling stake in Prosus, hopes the deal will improve valuations for both.The 28.9% stake that Prosus holds in software and gaming giant Tencent Holdings is worth 172 billion euros ($208.6 billion) at current market prices. Prosus has a market capitalisation of 138 billion euros and Naspers of 80 billion euros.Van Dijk said Prosus shareholders would benefit as Naspers shares are more deeply discounted. Prosus trades at a 20% discount, and Naspers at a 35% discount, relative to their economic interests in the Tencent stake.DOMINANCENaspers has struggled with its relative dominance on the Johannesburg exchange and its shareholders have long lobbied for the company to reduce the valuation gap. read more The deal would address those issues, Van Dijk said, and he predicted the offer, which is voluntary, would be fully subscribed.Naspers will remain the largest company on the Johannesburg stock exchange, but will see its weighting on the exchange's leading share index fall to 14% from 23%.The deal will increase Prosus's float on the Euronext stock exchange to around 42.8%, from 27% at present, making it eligible for inclusion among indexes of Europe's largest companies.Analysts and fund managers welcomed the move.Peter Takaendesa, head of equities at Mergence Investment Managers, said while the move is a decent solution it might not be enough to close the valuation gap, and suggested selling the Tencent stake down would be more direct.Shares in Prosus rose 1.8% to 86.30 euros in Amsterdam while Naspers shares rose 2.6% to 325.67 rand in Johannesburg by 0803GMT.Last month Prosus sold 2% of Tencent for $14.7 billion, in one of its largest strategic moves since its 2019 public listing in Amsterdam. Van Dijk repeated Wednesday the stake will not be further reduced for 3 years.  read more The companies said they expect the share deal to be implemented in the third quarter of 2021.($1 = 0.8247 euros)"}