{"text": "Naspers (NPNJn.J) Chief Executive Bob van Dijk is going all-in to crush his South African discount. The $100 billion internet group on Wednesday launched a long-awaited move to take pressure off its Johannesburg-listed stock via a share swap with Amsterdam-based offshoot Prosus (PRX.AS). That leaves the Dutchman with a harder challenge: shrinking the persistent valuation gap with its $212 billion stake in Chinas Tencent (0700.HK).Van Dijks rejig is the latest in a string of increasingly intricate attempts to reduce the disconnect between Naspers market value and the worth of its underlying assets. The listing of Prosus in 2019 has had limited success: creating a European holding company merely split the discount in two.Prosus assets, including its 28.9% stake in the Chinese internet giant, are worth about $248 billion, according to Breakingviews calculations based on current share prices and Bank of America estimates. That implies Naspers, which owns 73% of Prosus, has an underlying net asset value of $180 billion. Its market value, however, is little more than half that figure.A gap will endure as long as van Dijk remains wedded to owning a big chunk of Tencent, and as long as Naspers super-voting stock allows it to ward off activist investors. However, the company has more leeway to reduce its outsized weighting on the Johannesburg stock exchange. Naspers currently accounts for around 23% of the bourse, forcing local fund managers regularly to sell shares in order to limit their exposure to a single company.The proposed share swap should reduce the weighting to around 14%. The price of the rejig, however, is a convoluted cross-shareholding structure whereby Prosus will own up to 49.5% of its parent. Thats as far as it can go without triggering a change of control at Naspers which would incur an estimated $50 billion tax bill from Pretoria. Intriguingly, however, Naspers will tighten its grip on its subsidiary through a new class of unlisted voting shares, further disconnecting its governance clout and market value.For Naspers shareholders the prospect of a 3.2% premium, based on Tuesdays closing prices, combined with switching from the volatile rand into euro-denominated Prosus, may be a sufficient lure. Less clear is whether Prosus narrows its own discount. Increasing its effective free float in Amsterdam should in theory attract more interest from index-tracking funds. But such efforts have failed so far. And, for now at least, van Dijk appears to have played his best cards.Follow @edwardcropley on TwitterCONTEXT NEWS- Amsterdam-based technology investor Prosus on May 12 announced plans to buy up to 45.4% of its parent, South Africa-listed Naspers, in an attempt to narrow the valuation discount between both companies and Prosus 28.9% stake in Chinese Internet giant Tencent, currently worth $211 billion.- Under the proposed deal, Prosus is offering to exchange one Naspers share for 2.27443 newly issued shares in Prosus. On completion, Prosus will hold a 49.5% interest in Naspers, while Naspers will own 57.2% of Prosus.- Prosus shares were up 2% at 86.44 euros by 0759 GMT on May 12, while Naspers shares were up 2.7% at 3,216 rand."}