{"text": "GENEVA Extreme weather events have increased dramatically in the past 20 years, taking a heavy human and economic toll worldwide, and are likely to wreak further havoc, the United Nations said on Monday.Heatwaves and droughts will pose the greatest threat in the next decade, as temperatures continue to rise due to heat-trapping gases, experts said.China (577) and the United States (467) recorded the highest number of disaster events from 2000 to 2019, followed by India (321), the Philippines (304) and Indonesia (278), the U.N. said in a report issued the day before the International Day for Disaster Risk Reduction. Eight of the top 10 countries are in Asia.Some 7,348 major disaster events were recorded globally, claiming 1.23 million lives, affecting 4.2 billion people and causing $2.97 trillion in economic losses during the two-decade period.Drought, floods, earthquakes, tsunamis, wildfires and extreme temperature events caused major damage.The good news is that more lives have been saved but the bad news is that more people are being affected by the expanding climate emergency, Mami Mizutori, the U.N. Secretary-Generals Special Representative for Disaster Risk Reduction, told a news briefing.She called for governments to invest in early warning systems and implement disaster risk reduction strategies.Debarati Guha-Sapir of the Centre for Research on the Epidemiology of Disasters at the University of Louvain, Belgium, which provided data for the report, said: If this level of growth in extreme weather events continues over the next twenty years, the future of mankind looks very bleak indeed.Heatwaves are going to be our biggest challenge in the next 10 years, especially in the poor countries, she said.Last month was the worlds hottest September on record, with unusually high temperatures recorded off Siberia, in the Middle East, and in parts of South America and Australia, the European Unions Copernicus Climate Change Service said.Global temperatures will continue to warm over the next five years, and may even temporarily rise to more than 1.5 degrees Celsius above pre-industrial levels, the World Meteorological Organization (WMO) said in July. Scientists have set 1.5C (2.7 Fahrenheit) as the ceiling for avoiding catastrophic climate change."}