{"text": "Carmelo Anthony made two free throws with 3.1 seconds left to break a tie and cap his 17-point fourth-quarter outburst to spark the Portland Trail Blazers to a 118-114 victory over the visiting Philadelphia 76ers on Thursday night.Anthony, who made his first six shots in the fourth quarter, finished with a season-best 24 points on 9-of-15 shooting as the Trail Blazers won for the fourth time in the past five games.Damian Lillard added a team-leading 30 points despite making just 6 of 21 field-goal attempts for Portland.Joel Embiid had 35 points and nine rebounds but couldnt prevent Philadelphia from losing for just the second time in the past eight games. Both setbacks during the stretch are to the Trail Blazers.Miami Heat 101 - Houston Rockets 94Jimmy Butler posted a triple-double, Bam Adebayo flirted with one and visiting Miami erased a first-half, double-digit deficit to beat Houston.Butler finished with 27 points, 10 rebounds and 10 assists while Adebayo added 10 points, 13 rebounds and eight assists. Max Strus (21 points off the bench) and Duncan Robinson (15 points) each made five 3-pointers to co-author the second-half comeback for the Heat.John Wall finished with 17 points and seven assists, sharing team scoring honors with Eric Gordon. DeMarcus Cousins (11 rebounds) and JaeSean Tate scored 16 apiece for the Rockets, who have dropped four consecutive games.Golden State Warriors 111 - Orlando Magic 105Stephen Curry saved six of his game-high 40 points for a late 16-0 flurry that propelled Golden State out of a fourth-quarter deficit and into a victory over Orlando in San Francisco.Curry hit 14 of his 26 shots to pace the Warriors, who won their second straight. Andrew Wiggins finished with 21 points for Golden State, while Kelly Oubre Jr. had 17 to go with a team-high 10 rebounds.Nikola Vucevic had 25 points, a game-high 13 rebounds and five assists for the Magic, who get a home rematch with the Warriors next Friday.Boston Celtics 120 - Toronto Raptors 106Semi Ojeleye scored a career-high 24 points, Payton Pritchard added 20 and Boston made 20 3-pointers on its way to a victory over visiting Toronto.Ojeleye and Pritchard each hit six 3s as the Celtics won for just the second time in their last five games. Kemba Walker scored 21 points on five treys, and Jayson Tatum had 17 points and nine assists. Jaylen Brown chipped in a 12-point, 10-assist double-double despite 3-for-14 shooting.Boston had assists on 30 of its 39 baskets and shot 51.3 percent from behind the arc.Indiana Pacers 111 - Detroit Pistons 95Domantas Sabonis piled up 26 points, eight rebounds and eight assists and Indiana snapped a four-game losing streak by pulling away from host Detroit.Sabonis added three steals and two blocks and Malcolm Brogdon had 18 points, nine rebounds and four assists. Jeremy Lamb tossed in 17 points off the bench and Myles Turner had 14 points and eight rebounds.Justin Holiday chipped in 11 points and T.J. McConnell filled the stat sheet with seven points, seven assists, six rebounds and two steals for the Pacers.--Field Level Media"}