{"text": "Giannis Antetokounmpo scored 13 of his 22 points in the second half to lift the Bucks to a 121-99 victory over the host Orlando Magic on Monday, Milwaukees fifth win in six games.Khris Middleton collected 20 points and 10 rebounds and Bobby Portis finished with 20 points off the bench for Milwaukee. Middleton made 9 of 17 shots and Portis went 9 of 13 for the Bucks, who shot 50.5 percent (46 of 91) from the floor.Orlandos Nikola Vucevic recorded 28 points and 13 rebounds for his third straight double-double and eighth of the season. Aaron Gordon had 21 points and eight assists for the Magic, who have dropped three in a row and five of seven since starting the season with a franchise-best 4-0 record.Charlotte Hornets 109 - New York Knicks 88Gordon Hayward scored 28 of his 34 points in the first half and host Charlotte picked up its fourth consecutive victory by defeating New York.Devonte Graham added 19 points, P.J. Washington and Miles Bridges each provided 13 points each and Terry Rozier had 12 points for the Hornets. Rookie guard LaMelo Ball, a 19-year-old who became the youngest player in NBA history to produce a triple-double two nights earlier, pulled in a game-high 14 rebounds to go with eight points, seven assists and three steals in a reserve role.Kevin Knox II, coming off the bench, poured in 19 points to lead the Knicks. Elfrid Payton posted 15 points, Austin Rivers had 13, Mitchell Robinson scored 12 and Julius Randle and RJ Barrett both contributed 11. Barrett shot 5-for-18 from the field, missing all five of his 3-point attempts.Memphis Grizzlies 101 - Cleveland Cavaliers 91Dillon Brooks scored 21 points and Jonas Valanciunas notched two of his 12 points on a critical put-back with less than two minutes remaining as Memphis rallied to win at Cleveland.Brooks capped his team-high scoring performance on a deep 3-pointer with 36.1 seconds remaining, the final points of a game-sealing 7-0 run for the Grizzlies. The decisive stretch began on Valanciunas put-back, which was one of the centers seven rebounds.The entire Cavaliers starting five scored in double figures, led by Andre Drummond with 19 points. Drummond also grabbed 14 rebounds to continue his streak of recording double-doubles in each of Clevelands 11 games this season. Cedi Osman and Damyean Dotson both scored 14 points.Atlanta Hawks 112 - Philadelphia 76ers 94Trae Young had 26 points and eight assists to help host Atlanta end its four-game losing streak with a win over short-handed Philadelphia.Atlanta also got 15 points and seven rebounds from DeAndre Hunter, 12 points and 11 rebounds from Clint Capela and 12 points and seven rebounds from John Collins. Brandon Goodwin came off the bench to score 15.Philadelphia rookie Isaiah Joe made four 3-pointers and scored a season-high 18. Tyrese Maxey scored 15 and rookie Dakota Mathias scored a season-high 14. The 76ers lost their third straight game.Washington Wizards 128 - Phoenix Suns 107Bradley Beal finished with a game-high 34 points to go along with eight rebounds and a team-high nine assists to power host Washington to an easy victory over Phoenix.Davis Bertans finished with 18 points by making six 3-pointers off the bench for Washington. Raul Neto had 16 points, Robin Lopez and Garrison Mathews 11 apiece and Rui Hachimura 10. Lopez added a game-high 11 rebounds.Devin Booker came up one point short in his personal duel with Beal, totaling a team-high 33 points for the Suns, who never led. Chris Paul notched 14 points and a game-high 11 assists while Mikal Bridges chipped in 14 points and Dario Saric had 13.--Field Level Media"}