{"text": "Fields across the Canadian Prairies and the U.S. Northern Plains are among the driest on record, raising production risks in one of the worlds key growing regions for canola and spring wheat.As planting season begins, the dusty soils generate fears that seeds will fail to germinate or yield smaller crops in a year when demand for canola already far outstrips supply. Unusually strong wheat exports to China for animal feed have also lowered global supplies of the main ingredient in bread and pasta.Prices of canola , which is processed into vegetable oil and animal feed, hit all-time highs in February and Canadian supplies look to dwindle by midsummer to an eight-year low.Spring wheat futures are trading near their highest levels since 2017, the last time significant drought gripped the northern U.S. Plains.\"I guess we seed in faith, hoping it's going to rain,\" said Steven Donald, 41, a fourth-generation member of a family-owned grain and cattle farm near Moosomin, Saskatchewan. \"It's the driest that we can remember.\"Donald's fields are powder-dry. His pastures crunch under his boots and contain gaping cracks.In eastern Saskatchewan and Manitoba, a dry winter followed scant rainfall during the last growing season, said Bruce Burnett, director of markets and weather at Glacier FarmMedia.Much of western Manitoba had the driest or close to the driest winter in more than a century of records, according to Agriculture and Agri-Food Canada data. Most of arable Manitoba and southern Saskatchewan faces severe to extreme drought, the federal department said on Friday.Many farmers are adjusting by scaling back canola plantings, said Neil Townsend, FarmLink Marketing Solutions' chief market analyst, citing surveys. Canola is especially vulnerable to drought that can prevent seeds from germinating.RECORD-BREAKING DRYNESS IN NORTH DAKOTAAcross the border in North Dakota, the top U.S. spring wheat producer, the last six months have been the driest in records dating to 1895, said Adnan Akyuz, the state's official climatologist. The latest weekly U.S. Drought Monitor showed 70% of North Dakota in \"extreme drought,\" up from 47% the previous week.The Drought Monitor shows a better outlook for corn and soybeans, the main U.S. cash crops, mostly grown farther south.Rain and snow are expected in North Dakota this week, according to meteorologist Greg Gust with the National Oceanic and Atmospheric Administration.But it is unlikely to amount to much relief, although showers are possible in the 16-30-day period, said Joel Widenor, agriculture meteorologist with the Commodity Weather Group. Most of the state's wheat crop is planted in late April and May.Statistics Canada will issue its first report on planting intentions on April 27. Farmers are likely to seed 4% more canola, mainly in northern areas with more soil moisture, Agriculture Canada said on March 18.The U.S. Department of Agriculture last month projected that North Dakota farmers would plant 7 million acres of soybeans, making it the state's most-planted crop, while spring wheat acres would fall 2% to 5.6 million.Soil erosion is a concern as winds whip the region, said Jim Peterson of the North Dakota Wheat Commission. As a result, wheat may lose more acres to soybeans, which farmers can plant into June without stirring up fields to apply fertilizer, he said.Conditions are the driest that Minto, Manitoba, farmer Jake Ayre and his family have seen since emigrating to Canada from England in 2002. But most planting in the region, known for its volatile weather, occurs in May.\"We're not panicking,\" Ayre said. \"My dad said, 'We're always three weeks away from a drought, three weeks away from a flood.'\""}