{"text": "WASHINGTON, Jan 12 The new chair of the U.S. Postal Board of Governors endorsed the leadership of Postmaster General Louis DeJoy and called on lawmakers to approve a sweeping financial reform measure.The board on Wednesday unanimously elected Roman Martinez, a retired investment banker as chair after President Joe Biden declined to renominate Ron Bloom to a new term on the board.Martinez, who was nominated by then President Donald Trump to the board, praised DeJoys tenure. He is the person to carry out the restructuring that is needed... He is a transformational leader.Many Democrats have urged the Postal Board to fire DeJoy, a supporter of Trump named USPS head in 2020 who came under fierce criticism for changes to election mail deliveries.Congress has been considering a bipartisan plan to provide the USPS with $46 billion in financial relief over 10 years, including eliminating the requirement that the service pre-fund retiree health benefits for 75 years.DeJoy on Wednesday thanked congressional and key committee leaders for what he said was their commitment to advancing this bill in the coming weeks. Lawmakers have not publicly announced a timetable for acting on the USPS reform bill and did not immediately comment Wednesday.DeJoy said it will eliminate the unfair funding requirements for our retiree health benefits.... It is fair, it is needed and it is urgent.Martinez said USPS is not looking for a handout from Congress.USPS has reported net losses of more than $90 billion since 2007. One reason is 2006 legislation mandating it pre-fund more than $120 billion in retiree healthcare and pension liabilities. Other businesses do not have to pre-fund their pensions so extensively, and labor unions have called the requirement unfair.DeJoy in March proposed cutting $160 billion in predicted losses over the next decade, including in October slowing down some first-class mail deliveries.The USPS, which struggled with poor delivery performance after facing a huge jump in packages and staffing issues due to COVID-19, reported a strong performance in the 2021 holiday season delivering 13.2 billion pieces of mail and packages in 2.7 days on average, up from 12.7 billion in the 2020 timeframe. (Reporting by David Shepardson; Editing by David Gregorio)"}