{"text": "New Yorks state pension fund is restricting investment in six Canadian oil sands companies because they have not shown they are prepared for a transition to a low-carbon future, the funds Comptroller Thomas DiNapoli said on Monday.The New York State Common Retirement Fund will divest more than $7 million in securities already held in the companies, and not make any further investments in them, DiNapoli said in a statement.Canada's oil sands hold the world's third-largest crude reserves and have some of the highest emissions intensity per barrel, due to the carbon-intensive production process of extracting tar-like bitumen from the ground.Climate-focused investors are putting increasing pressure on the companies to reduce their greenhouse gas emissions or face divestment. In December, the fund said it would help curb climate change by transitioning its investments to net-zero greenhouse gas emissions by 2040, making it the first U.S. pension fund to set the goal by that date. \"We have carefully reviewed companies in the oil sands industry and are restricting investments in those that do not have viable plans to adapt to the low-carbon future,\" DiNapoli said. \"Companies responsible for large greenhouse gas emissions like those in this industry, pose significant risks for investors.\"The companies are Imperial Oil (IMO.TO), Canadian Natural Resources Ltd (CNQ.TO), MEG Energy Corp (MEG.TO), Athabasca Oil Corp (ATH.TO), Japan Petroleum Exploration Ltd (1662.T), and Cenovus Energy Inc (CVE.TO). A seventh company mentioned in DiNapoli's statement, Husky Energy, was acquired by Cenovus in January.New York State continues to invest in oil sands producer Suncor Energy (SU.TO).The fund is the third-largest pension fund in the United States with an estimated valuation of about $248 billion.\"The smart money, led by New York, is headed away from the climate-damaging energy sectors of the past, and into the future with clean, safe renewable energy,\" said Richard Brooks, Climate Finance Director at Stand.Earth."}