{"text": "WASHINGTON The U.S. government on Monday said it would begin collecting new duties on aircraft parts and other products from France and Germany from Tuesday after failing to resolve a 16-year dispute over aircraft subsidies with the European Union.In a notice to shippers late on Monday, U.S. Customs and Border Protection said the new duties would apply from 12:01 a.m. ET (0501 GMT) on Tuesday as part of the long-running battle over government subsidies to Europes Airbus SE and its U.S. rival, Boeing Co.The notice here follows an announcement by the U.S. Trade Representative's office that it would impose an additional 15% tariff on aircraft parts, including fuselage and wing assemblies, and a 25% duty on certain wines.Talks between Washington and Brussels to end the battle stalled in the final weeks of the Trump administration, a European source familiar with the matter said. Washington had also pressed to reach a separate solution with Britain, which has a share in Airbus, but has exited the EU.Brussels said it would seek swift resolution of the issue with U.S. President-elect Joe Biden, who takes office on Jan. 20. The Biden team had no immediate comment on the tariff issue.Both Washington and Brussels have won cases at the World Trade Organization, the former allowed to impose tariffs on $7.5 billion of EU goods and the latter extra duties on $4 billion of imports from the United States.Airbus said USTRs expansion of tariffs to include aircraft components made in France and Germany was counterproductive and would wind up harm U.S. workers at its Mobile, Alabama site where it assembles A320 and A220 aircraft.The measure will hit A320 production which uses components from France and Germany, while the A220 production does not, according to an Airbus spokesman. Airbus delivered more than 40 A320 Family planes from Mobile in 2020, but the number will be lower this year due to the pandemic, a spokesman said.The initial impact may be muted since aerospace companies generally procure large components such as wings and fuselages well in advance to ensure smooth production flows.Aircraft were already covered by U.S. tariffs, but the addition of components closed a loophole that had allowed Airbus planes assembled in Mobile to be sold in the United States free of tariffs. Unless the issue is resolved quickly, those aircraft are likely to be uncompetitive in the U.S. market.Some alcohol from the Airbus-producing nations - France, Germany, Spain and Britain - had already been subject to tariffs, but new varieties are now affected. The French wine exporters federation called it a sledgehammer blow.Unlike previous short-notice tariff actions, USTR did not grant any exclusions for products already in transit or on the water, said Ben Aneff, president of the US Wine Trade Alliance, calling the decision deeply unfair.Aneff urged U.S. Trade Representative Robert Lighthizer in a letter on Monday to amend the action to exempt goods in transit when the tariffs were announced less than two weeks ago on Dec. 30, noting that ocean transit can take 22 to 40 days.Aneff said the move would hit many U.S. businesses in the hospitality, restaurant and wine industry with sharply higher costs at a time when they were already being hammered by pandemic-related closures."}