{"text": "New York City politicians are expected to vote next week to force the largest police force in the United States to divulge the surveillance technology it uses, one of many reforms of law enforcement being considered across the country.City council members will vote on June 18 on a long-delayed oversight bill that would force the New York Police Department to give details about its surveillance tools, the councils speakers office said on Friday.The Public Oversight of Surveillance Technology (POST) Act already has enough co-sponsors to win the two-thirds support needed to override veto from the mayor, who has opposed the bill.New Yorkers deserve to know the type of surveillance that NYPD uses in communities and its impacts, Council Speaker Corey Johnson said in a statement.Like other proposed police reforms, the POST Act has been in limbo for years. Backers said anger over the death of African American George Floyd in Minneapolis and its aftermath helped push the legislation forward.Similar rules exist in other cities, but politicians and privacy advocates said a surveillance audit for the NYPD was likely to have a particularly significant effect.Its by far the biggest police force with by far the biggest budget, council member Brad Lander, who backs the bill, told Reuters. He said it would empower citizens elsewhere to go to their municipalities and ask, Are you using this too?The NYPD, which did not return messages seeking comment, has vehemently opposed the bill. In 2017, Deputy Commissioner of Intelligence and Counterterrorism John Miller said it would require us to advertise sensitive technologies that criminals and terrorists do not fully understand. New York Mayor Bill de Blasios office said it was reviewing the legislation.Activists and experts have already catalogued here a vast array of NYPD surveillance technology.TerraHawk towers keep an eye on certain neighborhoods, ShotSpotter microphones listen for sounds of gunfire from rooftops or light poles, and unmarked X-Ray vans prowl the streets scanning cars and buildings.The citys sprawling network of cameras, license plate readers, and chemical and radiation meters has been stitched into a Microsoft Corp.-supported platform called the Domain Awareness System.Lawyer Albert Fox Cahn, who directs the New York-based Surveillance Technology Oversight Project, said allowing citizens to understand how police watch over them would help curb abusive surveillance - and abuses more generally.Theres a straight line through to this intrusive surveillance to unnecessary police stops to the kind of tragic violence we saw in Minneapolis, Cahn said."}