{"text": "SAO PAULO A coronavirus vaccine developed by Chinas Sinovac Biotech was just 50.4% effective at preventing symptomatic infections in a Brazilian trial, researchers said on Tuesday, barely enough for regulatory approval and well below the rate announced last week.The latest results are a major disappointment for Brazil, as the Chinese vaccine is one of two that the federal government has lined up to begin immunization during the second wave of the worlds second-deadliest COVID-19 outbreak.Several scientists and observers blasted the Butantan biomedical center for releasing partial data just days ago that generated unrealistic expectations. The confusion may add to skepticism in Brazil about the Chinese vaccine, which President Jair Bolsonaro has criticized, questioning its origins.We have a good vaccine. Not the best vaccine in the world. Not the ideal vaccine, said microbiologist Natalia Pasternak, criticizing Butantans triumphant tone.Last week, the Brazilian researchers had celebrated results showing 78% efficacy against mild-to-severe COVID-19 cases, a rate they later described as clinical efficacy.They said nothing at the time about another group of very mild infections among those who received the vaccine that did not require clinical assistance.Ricardo Palacios, medical director for clinical research at Butantan, said on Tuesday that the new lower efficacy finding included data on those very mild cases.We need better communicators, said Gonzalo Vecina Neto, a professor of public health at the University of Sao Paulo and former head of Brazilian health regulator Anvisa.Piecemeal disclosures about Chinese vaccine trials globally have raised concerns that they are not subject to the same public scrutiny as U.S. and European alternatives.Palacios and officials in the Sao Paulo state government, which funds Butantan, emphasized the good news that none of the volunteers inoculated with CoronaVac had to be hospitalized with COVID-19 symptoms.Public health experts said that alone will be a relief for Brazilian hospitals that are buckling under the strain of surging case loads. However, it will take longer to curb the pandemic with a vaccine that allows so many mild cases.Its a vaccine that will start the process of overcoming the pandemic, Pasternak said.DELAYS AND DISAPPOINTMENTResearchers at Butantan delayed announcement of their results three times, blaming a confidentiality clause in a contract with Sinovac.In the meantime, Turkish researchers said last month that CoronaVac was 91.25% effective based on an interim analysis. Indonesia gave the vaccine emergency use approval on Monday based on interim data showing it is 65% effective.Butantan officials said the design of the Brazilian study, focusing on frontline health workers during a severe outbreak in Brazil and including elderly volunteers, made it impossible to compare the results directly with other trials or vaccines.Still, COVID-19 vaccines in use from Pfizer Inc with partner BioNTech SE and Moderna Inc proved to be about 95% effective in preventing illness in their pivotal late-state trials.The disappointing CoronaVac data is the latest setback for vaccination efforts in Brazil, where more than 200,000 people have died since the outbreak began - the worst death toll outside the United States.Brazils national immunization program currently relies on CoronaVac and the vaccine developed by Oxford University and AstraZeneca Plc - neither of which has received regulatory approval in Brazil.Anvisa, which has stipulated an efficacy rate of at least 50% for vaccines in the pandemic, has already pressed Butantan for more details of its study, after it filed for emergency use authorization on Friday.The regulator said it will meet on Sunday to decide on emergency use requests for CoronaVac and the British vaccine.AstraZeneca failed to deliver active ingredients to Brazil over the weekend, leaving the government scrambling to import finished doses of the vaccine from India to begin inoculations."}