{"text": "VIENNA Austria said on Tuesday it has identified a new cluster of 17 COVID-19 cases, a mainly British group on a ski teacher training course, despite the country being on lockdown and having banned flights from Britain over fears of a new coronavirus variant.The Alpine province of Tyrol, which suffered Austrias worst outbreak to date at the ski resort of Ischgl, said the cluster in the town of Jochberg was suspected to be of the new, more infectious variant first pinpointed in Britain in September that has spread to dozens of countries including Austria.The fact such a training course was allowed to happen despite lockdown restrictions, which include closing schools to all but daycare, stunned many Austrians.Workers from eastern Europe have not been allowed to go home for weeks - or only under the strictest conditions - but ski teachers from around Europe are allowed to come to Tyrol for training and get infected? This just beggars belief, Florian Klenk, editor of left-wing weekly Falter, said on Twitter.The cluster touches on many areas of life that have been restricted to contain the contagion of COVID-19.Ski resorts were allowed to open as of Christmas Eve but hotels remain closed to all but business travel, meaning only people who live close enough to a resort can go, for the day.Austria also introduced a quarantine rule for arrivals from almost every European country over the holiday period, at least partly to put off skiers from neighbouring countries who might have been tempted by the open lifts.These were people of various nationalities - mainly British citizens, Tyrols provincial government said in a statement, offering all of Jochbergs roughly 1,500 residents a free coronavirus test. The last of them arrived in Tyrol on Dec. 18. They travelled by land and air.The new quarantine requirement took effect on Dec. 19. Flights from Britain were banned on Dec. 22.Most of those infected experienced the first mild symptoms on Jan. 3, and it will take another week to tell whether they were infected with the new variant, the statement added."}