{"text": "New Yorks two U.S. senators joined other leading Democrats in urging New York Governor Andrew Cuomo to resign on Friday after a seventh woman came forward to accuse him of sexual misconduct.Chuck Schumer, the Senate majority leader, and Kirsten Gillibrand, a leading voice of the #MeToo movement against sexual harassment and abuse, joined others including U.S. Representative Alexandria Ocasio-Cortez in calling on the three-term Democratic governor to resign.Cuomo, 63, the divorced father of three daughters in their 20s, again repeated his denial of the allegations on Friday and said it was reckless and dangerous for politicians to ask him to resign before they have all the facts.Women have a right to come forward and be heard, and I encourage that fully. But I also want to be clear: there is still a question of the truth. I did not do what has been alleged, period, Cuomo said on a call with reporters.Wait for the facts. An opinion without facts is irresponsible, he said.Asked on Friday if he ever had consensual romantic relationships with any of the women, Cuomo responded by saying only that he never intended to make anyone feel uncomfortable, and was sorry if he did.Hours after the governors call with reporters, Schumer and Gillibrand became the highest-profile national politicians to urge him to resign.Due to the multiple, credible sexual harassment and misconduct allegations, it is clear that Governor Cuomo has lost the confidence of his governing partners and the people of New York, the two senators said in a joint statement.A growing list of women including former aides have accused the governor of sexual misconduct, ranging from unwelcome flirtatious behavior at work to groping.Reporter Jessica Bakeman became the latest on Friday, writing a first-person account for New York magazine. She said Cuomo had often put his hands on her, including one time when taking a picture with her at a 2014 holiday party when she said he remarked, Im sorry. Am I making you uncomfortable? I thought we were going steady.Bakeman said she did not want to smile for the camera with Cuomos hands on her, but decided it was easier to take a quick picture than challenge a powerful politician.I never thought the governor wanted to have sex with me. It wasnt about sex. It was about power, she wrote. He wanted me to know that he could take my dignity away at any moment with an inappropriate comment or a hand on my waist.The new calls for Cuomo to resign came a day after more than 55 Democratic New York state lawmakers urged him to step down, and the state legislature said it would open an impeachment investigation into the allegations.The legislative inquiry will run parallel to an investigation led by the office of New York State Attorney General Letitia James.The two senators joined at least 16 of the 27 members of New Yorks U.S. congressional delegation in urging Cuomo to quit, calling into question the political future of the high profile Democratic figure, who gained national prominence for his leadership during the peak of his states COVID-19 crisis.While 15 U.S. House members from New York issued their statements on Friday, a House aide told Reuters there was no formal, coordinated effort within the delegation to pressure Cuomo.On Tuesday, an unnamed aide told the Times Union that Cuomo had groped her after calling her to the executive mansion under the pretext of business last year, long after the #MeToo movement took down a host of politicians, media figures and business leaders for sexual harassment or assault.The fact that this latest report was so recent is alarming, and it raises concerns about the present safety and well-being of the administrations staff, Ocasio-Cortez said in a joint statement on Friday with U.S. Representative Jamaal Bowman.White House Press Secretary Jen Psaki said on Friday that President Joe Biden certainly supports the state attorney generals investigation into the allegations. She added that the president and his COVID-19 response team would continue working with Cuomo on vaccination roll-out in New York."}