{"text": "Kevin Stenlund scored the game-winning goal with 74 seconds remaining in regulation in a two-point night as the visiting Columbus Blue Jackets claimed a 6-5 comeback victory over the Chicago Blackhawks on Thursday night.Cam Atkinson collected one goal and three assists for the Blue Jackets.With overtime looming, Stenlund collected his second goal of the season for the Blue Jackets, who erased a two-goal third-period deficit and received a 21-save performance from goalie Joonas Korpisalo in a roller-coaster affair.Atkinson gave the Blue Jackets first blood in the middle of the first period. After a turnover, he gained the puck just inside the offensive blueline and ripped a shot home from the high slot for his third short-handed goal of the season and the franchise-record 15th of his career.Penguins 4, Islanders 3 (SO)Sidney Crosby scored the only goal of the shootout for visiting Pittsburgh, which came back from a trio of one-goal deficits to edge New York in Brooklyn, N.Y. It was the Penguins 83rd shootout win -- breaking a tie for the all-time lead with New York.Evgeni Malkin scored with 18 seconds left in regulation to force overtime for the Penguins, who ended a two-game losing streak and won for the second time in six games (2-2-2). Bryan Rust and Zach Aston-Reese also scored for Pittsburgh. DeSmith made 26 saves in regulation and overtime.Casey Cizikas, Jean-Gabriel Pageau and Mathew Barzal scored for the Islanders, who had a two-game winning streak snapped.Panthers 5, Lightning 2Goalie Sergei Bobrovsky remained unbeaten in regulation as host Florida defeated Tampa Bay at Sunrise, Fla. The Lightning had their six-game win streak broken.Bobrovsky (5-0-1), who has yet to lose in regulation this season, made 19 saves. His record is a career-best through his first six appearances of a season. The Panthers got goals from Frank Vatrano, Alex Wennberg, Aaron Ekblad, Carter Verhaeghe and Brett Connolly (empty net).For Tampa Bay, Brayden Point scored twice, both on power plays. Goalie Andrei Vasilevskiy made 24 saves, and Victor Hedman added two assists.Oilers 3, Canadiens 0Darnell Nurse scored for the fifth time in six games, Mike Smith worked his 40th career shutout and Edmonton blanked host Montreal.Jujhar Khaira and Tyson Barrie scored, and Leon Draisaitl and Connor McDavid returned to the scoresheet with an assist for the Oilers, who won their third straight and sixth in their last seven games.The high-scoring Draisaitl and McDavid both had 10-game point streaks snapped in Tuesdays 3-2 win over the Senators but had helpers on Barries tally.Predators 3, Red Wings 2Dante Fabbro scored with 59.2 seconds remaining as Nashville snapped a three-game losing streak with a victory against visiting Detroit.Ryan Ellis and Matt Duchene also scored for the Predators, with Filip Forsberg and Roman Josi both getting two assists. Goaltender Pekka Rinne made 24 saves.Robby Fabbri and Marc Staal scored for the Red Wings, who will wrap up their six-game trip Saturday at Nashville. Four of the games five goals were scored in the final minute of a period, including the winner.Jets 5, Senators 1Paul Stastny recorded a goal and an assist and Connor Hellebuyck made 41 saves to lift host Winnipeg to a victory over Ottawa.Captain Blake Wheeler, Mathieu Perreault, Nikolaj Ehlers and Neal Pionk also tallied for the Jets, who have outscored Ottawa by a 19-8 margin en route to winning all four encounters this season. Mark Scheifele notched a pair of assists to join Pionk with five-game point streaks.Matt Murray yielded three goals on 15 shots through two periods before being relieved by Marcus Hogberg (nine saves). The Senators have dropped four in a row and 13 of their last 14 games (1-12-1).Hurricanes 5, Stars 3Nino Niederreiter scored the game-winner on a third-period breakaway to lift visiting Carolina to a win over Dallas.Jordan Staal added a single marker and an assist for the Hurricanes while Sebastian Aho, Brock McGinn and Warren Foegele each scored once. Vincent Trocheck and Brett Pesce both had two assists.The Stars got goals from Mark Pysyk, Roope Hintz and Joe Pavelski, along with two-assist nights from Jason Robertson and Denis Gurianov.Ducks 1, Golden Knights 0Max Comtois scored with 7:42 to go to break a scoreless tie and John Gibson stopped 21 shots for his third shutout of the season as visiting Anaheim handed Vegas a loss.It was the sixth goal of the season for Comtois, four of which have come in four games against the Golden Knights, who had a three-game winning streak snapped and lost for the first time in regulation in nine home games (7-1-1) this season. It was Gibsons 22nd career shutout.Marc-Andre Fleury finished with 27 saves in suffering his first loss of the season (5-1-0) for Vegas. Fleury was making consecutive starts for the first time since Feb. 20-22, 2020, after expected starter Robin Lehner was scratched after suffering an upper-body injury during the teams morning skate.Kings 6, Sharks 2Anze Kopitar, Carl Grundstrom and Jaret Anderson-Dolan each had a goal and an assist for Los Angeles in a win against visiting San Jose.Drew Doughty had three assists, and Cal Petersen made 29 saves for the Kings, who were 0-4-1 in their previous five games.Tomas Hertl scored two goals, and Martin Jones made 20 saves for the Sharks, who were playing the last of 12 straight road games to start their season.Flames 3, Canucks 1Mark Giordano collected one goal and one assist and goaltender Jacob Markstrom provided a stellar 33-save performance against his former team to lead visiting Calgary to a victory over slumping Vancouver.Andrew Mangiapane and Johnny Gaudreau also scored for Calgary, which won the first of four consecutive meetings between the clubs. The Flames have won all three clashes so far this season, with the next one scheduled for Saturday night.The free-falling Canucks have lost six straight games, all in regulation.--Field Level Media"}