{"text": "LONDON The UK Supreme Court on Friday allowed a group of 42,500 Nigerian farmers and fishermen to sue Royal Dutch Shell (RDS) in English courts after years of oil spills in the Niger Delta contaminated land and groundwater.Senior judges said there was an arguable case that UK-domiciled Shell, one of the worlds biggest energy companies, is responsible, in the latest test of whether multinationals can be held to account for the acts of overseas subsidiaries.Represented by law firm Leigh Day, the group of Nigerians have argued that the parent company Shell owed them a duty of care because it either had significant control of, and was responsible for, its subsidiary SPDC. Shell countered that the court had no jurisdiction to try the claims.(The ruling) also represents a watershed moment in the accountability of multinational companies. Increasingly impoverished communities are seeking to hold powerful corporate actors to account and this judgment will significantly increase their ability to do so, Daniel Leader, partner at Leigh Day, said.UK common law is also used in countries like Canada, Australia and New Zealand so this is a very helpful precedent.The decision comes almost two years after a seminal ruling by the Supreme Court in a case involving mining firm Vedanta. The judgment allowed nearly 2,000 Zambian villagers to sue Vedanta in England for alleged pollution in Africa.That move was seen as a victory for rural communities seeking to hold parent companies accountable for environmental disasters. Vedanta ultimately settled out of court in January.Nigerias Ogale and Bille communities allege their lives and health have suffered because repeated oil spills have contaminated the land, swamps, groundwater and waterways and that there has been no adequate cleaning or remediation.SPDC is the operator of oil pipelines in a joint venture between the Nigerian National Petroleum Corporation which holds a 55% stake, Shell which holds 30%, Frances Total with 10%, Italys Eni with 5%.A Shell spokesman said the decision was disappointing.Regardless of the cause of a spill, SPDC cleans up and remediates. It also works hard to prevent these sabotage spills, by using technology, increasing surveillance and by promoting alternative livelihoods for those who might damage pipes and equipment, Shell said.Shell has blamed sabotage for oil spills. It said in its annual report published last March that SPDC, which produces around 1 million barrels of oil per day, saw crude oil spills caused by theft or pipeline sabotage surge by 41% in 2019.Shell CEO Ben van Beurden said last week that the firm would take another hard look at its onshore oil operations in the west African country.The ruling is the second judgement against Shell this year regarding claims against its Nigerian operations. In a landmark Dutch ruling two weeks ago, an appeals court held Shell responsible for multiple oil pipeline leaks in the Niger Delta and ordered it to pay unspecified damages to farmers, in a victory for environmentalists.Leigh Day said that the amount of compensation sought would be quantified as the case enters the trial stage. Shell could however try to settle the matter out of court.In 2015, Shell agreed to pay out 55 million pounds ($83.4 million) to the Bodo community in Nigeria in compensation for two oil spills, which was the largest ever out-of-court settlement relating to Nigerian oil spills."}