{"text": "LONDON A lawsuit launched by the Nigerian government against U.S. bank JP Morgan Chase, claiming over $1.7 billion for its role in a disputed 2011 oilfield deal, will proceed to trial, Londons high court ruled on Thursday.The suit filed in the English courts in 2017 relates to the purchase of the offshore OPL 245 oilfield in Nigeria by oil majors Royal Dutch Shell and Eni in 2011, which is the subject of an ongoing trial in Milan.The six-week London trial will start on the first available date after Nov. 1 next year, meaning that proceedings may not begin until 2022.JP Morgan declined to comment.Central to the case is a $1.3 billion payment from Shell and Eni to secure the block that was deposited into a Nigerian government escrow account managed by JP Morgan.As part of the proceedings, JP Morgan will also have to disclose within 21 days which individuals at the bank made the final decision to transfer the funds in question.Nigeria is pleased that JP Morgan has agreed it will now confirm all the senior figures at the bank who were involved, a spokesman for the Nigerian government on this case said.This claim will move forward and Nigeria will hold JP Morgan accountable for its central role in the OPL 245 fraud.In the claim, Nigeria alleges JP Morgan was negligent in its decision to transfer the funds in escrow to a company controlled by the countrys former oil minister Dan Etete instead of government coffers.The damages sought include the monies allegedly sent to Etete, around $875 million paid out in three instalments, plus interest taking the total to $1.7 billion.The decision is also likely to compel the bank to disclose details of its internal processes. JP Morgan sought to quash the case last year.The Milan trial began in 2018. In July 2020, Italian prosecutors asked a Milan court for Eni and Shell to be fined and some of their present and former executives, including Eni CEO Claudio Descalzi, to be jailed.They further requested Eni and Shell to be fined 900,000 euros ($1.06 million) each and sought to confiscate a total of $1.092 billion from all the defendants in the case, the equivalent of the bribes alleged to have been paid.Shell and Eni and the managers accused in the Milan court case, including Eni CEO Claudio Descalzi, have all denied any wrongdoing.Final defence arguments from lawyers representing Shell, Eni and its executives are being made to the court. The next hearing is scheduled for Nov. 25.A full timeline of the legal cases surrounding the oilfield deal can be found here:($1 = 0.8481 euros)"}