{"text": "LAGOS Indian-Nigerian restaurant owner Hamisha Daryani Ahuja gave up her long-running business to pursue her dream of making movies.Two years later, the 36-year-old will see her first feature film, the cross-cultural love story Namaste Wahala, debut on Valentines Day on Netflix.The film, whose title translates in Hindi and Nigerian pidgin as Hello trouble, tells the tale of a Nigerian woman who falls in love with an Indian investment banker living in Lagos. The young couple face a series of challenges - including their families - to be together.I wanted to do something that will be more relatable so it is a full-on Nollywood movie, but I brought in some Indian actors to make it a little bit more fun, Daryani Ahuja, who directed, executive produced and acted in the movie, told Reuters.What I tried to do is the 90s style Bollywood ... the singing and dancing around trees. We have all of that. It is a very cheesy, mushy romantic drama.Born of Indian parents, Daryani Ahuja has lived most of her life in Nigeria.I have lived in an Indian house, I know the Nigerian culture, the pidgin, the food and it is so interesting how even though everybody thinks with Namaste Wahala the cultures are different, we are actually so similar, she said.We are actually all one, and thats the whole theme of the movie.The 110-minute film stars Indian actor Ruslaan Mumtaz and Nigerian actress Ini Dima-Okojie in the lead roles.It is very important to make films like this when you show cross-cultural love stories, because in every country ... people just separate each other as far as religion is concerned, Mumtaz said. Especially in India, you cant marry somebody if they are from a different religion or from a different caste.Mainly shot in English, the movie had a production team of more than 60 people across India and Nigeria. Production was completed before lockdowns made making movies difficult; the original release date was April.The thing I love the most are the underlying messages which is the beauty in embracing your similarities, the beauty in embracing love even if you are from different backgrounds, Dima-Okojie said.Putting out hundreds of movies and television episodes a month, Nollywood is the worlds second most prolific film industry after Indias Bollywood.Nigeria has a growing base of Bollywood fans, who watch its sitcoms subtitled in English, and Namaste Wahala is creating a buzz online.Daryani Ahuja says she hopes to make a sequel in the coming months."}