{"text": "Norways Equinor ASA (EQNR.OL) has decided to stay in the American Petroleum Institute after the major U.S. oil lobby group changed its stance on climate policy.However, Equinor has quit the Australian Petroleum Production and Exploration Association as the firm has wound down operations in Australia after giving up an exploration drilling plan in the Great Australian Bight.In a report dated March 2021, Equinor said it had completed an annual review of industry groups' climate policy alignment with the Paris Agreement to limit global warming to 2 degrees Celsius and the company's goal to be net zero by 2050.Last year it quit the Independent Petroleum Association of America (IPAA) over disagreement on climate policy and found \"some misalignments\" for the American Petroleum Institute (API)and the Australian Petroleum Production and Exploration Association (APPEA). However, following API's commitment to endorse the Paris Agreement's ambitions, work with the U.S. administration and back a carbon price policy, Equinor said it would remain a member of API.\"We will continue to engage with API and work with other members on API climate policy through our representation on the board and in relevant committees impacting climate and sustainability issues,\" Equinor said in its March 2021 review.Equinors decision to stay in API contrasts with French major Totals (TOTF.PA) move to quit API in January over its climate policies and support for easing drilling regulations. The Norwegian company disclosed its membership fees for the first time, revealing that its contribution to API is between $1 million and $3.5 million, the same as its contribution to Norway's oil and gas lobby group (NOROG).Equinor said it decided to leave APPEA \"in line with changes to our international operations\".Last year it said it would push APPEA to take a clear stand on supporting carbon pricing and \"a clear position on not accepting carryover credits\" to count towards Australia's emissions reduction target under the Paris Agreement.Shareholder activist group the Australasian Centre for Corporate Responsibility (ACCR) applauded Equinor for quitting APPEA.\"APPEA's record of advocacy is completely at odds with Australia's commitment to the Paris Agreement,\" said ACCR's climate and environment director, Dan Gocher."}