{"text": "Norway's oil and gas reserves have made it one of the world's wealthiest countries but its dreams for deep-sea discovery now centre on something different.This time, Oslo is looking for a leading role in mining copper, zinc and other metals found on the seabed and in hot demand in green technologies.Norway could license companies for deep-sea mining as early as 2023, its oil and energy ministry told Reuters, potentially placing it among the first countries to harvest seabed metals for electric vehicle batteries, wind turbines and solar farms.That could also place it on the front line of a controversy over the environmental risks posed by exploiting the world's unexplored seabeds, however.Norway on Tuesday announced it was starting preparations for an environmental impact study needed to open areas of its seabed mineral exploration and production.The move follows three years of expeditions on which Norway has found deep-sea deposits containing copper, zinc, cobalt, gold and silver, according to the Norwegian Petroleum Directorate which conducted the work.There could be up to 21.7 million tonnes of copper - more than the world's copper output in 2019 - and 22.7 million tonnes of zinc on the Norwegian continental shelf, Norwegian University of Science and Technology (NTNU) researchers have estimated.Mean estimates however are far lower, at 6.9 million and 7.1 million tonnes, respectively.\"Copper mining inside Norway's jurisdiction will probably never replace extraction onshore, but ...it can be an important contributor in meeting future global demand,\" NTNU Associate Professor Steinar Loeve Ellefmo told Reuters.\"Deep-sea mining might also change the geopolitical climate,\" he said.  The metals have been found in polymetallic sulphides, or \"black smokers\", which are formed when sea water reaches magma, heats up and is flushed back to the seabed carrying dissolved metals and sulphur.The expeditions have also discovered high concentrations of lithium and the rare earth metal scandium used in electronics and alloys in manganese crusts which grow on bedrock, the Directorate said.Norway has mapped these deposits along the Mid-Atlantic Ridge between Jan Mayen Island and the Svalbard archipelago in the Norwegian Sea as far as 700 kilometres (435 miles) offshore.    TIMELINEOnce completed, the government plans public consultations on its environmental impact assessment and on a proposal for opening areas for exploration and production by the end of 2022 followed by debate and a vote in parliament in the second quarter of 2023.    \"Were parliament to decide to open up, exploration licences could be issued - possibly in the second half of 2023 or in 2024,\" the oil and energy ministry said.    \"We are moving forward on this, and the momentum is high,\" Oil and Energy Minister Tina Bru told Reuters. \"This is an industry with great potential.\"Japan has similar plans but its project with private firms is not expected to begin before some time between 2026 and 2028, an official at the Japanese Agency for Natural Resources and Energy told Reuters.Timing will depend on metals prices and reducing the costs of deep-sea mining, the official said.The United Nations' International Seabed Authority (ISA), which regulates seabed mineral activities in international waters, has approved 30 contracts for exploration with China holding the most with five.  The Jamaica-based ISA was forced to postpone plans to approve rules governing the production of deep-sea minerals to 2021 from last year due to the COVID-19 pandemic.Norway, however, doesn't have to wait as its resources are not in international waters. ENVIRONMENTAL CONCERNSThough demand for the metals on offer is being driven by clean technologies, exploration of the seabed presents environmental challenges of its own.Environmentalists including Britain's David Attenborough have called for a moratorium on deep-seabed mining until more is known about species living on the seabed and the potential impact on them. Greenpeace in a recent report called for a permanent ban. \"Greater knowledge of the environmental impacts, as well as the ability to mitigate these to acceptable levels, is required before we can be confident that engaging in industrial-scale deep-seabed mining would bring a global net benefit,\" said an expert report published last month commissioned by the Ocean Panel.The Ocean Panel is co-chaired by Norway and groups 14 coastal states that seek to shape policy on the world's oceans.\"We are not saying a complete and final \"no\" to seabed mining, but we know that it can have very substantial impact on the seabed habitat, more than oil and gas extraction,\" said Peter Haugan, a professor at the University of Bergen and one of the report's co-authors.Giant tube worms, clam shells, crabs and micro fauna all rely on the bacterial oxidation of chemicals in fluids in the hydrothermal vents where seabed minerals are found, according to the ISA.Companies seeking exploration licences say they will focus their attention on inactive \"smokers\". \"I believe Norway can do this in a sustainable way, but we have to do it step by step, which has been a key success factor for developing our oil and gas industry,\" Oil and Energy Minister Bru said.PIVOT FROM OILWhile oil and gas have made Norway rich, the country of 5.4 million is keen to find alternatives to gradually replace its top industry and to play its role in greener energy and the growth it offers.Deep-sea mining could generate up to $20 billion in annual revenue for Norway towards 2050 - compared to around $61 billion from oil and gas in 2019 - and create about 20,000 jobs, Oslo-based consultancy Rystad Energy has estimated.Seabird Exploration (SBX.OL), which maps out the seabed for oil and gas deposits, plans to list a deep-sea mining subsidiary on the Euronext Growth Oslo small-cap bourse this quarter. The Cyprus-based firm believes production could start by the late 2020s and could apply technologies used in the oil and gas sector. \"We will need to design from scratch the production system, but the basic elements are there ... it will be a mixture of mining and petroleum technology,\" Seabird Executive Chairman Staale Rodahl told Reuters.Nordic Mining (NORG.OL) also said it would seek exploration licences while Norway's largest energy firm Equinor (EQNR.OL) and oil-focused investment group Aker (AKER.OL) have not yet decided whether they will get involved, they said.    State-run Japan Oil, Gas and Metals National Corp (JOGMEC) successfully conducted the world's first test involving the excavation and raising of deep-sea minerals to the surface off Japan in 2017.\"It sounds fantastic to go deep for minerals, but remember what the oil and gas industry has achieved over the last 50 years, and you can stand on the shoulders of it,\" said Walter Sognnes, chief executive of start-up LOKE Marine Minerals and a former co-founder of several oil firms."}