{"text": "MOSUL Iraq has started closing camps housing tens of thousands of people, including many who fled their homes during the final battle against Islamic State, but aid groups warn this could create a second wave of displacement with dire consequences.Among those having to leave are 50-year-old Umm Ahmed and her two sons, who have lived at the Hammam al-Alil camp since 2017 when their house in Mosul was destroyed in an air strike by the U.S.-led coalition as it battled to retake the city from Islamic State.I dont have any income, no one provides for us. The camp became our home, said Umm Ahmed, who cannot take on manual work due to a disability. She says her sons both have mental health problems.Islamic State upended the lives of millions of Iraqis when they took swathes of the country in 2014 and imposed a brutal rule that in some places like Mosul would last three years.Before ISIS, my son used to clean the streets and we would survive with whatever income he managed to get. But now, he is too ill to work, said Umm Ahmed.Hammam al-Alil, 25 kilometres (15 miles) south of Mosul, is one of several camps due to shut this month. The operation had been scheduled for earlier this year but was delayed by the coronavirus pandemic, according to Khalid Abdul Karim, who heads the displacement and migration office in Mosul.Each family would receive 1.5 million dinars ($1,263.03) in aid during the first year and the authorities are coordinating with international aid organisations to ensure they receive assistance once they settle elsewhere, Abdul Karim said.But aid organisations say it will be harder to reach the most vulnerable if spread across the country, and some could face violence and arrest on returning home if they have relatives who were affiliated with armed groups, including ISIS.Around 100,000 people are at risk of becoming homeless as the closures were not properly planned and coordinated, the Head of Support for Iraq at the humanitarian organisation Norwegian Refugee Council, Ahmad Azzam, told Reuters.Packed up her belongings, an Iraqi woman from the province of Baji says she has no relatives to take care of her and her children. Her husband died during the war and she has been living in the camp since.Her children, like thousands of others born under Islamic State rule, have no identification papers, without which they will struggle to access basic services, including education.Whether they give us support money or not depends on their conscience, Umm Ahmed said as she watched her neighbours load their things onto a pickup truck and set off towards an uncertain future."}