{"text": "Nvidia Corp (NVDA.O) on Monday said it plans to make a server processor chip based on technology from the United Kingdom's Arm Ltd, putting it in the most direct competition yet with rival Intel Corp (INTC.O) and adding a layer of complexity to the antitrust review of Nvidia's $40 billion deal to buy Arm.Intel is the world's biggest maker of central processors for data center servers but has increasingly seen competition from Arm-based chips. With its \"Grace\" server processor, Nvidia will be the largest chip company so far to challenge Intel in its key market.Nvidia shares rose 2.6% and Intel shares dropped 4% in midday trading after the news. Intel shares have risen more than 30% this year as its new chief Pat Gelsinger outlined its strategy to overcome years of manufacturing woes.Arm's technology powers the chips in most smartphones, but for the last several years has been making its way into data centers, with companies such as Amazon.com Inc (AMZN.O) and Ampere Computing designing chips for servers with it.Nvidia's entry into the market could hasten Arm's inroads into data centers. Nvidia's chips have traditionally been used as \"accelerators\" alongside existing central processors from Intel, Advanced Micro Devices Inc (AMD.O) or others, offloading some computing work from them and speeding up the overall computing system.By making its own central processor, Nvidia is taking on Intel and AMD directly for the first time. In a keynote speech announcing the chip, Nvidia Chief Executive Officer Jensen Huang called the new server chip the \"final piece of the puzzle\" that will join Nvidia's graphics and networking chips to form the \"basic building block of the modern data center.Santa Clara, California-based Nvidia said the \"Grace\" server processor, which will be released in 2023, is designed to handle tasks like training artificial intelligence algorithms. Once known for its graphics chips to improve the play of video games, Nvidia has focused heavily on artificial intelligence computing in recent years, helping its market capitalization exceed Intel's to become the largest U.S. semiconductor firm.Nvidia also said that the Swiss National Supercomputing Centre will make a new supercomputer dubbed \"Alps\" using the new \"Grace\" processors and built by Hewlett Packard Enterprise Co (HPE.N). The computing system, which Huang said will be 10 times faster than the world's current best supercomputer, will be used for tasks such as weather forecasting and physics research.Nvidia officials said that the company's accelerator chips will continue to support central processors from Intel and AMD even as it dives into the market itself. Huang said that Nvidia will alternate its focus, concentrating on making accelerator chips that work with Arm-processors one year, and then chips that work with AMD and Intel chips in the next year.Nvidia did not disclose which Arm technology it would use for the chips but said they would use computing cores Arm's \"Neoverse\" family of server chip technology that will be released in the future. Huang said it was \"off-the-shelf\" technology from Arm.Nvidia said in September that it will buy Arm for $40 billion. Nvidia's rivals have expressed concerns that the company will use its potential ownership of Arm to get early access to Arm's technologies as they become more prevalent in the data center market.  read more Arm said that Nvidia has had the same access to its intellectual property as the rest of Arm's customer base and did not get early access to its technology."}