{"text": "New Zealand's central bank is expected to leave interest rates and its quantitative easing programme unchanged this week as it assesses the economic impact of some international tourists returning and the government's new housing market measures.In a Reuters poll, all 11 economists forecast the Reserve Bank of New Zealand (RBNZ) to stand pat on Wednesday, and predicted it will keep the official cash rate (OCR) at the historic low of 0.25% for the rest of the year.Only three expected rates to be raised after the second half of next year.Business sentiment has been waning in recent months despite a remarkable rebound in economic activity after the COVID-19 lockdowns, and the economy contracted in the last quarter of 2020. But these downsides were offset by the improving global outlook, and the return of Australian tourists to New Zealand next week through a COVID-19 'travel bubble' arrangement.  read more \"We expect no change in monetary policy settings at next Wednesdays review, with the OCR on hold at 0.25% for the foreseeable future,\" said Westpac economist Michael Gordon.\"The recent news on the domestic economy has been softer than expected, but this is offset to some degree by a rapidly improving global outlook and growing concerns about cost and price pressures,\" he said.The central bank cut its cash rate by 75 basis points in March last year and pledged to keep it unchanged for 12 months, while also introducing quantitative easing to support an economy hit by border closure and coronavirus lockdowns.But a quicker economic recovery and concerns about a red-hot property market buoyed by historically low interest rates have left markets speculating that the easing cycle has ended, and a rate hike may come sooner than expected.Under political pressure to cool the housing market, Prime Minister Jacinda Ardern introduced a raft of measures slugging investors with new taxes. Analysts expect the RBNZ to hold off on any near term policy action until it assesses the impact of the new property cooling measures on the economy.\"The housing market is an important driver of economic momentum currently, so housing developments have a significant bearing on the OCR outlook,\" said ANZ economist Sharon Zollner."}