{"text": "LONDON Oil prices have reached a critical threshold where OPEC+ must decide whether to increase production, or risk losing market share again to U.S. shale producers.Front-month Brent futures prices have climbed to more than $60 per barrel, up from less than $40 when the first successful vaccines were announced in November, and less than $20 when the pandemic was raging in April.After adjusting for inflation, Brent prices are now in the 58th percentile for all months since the start of 1990, which is consistent with slow but steady increases in output by non-OPEC producers.In the last decade, whenever Brent prices averaged more than about $57 per barrel, U.S. producers captured all the growth in global oil consumption, increasing their market share at the expense of OPEC and its allies.Responding to the earlier rise in prices, U.S. producers have already increased the number of rigs drilling for oil to nearly 300, up from a low of just 172 in August, according to oilfield services company Baker Hughes.More recent price increases are likely to ensure the number of active rigs increases at least until the end of June, when the count is likely to exceed 425 or even 450, if the current trend continues.Reflecting the rising rig count, U.S. production from the Lower 48 states excluding the Gulf of Mexico is already forecast to rise from current levels by 340,000 barrels per day (bpd) by the end of 2021.Further production gains of 640,000 bpd are expected by the end of 2022, according to the Energy Information Administration (Short-term energy outlook, EIA, Feb. 9).If prices rise further, both drilling and production are likely to accelerate even faster in the second half of 2021 and 2022.BACKWARDATIONIn the futures market, the price for Brent delivered in April is trading more than $2.70 per barrel higher than for deliveries in November, a price structure known as backwardation.Backwardation normally occurs when traders anticipate production will fall short of consumption and petroleum inventories are low and falling further (tmsnrt.rs/3rOs0rO).The current degree of backwardation in the futures market is in the 85th percentile for all trading days since the start of 1990, and has been trending higher.The implication is that traders anticipate a large production shortfall over the rest of this year, with inventories depleted below long-term average levels.If that expectation proves correct, Brent prices are likely to increase further, perhaps significantly. Escalating prices and intensifying backwardation are both signalling the need for more production in the rest of the year.Unless OPEC and its allies in OPEC+ provide the extra output to cover the shortfall, it will come from U.S. shale producers and other non-OPEC sources, encouraged by rising prices to boost output.OPEC+ DECISION TIMEBetween 2011 and the first half of 2014, and then again between 2017 and 2019, OPEC and then OPEC+ failed to increase output enough to relieve the anticipated shortage and ease upward pressure on prices.In both instances, prices surged, the market moved into a large and sustained backwardation and, with a delay of 12-18 months, U.S. shale production surged higher.Both times, OPEC insisted the market was not tight and there was no need to increase output  until it was too late and the surge in shale production had already pushed the market back into an incipient oversupply.OPEC members harvested the windfall from higher prices and revenues, even as their market share eroded and shale production surged, creating conditions for an eventual slump.OPECs delay in relieving the shortfall contributed to the explosive upswing in prices, worsening cyclical instability, and making the next cyclical downturn inevitable.In March and April this year, OPEC+ will again face the same question about whether to increase production to pre-empt an unsustainable increase in prices.Because of the delays between making a decision to raise output and extra barrels actually being available to consumers, OPEC+ must make a decision in the next six weeks to affect supply at the end of the second quarter and the start of the third, when the market is expected to become very tight.The question is whether OPEC+ will postpone output increases, as it did in 2013/14 and again in 2017/18, or move proactively to relieve the pressure on supply and moderate the upward cycle in prices."}