{"text": "NEW YORK Oil settled near $70 a barrel on Friday, supported by production cuts by major oil producers and optimism about a demand recovery in the second half of the year.Benchmark Brent settled down 41 cents, or 0.6%, to $69.22 a barrel. U.S. West Texas Intermediate crude also ended down 41 cents to $65.61 a barrel.Brent and U.S. crude ended the week roughly flat after prices touched a 13-month high on Monday, following seven straight weeks of gains.Demand for risky assets such as oil continues to be buoyed by the White House relief package and an almost daily flow of optimistic vaccine headlines, said Jim Ritterbusch, president of Ritterbusch and Associates in Galena, Illinois.The Organization of the Petroleum Exporting Countries forecast a stronger oil demand recovery this year, weighted to the second half. OPEC, Russia and its allies decided last week to maintain its output curbs almost unchanged.U.S. drillers are also holding back, cutting the number of oil and natural gas rigs operating for the first time since November, according to data from energy services firm Baker Hughes Co.The stronger-than-expected rebound in the second half of this year implies that the global economy and hence oil demand outlook is close to shaking off its COVID woes, PVM analysts said.RBC Capital analysts said the fundamentals for summer gasoline was the most bullish in nearly a decade.The United States, worlds largest oil consumer, saw a big draw on U.S. gasoline stocks last week as the winter storm in Texas disrupted refining output. [EIA/S]Sustained higher oil prices are expected to encourage U.S. producers to increase output, which could eventually weigh on prices, JPMorgan analysts wrote.JPMorgan expects U.S. oil output to average 11.36 million barrels per day this year compared with 11.32 million bpd in 2020.Earlier this week, the government revised down 2021s decline expected in U.S. crude production. Output is seen falling 160,000 bpd to 11.15 million bpd, a smaller decrease than its previous monthly forecast for a 290,000-bpd drop."}