{"text": "Oil producer Ovintiv Inc is in advanced talks with a privately owned energy investment firm to sell its holding in a south Texas shale basin for more than $800 million, sources familiar with the matter said on Friday.The sale of its Eagle Ford acreage would mark a milestone for Denver-based Ovintiv, which is on a multi-year debt reduction plan it outlined in February. The plan includes generating about $1 billion from divesting assets.Ovintivs shares have gained over 90% so far this year, amid a broad rally in oil producers aided by rising U.S. crude prices.The prospective buyer is Pontem Energy Capital, which is run by Felix Energy founder Skye Callantine, Jeff Bartlett and Cameron Brown, the sources said.While there is no guarantee that the deal will go through, it could be announced as early as next week, according to one of the sources.The sources spoke on the condition of anonymity as the information is not public yet. Ovintiv declined to comment, while Pontem did not immediately respond to a request for comment.The Eagle Ford position, which was bought in 2014 for about $3.1 billion from Freeport-McMoRan Inc, attracted multiple private equity bidders, the sources said.Pontem's bid was well above rivals, according to two of the sources. (Graphic: Ovintiv's debt burden, )https://graphics.reuters.com/OVINTIV-DIVESTITURE/yzdpxedmbvx/chart.pngThe Eagle Ford asset sale, which Reuters first reported was underway in November, would be the latest step Ovintiv has taken to cut down debt and gain investor confidence.While many U.S. shale producers have generated below par returns in recent years, Ovintiv also drew shareholder ire for its acquisition of Newfield Exploration, which left it with nearly $7 billion in debt, and high executive pay.Ovintiv was targeted by activist investor Kimmeridge Energy Management last year, which led to a proxy fight and the company agreeing earlier this month to add one of the investors nominees to its board.In February, Ovintiv introduced changes including aligning management pay with climate change targets and came up with a revised plan to cut its debt by around 35% to $4.5 billion, while also selling its Duvernay assets in Alberta."}