{"text": "NEW YORK Oil hit an 11-month high just below $57 a barrel on Tuesday, bolstered by Saudi Arabias plans to limit supply, offsetting worries that rising coronavirus cases globally would curtail fuel demand.Brent crude settled up 92 cents, or 1.7%, at $56.58 a barrel by after touching its highest level since last February at $56.75. U.S. West Texas Intermediate (WTI) gained 96 cents, or 1.8%, to $53.28.Saudi Arabia plans to cut output by an extra 1 million barrels per day (bpd) in February and March to keep inventories in check.The Saudi cut is part of an OPEC-led deal in which most producers will hold output steady in February. Last years record cuts from OPEC and its allies helped oil recover from historic lows reached in April.But OPEC+ compliance with pledged oil output curbs fell to 75% in December, among the lowest levels since the supply pact started in May 2020, tanker tracker Petro-Logistics said on Tuesday, which could weigh on oil prices.U.S. crude oil production was also expected to fall by 190,000 barrels per day (bpd) in 2021 to 11.1 million bpd, according to an Energy Information Administration report released on Tuesday, a smaller decline than its previous forecast for a drop of 240,000 bpd.Storage at Cushing is only 10.2 million barrels below the all-time record high, so there is no problem with supply here in the U.S., but the complex is responding positively to this chatter about undersupply, said Bob Yawger, director of energy futures at Mizuho.Oil also gained on expectations for a drop in U.S. crude stockpiles. Analysts expect crude inventories to fall by 2.7 million barrels for a fifth straight week of declines. [EIA/S]The first of this weeks two supply reports, from the American Petroleum Institute, is due at 4:30 p.m. EST (2130 GMT).The market is also being supported by the prospect of increased economic stimulus in the United States. President-elect Joe Biden, who takes office on Jan. 20, has promised trillions in extra pandemic-relief spending.However, oil price gains were capped by demand concerns as coronavirus cases rise around the world.Chinese authorities introduced new curbs in areas surrounding Beijing on Tuesday and Japan is to widen a state of emergency beyond Tokyo."}