{"text": "NEW YORK Oil prices fell on Thursday, weighed down by the surge in coronavirus cases that is hampering the global economy, along with an unexpected rise in U.S. crude stockpiles.Oil futures tracked with U.S. equities, which also fell on pandemic concerns. Europe is grappling with a sharp increase in infections and new social restrictions. In the United States, new cases have surpassed 100,000 per day for several days, and more than a dozen states have doubled their caseloads in the last two weeks.Brent crude fell 27 cents to settle at $43.53 a barrel, while U.S. West Texas Intermediate (WTI) crude fell 33 cents to settle at $41.12 a barrel.When stocks gave up gains, oil followed, said Phil Flynn, senior analyst at Price Futures Group in Chicago. Its a very nervous market.U.S. government data added to the bearishness, as crude inventories rose by 4.3 million barrels last week, compared with an expected fall of 913,000 barrels.Even with that development, though, oil demand remains shaky. The International Energy Agency (IEA) said global oil demand was unlikely to rise significantly until well into 2021, if the vaccine is successful.While the vaccine remains the best news received since the virus spread, life wont return to normal in a matter of days or weeks, said Hussein Sayed, chief market strategist at FXTM.Similarly, the Organization of the Petroleum Exporting Countries (OPEC) lowered its forecast for demand on Wednesday, saying consumption will rebound more slowly in 2021 than previously thought because of the virus.(GRAPHIC: Demand/supply balance - )https://fingfx.thomsonreuters.com/gfx/mkt/xklpybgdyvg/supplydemandnov.JPGAlgerias energy minister said OPEC+ - grouping OPEC and allies including Russia - could extend production cuts of 7.7 million barrels per day (bpd) into 2021, or deepen them further if needed.OPEC+ is expected to hold off on a scheduled increase in supply in January due to the weakening outlook. It was considering a reduction in its supply cuts to 5.7 million bpd.We feel OPEC has no choice but to delay output increases; most likely by three months, analysts at ANZ Research wrote."}