{"text": "NEW YORK Oil prices climbed more than 2% on Friday, hitting the highest levels in more than a year on hopes a U.S. stimulus will boost the economy and fuel demand, as supplies tighten due largely to output cuts by top producing countries.Brent crude settled up $1.29, or 2.1%, at $62.43 a barrel by 1:32 p.m. ET (1832 GMT) after rising to a session high of $62.83, the highest since Jan. 22, 2020. U.S. oil ended the session up $1.23, or 2.1%, at $59.47 after rising to a session high of $59.82, the highest since Jan. 9, 2020.U.S. crude notched a weekly gain of about 4.7% while Brent rose 5.3% on the week.U.S. President Joe Biden will meet with a bipartisan group of mayors and governors as he keeps pushing for approval of a $1.9 trillion coronavirus relief plan to bolster economic growth and help millions of unemployed workers.All three major U.S. stock indexes were on course for their second straight weekly rise. A sharp drop in new COVID-19 cases and hospitalizations buoyed hopes life will eventually return to normal.Expected U.S. stimulus and ongoing vaccine progress is likely to maintain appetite for risky assets in offering support to the oil market, said Jim Ritterbusch, president of Ritterbusch and Associates in Galena, Illinois.Oil prices have risen over recent weeks due partly to production cuts from the Organization of the Petroleum Exporting Countries (OPEC) and allied producers in the group OPEC+.Oil prices held onto their recent gains this week, buoyed by further signs that crude stocks, particularly in the U.S., are falling, Capital Economics analysts said in a note.We anticipate that inventories will fall further later this year as transport fuel demand revives in tandem with the easing of virus-related restrictions on travel.Still, OPEC this week ratcheted down expectations for global oil demand to recover in 2021, trimming its forecast by 110,000 barrels per day (bpd) to 5.79 million bpd.The International Energy Agency (IEA) said oil supply was still outstripping global demand, though COVID-19 vaccines are expected to support a demand recovery.The (IEA) report paints a more pessimistic picture than market participants have presumably been envisaging given the current high prices, Commerzbank said.Demand data from the worlds biggest oil importer also paints a bleak picture.The number of people who travelled in China ahead of Lunar New Year holidays plummeted by 70% from two years ago as coronavirus restrictions curbed the worlds largest annual domestic migration, official data showed.Rebalancing in the market could also face headwinds if U.S. production rises, analysts and traders said.U.S. drillers this week added oil and natural gas rigs for a 12th week in a row, the longest streak of additions since June 2017, according to Baker Hughes data."}