{"text": "Russian President Vladimir Putin marked the 60th anniversary of Yuri Gagarin's historic space flight on Monday with a pledge that Moscow would remain a key space and nuclear power.Gagarin became the first human in outer space on April 12, 1961, in one of the Soviet Union's most important Cold War victories and a pivotal moment in its space race with the United States.The Soviet Union's achievements in space continue to be a source of national pride and a patriotic rallying cry at a time when Moscow's relations with Washington are at a post-Cold War low.To mark the anniversary, Putin laid flowers on a monument to Gagarin near his landing site close to the city of Engels, some 860 km (535 miles) southeast of Moscow.\"This is without a doubt a great event that changed the world. We will always be proud that it was our country that paved the road to outer space,\" Putin told senior officials.\"In the 21st century, Russia must properly maintain its status as one of the leading nuclear and space powers, because the space sector is directly linked to defence.\"Gagarin's 108-minute orbit around the Earth propelled him to international fame and earned him the status of national hero in the Soviet Union, which erected statues and painted murals in his honour across its vast territory.The head of Russian space agency Roscosmos and members of the Communist Party laid flowers on Gagarin's grave at the foot of the Kremlin wall on Monday.Other commemorative events were more light-hearted, including a neighbourhood clean-up in the Siberian city of Irkutsk where volunteers dressed up as characters from Star Wars.Celebrations also took place in space.\"Our scientists and engineers demonstrated the unquestionable superiority of our homeland's technology, and made us the (world's) first space power,\" cosmonaut Oleg Novitsky said in a video address from the International Space Station (ISS), flanked by three other Russian cosmonauts.Roscosmos has suffered a series of technical mishaps and corruption scandals in recent years, including during the construction of the Vostochny Cosmodrome in the country's far east where contractors were accused of embezzling state funds.In 2019, Putin complained to government officials about corruption at the facility, and investigators said they were looking into allegations of fraud."}