{"text": "Remember when plug-in hybrid cars were the go-to technology for the climate-conscious driver? Turns out, theyre not good for the environment, according to some experts, and they could be phased out by carmakers in the face of tougher European rules.EU policy plans for plug-in hybrid vehicles (PHEVs), which contain an electric battery and a combustion engine, could mean the \"transition\" technology has a shorter lifespan than envisaged by some leading automakers.Draft green finance regulations would ban manufacturers from labelling them as \"sustainable investments\" beyond 2025, potentially deterring investors. Meanwhile planned rules on emissions of pollutants like nitrogen oxides could increase the cost of producing these cars.The aim of such reforms is to speed the transit to fully-electric vehicles and meet climate goals. Yet they would mark a shift from existing EU policies, such as CO2 standards, which have treated hybrids on a par with all-electric cars and helped spur the auto industry to invest tens of billions of euros in the technology.Some carmakers had envisaged selling hybrids until at least the end of this decade as a bridge to fully battery electric vehicles (BEVs) - although their shift away from the technology looks to be underway.An analysis of car production plans in Europe through to 2028 compiled for Reuters by AutoForecast Solutions (AFS), which tracks industry production plans, shows only 28 PHEV models versus 86 BEV models. That is a turnaround for an industry where PHEV models on the market have outnumbered BEV models every year since 2015, often significantly.Now some carmakers fear the EU could prematurely cut short that transition. They warn upcoming rules could make it hard to sell PHEVs in European markets in just a few years' time, despite consumer concerns about the range of fully electric cars and a lack of charging infrastructure.\"It's crazy to do this by 2025 because effectively you kill demand today,\" said Adrian Hallmark, CEO of British luxury carmaker Bentley, a unit of Volkswagen (VOWG_p.DE), referring to proposals to not classify PHEVs as sustainable investments. He plans to sell PHEVs until 2030 before going all-electric.\"For most people, a battery electric car is not yet practical,\" he told Reuters.A European Commission official declined to comment on the green finance rules specifically, but said its policies were \"technology neutral\", adding that PHEVs were \"a transition technology towards zero-emission mobility\". To reach an overall climate neutrality target in 2050, nearly all cars on the roads must be zero emissions by that time, the Commission added.The rules, which are still being drafted, come against the backdrop of a shift in the position of some leading environmental groups which are pushing to dispel PHEVs' green credentials and do away with their subsidies.One study, from the International Council on Clean Transportation last September, said PHEVs' fuel consumption and CO2 emissions are up to four times the level they are approved for because people do not charge them often enough. Julia Poliscanova, senior director for vehicles and e-mobility at European NGO Transport & Environment, said its own research showed that when driven in combustion-engine mode, hybrids' CO2 emissions were higher than conventional cars' - they're heavier than combustion-only cars so used more fuel.\"From the perspective of environment and climate, today's plug-in hybrid technology is worse than what it is replacing.\"This is a change in the group's position from as recently as 2018, when it saw PHEVs as a transition technology.'GREAT CONSUMER PRODUCT'Carmakers say hybrids, used properly with electric as the primary power source and combustion as a back-up, emit far less than conventional cars. They add that PHEVs are a popular transitional choice for consumers who want greener travel.PHEV sales in the EU more than tripled to 507,000 vehicles in 2020, almost as many as the nearly 539,000 all-electric vehicles sold.Gauging carmakers' investments on PHEVs is hard because they only announce broad \"electrification\" plans. Consultancy AlixPartners estimates carmakers and suppliers will invest $200 billion in electrification from 2020 to 2024.German engineering specialists FEV estimates fitting a battery, motor and electronics to a combustion engine car to make a PHEV costs up to 4,000 euros ($4,700) per vehicle.European automakers are dividing over whether to fight for PHEVs, or spend their financial and political capital accelerating the leap to fully electric vehicles and pushing for better charging infrastructure across the continent.Stephan Neugebauer, chairman of the European Green Vehicles Initiative Association, told Reuters technology improvements will mean future PHEVs rely less on their combustion engines, making them fit for the green transition over the next decade and even beyond.\"Will all customers buy battery electric vehicles in 10 years, or nine years? We don't think so,\" said Neugebauer, who is also BMW's director of global research cooperation.\"Why? Because sometimes you have to make a long-distance trip, you go on holidays, you have to pull a trailer. And for this, you need public charging infrastructure. And this will still be a critical issue.\"BMW (BMWG.DE) and Renault SA (RENA.PA), which have not set a date for going all-electric, are among the companies firmly in the hybrids camp.BMW boss Oliver Zipse said last month that they were \"a great consumer product\" and there would be a market for them even without subsidies. Renault CEO Luca de Meo said in February that PHEVs \"will be part of the landscape for the next 10 years easily\" and were more profitable than conventional cars.Volvo Cars CEO Hkan Samuelsson told Reuters: \"It's a bit disappointing they (Brussels policymakers) don't see the value of a plug-in hybrid\". But he said his company, which aims to be all-electric by 2030, was more focused on pushing the EU to make member states invest heavily in charging infrastructure.\"If we in the car industry invest in electric cars, and do that very rapidly, I think our credibility to ask for investments in the charging network increases,\" he said.'THE LIMIT OF WHAT'S ACHIEVABLE'The European Commission is due to propose at least a dozen pieces of legislation to slash emissions across all sectors this year. Current drafts of the EU's sustainable finance taxonomy, a list of economic activities that from next year will determine what can be marketed as a sustainable investment, exclude manufacturing of PHEVs from 2026. That could deter the army of investors seeking assets with green credentials. It could also potentially restrict public funding, if governments moved to align their spending with the taxonomy.While many countries still subsidise PHEVs, the Netherlands scaled back tax breaks for them in 2016. By 2020, eight times as many BEVs were sold in the country as PHEVs, compared with four times as many PHEVs as BEVs four years before, showing how government policy on vehicle technology can have a major effect on consumer behaviour.A consortium of researchers, commissioned by the EU and known as CLOVE, this month recommended that so-called Euro 7 rules should tighten car emission limits for pollutants including nitrogen oxides and carbon monoxide from 2025. Its recommendations are not binding, but aim to inform the European Commission's proposals, due later this year.Transport & Environment, part of the Commission's expert group working on the standards, said the proposals would force carmakers to fit PHEVs with expensive technology to curb emissions from their combustion engines.Hildegard Mueller, president of German auto industry association VDA, said the proposals were \"at the limit of what is technologically achievable\".\"We still have to be very careful that the internal combustion engine is not made impossible by Euro 7,\" she said.($1 = 0.8503 euros)"}