{"text": "CAMDEN, N.J. Zsakhiem James, a police captain in Camden, New Jersey - once considered the most dangerous city in the United States - sees every encounter with a resident as an opportunity to build social currency to prevent or solve a future crime.Thats why during a tour this week of Federal Street, a main thoroughfare through Camdens business district, he preached to two young officers the importance of forging personal ties on their beat.We try to meet people in the absence of crisis, James told Reuters. Thats one of the things that helps us build that social currency. We make those deposits in the community where when things happen we can make a withdrawal on that trust.Crime in Camden, a city of 74,000 on the Delaware River east of Philadelphia, has dropped since it dissolved its police force and rebuilt it in 2013 with a focus on community engagement. Officials are quick to point out Camdens protests over the death of George Floyd remained peaceful, with some officers taking part, while there was looting in Philadelphia.The force has earned plaudits from former U.S. President Barack Obama and is drawing attention as a possible model of reform after the death of Floyd in Minneapolis police custody on May 25. Proposals to rethink policing (here) range from banning chokeholds to dismantling police departments outright.To be sure, some critics say the drop in crime in Camden has as much to do with the hiring of more officers than a softer approach, and that the force has not been fully transparent with its disclosures. One resident is suing the department after a video showed him being punched by an officer 12 times during an arrest.Still, the statistics point to progress. The police reported 1,161 violent crime incidents in 2019, down 42 percent since 2012, the year before Camden County took over policing from the city. Excessive force complaints have also dropped. Three were registered for 2019, down from 65 in 2014.That compares to a 2 percent nationwide drop in violent crime rates between 2012 and 2018, that latest year available for data compiled by the FBI.The Camden County Police Departments use-of-force policy emphasizes respect for the sanctity of life and techniques to reduce tensions. A training simulator used to teach cadets triggers red flags based on the tone of an officers voice.While walking his beat on Federal Street, Alexander Baldwin, 28, recalled defusing a fight between two men over a woman by giving the main instigator space to vent a little After a year on the job, he says he has yet to draw his gun.Just trying to treat them as people and not as some sort of criminal helps a lot, the officer said.A MODEL?More than 130 agencies and police executives have visited Camdens command staff over the past four years, according to county spokesman Dan Keashen, a number that is likely to grow as cities respond to calls to defund the police.Devon Jacob, a lawyer representing Edward Minguela in his lawsuit accusing Camden police officers of violating his civil rights during a 2018 arrest, says the punches delivered to his clients head are proof Camden is not deserving of praise.Camden has not reformed itself, said Jacob, who is also on the Floyd familys legal team and sees parallels with Floyds case in that other officers at the scene did not intervene to stop the punching. Its not a model.Camden County terminated the officer and sought his prosecution, evidence of the forces commitment to rooting out problems, Keashen said. The officer was prosecuted in a federal criminal case but was acquitted following two trials last year.John Pike, 60, lives across the street from an apartment tower that about a decade ago was famously raided from the air. Officers, fearful of resistance on the ground, descended by helicopter onto the roof to make arrests.Pike, who has lived in Camden for five decades, says the police are doing a better job of engaging with youth and are hiring better people, but that investments in charter schools and other factors are also behind lower levels of crime.Camdens police department has nearly doubled in size since its reformation to around 400, a factor that educator Keith Benson believes gets overlooked in all the praise being heaped on the force, along with the long-term decline in crime nationwide.You went from a skeleton crew by design to a fully staffed police force, said Benson, president of a Camden teachers union. The public narrative is really incomplete.Camden still has problems. It has one of the highest crime rates in New Jersey and in January was ranked Americas 10th most dangerous city by neighborhoodscout.com.But Lieutenant Gabe Rodriguez says the focus on community relations and limiting the use of force has paid off. He said he has drawn his gun hundreds of times since becoming an officer in 2003 but cant remember doing it once in the last 6 years.De-escalate, de-escalate. Thats the key."}