{"text": "LONDON Englands arts and cultural sector has so far received less than half of the one billion pounds ($1.4 billion) promised by the British government to help it cope with the COVID-19 pandemic, parliaments spending watchdog said on Friday.Museums, galleries, cinemas, nightclubs, theatres and other arts venues were all forced to close last March because of the coronavirus crisis. While some partially reopened last summer, many have remained shut since then.Last July, the government announced a 1.57 billion pound Culture Recovery Fund package of grants and loans. Four bodies - Arts Council England, Historic England, the National Lottery Heritage Fund and the British Film Institute - were responsible for handing out the first 1 billion pound tranche in England.In a report, the National Audit Office said 495 million pounds had been paid out to recipients by late February, while the government had not paid out any funding from a 400 million pound second phase it announced in December.Many across the sector will have welcomed the funding announced last summer. But eight months later, more than half of the 1 billion pounds made available so far is still waiting in the wings, Meg Hillier, chair of parliaments Public Accounts Committee, said.The Department for Digital, Culture, Media and Sport (DCMS) had based its funding plans on saving 75% of at-risk organisations under a worst-case scenario which envisaged social distancing measures remaining in place until March.However under the governments current plan, social distancing restrictions affecting many arts and entertainment venues will remain until the middle of June at the earliest.With the sectors shutdown already past governments worst-case scenario, DCMS needs to get support out to organisations while there are still organisations left to support, Hillier said.The DCMS said nearly 4,000 organisations and over 75,000 jobs had been saved.It is right that we get funding out quickly with the safeguards taxpayers would expect to see in such a huge investment, and much more money has been invested into the sector since this report was compiled, a spokeswoman said."}