{"text": "TORONTO/OTTAWA Ontario declared an emergency on Tuesday after latest modelling put Canadas most populous province on track to have more than 20,000 new COVID-19 cases per day by the middle of February, a nearly ten-fold increase from the current count.Ontario, which is battling a coronavirus surge that has swamped its hospitals and triggered a province-wide lockdown, could also see roughly 1,500 more deaths in its long-term care homes through mid-February under a worst-case scenario, according to modeling from experts advising the government.New restrictions that take effect on Jan. 14 mandate that residents must stay at home except for essential activity, while outdoor gatherings will be limited to five people, and non-essential construction work will be restricted.I know the stay at home order is a drastic measure, one we dont take lightly. Everyone must stay home to stay lives, said Ontario Premier Doug Ford at a media briefing. Enforcement and inspections will increase.Canada began targeted vaccinations in December, with current efforts focused on healthcare workers and residents of long-term care homes.The federal government ordered an additional 20 million doses of the coronavirus vaccine from Pfizer Inc and BioNTech, Prime Minister Justin Trudeau told reporters on Tuesday. That would take the total number of doses to be delivered this year in Canada to 80 million.Ontario, the countrys economic engine, has been under lockdown since Dec. 26, with non-essential businesses shuttered and schools closed for in-person learning.Yet the daily number of COVID-19 cases has spiked above 3,500 on average over the past seven days, government data showed. On Tuesday, Ontario reported 2,903 new COVID-19 cases.Under the worst-case scenario with 7% case growth, there would be 40,000 new cases daily by mid-February, while the best-case scenario with 1% growth would result in 5,000 new cases every day, Ontarios data showed. Case growth has recently been over 7% on the worst days, the data showed.In five of the hardest hit areas of Ontario - including the Toronto area, nearby Hamilton, and Windsor-Essex across the border from Detroit - schools will remain closed until at least Feb. 10. Childcare for children who are too young for school will remain open, along with emergency childcare for some school-age children.We will have to confront choices that no doctor ever wants to make and no family ever wants to hear, Dr. Steini Brown, head of Ontarios case modeling, said at a briefing on Tuesday. People will die from the virus itself and from the overloaded health system that is unable to respond to their needs.Brown warned that the new COVID-19 variant from Britain was already in Ontario and could decrease the doubling time of cases - or how long it takes for case counts to double, currently 30 to 40 days - to 10 days.Last week Quebec, Canadas worst-affected province from COVID-19, became the first in the country to introduce a curfew to limit the spread."}