{"text": "LONDON World oil demand will fall more steeply in 2020 than previously forecast due to the coronavirus and there are doubts about next years recovery, OPEC forecast on Wednesday, potentially making it harder for the group and its allies to support the market.World oil demand will tumble by 9.06 million barrels per day (bpd) this year, the Organization of the Petroleum Exporting Countries said in a monthly report, more than the 8.95 million bpd decline expected a month ago.Oil prices have collapsed as the coronavirus curtailed travel and economic activity. While some countries have eased lockdowns, allowing demand to recover, fear of new outbreaks has kept a lid on prices and OPEC expects this to persist.Crude and product price developments in the second half of 2020 will continue to be impacted by concerns over a second wave of infections and higher global stocks, OPEC said in the report.OPEC stuck to its forecast that in 2021 oil demand would rebound by 7 million bpd but said the outlook was subject to large uncertainties that might result in a negative impact on petroleum consumption, such as demand for air travel, more fuel-efficient cars and more competition from other fuels.Almost all forecasters expect jet fuel in 2021 to struggle making up for lost demand, OPEC said. Gasoline demand will face pressure to return to 2019 levels.Oil stocks have built up due to the demand collapse. OPEC said inventories in developed nations rose in June to stand 291.2 million barrels above the five-year average, a yardstick that OPEC before the pandemic saw as a desirable level.OPEC OUTPUT RISESTo tackle the drop in demand, OPEC and its allies, known as OPEC+, agreed to a record supply cut of 9.7 million bpd that started on May 1, while the United States and other nations said they would pump less.In the report, OPEC said its output rose by 980,000 bpd to 23.17 million bpd in July, largely because Saudi Arabia and other Gulf members ended extra voluntary cuts they had made in June.That amounted to 97% compliance with the pledges, according to a Reuters calculation - lower than Junes figure of well above 100%.OPEC is set to boost output further this month as the 9.7 million bpd cut tapers to a reduction of 7.7 million bpd from Aug. 1. A monitoring panel of OPEC+ ministers meets next Tuesday to discuss the market, and so far there is no suggestion of tweaking the agreement.The report also forecast that demand for OPEC crude will be lower than expected this year and next, as supply increases from outside the group and because of the reduced demand outlook for 2020.OPEC said demand for its crude this year will average 23.4 million bpd, down 400,000 bpd from the previous forecast. That suggests the market could move into surplus should OPECs output rise in August, as called for by the OPEC+ agreement."}