{"text": "Andrea Orcel stamped his mark on UniCredit within weeks of taking the reins, axing management committees and a dual head structure that had irked some top investors while hiring key lieutenants to oversee strategy and relations at the Italian bank.Orcel, a veteran UBS (UBSG.S) and Merrill Lynch dealmaker who almost landed the top job at Spanish bank Santander (SAN.MC), was hired by UniCredit (CRDI.MI) after its board fell out with his predecessor, Jean Pierre Mustier, over strategy.\"I have heard your concerns about the complexity of our business ... I have felt your frustration about some of the decisions that have been made; confusion about where ultimate responsibility lies; and the resulting lack of accountability,\" Orcel said in a message to UniCredit staff on Wednesday.UniCredit is struggling with profitability after Mustier, a French investment banker, focused on repairing its balance sheet and replenishing capital reserves, while failing to land a mooted cross-border merger.Orcel's appointment as CEO signals a new expansionist era for UniCredit, which underwent a major retrenchment under Mustier who shed 15 billion euros ($18 billion) in assets. In a break with his predecessor, Orcel said last week he could consider mergers and acquisitions to drive revenue and profit growth.  read more A hard-hitting investment banker behind many deals in financial services during his decades at UBS and Merrill Lynch, Orcel has also pledged to address operational flaws.\"I have spent the last few weeks speaking and listening to our people,\" he said as UniCredit announced that it was removing the bank's twin heads and appointing a chief technology officer as part of a broad overhaul.It is also replacing its executive management committee, which is made up of 27 people, with a 15-member group executive committee and cutting its internal committees to 15-20 from 44.\"I promised you a less complex, simplified organisation,\" Orcel said ahead of unveiling a new business plan later this year.Underpinning Orcel's pledge to place technology at the core of every decision, UniCredit hired Jingle Pang, who oversaw the digital transformation of Chinese insurance and banking conglomerate Ping An, as its new digital and information officer. STAKEHOLDER FOCUSUniCredit said as part of the changes it is axing its Western Europe and Finance & Controls divisions and forming a CEO office to include a stakeholder engagement arm as well as a \"strategy and optimisation\" division.The latter will be led by Fiona Melrose, former head of strategy at UBS's investment banking arm before joining Santander's strategy division in 2019.The moves come after Orcel, 57, only narrowly defeated a shareholder revolt over the terms and size of his up to 7.5 million euro ($9 million) remuneration package, securing just 54.1% of votes at a general meeting last month.  read more In an apparent indication of bridge building, Orcel has engaged Joanna Carss, another former Merrill and UBS ally, to run the new stakeholder engagement function at UniCredit.\"On paper the changes are very positive ... with people and digital technologies as key drivers. Success will hinge on executives holding the key roles,\" said Alessandro Zattoni, an Italian academic who chairs the International Corporate Governance Society.UniCredit will appoint Niccolo Ubertalli as head of Italian operations, having previously been in charge of Eastern Europe together with Gianfranco Bisagni.Like the heads for Germany, Central Europe and Eastern Europe, Ubertalli will now report directly to Orcel in a move that UniCredit said reflected Italy's \"critical importance\".Mustier had sought to reduce UniCredit's exposure to its debt-laden home country, which people close to the matter have said was one of the reasons he clashed with the board.Michael Diederich will continue to lead Germany, Bisagni will be in charge of Central Europe and Teodora Petkova, head of UniCredit's Bulgarian unit, becomes head of Eastern Europe.Stefano Porro and TJ Lim retain their current roles as, respectively, chief financial officer and chief risk officer, as does Richard Burton head of commercial investment banking.Ranieri de Marchis remains chief operating officer.($1 = 0.8244 euros)"}