{"text": "PHOENIX, Ore. Matt Manson stared at the burned-out corpse of his pick-up truck on Friday, which sat on a blackened driveway in front of a smoldering pile of rubble that once was his house.Like other residents of the small agricultural town of Phoenix, Oregon, he was in shock as he returned to his neighborhood and saw how fast the Alameda Drive wildfire had engulfed his home and upended his life.The fire melted the motor right out of my truck - it drained down the driveway, said Manson, a 43-year-old construction worker. I lost everything. I lost all my tools. My truck. I cant work. I lost $30,000 worth of guitars. All gone.Manson, who now owns only a backpack with a change of clothes, struggled to find the words to describe how the fire had ravaged the town that sits near the green Siskiyou Mountains, about 210 miles south of Portland. Trees lining his street were now just blackened, skeletal remains.It looks like a war just happened here, he said.A half million people in Oregon were ordered to evacuate as of Friday as scores of wildfires ate up the parched countryside, smoke darkening skies across the state, along with neighboring California and Washington. At least 24 people have died since the fires began last month. Authorities say they expect to find many more dead when they can inspect hard-hit areas.In Phoenix the smoke was still thick in the air as many of its 4,600 residents tried to grasp the extent of the damage. Local authorities said the fire destroyed a large swath of the town. State fire officials said at least two people were killed and four injured, and that the fire was 20% contained as of Friday afternoon.Doris Peterson, 85, said she only had time to grab Toby, her 12-year-old Chihuahua, when she and her husband, Richard, fled after police banged on their door Tuesday about noon and told them they had just minutes to get out.They spent five hours in bumper-to-bumper traffic before finding a hotel room in Grants Pass, Oregon - 35 miles up Interstate 5.On Friday she and her husband sat in their car at a baseball field just north of Phoenix, waiting to be escorted into their neighborhood by police. She was bracing for the worst, but still hoped for a miracle.I called my landline phone - and the answering machine picked up! she said. My next door neighbors will not pick up. Maybe our house survived."}