{"text": "NEW YORK Naomi Osaka ended Victoria Azarenkas dream run to claim her second U.S. Open title in three years with a 1-6 6-3 6-3 comeback win on Saturday which cemented her status as the sports leading light both on and off the court.Unlike the 22-year-old Japaneses first U.S. Open win in 2018 over Serena Williams, which was played in a frothing Arthur Ashe Stadium, Saturdays drama unfolded in a strangely quiet arena as COVID-19 health and safety protocols prevented fans from entering the Billie Jean King National Tennis Center.But the lack of buzz around the stands did not stop the two former world number ones from producing a dazzling display of shot making.As Osaka walked off with a third Grand Slam title, Azarenka was denied a U.S. Open crown for a third time having also finished runner-up in 2012 and 2013.Still it was a remarkable and unexpected run for the 31-year-old Belarusian, who reached her first major final in seven years.It was the second time in two weeks Azarenka, twice a winner at the Australian Open, and Osaka had set up a final showdown. The pair had been set to meet in the Western and Southern Open final on Aug. 29 until Osaka withdrew due to a hamstring injury.I actually dont want to play you in more finals, Osaka told Azarenka with a smile during the victory ceremony.I didnt really enjoy that.That was a really tough match for me.And yes, really inspiring for me because I used to watch you play here when I was younger so just to have the opportunity to play you is really great and I learned a lot.COVID-19 ERAThe presentation ceremony showed the precautions everyone has had to take during the COVID-19 era, with the two finalists having to pick up their respective prizes themselves from a table placed on court, while everyone stood socially distant for the obligatory photocall.As she has done in every match over the past fortnight, Osaka appeared on court with her left thigh strapped and a facemask with the name of a Black American victim of police brutality or racial injustice.For the final it was Tamir Rice, a 12-year-old boy shot by police in 2014 while playing with a toy gun in a playgound.Osaka had already replaced Serena Williams as top earner and now has assumed the leadership mantle that goes with it.With the United States rocked by unrest following the shooting of Jacob Blake, a Black man, just three weeks ago by police in Kenosha, Wisconsin, Osaka had withdrawn from her semi-final at the Western and Southern Open in protest.The mens and womens tour responded by postponing all the matches that were due to take place on the day of the protest by 24 hours and persuaded Osaka to contest the rescheduled match.By taking the stand, the 22-year-old activist had made her point.Azarenka, who ended Serena Williams bid for a record equalling 24th Grand Slam title in the semi-finals, carried that momentum into the final with a near flawless first set.One of top returners in the womens game, an energized Azarenka broke the fourth seed to start the final and twice more in a lopsided opening set that took just 27 minutes.If any spectators had been allowed in Arthur Ashe Stadium, they no doubt would have been left stunned by events as a rampaging Azarenka again broke Osaka at the first opportunity in the second to go 2-0 up.But Osaka would not lose her composure.After no aces in the opening set, Osaka, one of the games top servers, slowly began to find her mark in the second. She hammered down five aces while helping herself to three breaks on way to levelling the match.In the third it was Osaka applying all the early pressure on an increasingly rattled Azarenka. She took charge with a break to nudge in front 3-1.Azarenka would show her fighting spirit with a break to get back on serve at 3-4 but Osaka would not be denied, immediately breaking back and holding serve to seal victory.It marked the first time since Arantxa Sanchez-Vicario in 1994 that a player had dropped the first set of the womens final and fought back to win the title."}