{"text": "TOKYO Naomi Osaka has been the dominant storyline of the 2020 U.S. Open, both for on-court performances that mean she will be playing in Saturdays final and for her vocal support of the Black Lives Matter (BLM) movement.Before each match, Osaka has worn a mask bearing the name of a different Black American in a powerful symbol of her support for the fight against racial injustice in the United States.Osaka, who has a Japanese mother and Haitian father, may represent Japan but she lives in Los Angeles and has joined several BLM protests across the country this year.Although her focus has been on racial injustice over the last few months, the 23-year-old has long been a symbol for change in Japan.Osaka is one of the countrys most recognised personalities and has become the face of a changing Japan coming to terms with challenges to its self-image as a racially homogenous society.Baye McNeil, a prominent Japan-based African-American author and activist, sees Osaka as the next in a line of great Black athlete activists such as boxer Muhammad Ali and sprinter Jesse Owens.Muhammad Ali... put his career on the line in order to protest things that he thought were unjust or just wrong. And I think Naomi is on that path, McNeil told Reuters from Yokohama.She is joining a community that has a history, has a legacy, going all the way back beyond Jesse Owens. In fact, what she is doing is very in line with Jesse Owens. Not necessarily for her impact on America but on Japan.I kind of think of her as a Jesse Owens of Japan.CHANGING THE NARRATIVEMcNeil, who moved to Japan 16 years ago, believes Osaka and other biracial athletes like basketball player Rui Hachimura and Chicago Cubs pitcher Yu Darvish can be catalysts for change just by competing.It doesnt even require them to say anything, you just look at them and say Oh my God, this is a Black woman representing Japan, he said.This is something Japan has never faced before and I am not sure how exactly they are going to resolve this, or how they are going to modify the narrative, but some modification is required.Jaime Smith, who helped organise Junes BLM protest in Tokyo, thinks many Japanese people do not see Osakas activism as relating to their own country.They see it from the viewpoint that she is a Black American woman, even though shes half Japanese, and she is speaking out about an American problem, so I still think theres some wilful ignorance there, Smith told Reuters.Thats ... the kind of mindset we are trying to change.Smith, who moved from the U.S. to Japan three years ago, sees Osaka as the perfect person to push through this change.She is at a point where she is huge worldwide and people cant help but listen to her, she said.I think this is the perfect time to do what she is doing.JAPANESE SPONSORSFollowing her 2018 U.S. Open triumph, Osaka attracted a large number of sponsors, many of them big Japanese brands, and became the worlds highest paid female athlete, according to Forbes.These sponsors have not always been supportive of Osakas campaigning against racial injustice, however.A report in Japanese newspaper Mainichi on Friday cited unnamed sources at one of her sponsors as criticising her BLM stance, saying they would prefer her to concentrate on tennis.If some in Japan are struggling to come to terms with Osakas activism, this was not apparent at Tokyos Godai tennis club on Saturday morning.With the face masks, I perceive a kind of determination that she is facing her matches with these thoughts, said Chika Hyodo.I think she is trying to fulfil the role she was given as an athlete and I feel awesome about it. I support her.Osaka was a hot topic of conversation at the club as the younger members had their weekly lessons and there was no sign that her activism was having any impact on her popularity.She is a Japanese, strong female tennis player, said 10-year-old Ai Uemura.I think its great that she entertains people."}