{"text": "Olympia Dukakis, who won an Oscar for her performance as a sardonic, middle-aged mother who advises her headstrong daughter on matters of love in the 1987 romantic film comedy Moonstruck, died on Saturday at age 89.Dukakis - a cousin of unsuccessful 1988 Democratic U.S. presidential nominee Michael Dukakis - passed away at her New York City home on Saturday morning after months of failing health, according to her agent, Allison Levy. Her daughter, Christina Zorich, was by her side.Dukakis, the Massachusetts-born daughter of Greek immigrants, worked for decades as a stage, TV and film actor before rocketing to fame at age 56 playing the mother of Cher's character in \"Moonstruck.\"Dukakis built on that with roles in films including \"Look Who's Talking\" (1989) and its sequels with John Travolta and Kirstie Alley, \"Steel Magnolias\" (1989) with Shirley MacLaine, Sally Field and Julia Roberts, director Woody Allen's \"Mighty Aphrodite\" (1995) and \"Mr. Holland's Opus\" (1995) with Richard Dreyfuss.Dukakis, a master of deadpan humor, also was nominated for Emmy awards for TV roles in 1991, 1998 and 1999.In the 1970s, she co-founded the Whole Theater in the New York City suburb of Montclair, New Jersey, after moving there with her husband, fellow actor Louis Zorich.But, for many, her most indelible performance came in director Norman Jewison's \"Moonstruck\" as Rose Castorini, a Brooklyn woman with a cheating plumber husband (Vincent Gardenia) and a widowed bookkeeper daughter, Loretta (Cher), who has an affair with her fiance's opera-buff brother (Nicolas Cage).Her banter with Cher was among the film's highlights, including a scene in which Dukakis scolded her daughter during a kitchen dissection of her love life.\"Your life's going down the toilet,\" Dukakis said in her throaty voice.At another point, she tells Cher it is good she did not love her fiance. \"When you love them, they drive you crazy because they know they can.\"\"Olympia Dukakis Was An Amazing, Academy Award Winning Actress,\" actress and singer Cher wrote on Twitter. \"... I talked to her 3Wks Ago. Rip Dear One.\"Another Oscar winner, Viola Davis, called Dukakis \"the consummate actress\" on Twitter. \"You made all around you step up their game. A joy to work with. Rest well.\"\"Moonstruck,\" considered one of Hollywood's great romantic comedies, won three Academy Awards, including Cher as best actress, and was nominated in three other categories, including best picture. It also was one of the highest-grossing films of 1987.In accepting her Oscar as best supporting actress in April 1988, when her cousin was battling to become the Democratic Party's presidential nominee, she thanked Jewison, her husband and a few others.She then raised the golden statuette over her head and shouted to the worldwide TV audience, \"OK, Michael, let's go.\"Michael Dukakis won the nomination but the Massachusetts governor lost badly in the general election to Republican Vice President George H.W. Bush.Like her cousin, Olympia Dukakis embraced liberal views, advocating for causes including women's rights, gay rights and the environment.\"She had an incredible life and we were very proud of her,\" Michael Dukakis told the Boston Globe on Saturday.Olympia Dukakis was born in Lowell, Massachusetts, on June 20, 1931 and continued to act into her 80s.Referring to becoming a movie star at an age when many actresses have a hard time finding good roles, Dukakis told the Guardian newspaper in 2012, \"Who knows how that happened? Chance, fate or a bit of both. But I'm very glad I did 'Moonstruck.' It meant that I woke up the next day and was finally able to pay the bills.\"Dukakis said she enjoyed her fame after \"Moonstruck.\"\"The fun part is that people pass me on the street and yell lines from my movies,\" she told the Los Angeles Times in 1991. \"For 'Moonstruck' they say, 'You're life is going down the toilet.'\"Her TV appearances included playing a transgender landlady in the 1993 miniseries \"Armistead Maupin's Tales of the City\" and its 1998 and 2001 follow-ups. Dukakis reprised her role in a 2019 revival of the miniseries for Netflix.Other films included \"Cloudburst\" (2011) playing a foul-mouthed lesbian, \"Away from Her\" (2006) with Julie Christie, \"The Event\" (2003), \"Better Living\" (1998) with Roy Scheider, \"Never Too Late\" (1996) with Cloris Leachman, and \"Dad\" (1989) with Jack Lemmon and Ted Danson.Dukakis in 1962 married Louis Zorich, with whom she had two sons and a daughter and who passed away in 2018. She also had four grandchildren."}