{"text": "(This February 12 story corrects day of the week in 2nd paragraph to Tuesday, not Wednesday)NACHOD, Czech Republic Jan Mach had coped with his eastern Czech district hospitals COVID-19 wards filling up - until 22 new arrivals on Monday alone were too much and he had to seek outside help.On Tuesday, ambulances took 15 patients to hospitals as much as 230 km (140 miles) away, as closer ones were also packed.We have been close to our ceiling in the past 14 days, we have touched it several times, director Mach said, adding the 339-bed hospital had 120 COVID-19 patients. On Monday alone we took in 22 patients and that was beyond our means.Nachod and Trutnov, neighbouring districts on the Polish border 150 km east of Prague, are among several regions that have seen incessant spread of the disease, despite a national lockdown.A new, more infectious variant of the virus first detected in Britain is the likely reason - data from January showed between 45% and 60% of new patients were infected with the UK variant.On Friday, the region of 550,000 reported just four free beds in COVID-19 wards and eight in high dependency and intensive care units (ICUs) treating coronavirus patients.We are taking in patients in a more serious condition and younger patients, I mean born 1970 and later, we had not seen that in the autumn, Mach said.Patients who would normally be treated in high-dependency units or ICU have had to be given therapies such as high-flow oxygen on normal wards due to the shortage of beds.Mach spoke minutes after overseeing another ICU patient being transferred to another hospital. Staff dressed in full-body protective gear pushed the trolley past piles of equipment boxes, one of them with the hand-written label body bags.The Czech Republic has ranked among the European countries worst-hit by the pandemic. Only Portugal has reported more new cases per capita in the past two weeks, according to the European Centre for Disease Prevention and Control (ECDC).As of Friday morning, the country of 10.7 million had reported 17,902 COVID-19 related deaths.Still, the parliament voted on Thursday not to extend a national state of emergency, which will lift some of current lockdown measures including the closure of shops, a loosely policed ban on gatherings and a night-time curfew.Petr Stepanek, chief surgeon in the resuscitation unit at Nachod hospital, said the situation was very tense.It is about the British variant, Stepanek said. If a majority of the population has already had it, thank God. If not, then the situation can become very dramatic."}