{"text": "Veteran offensive tackle Jared Veldheer could make NFL history if he takes the field for the Green Bay Packers against the Los Angeles Rams in their divisional playoff game on Saturday after signing with the team Monday, according to ESPN and the NFL Network.Veldheer started at left tackle for the Indianapolis Colts in their loss to the Buffalo Bills in a wild-card game last weekend. He joined the Colts practice squad in late December.Veldheer, who was retired for most of 2019 and most of 2020, is one snap away from becoming the first player in league history to play games for two teams in the same postseason.Veldheer, 33, is allowed to sign with Green Bay because he was on the Colts practice squad and was promoted only for the Colts playoff game. He was not signed to the 53-man roster. He should be allowed to practice immediately because was in the Colts COVID-19 testing program.Veldheer is no stranger to Green Bay. He started for the Packers at right tackle in last years NFC divisional playoff win over the Seattle Seahawks after Bryan Bulaga missed the game because he was sick. Veldheer came out of retirement to sign with the Packers in November 2019.Now, Veldheer will likely team with Rick Wagner to replace left tackle David Bakhtiari, who suffered a season-ending torn ACL before the Packers final regular-season game against the Bears. Against Chicago, the Packers started Billy Turner and shifted Wagner to right tackle.However, Wagner has been dealing with an ailing knee and didnt practice during Green Bays bye week, which it earned as the top seed following a 13-3 regular season.Veldheer would be called upon to help block Los Angeles All-Pro defensive tackle Aaron Donald, who powered a unit that sacked Seattle quarterback Russell Wilson five times in a 30-20 win last Saturday.Veldheer, who was drafted by Oakland in the third round of the 2010 NFL Draft, has played in 121 games, with 114 starts, during an 11-season career in which he played for Oakland, Arizona, Denver, Green Bay and Indianapolis.--Field Level Media"}