{"text": "ISLAMABAD Protests were held in several Pakistani cities for a second day on Saturday over the handling of an investigation into the gang rape of a mother travelling with her children on a highway, as police said they were launching a manhunt for the suspects.The woman, who police say is in her early 30s, was driving late on Tuesday night outside the eastern city of Lahore with her two children when her vehicle ran out of fuel.She phoned police for help, but before they arrived two men took her and her children out of the vehicle at gunpoint and raped her beside the highway.Inam Ghani, Inspector General of Punjab province, where the incident took place, told reporters on Saturday night that police had identified the two suspects through DNA tracing.I am hopeful very soon we will reach them and arrest them, he said.But the protesters are not satisfied, and called for the sacking of the lead police investigator assigned to the case, Omar Sheikh, who has repeatedly pointed out what he felt were mistakes made by the victim, such she should have taken a different, busier, highway, not travelled at night, and made sure her vehicle had enough fuel.He also said she appeared to be under the impression Pakistan was as safe for women as France, her country of residence. Requests for comment to the French Embassy in Islamabad went unanswered.In Islamabad, several hundred protesters gathered, some waved French flags, and others held signs saying hang the rapists.Hundreds, mostly women, also gathered in Lahore, Karachi, and even the conservative northwestern city of Peshawar. Shatter the silence, stop the violence, read one placard in Peshawar.Global rights watchdogs have pointed out that Pakistan has not done enough to stem violence against women, including ensuring perpetrators are held accountable.The attack has especially angered women who say public space in the ultra-conservative country was already limited. And now the police are telling you that you are responsible for your own safety, said Yamna Rehman at the Islamabad protest.The incident has sparked widespread outrage on social media."}