{"text": "Drivers in the U.S. Southeast formed lines on Wednesday to fill up tanks from the dwindling number of retail gas stations with fuel to sell, disregarding government pleas not to hoard as the shutdown of the nation's biggest fuel pipeline entered its sixth day.\"If I don't have gas, I don't work,\" said Ronald Ross, 47, a DoorDash driver in Atlanta, as he fueled up his Chevy sedan.Asked about government requests to avoid hoarding, he said: Forget that. It's first come first serve. People have to look out for themselves. As long as they're peaceful and all.\"Fistfights at gas stations were reported in some places. One video showed an altercation between two customers at a station in North Carolina.Nearly 60% of gas stations in metro Atlanta were without gasoline on Wednesday, along with more than 70% of stations in metro Charlotte and Raleigh, North Carolina, and Pensacola, Florida tracking firm GasBuddy said.The average national gasoline price, meanwhile, rose to above $3.00 a gallon on Wednesday, the highest since October 2014, the American Automobile Association said.The U.S. Southeast and Mid-Atlantic rely heavily on the Colonial Pipeline, which was shut by a ransomware hack on Friday and is expected to remain down for several more days.  read more The administration of U.S. President Joe Biden on Tuesday called on Americans not to hoard fuel during the pipeline outage, saying panic buying would only intensify supply outages at service stations struggling to get new deliveries.It also warned Americans to not fill plastic bags with fuel, after a Twitter post overnight showed someone doing that. L1N2MZ1WZGeorgia Governor Brian Kemp temporarily suspended gas taxes in the state to ease the impact of the price hikes on consumers, and also asked citizens not to \"panic buy.\"James Jones, 48, a contractor in Atlanta, did not heed that call. He drove for miles looking for a retail station that was still operating Wednesday morning so he could load up two red five-gallon jerry cans for future use.\"I just went to five stations, finally I found one that still had gas,\" Jones said.He had filled up his Chevy truck with gasoline Tuesday night, but got nervous and decided to get more. \"Who knows when this will end, so I thought I'd better get mine,\" Jones said. \"I need to keep my truck running.\"The attitude was similar in parts of North Carolina, where drivers were also pumping retail stations dry.Cherie Thomas, a manager at an Exxon Mobil station in Chapel Hill, North Carolina, for example, had a delivery of about 4,000 gallons of gasoline Wednesday morning that she said was running down fast.\"We ran out of fuel yesterday, and this will all be gone in just an hour,\" Thomas said.A line of about 30 cars snaked out of the station and into a parking lot next door as people vied for the next open pump.Asked how motorists are handling the shortage, Thomas said, \"Not very nice.\"Rob Underwood, President of the Energy Marketers of America, which represents fuel distributors and gas stations, pleaded with U.S. drivers to stay calm.\"Retailers right now have sold several days worth of inventory within a few hours,\" he told reporters in a press conference. \"This creates major supply shortages that really don't do anything to help the process out and doesn't benefit anyone in the long run.\""}