{"text": "Paul, Weiss, Rifkind, Wharton & Garrison said Monday that it has hired two new partners in New York, adding Brian Krause in its tax department and David Tarr in its corporate department. Both focus on transactions work, which continues to surge at top firms amid high deal volume.Krause, a rising star who has advised Pfizer Inc and Paul Weiss client Exxon Mobil Corp on deals, joins from Skadden, Arps, Slate, Meagher & Flom. He said in a statement that his move to Paul Weiss is an exciting opportunity to help grow the firms already outstanding transactional practice.Tarr joins from Willkie Farr & Gallagher, where he was co-chair of the finance practice group and represented private equity sponsors such as Insight Partners. He said in a statement he is excited to work at Paul Weiss.Deal volume remains high at large law firms, and the competition to add transactions talent - both partners and associates - is fierce.Paul Weiss, for example, had advised on 54 announced deals worldwide in 2021 as of Friday, according to data provider Refinitiv. The New York firm had advised on just 37 deals this time last year.The largest announced deal it worked on this year by value was AerCaps deal, valued at more than $30 billion, to buy the aircraft leasing business of General Electric. Paul Weiss advised GE.M&A activity surged globally in the first three months of 2021, as companies and investment firms rushed to get ahead of changes in how people work, shop, trade and receive healthcare since the start of the COVID-19 pandemic.While the number of deals was up only 6% from a year ago, the total value of pending and completed deals rose 93% to $1.3 trillion  the second-biggest quarter on record and the biggest-ever first quarter, according to Refinitiv data. That record comes after many law firms struggled with dealmaking in the spring of 2020 as the pandemic put transactions on pause.Paul Weiss, while busy this year, still trails rivals including White & Case and Latham & Watkins in Refinitivs rankings of M&A legal advisers by the total value of announced deals theyve counseled on so far in 2021."}