{"text": "STOCKHOLM Swedish payments firm Trustly said on Monday it intends to list its shares on the Nasdaq Stockholm exchange, the latest in a line of major European tech unicorns seeking a stock market listing.The deal could see the company valued at around 9 billion euros ($10.70 billion), based on the middle of a range of analyst views on the company seen by Reuters and confirming a Reuters report here from earlier this year.That would be around 60 times Trustlys expected core 2022 earnings, a discount to peer Adyen which trades at 72.5 times but a premium to Nuvei, which trades at 30.5 times.We are going to raise 8 billion Swedish crowns primary proceeds that we will use to pay off existing debt facilities, and then we want to have a net cash positive balance sheet, Chief Executive Officer Oscar Berglund told Reuters.The appeal of financial technology companies has increased during the COVID-19 pandemic as more people shop online and make payments digitally to avoid physical contact.Tech and e-commerce companies helped push the European IPO market to its strongest quarter since 2015 in the first three months of this year.Polands InPost and Germanys Auto1 were two highlights, though a debilitating stock market debut for Britains Deliveroo cast doubts on whether the tech rally can last.Trustly is a quality asset with quality sponsors in a very hot space, said a source familiar with the companys IPO.Yes, there has been a rotation from growth to value stocks recently. But I think growth still has a lot of attraction. It should ideally come with profitability as well as cash flow, he added.Other European fintech firms such as Wise and Klarna are also planning for stock market listings.This is sort of a process that we have been working on for a year now to prepare the company and make it ready for the public markets, Trustly Chairman Johan Tjrnberg said.Trustly had also assessed a listing in the United States and might look at a dual listing in the future, he said.Founded in 2008, the company counts PayPal, Wise and Facebook among its customers. Its platform allows users to pay for purchases directly through their bank accounts, bypassing the need for a debit card or a mobile wallet.Carnegie, Goldman Sachs and J.P. Morgan are joint global coordinators.($1 = 0.8413 euros)"}