{"text": "PayPal Holdings Inc said late on Monday it had blocked a Christian crowdfunding site, GiveSendGo, after it helped raise funds for people who attended last weeks event in Washington when supporters of President Donald Trump stormed the Capitol.The digital payments processor also confirmed to Reuters that it closed an account held by Ali Alexander, one of the organizers of the gathering. The news was reported earlier by Bloomberg, which cited an unidentified source.Online platforms and social media companies are distancing themselves from, and taking action against, those that encouraged or engaged in last weeks violence in the U.S. Capitol.Twitter said it had suspended more than 70,000 accounts since Friday that were primarily dedicated to sharing QAnon content after the assault on the Capitol building. QAnon backers push baseless conspiracies on social media.A number of large U.S. companies, including AT&T Inc, American Express and Dow Inc, have said they would cut off campaign contributions to those who voted to challenge President-elect Joe Bidens victory, with Republicans in the U.S. Congress facing growing consternation from corporate America.Supporters of Trump stormed the U.S. Capitol on Wednesday, trying to halt the certification by Congress of Bidens election win.Trump, who has without evidence challenged the validity of Bidens election win, initially praised his supporters but later condemned the violence.Bloomberg reported last week that PayPal had closed an account held by Joy In Liberty, one of the groups that paid for supporters of Trump to travel to Washington.GiveSendGo, which describes itself as A place to fund hope. A place to work together with the body of Christ around the world to make a difference, said it had moved its payment processing away from PayPal and was going to shut its PayPal account anyway.We have created and are using alternative payment solutions for our platform, GiveSendGos co-founder and Chief Financial Officer Jacob Wells said in an email."}