{"text": "WASHINGTON House Speaker Nancy Pelosi accused President Donald Trump of messing with childrens health on Sunday and said federal guidelines on reopening schools amid the coronavirus outbreak should be mandatory.The Democratic House of Representatives leader sharply criticized the Trump administration for advocating a return to school in the fall as coronavirus infections surge across the country, particularly in states that reopened their economies earliest during the pandemic.The federal government can make the Centers for Disease Control guidelines for reopening schools mandatory, like some state governors have done with anti-coronavirus measures, she said. Critics of the Trump administrations pandemic response have long called for a national strategy on mitigation efforts.Going back to school presents the biggest risk for the spread of the coronavirus, Pelosi said on CNNs State of the Union program. If there are CDC guidelines, they should be requirements.They should be mandates.Trump last week attacked the CDC, the federal governments health protection agency, for school reopening guidelines that he said were too tough, expensive and impractical.The president and his administration are messing with the health of our children, Pelosi said. We all want our children to go back to school, parents do and children do. But they must go back safely.On Sunday, the Republican presidents education secretary, Betsy DeVos, repeatedly refused to say if states and school districts should follow the CDC guidelines.In an interview with CNN, DeVos said children get the virus at a far lower rate than adults and downplayed the risk of children bringing the virus home to teachers, parents, grandparents or caregivers.She also failed to put forth any other blueprint for safe school reopenings, saying there was no single solution.We know that schools across the country look very different and that theres not going to be a one-size-fits-all approach to everything, she told Fox News Sunday.Her comments drew an immediate rebuke from Pelosi, who said the Trump administrations approach to school reopenings was dangerous.What we heard from the secretary was malfeasance and dereliction of duty, Pelosi said on CNN.Facing a battered economy as he seeks re-election in November, Trump has pressured states to reopen shuttered businesses and schools.Since many states relaxed coronavirus restrictions, the virus has found a new toehold. So far in July, 24 states have reported record increases in cases of COVID-19, the respiratory illness caused by the novel coronavirus, according to a Reuters tally.CDC recommendations for schools include testing for COVID-19, dividing students into small groups, serving packaged lunches in classrooms instead of cafeterias, and minimizing sharing of school supplies. It has advised that seats be spaced at least six feet apart and that sneeze guards and partitions be put in place when social distancing is not possible.DeVos last week criticized Fairfax County schools for offering virtual learning with an option of two days a week in-person schooling for the fall.Schools superintendent Scott Brabrand said it was impossible for the district to get all 188,000 kids back in the classroom while honoring the six-foot distancing guideline.Were the size of five Pentagons. You would need another five Pentagons of space to be able to safely accommodate all of the students in Fairfax County Public Schools, he told CNN.A number of Republican governors have made clear they will go their own way on coronavirus measures, including whether to reopen schools.We are not going to be rushed into this, Marylands Republican governor, Larry Hogan, said on NBCs Meet the Press."}