{"text": "Peruvian right-wing presidential candidate Keiko Fujimori, who is likely to lose a runoff election against her socialist rival, on Saturday led a protest in Lima\t, calling again for the annulment of votes that did not favor her.\"If the (electoral) jury analyzes this, the election will be flipped, dear friends,\" Fujimori told thousands of supporters, many waving Peru's red-and-white flag. \"I'm the sort of person who never gives up.\"Front-runner Pedro Castillo, a member of the left-wing Free Peru party, is close to being named the Andean country's next president, despite Fujimori's unsubstantiated claims of fraud, as the count from the second round of voting earlier this month nears an end.Castillo, an elementary school teacher who was raised in an impoverished village, was leading the count by 50,000 votes on Saturday evening, with only around 16,000 votes remaining to be counted.But Fujimori this week has increasingly doubled down on allegations of fraud, saying supporters of Castillo stole votes in rural areas where she got no votes. International observers have said there is no evidence of fraud and that the election was clean.\"There's definitely a boycott, people want to flip our votes, disqualifying Keiko (Fujimori's) votes,\" said Ronald Vertis, a protester in Lima, who supports her.Fujimori says she has sought the annulment of 200,000 already-counted ballots, although the majority of those requests were submitted after a critical deadline, meaning they are unlikely to be considered.\"We won, teacher Pedro Castillo (is) President,\" his party wrote on Twitter late on Friday.Fujimori has also blamed the \"international left\" for pushing for a Castillo victory, citing how Argentina and Bolivia, countries led by left-wing leaders, have been quick to recognize the socialist candidate as Peru's president-elect.\"Peru is a country that is strategically, geopolitically speaking, crucial in Latin America, and that is why the international left is trying this,\" Fujimori said in a news conference with foreign media on Saturday morning.Fujimori, the daughter of ex-President Alberto Fujimori who is in prison for human rights abuses and corruption charges, is facing legal woes of her own.Prosecutors this week sought to jail her again on allegations of money laundering, for which they are asking for 30 years in prison. Winning the election would halt the criminal process against Fujimori until the end of her administration.Even if Fujimori were to succeed in annulling some votes, the number of votes still in play make it unlikely she would flip the result.The tense vote count is the culmination of a bitterly divisive election in Peru, where many low-income citizens supported Castillo while mostly wealthier ones voted for Fujimori.On Friday, Peru's electoral jury, which oversees elections in the country, tried to push back a deadline to allow Fujimori to submit requests to disqualify up to 200,000 votes cast in Peru's poorest regions, but said in the afternoon that it had backtracked on that plan, paving the way for a Castillo victory.On Saturday, Fujimori led a protest calling for the challenges to those 200,000 votes to be heard, an effort that Castillo has questioned.\"We call for the (electoral jury) to guarantee and support a clean and just electoral process,\" Castillo tweeted on Friday night. \"The Peruvian people deserve it.\"Fujimori first brought allegations of fraud on Monday, when initial counts from Sunday's runoff vote showed she was likely to lose by a slim margin.A potential Castillo administration has spooked markets, largely because his party describes itself as Marxist-Leninist.He has recently sought out a moderate-left platform, but it remains unclear if his administration will ultimately keep that tone or return to the partys roots as a far-left organization."}