{"text": "JOHANNESBURG Petra Diamonds said it was investigating allegations by a British non-governmental organisation that subsistence miners who trespassed on the firms Williamson mine in Tanzania were detained, beaten and shot at, killing at least seven of them.The RAID report, based on research conducted between September 2019 and November 2020, alleged that security contractors and security employees of Petras subsidiary Williamson Diamonds Limited (WDL) used excessive force.Petra Diamonds told Reuters a specialist external adviser was conducting an investigation and said an external consultancy had been appointed to assess WDLs management of its security.The board of Petra Diamonds finds the allegations of human rights abuses at the Williamson mine in Tanzania to be deeply concerning and is taking the matter extremely seriously, said Petra Diamonds, which owns 75% of WDL. The state owns the rest.It said the investigation would be completed by the end of 2020.Simon Msanjila, a permanent secretary at Tanzanias Ministry of Minerals, told Reuters he had not seen the RAID report and could not comment on it.WDL has suspended the mine chief security officer and the support services manager, an interim measure taken whether or not there is any substance in the allegations, Petra Chief Executive Richard Duffy said in a letter to RAID dated Oct. 13.In its report, RAID said it had found evidence indicating that since Petra Diamonds acquired the Williamson Mine in 2009, there have been at least seven killings and 41 assaults of local residents, many leading to life-changing injuries.Zenith Security Services Ltd, the security contractor named in the report, did not respond to a Reuters request via email for comment.The allegations highlight tensions caused when mining companies co-exist with communities who rely on subsistence mining to supplement their income, as in other parts of Tanzania and across resource-rich countries in Africa.Subsistence or artisanal miners, who typically use rudimentary techniques, number around 40 million worldwide, according to a 2019 estimate by Delve, an artisanal mining database.Britain-based law firm Leigh Day had filed a claim in the High Court of England and Wales in September on behalf of more than 30 Tanzanians who alleged abuse breaches of human rights at the Williamson mine, Petra previously said.The Williamson mine, active since 1940, is in Shinyanga, one of Tanzanias poorest regions. It produced a 54.5-carat pink diamond presented to Queen Elizabeth for her wedding in 1947.The mine has been shut since April, when Petra put it on care and maintenance after the coronavirus pandemic caused rough diamond prices to plunge. Petra also operates mines in South Africa."}