{"text": "MANILA Philippine President Rodrigo Duterte said on Friday the United States must pay if it wants to keep a two-decade-old troop deployment agreement with his country that is central to U.S. strategy in Asia.Duterte, a firebrand nationalist who openly disapproves of the long-standing U.S. military alliance, unilaterally cancelled the Visiting Force Agreement last year in an angry response to an ally being denied a U.S. visa.The withdrawal period has been twice extended, however, to create what Philippine officials say is a window for better terms to be agreed.Speaking to Philippine troops on Friday after inspecting newly acquired air assets, Duterte said: Id like to put on notice if there is an American agent here, from now on, you want the Visiting Forces Agreement done? You have to pay.It is a shared a responsibility, but your share of responsibility does not come free, after all, when the war breaks out we all pay, Duterte said, alluding to Washington and Beijing stepping up military activities in the South China Sea.Duterte did not elaborate, or say how much U.S. should pay.The U.S. embassy in Manila did not immediately respond to a request for comment on his remarks.The Philippines defence apparatus want to keep the VFA as it has been vital in boosting the capabilities of under-resourced Philippine forces through dozens of annual joint training exercises, Dutertes defence minister has said.U.S. and Philippine officials met on Thursday to settle differences over the VFA, the first under U.S. President Joe Bidens administration, which has reaffirmed the alliance in the face of Chinas growing assertiveness in the South China Sea.(The United States) is free to advance their troops in our land...We do not like it because we want to remain neutral, Duterte said. But the exigency of the moment requires their presence here, I am okay with that.Relations between the United States and its former east Asian colony have been complicated by Dutertes rise to power in 2016 and his frequent statements condemning U.S. foreign policy, and his open embrace of China.Duterte reiterated that he wanted to avoid confrontation with China over maritime claims that would lead to something we can hardly afford."}