{"text": "CEDARTOWN, Ga From the pulpit this past Sunday, Pastor Brian Crisp prayed for President Joe Biden and delivered a passionate sermon on loving ones neighbor. But away from church, the Baptist preacher was steeling for battle.This rural stretch of northwest Georgia is Marjorie Taylor Greene country. The freshman congresswoman won this district in a landslide in November. Voters here arent happy that the Democratic-controlled House of Representatives on Feb. 4 stripped Greene of her committee assignments - diluting her influence - for, among other things, advocating violence against Democratic lawmakers on social media before she was elected.Exhibit A for the Democrats was Greenes September Facebook post showing an image of herself brandishing an AR-15 semi-automatic rifle superimposed alongside the faces of three Democratic congresswomen. The post, later removed by Facebook, urged Christians to go on the offense against these socialists. Crisp, the pastor, viewed the post not as a threat by Greene against the officials - all women of color - rather as a defense of his communitys way of life.It promoted a strong stance of who we as Americans are, said Crisp, over lunch in Cedartown, a city of 10,000 people northwest of Atlanta. We are not going to let you come in here and change this nation.An ardent backer of former President Donald Trump, Greene has taken center stage as the Republican Party grapples with a profound identity crisis in the wake of his November election defeat. Her extremist views resonate with many lawmakers and voters who remain loyal to Trump, despite warnings from more mainstream Republicans that she and candidates like her could do long-term damage to the partys electoral fortunes.Reuters this month interviewed three dozen Republican-leaning voters in Georgias 14th district, the primarily rural and blue-collar region that sent Greene to Washington. The majority said they endorse her view that Democrats are taking the country down a dangerous path towards socialism. Like Greene, they believe Trumps false claims that the election was stolen. The former president, they contend, was unfairly impeached for inciting the deadly Jan. 6 insurrection by a pro-Trump mob at the U.S. Capitol, and they are rooting for his acquittal in the Senate.Of those interviewed, just four said they hadnt voted for her in November. Most said they would support her again.COMBAT OVER COMPROMISEMost brushed off outlandish conspiracies Greene has promoted in the past, including a baseless QAnon theory that holds that elite Democrats are part of a cabal of Satan-worshipping pedophiles and cannibals. Instead, they praised her anti-abortion, pro-gun, no-filter approach to politics.She speaks her mind. I like her style, said Michael Pace, a 26-year-old manager at a gift boutique in Dallas, Georgia.Like Trump, Greene understands that her supporters prize combativeness over compromise or policy successes, said David Jolly, a former Republican congressman from Florida who left the party over Trump. Jolly believes Greenes newfound political celebrity - the 46-year-olds national profile has grown dramatically over the last month - could imperil other Republicans running in competitive races in next years midterm elections.Democrats have lost no time in trying to make Greene the face of her party with an eye toward the 2022 elections for the House of Representatives and Senate. An ad campaign already running in competitive districts, including in California and Texas, declares QAnon took over the Republican Party and sent its followers to Congress.A Reuters review of voter data shows that tens of thousands of registered Republicans left the party in the crucial battleground states of Pennsylvania, Florida and North Carolina this year, much higher than the rate of Democratic defections. In addition, prominent Republicans worried about Trumps hold on the party are in talks to form a breakaway center-right party, Reuters reported this week.A representative for Greene did not respond to requests for a comment. At a press conference last week in Washington, she remained defiant, saying Democrats had stripped my district of their voice by expelling her from committees. Greene has used her ouster as an opportunity to raise money from supporters.Michael McAdams, a spokesman for the National Republican Congressional Committee, said Democratic efforts to portray Greene and QAnon as stand-ins for the entire party was a strategic misfire. He blamed Democrats for elevating fringe conspiracy theories by criticizing Greene.We are going to continue hammering House Democrats for their job-killing, socialist agenda, McAdams said.Most House Republicans, meanwhile, have shown little interest in distancing themselves from Greene. Rather than rebuke Greene for her views, on Feb. 3 some House colleagues gave her a standing ovation after she apologized for some of her previous stances, including a past assertion that the U.S. government was behind the 9/11 terrorist attacks.Across the country, Trump loyalists are flexing their muscle. In the last few weeks, they have taken control of state Republican chapters in the battleground states of Arizona and Michigan. And state parties in Louisiana, Nebraska, South Carolina and Wyoming have blasted Republican lawmakers who have shown support for Trumps impeachment for inciting the Jan. 6 Capitol riot.The trend worries Jay Williams, a Republican operative in Georgia. He pointed to two recent U.S. Senate contests - both won by Democrats in surprise upsets over pro-Trump Republicans - as a preview of what lies ahead if the Republican Party continues to repel moderate voters.The Trump wing of the party, he said, has to learn to play with other people or they are going to keep losing.CHURCHES AND GUNSA former businesswoman and fitness instructor in the Atlanta area, Greenes sudden ascension into national politics was made possible by her largely rural district, one of the most conservative in the country.The region is dotted by Protestant churches. Gun ownership is common. Democrats are routinely trounced in local and national elections. Greene won the Republican primary last year after beating a local neurosurgeon, John Cowan, by 14 points in a run-off. She went on to crush her Democratic challenger in the general election by winning nearly 75% of the vote.Her district is overwhelmingly white  about 85%  and has a college graduation rate of just 18%, far below the national average of about 34%. Manufacturing and retail jobs dominate the local economy.The district is thinly populated, with 732,000 people scattered across 12 counties. Yet it ranks third among all Georgia districts in the number of COVID-19 cases: more than 60,000 as of Feb. 10, according to a tracking project at Harvard University.Still, much of downtown Rome, a city of 37,000 in the heart of the district, operates as if the virus is no longer a threat. Maskless patrons walk in and out of stores and bars along Broad Street. Many businesses display signs in their windows objecting to enforcement of a local face-covering ordinance.Even so, not everyone in the district was ready to get on board with Greene, who will have to run for re-election next year.Cowan, the neurosurgeon, said a lot of supporters are pleading with him to run again in 2022. But hes realistic about the allure of Greenes flame-throwing political style.If thats what our district wants, then Ill lose, said Cowan, a mild-mannered former college football player. Im not on a kamikaze mission.In Georgias Dade County, part of Greenes district, Tom Pounds abruptly resigned last week as the countys Republican party chair. Already dismayed by his partys unwavering allegiance to Trump, he said its embrace of Greene pushed him over the edge.I wasnt going to bite my tongue for two more years of her term, he said.SHE IS THERE FOR MEA recent gathering in Cedartown was more representative of the district. Three miles north of Crisps Lime Branch Baptist Church sits a local gas station and convenience store. Every morning before dawn, local men known as the Committee gather over bacon, biscuits and grits to discuss news of the day.Jeff Minge, owner of the store and a regular Committee member, said he likes Greene because she doesnt walk on eggshells when she talks and, like Trump, represents a bulwark against the left.On a recent morning, six men sitting around a plastic table took turns railing against various perceived injustices perpetrated by Democrats. Among their beefs was Democrats condemnation of the Jan. 6 attack on the Capitol by Trump supporters, a rampage that left five dead. Why hadnt Democrats spoken out just as forcefully about violence at Black Lives Matter protests last summer, the Committee wondered.While Greene may have made some regrettable comments, so have the Democrats, the men agreed.She is radical, no doubt, said Mike Lester, a 53-year old automotive repair teacher. But she is there to support me, radical or not."}