{"text": "NEW YORK Bond giant PIMCO expects the U.S. economy to return to pre-pandemic levels later this year but warned of political and economic risks that could derail the recovery, including a sooner-than-expected withdrawal of fiscal stimulus.In its 2021 outlook published Tuesday, the California-based fixed-income investor, which manages over $2 trillion in assets, predicts that U.S. economic activity will hit pre-recession peaks in the second half of the year. Global gross domestic product, PIMCO says, will grow at the fastest rate in a decade, buoyed by the worldwide rollout of COVID-19 vaccines.But a pullback in U.S. fiscal stimulus, Chinese corporate deleveraging and continued caution in U.S. spending, investment and hiring could all disrupt the expected recovery, potentially hurting investors who have already priced in a rebound, PIMCO said in the report.Investors may have become too complacent as reflected by the bullish consensus positioning. As these risk factors underline, we see this as a time for careful portfolio positioning and not for excessive optimism or risk-taking, the report said.PIMCOs comments come amid a broad market rally. The promise of the coronavirus vaccine and hopes the Democratic Congress will ramp up spending have driven U.S. stocks to all-time highs and corporate credit spreads to pre-pandemic levels.The spread between two- and 10-year Treasury yields, the most common measure of the yield curve, rose on Monday to its widest since 2017, indicating expectations of economic growth.But with the Senate divided down the middle, the margin for passing stimulus legislation remains razor-thin. Democrats in more traditionally conservative areas may object to big fiscal spending plans, the report says.The problem may not be confined to the United States, with governments globally at risk of fiscal fatigue.Chinese companies, meanwhile, may look to reduce their debt in 2021, paring back their activity and potentially slowing credit growth and affecting industries heavily dependent on China, PIMCO said, like telecoms, autos and chipmakers.The recovery depends also on the assumption that consumer spending, corporate investment and hiring will boom once the economy emerges from lockdown. A persistence in cautious spending would hamper that, the report said.PIMCO argues that inflation is unlikely to flare up in 2021, despite near-zero interest rates and the expected fiscal stimulus. Bets on rising consumer prices have driven the 10-year TIPS breakeven inflation rate - which reflects forward expectations of inflation - to its highest since 2018.Unemployment is expected to decrease in 2021, although staying above pre-recession levels, keeping prices low, PIMCO said. And low mortgage rates and falling rents will temper costs related to housing - which represent 40% of the consumer price index, a key inflation metric.Still, inflation is likely further out in the future, PIMCO said. The firm sees other areas of opportunity for investment in non-agency Residential Mortgage Backed Securities (RMBS), agency-backed RMBS, other structured products, some credit and some emerging market sovereign debt.(This story corrects penultimate paragraph to say unemployment is expected to decrease though remain above pre-recession levels)"}