{"text": "LESBOS, Greece Angry migrants left homeless by a blaze at Europes largest refugee centre demanded to leave the Greek island of Lesbos on Saturday as authorities opened up new tent shelters and European leaders faced growing calls to take in more of the displaced.More than 12,000 people, most from Africa and Afghanistan, have been sleeping rough since flames swept through the notoriously squalid and overcrowded Moria camp earlier this week. Some residents had COVID-19, raising fears the outbreak could spread.Under a hot sun on Saturday, hundreds of migrants, many chanting Freedom and No Camp, gathered as bulldozers cleared ground in preparation for tents to be put up.Some carried handwritten signs carrying messages including We dont want to go to a hell like Moria again and Can you hear us Mrs Merkel? in an appeal to the German chancellor.The fire made things much more difficult, said Sajida Nazari, a 23-year-old student from Afghanistan who has been on Lesbos for over a year. We dont have food, we dont have water, we dont have freedom.Police briefly fired rounds of teargas when some of the protesters attempted to march down a road leading to the islands main port of Mytilene, which police had blocked while work on the new tent settlement continued nearby.The fire at the camp, which was holding four times the number of people it was supposed to, has returned the spotlight to the migration crisis facing the European Union, which has struggled to find a response that goes beyond temporary fixes.German Vice Chancellor Olaf Scholz called on Europe to accept more refugees but the difficulty of reaching an accord was underlined by Austrian Chancellor Sebastian Kurz, who ruled out taking more in.Greek authorities have refused any mass transfer off the island, located a few miles off the Turkish coast, despite growing hostility from local residents angry after years at the front line of the crisis.But officials said they were determined to provide shelter and proper sanitation and prevent a humanitarian catastrophe.As of today, asylum seekers will start coming into the tents, into safe conditions, Migration Minister Notis Mitarachi told reporters at the site.The need to bring the situation under control has been made more urgent by the fact that authorities have lost track of 35 camp residents who had tested positive for coronavirus.Health authorities have promised to conduct rapid tests at the entrance of the new camp, with a quarantine unit ready for anyone testing positive.Still, the unsanitary conditions being endured by Morias former inhabitants in the fields and streets of Lesbos has caused deep alarm.This is a health bomb. These people havent even had access to water all these days, they cannot even wash their hands, Matina Pagoni, president of Athens and Piraeus hospital doctors union, told Skai television."}