{"text": "WARSAW/GDANSK, Poland Shares in Polish e-commerce group Allegro leapt more than 60% on their debut on Monday, giving the company a market value of almost $19 billion in Europes biggest initial public offering (IPO) so far this year.Founded more than 20 years ago as a home-grown rival to eBay, Allegro is central Europes most recognised e-commerce brand and its website is attracting 20 million visitors a month as consumers go online during the COVID-19 pandemic.Allegros strong start mirrored the performance of some recent IPOs in the United States where shares have shot up as investors showed they were willing to pay for companies with potential for growth.Last month, British e-commerce firm The Hut Group made the biggest debut on the London Stock Exchange in seven years and Allegros successful launch was a further sign the European IPO market is picking up.However, investor appetite seems to be reserved for tech and growth companies - sectors that corporate Europe is light on compared to the United States, where a number of blockbuster tech IPOs have launched this year.The recent pandemic highlighted the value of e-commerce for a consumer, and accelerated e-commerce penetration, said Ivan Kim, an analyst at Xtellus Capital. Allegro is a well-established marketplace ... and is already quite profitable.Shares in Allegro closed the day at 70 zlotys, up 63% from their IPO price of 43 zlotys, which was at the upper end of the guidance range.Allegro immediately became the most valuable company on the Warsaw bourse, which said the company would replace Commerzbanks mBank in its index of the 20 biggest companies WIG20 after the Oct. 14 trading session.WE ALL NEED GOOD NEWSPoland hopes the initial public offering will boost the exchange which has struggled to attract new listings and seen a drop in turnover. Polish mobile games firm Huuuge has announced plans for a stock market listing.In these difficult times when we fight with the pandemic and recession, we all need good news. Allegros debut is good news for all of us, Deputy Prime Minister Jaroslaw Gowin told a news conference.Allegros private equity owners Cinven, Permira and Mid Europa will want to benefit from the IPO momentum with follow-on placements as only about 25% of the company was floated, said Christoph Stanger, co-head of Goldman Sachss European equity capital markets business, which helped organise the listing.When pricing deals like Allegro, it is more important to build momentum than to maximize price on day one, said Stanger.Across Europe, there are numerous IPO deals in the pipeline for the first half of 2021, as the 2020 season is drawing to a close and issuers want to avoid any potential market turmoil in connection with the U.S. presidential elections on Nov. 3, capital markets bankers have said.Allegros IPO comprised more than 23.25 million new shares and 190.29 million existing ones. Previously, the largest company on the Warsaw exchange was video games producer CD Projekt.Goldman Sachs, Morgan Stanley, Barclays, Bank of America, Citigroup, Santander and BM PKO BP organised the Allegro IPO.($1 = 3.7841 zlotys)"}