{"text": "NICOSIA The United States remains deeply concerned about Turkeys actions in the eastern Mediterranean, Secretary of State Mike Pompeo said on Saturday, urging a diplomatic end to a simmering crisis over offshore natural resources.Tensions in the eastern Mediterranean have risen over claims and counter claims pitting Turkey against Greece and Cyprus to maritime areas thought to be rich in natural gas.Countries in the region need to resolve disagreements including on security and energy resource and maritime issues diplomatically and peacefully, Pompeo said in a fleeting trip to Cyprus on Saturday night, where he met with President Nicos Anastasiades.Increased military tensions help no one but adversaries who would like to see division in transatlantic unity, he said.Turkey has sent two survey vessels to separate areas in the region, drawing strong protests from both Cyprus and Greece, which say Ankara is operating on their respective continental shelves.Turkey says it has a legitimate claim over the area. There is no agreement between Greece and Turkey delimiting their continental shelves, while Turkey disputes any claims by Cyprus, with which it has no diplomatic relations.We remain deeply concerned by Turkeys ongoing operations ... the Republic of Cyprus has the right to exploit its natural resources including the right to hydrocarbons found ... in its exclusive economic zone, Pompeo said.The east Mediterranean island was split in a Turkish invasion in 1974 triggered by a brief Greek-inspired coup. Its internationally recognised Greek Cypriot government represents the whole island in the European Union, though its authority is effectively contained to the southern part. North Cyprus is an unrecognised Turkish Cypriot state recognised only by Ankara.Earlier this month the United States said it would lift a 33-year embargo on non lethal defence articles applied on Cyprus in 1987 and deepen its security cooperation with Nicosia, prompting an angry response from Turkey.Pompeo said he also raised with Anastasiades concerns over Russian money laundering -- something Cyprus repeatedly denies -- as well as frequent port calls by the Russian navy to the island.We know that all the Russian military vessels that stop in Cypriot ports are not conducting humanitarian missions in Syria and we ask Cyprus and the president to consider our concerns, Pompeo said."}