{"text": "WASHINGTON U.S. Secretary of State Mike Pompeo said on Tuesday without providing hard evidence that al Qaeda had established a new home base in Iran and that it was time for America and all free nations to crush the Iran-al-Qaeda axis.The comments, rejected by Iran as warmongering lies, in some ways echoed former U.S. President George W. Bushs 2002 description of Iraq, Iran and North Korea as part of an axis of evil -- a comment he made about a year before invading Iraq.With eight days left in President Donald Trumps term, Pompeo said Iran had allowed al Qaeda, the group blamed for the Sept. 11, 2001 attacks on the United States, to establish a new operational headquarters there despite skepticism about the claim within the U.S. intelligence community and among independent analysts.Al-Qaeda has a new home base: it is the Islamic Republic of Iran, Pompeo said, saying that from 2015, Iran had allowed al Qaeda leaders greater freedom of movement inside Iran.Pompeo said he was announcing publicly for the first time that al Qaedas Abu Muhammad al-Masri, accused of helping to mastermind the 1998 bombings of two U.S. embassies in Africa, died on Aug. 7 last year.The New York Times reported that al-Masri was killed by Israeli operatives in Iran. Iran denied the report, saying there were no al Qaeda terrorists on its soil.Pompeo also asserted that the Iranian government had provided safe havens as well as logistical support such as ID cards and passports to enable al Qaeda activity and said the group had centralized its leadership inside Iran.Terrorism experts voiced skepticism about Pompeos claims, saying it long has been known that senior al Qaeda operatives were given refuge in Iran but that Pompeo was exaggerating that the group has made Iran its new home base.A source familiar with U.S. intelligence reporting analysis said the U.S. Congress has been told that there is an al Qaeda presence in Iran which ebbs and flows and arguably is tolerated by elements of the Iranian government.However, this source said that Pompeos rhetoric was over the top and suggested his real objective may be to sabotage U.S. President-elect Joe Bidens expected efforts to restart the 2015 Iran nuclear deal.Iran and al Qaeda are sort of strategic enemies, said analyst Charles Lister of the Middle East Institute think tank. To paint Iran and Al Qaeda as being in a strategic relationship is far more fiction than fact.Shiite Iran and al Qaeda, a Sunni Muslim group, have long been sectarian foes.Pompeo said the United States had imposed sanctions on Iran-based two al Qaeda leaders - Muhammad Abbatay, also known as Abd al-Rahman al Maghrebi, and Sultan Yusuf Hasan - and on three leaders of the al Qaeda Kurdish Battalions, a group operating on the Iran-Iraq border.He said the State Department would offer a reward of up to $7 million for information leading to al Maghrebi.On Twitter, Iranian Foreign Minister Mohammad Javad Zarif dismissed Pompeos accusations as warmongering lies.Alireza Miryousefi, spokesman for Irans mission to the United Nations, described Pompeos comments as preposterous, false accusations.Iran has been a target throughout the Trump administration and Pompeo has sought to further ratchet up pressure on Iran in recent weeks with more sanctions and heated rhetoric.Biden advisers believe the Trump administration is trying to make it harder for him to re-engage with Iran and seek to rejoin the 2015 international deal on restraining Irans nuclear program. U.S.-Iranian relations have deteriorated since 2018 when Trump abandoned that deal, which curbed its nuclear activities in return for the lifting of economic sanctions."}