{"text": "VATICAN CITY Pope Francis met on Monday with Australian Cardinal George Pell, the Vaticans former economy minister who has returned to Rome after the firing of an Italian cardinal whom Pell had accused of obstructing financial reform.Pell was cleared earlier this year of sexual abuse charges in Australia after spending 13 months in prison, and it remains unclear whether he will take up another role in the Vatican.The Vatican announced the meeting between Pell and Pope Francis in a statement on the popes daily private audiences, but gave no details. It went very well, Pell told reporters in front of his residence just outside the Vatican walls.Pell returned to Rome on Sept. 30, just days after the pope fired Pells nemesis, Italian Cardinal Angelo Becciu, who was accused of embezzlement and nepotism. Becciu has denied all wrongdoing.While Becciu was number two in the Vaticans Secretariat of State and Pell was economy minister, the two had a very stormy relationship.Becciu told reporters the day after he was sacked about a meeting between Pell, the pope and Becciu where Pell told Becciu, You are dishonest, and Becciu replied: How dare you!After Becciu was sacked, Pell said: The Holy Father was elected to clean up Vatican finances. He plays a long game and is to be thanked and congratulated on recent developments.Pell said he hoped the cleaning of the stables would continue.Beccius lawyer has denied Italian media reports that his client sent money to Australia to help Pells enemies while he was facing the sexual abuse charges.Through his lawyer, the Australian man who accused Pell of sexually abusing him two decades ago denied Italian reports speculating that he may have been bribed to testify.Pells Australian lawyer, Robert Richter, called for an investigation to track the money trail. He said it should include Italian and Australian investigators.If one is to give any credence to what has been alleged, then it is critical that all proper money-tracing exercises be undertaken, Richter told Reuters."}