{"text": "LONDON The popularity of Prince Harry and his wife Meghan has tumbled in Britain and has never been lower following their explosive interview with U.S. chat show host Oprah Winfrey, according to a poll on Friday.During the interview aired last Sunday, Meghan said her pleas for help while she felt suicidal were ignored and that one unnamed member of the family had asked how dark their son Archies skin might be.Meanwhile, Harry, Queen Elizabeths grandson, also bemoaned his familys reaction of the couples decision to step back from official duties.The tell-all interview has plunged the 1,000-year-old monarchy into its greatest crisis this century, and according to a YouGov poll, the standing of the two royals has also taken a big hit in the aftermath.It found 48% percent of the 1,664 respondents had a negative attitude of Harry compared to 45% with a positive view, the first time his net favourability rating had been negative, and a fall of 15 points from a week earlier.Meanwhile, only three in 10 people had a positive view of Meghan, while 58% had a negative opinion.As with other polls conducted since the interview, there was a divide between generations, with a majority of those aged 18 to 24 liking Harry and Meghan and those over 65 overwhelmingly having negative feelings towards them.The only other member of the family to see their popularity fall was Harrys father, heir-to-the-throne Prince Charles. The survey said 42% now had a negative view of him compared to 49% with a positive opinion.That compared to the 94-year-old queen, who was liked by 80%, and Harrys elder brother and his wife Kate, who were popular with three-quarters of respondents.A separate poll, conducted partly before the interview was broadcast in Britain, found support for the monarchy as a whole was largely unchanged with 63% backing the institution and 25% wanting an elected head of state.But there were some worrying figures for the royal family. Among the youngest age group, support for an elected head of state was higher than that for the monarchy by 42% to 37%, although YouGov said this was within the margin of error."}