{"text": "NEW DELHI Operations at South Korean steelmaker Poscos plant in the Indian state of Maharashtra have been disrupted due to local protests over labour and other issues, police and sources told Reuters, hampering the supply chain for automakers.A local politician leading the protests said they have blocked employees and goods from entering the plant and will continue until Posco heeds to some of their requests which include giving employment preference to local workers, raising the wages of temporary employees and making them permanent.Supply of steel from Poscos Maharashtra plant has been seriously affected and production for carmakers is likely to come to a standstill if the issue is not resolved soon, the countrys top auto industry body said in a March 10 letter addressed to the states chief minister.The blockage is ... causing disruption in the supply chain and is resulting in shortage of critical auto parts and components, the Society of Indian Automobile Manufacturers (SIAM) said in its letter which has been reviewed by Reuters.In view of this, production activity at the facilities of vehicle manufacturers in India, is likely to come to a standstill, SIAM said, adding that Posco is one of the major suppliers of steel to the industry.Reuters could not independently verify the extent of the production disruption at Poscos plant.Posco did not respond immediately respond to a request for comment outside office hours.Automakers including Maruti Suzuki, Indias top carmaker by sales, Hyundai Motor, Kia Motors, Tata Motors and Mahindra & Mahindra source steel from the Posco plant, sources said.These companies, which together account for over 80% of Indias automobile production, did not respond to requests for comment. The Maharashtra chief ministers office also did not respond.SIAM said the disruption comes at a time when companies are still recovering from the impact of COVID-19 and this could be a major setback for the economy.Such incidents would also seriously tarnish the image of India as a preferred destination for investment, SIAM said in its letter, a copy of which has also been sent to the central government seeking urgent intervention.This is the second instance in recent weeks when a global company has faced issues in Maharashtra, Indias top business state. In January, General Motors said Maharashtras move to block the U.S. automaker from shutting its plant and exiting the country defied the states business friendly image and sent a concerning message to future investors.Chandrashekhar Khanvilkar, the local politician leading the Posco protests told Reuters that their other demands include giving preference to local companies for providing transport and canteen services and garden maintenance. They also want steel scrap from the plant to be sold to local companies.We are not allowing transport vehicles and workers to enter the factory. We will continue the agitation peacefully until the company agrees to at least a few of our 18 demands, he said, adding they have been protesting since March 2.Pradeep Deshmukh, a police inspector, told Reuters that 30 police officials have now been stationed outside the plant, up from six to seven initially deployed."}