{"text": "OTTAWA After the COVID-19 pandemic, Canada will need to focus on creating sustainable growth that leaves fewer people behind in order to make higher levels of debt more manageable, a senior Bank of Canada official said on Thursday.The pandemic has lowered the countrys potential growth profile, even as debt has continued to pile up, and both industry and government have roles to play in finding ways to close that gap, Carolyn Wilkins said in her last speech as senior deputy governor of the central bank.We need to set our sights higher to help businesses create good jobs and to make high debt loads more manageable, Wilkins said. We need to recognize that social and economic goals are often self-reinforcing, not conflicting.She added that the pandemic forced Canadians to adapt quickly on many fronts and said that type of innovation could be applied to helping the economy recover from the deep crisis.Lets use that impetus to propel us in a better direction  toward investments that boost sustainable and inclusive growth in the long term, said Wilkins, who will leave the Bank on Dec. 9, ahead of the end of her term.Canada is likely to exit the pandemic with a lower profile for potential output, which will significantly diminish its ability to generate goods, services and incomes on a sustainable basis, Wilkins said.Many of those scars could become permanent without deliberate actions from all of us, she said.She noted that youth, women and recent immigrants are among the hardest hit and most at risk of sustained unemployment amid the pandemic.Canadas Prime Minister Justin Trudeau has promised to create jobs with major green investments, and pledged significant spending on childcare and COVID-19 aid programs. His government is also ramping up immigration.Wilkins noted that immigration has fueled Canadas economic growth in recent years and said higher levels would boost potential growth over time.She later said a global resurgence of COVID-19 infections and more widespread lockdown measures around the world pose risks to the Bank of Canadas recent global growth projections.Its hard not to be worried, thats for sure; theres a lot of downside risks to the global outlook, Wilkins said during an audience question-and-answer period after her speech."}