{"text": "Prince Harry praised Prince Philip on Monday for his devotion to \"granny\" Queen Elizabeth, and described the late duke as a mischievous host who could captivate his guests with unpredictable remarks.Philip, husband of Britain's Queen Elizabeth who had been at her side throughout her 69-year reign, died at Windsor Castle on Friday, aged 99.  read more \"Grandpa, thank you for your service, your dedication to Granny, and for always being yourself,\" Harry, who returned to the United Kingdom from Los Angeles for Philip's Saturday funeral, said in a statement.\"He was authentically himself, with a seriously sharp wit, and could hold the attention of any room due to his charm and also because you never knew what he might say next,\" said Harry.Philip's sense of humour and dedication to his duty earned him widespread popularity in Britain, but he was also criticised for off-the-cuff comments, some of them racist, which shocked princes, priests and presidents.He once asked, within earshot of both Pope Benedict XVI and the queen, if a female Scottish politician was wearing Tartan knickers.Philip also asked President Jomo Kenyatta, at the most solemn moment of the Kenyan independence celebrations in 1963 as the British flag was about to be lowered: \"Are you sure you want to go through with this?\"Other remarks touched on the drinking habits of Scots and the national cuisine of Hungarians.'TRYING TO BREAK THE ICE'In parliament, Prime Minister Boris Johnson referenced some of Philip's more controversial remarks, including those about cannibalism in Papua New Guinea and the murder of half his family by the Russians.\"It is true that he occasionally drove a coach and horses through the finer points of diplomatic protocol, and he coined a new word - dontopedalogy - for the experience of putting your foot in your mouth,\" Johnson said.\"But the world did not hold it against him,\" Johnson added. \"They overwhelmingly understood that he was trying to break the ice, to get things moving, to get people laughing and forget their nerves.\"Harry, sixth in line to the throne, will quarantine in accordance with coronavirus guidelines so that he can attend the ceremonial funeral at Windsor Castle.Harry and his wife Meghan left Britain for a new life in the United States after a public rift with the royal family and a falling-out with the tabloid press.The couple gave an interview to Oprah Winfrey last month in which Meghan said had felt isolated and that an unnamed member of the family had asked how dark their unborn child's skin might be.GET ON WITH THE JOBHarry's tribute to Philip came minutes after his elder brother Prince William, second in line to the British throne, hailed his grandfather for his dutiful service.William, known as the Duke of Cambridge, said Philip was an extraordinary man whose life had been defined by service, but that he would have wanted members of the royal family to get on with their jobs.\"I will miss my Grandpa, but I know he would want us to get on with the job,\" William, 38, said in a statement on Monday. \"My grandfather was an extraordinary man and part of an extraordinary generation.\"\"My grandfather's century of life was defined by service  to his country and Commonwealth, to his wife and Queen, and to our family.\"William said he felt lucky to have had Philip's example to guide him, and praised his grandfather for showing great kindness to his wife, Catherine, Duchess of Cambridge.Philip is lying at rest in the Private Chapel at Windsor Castle. He will be taken to St George's Chapel in a specially modified Land Rover which he helped to design before his death.Johnson said it was a fitting last journey.\"That vehicle's unique and idiosyncratic silhouette reminds the world that he was above all a practical man, who could take something very traditional - whether a machine or indeed a great national institution - and find a way by his own ingenuity to improve it, to adapt it for the 20th or the 21st century.\""}