{"text": "WASHINGTON Conservative groups claiming without evidence that the Nov. 3 election was stolen from President Donald Trump staged protests across the country on Saturday, with one in Washington turning violent at times as police broke up sporadic clashes after dark.Organizers of Stop The Steal, linked to pro-Trump operative Roger Stone, and church groups urged supporters to participate in Jericho Marches and prayer rallies.But groups of pro-Trump Proud Boys protesters and Antifa counterprotesters brawled in downtown Washington on Saturday night. Police moved in quickly to separate them, using pepper spray on members of both sides, Reuters witnesses said.Around 200 members of the Proud Boys, a violent far-right group, had joined the marches earlier on Saturday near the Trump hotel. Many wore combat fatigues, black and yellow shirts and ballistic vests, carried helmets and flashed hand signals used by white nationalists.Earlier, police in riot gear and on bicycles kept the opposing demonstrators apart by blocking streets. After dark fell, the protesters - including members of the aggressive far-left anti-facism movement - splintered into smaller groups to roam the streets in search of their rivals.Protests were also held in other communities around the country, including Atlanta, Georgia, another state where Trumps campaign has sought to overturn Joe Bidens election victory, and Mobile, Alabama, according to local news coverage.Local media in the Washington state capital of Olympia reported here that one person was shot and three arrested after clashes between pro- and anti-Trump protest groups.FLYNN SPEAKSMore than 50 federal and state court rulings have upheld Bidens victory. The U.S. Supreme Court on Friday rejected a long-shot lawsuit filed by Texas and backed by Trump seeking to throw out voting results in four states.Whatever the ruling was yesterday ... everybody take a deep, deep breath, retired Army General Mike Flynn, Trumps former national security adviser, told protesters in front of the Supreme Court, referring to the courts refusal to hear the Texas case.Flynn who twice pleaded guilty to lying to the FBI about contacts with the former Russian ambassador, spoke in his first public address since Trump pardoned him on Nov. 24.My charge to you is to go back to where you are from and make demands, Flynn told the crowd, without being more specific. The U.S. Constitution is not about collective liberty it is about individual liberties, and they designed it that way, he said.Trump, a Republican, has refused to concede defeat, alleging without evidence that he was denied victory by massive fraud. On his way to Andrews Air Force Base and then the Army-Navy football game in New York, Trump made three passes in the Marine One helicopter over the cheering protesters.During his first debate with Biden in September, Trump gave fuel to the Proud Boys movement by telling the group to stand back and stand by. He later said he condemned the group and all white supremacists.MASKLESS PROTESTSTrumps supporters carrying his campaign flags and signs marched between the Supreme Court, the Capitol and downtown Washington, which was closed to traffic by police vehicles and dump trucks.Few of the marchers wore masks, despite soaring COVID-19 deaths and cases, defying a mayoral directive for them to be worn outside. Several thousand people rallied in Washington, fewer than during a similar protest last month.As some in the crowd echoed far right conspiracy theories about the election, a truck-pulled trailer flew Trump 2020 flags and a sign reading Trump Unity while blaring the country song God Bless the U.S.A.Its clear the election has been stolen, said Mark Paul Jones of Delaware Water Gap, Pennsylvania, who sported a tricorner Revolutionary War hat as he walked toward the Supreme Court with his wife.Trump is being railroaded out of office, he said, adding that Biden won with the complicity of the Supreme Court, FBI, Department of Justice and CIA. The Supreme Court didnt even take the time to hear the case, Jones said.Eddy Miller of Philadelphia, who was selling Trump campaign T-shirts, said he was sure there was fraud despite what I see on the news about court rulings striking down fraud allegations.BATTLE OF JERICHOSome protesters referenced the Biblical miracle of the battle of Jericho, in which the walls of the city crumbled after soldiers and priests blowing horns marched around it.In his speech, Flynn told the protesters they were all standing inside Jericho after breaching its walls.Ron Hazard of Morristown, New Jersey, was one of five people who stopped at the Justice Department to blow shofars - a rams horn used in Jewish religious ceremonies - to bring down the spiritual walls of corruption.We believe what is going on in this county is an important thing. Its a balance between biblical values and anti-biblical values, Hazard said.His small group, including one member who wore a Jewish prayer shawl known as a tallit, are Christians who love the Jewish people. We love Israel, he said."}