{"text": "WASHINGTON A group of former Republican officials considering a new center-right political party to counter former President Donald Trumps influence would face steep challenges in shaking up a U.S. political system that has favored two-party rule throughout its history.Reuters exclusively reported on Wednesday that more than 120 Republicans - including former elected officials, along with former administrators under Trump and former presidents Ronald Reagan, George H.W. Bush and George W. Bush - met virtually on Feb. 5 to discuss forming a third party or a new center-right faction.Two of the most prominent anti-Trump Republicans in Congress - Representative Liz Cheney of Wyoming and Representative Adam Kinzinger of Illinois - rejected the idea of a breakaway party in statements to Reuters on Thursday. Other Republican critics of Trump expressed similar skepticism - arguing a third party would accomplish little beyond splitting the votes of conservatives and helping Democrats get elected.The resistance to a third party among some of Trumps toughest Republican critics underscores the extreme difficulty of such a political revolt. Such an effort would require walking away from the Republican Partys massive political infrastructure - staff, money, connections and data on donors and voters - that would take years if not decades to build from scratch.An upstart party would also have little chance of succeeding without a charismatic leader who could capture the loyalties of millions of disaffected voters, said Alex Conant, a Republican strategist who was a senior advisor to the Republican primary campaign of Marco Rubio, a Senator from Florida, in 2016.If somebody was going to start a third party that was going to gain some traction, it would be Trump and not his opponents, said Conant.Kinzinger joined the Feb. 5 video conference of the anti-Trump group and spoke for about five minutes, a spokeswoman told Reuters. But the congressman wants to reform the party from within, she said. He has recently formed a new political action committee to support Republican primary challengers running against pro-Trump House Republicans such as Matt Gaetz, of Florida, and Marjorie Taylor Greene, of Georgia.A spokesman for Cheney told Reuters in a statement that she opposes any effort to split the party, saying it would only make it easier for Democrats to enact policies that conservatives oppose.Both Cheney and Kinzinger were among just 10 House Republicans, a small minority, who voted to impeach Trump on a charge of inciting the Jan. 6 insurrection at the U.S. Capitol.A more likely outcome of an anti-Trump movement would be for centrist Republicans to try to purge Trumpism from within its own ranks, said David Jolly, a former Republican congressman from Florida who recently quit the party in protest of Trump and declared himself an independent.A party of center-right conservatives could never create a broad enough coalition to win national elections, Jolly said. And Trump has effectively undercut his more moderate opponents among Republican voters, he said, by ridiculing them as Never Trumpers and RINOs (Republicans in Name Only).Its just impossible to escape the never Trump label, he said.Others argue it would be much harder to wrest power over the Republican Party from Trump.Lets not kid ourselves; we are not going to change this party, said Jim Glassman, a former undersecretary of state under George W. Bush.Glassman gave a five-minute presentation on the Feb. 5 call advocating for a new party. Any effort to reclaim the party would be a soul-deadening slog, he told participants.He told Reuters on Thursday that he sees the Republican Party as now thoroughly in thrall to Trump - and beyond repair.I thought, if Trump lost by 7 million votes, there may have been a chance to do that, he said in an interview. But events since the election have made clear thats not going to happen.Asked on Wednesday about the discussions for a third party, Jason Miller, a Trump spokesman, said: These losers left the Republican Party when they voted for Joe Biden.SPLIT ON STRATEGYGlassman believes there are enough Republican donors who are disgusted with Trump and willing to finance a new party. He believes a new conservative party could also attract maybe one fifth of Republican voters who disapprove of Trump, along with some independents and Democrats. Further, he said, running third-party candidates in House and Senate races would force the Trumpist candidates to tack to the center in general elections and temper the shrill partisanship of those races.Many people at the Feb. 5 virtual gathering agreed with Glassman. In a poll of participants, about 40% of those in attendance supported creating an entirely new party, according to one source with direct knowledge of the discussions. About 20% favored creating a faction within the party, and an equal number supported creating a faction outside the party, though it remained unclear exactly how such an independent faction would operate.While they disagreed on strategy, participants in the meeting said, attendees united on the need to organize and advocate for a return to principled conservatism that prizes the rule of law and adherence to the Constitution, ideals they believe Trump has violated.Among the group at the Feb. 5 meeting was Elizabeth Neumann, former deputy chief of staff in the Department of Homeland Security under Trump. Shes enraged at Republican lawmakers continued support for Trump in the wake of his stolen-election claims, which she had repeatedly warned - before the Jan. 6 U.S. Capitol riots - could lead to violence. Now she wants to politically target the lawmakers who voted, in the hours after the deadly insurrection, to overturn the presidential election result - and shes open to any strategy that might work.I hear arguments that we should break off and form a new party, or we should stay inside the party. There will come a time when this crystallizes, Neumann told Reuters on Thursday. At the moment, Im more focused on the individual people and holding them accountable.HISTORY OF THIRD-PARTY FAILURESHistorically, third parties have generally failed in U.S. elections, particularly at the presidential level, often serving more as spoilers than true contenders.Theodore Roosevelt, a charismatic war hero, had served two previous terms as president but lost in 1912 when he ran as a Progressive - or Bull Moose - Party candidate, finishing second, with more votes than the Republican candidate, in a three-way race ultimately won by Democrat Woodrow Wilson. That was the last time any third-party candidate won more votes than either of the two major party presidential candidates.More recently, the most successful third-party candidate was Texas billionaire Ross Perot, whose self-financed Reform Party campaign in 1992 earned him 19% of the vote in a race won by Democrat Bill Clinton, who unseated incumbent Republican President George H.W. Bush.In other cases, supporters of losing presidential nominees have blamed third-party candidates for siphoning off voters. In 2016, some backers of Democrat Hillary Clinton were frustrated by Green Party candidate Jill Stein, whose percentage of the vote was greater than Clintons margin of defeat in key states.Republican Senator Rand Paul, asked about the prospects for a new party, told Reuters: Thatd be a good way to allow the Democrats to always win.Texas Republican Senator John Cornyn laughed when asked by Reuters about a possible third party.More power to em, he said.Cornyn, however, predicted shared opposition to President Bidens agenda will hold Republicans together. He said he hopes life in the Republican Party will return to something more normal in Trumps absence.Its made us all a little crazy, Cornyn said."}