{"text": "Governance advisor Pensions & Investment Research Consultants (PIRC) on Wednesday recommended Exxon Mobil Corp (XOM.N) shareholders vote in favor of four hedge fund nominees in a bitter proxy fight seeking to overhaul the oil giant's board.Exxon and activist hedge fund Engine No. 1 are battling over board seats and Exxon's strategy to meet demands for lower-carbon energy. The fund has nominated four board candidates and criticized existing directors for a lack of \"credible plan\" as energy markets shift to cleaner fuels.  read more London-based PIRC is the first of the major proxy advisory firms to comment ahead of the company's May 26 shareholder vote. Its report did not detail the reasons for its director recommendations.It advised Exxon shareholders to vote for activist fund nominees - Gregory Goff, Anders Runevad, Kaisa Hietala and Alexander Karsner - and against five existing Exxon board members including Chief Executive Darren Woods.PIRC also recommended shareholders vote to split the combined CEO-board chairman roles. A separate chair can provide \"independent oversight\" of management, it wrote.Exxon's recent earnings show \"our plans are delivering shareholder value\" and a vote for the hedge fund's nominees \"pose a clear risk to our future and the dividend,\" spokesman Casey Norton said.Engine No.1, which counts three pension funds among backers of its slate, said it was \"pleased\" by the proxy recommendation. It opposes the re-election of Exxon directors' Steven Kandarian, Douglas Oberhelman, Samuel Palmisano, and Wan Zulkiflee.PIRC urged support for shareholder proposals calling for greater disclosures on lobbying, reports on political contributions and how net-zero carbon emissions scenarios would impact the business.Its report said allowing shareholders to vote on the company's climate strategy and goals, would be \"in the long-term interests of shareholders.\"Exxon has rejected the activist slate and has urged no votes on the proposals to split its chairman and CEO roles, and on the climate-related reports."}