{"text": "Post-Brexit Britain has overtaken India to become the fourth most favoured investment destination according to a survey of chief executives of more than 5,000 companies, PricewaterhouseCoopers Chairman Bob Moritz said on Friday.The top three - the United States, China and Germany - were unchanged from the previous year's PwC survey, while Britain and India swapped positions.Britain's attractions have changed as a result of \"becoming a separate country and location\", Moritz told the Reuters Global Markets Forum, noting that U.S. and German companies appeared particularly favourable toward investing in the UK.    Britain formally left the European Union on Jan. 31, 2020, making a tortuous exit after a referendum in 2016 on whether to remain or leave the trading bloc. A new trade deal between Britain and the EU was agreed on Dec. 24.     Moritz said the survey, conducted in January and February,  found optimism among CEOs at record levels as the world begins to come out of the COVID-19 pandemic, with 76% expecting global economic growth to improve in 2021.However, that optimism was fragile, with inflation being seen as a medium-term risk, Moritz said.\"(CEOs) do see some of these risks building up over the next year or two, which causes them to question what they do, how they invest, where they invest, and how much to invest.\"He also noted that China was lagging further behind the United States as a favoured investment destination as companies were worried by the trade war between the two countries as well as market access and unfair practices in China.Moritz said the pandemic had accelerated moves among companies towards sustainability and digitalisation, along with a focus on meeting duty of care to employees for their mental and physical wellbeing.\"The combination of technology and humanity coming together, I think will be something that we see companies try to optimize in terms of the balance over the next few years,\" Moritz said.(This interview was conducted in the Reuters Global Markets Forum, a chat room hosted on the Refinitiv Messenger platform. Sign up here to join GMF: https://refini.tv/33uoFoQ)"}