{"text": "John Quinn has his doubts about whether he will ever do another in-person deposition again.With the ongoing COVID-19 pandemic forcing the legal industry to go remote, litigators like Quinn are conducting depositions virtually.I think weve all learned how to do that and how efficient it is. And I really have some questions in my mind whether in-person depositions are going to come back frankly, said the founder of Quinn Emanuel Urquhart & Sullivan.Thats just one of the changes that could become permanent because of the pandemic, he said.Quinn talked with Reuters about how the pandemic has altered his firms views on office space, as well as whether his firm will follow in the footsteps of Davis Wright Tremaine, which is requiring its employees to get vaccinated before they can return to the office and participate in firm events. (The firm has about two dozen offices in 11 countries.)The conversation below has been edited for clarity and brevity.REUTERS: Is this pandemic causing you to rethink your office space needs?JOHN QUINN: Yeah, I think we have to do that, as leases come up for renewal. Were going to have to think about what really are our space needs. How will this space be utilized? And Im sure the answer to that, in most cases, if not all cases, is going to be we dont need as much space as we had in the past. However, I will say, our London office has really grown and weve just recently taken on some more space in London. So you know, if you continue to grow, youre going to need more space for more lawyers.REUTERS: As a follow up to that, it sounds like that youve thought about it, but have you actually renegotiated any of your office leases yet. Are you planning to downsize your space in any particular market, or have the lease terms not come up yet?JQ: Mostly the lease terms have not come up yet. We were negotiating a renewal of our lease in New York, when the pandemic or shortly before the pandemic started and we ended up signing an interim lease, you know, for some, two, three, four years. But we didnt make a big long-term commitment, fortunately. So obviously, as that space comes up for renewal, were going to be looking hard at how much space we need in New York. New York is our largest office. I know that there are spaces in Northern California that are coming up. And so were looking at what our needs might be.REUTERS: Two weeks ago, Davis Wright Tremaine announced that it would require its employees to get vaccinated before they return to the office or attend firm sponsored events. Whats your take on that?QUINN: Were thinking about that. I know we have a group thats thinking about that and what other policies we need to implement, and whether we need to reconfigure offices and spacing and the like. So thats to be determined, I guess.REUTERS: Would you be able to walk me through some of the pros or cons of such a policy? There are probably factors that weigh in favor of it versus maybe obstacles to requiring vaccinations. Whats the current debate at the office around?QUINN: We have a group of people that are looking at this, and Im actually not a member of that team. Some people, I understand, you read about this, dont want to take vaccines, and Ive got to believe that some of those people work at Quinn Emanuel. So we have to think about that. And there are legal issues, Im sure, as to can am employer actually require that. I havent seen anything definitive on that. So this all remains to be thought through.REUTERS: Has the pandemic changed your firm at all, in terms of what youre focusing on or where you see growth?QUINN: I think the pandemic has accelerated some changes that were probably already in place. One thing is the growth into new markets. Weve opened an office in Austin; weve opened an office in Atlanta. We have some other offices that were working on that I think well have some announcements soon. So its made us sort of focus and realize that we can do that, and its not hard to do that if you find the right people, and thats the big if. And then, you know, the importance of our international platform has been very important during the pandemic. We think its an advantage to us, that we have 24 offices in 11 countries around the world. So were more than ever appreciating that and looking to double-down on that."}