{"text": "India vice-captain Ajinkya Rahane hopes they can level the four-test series against England by flexing their spin muscles in the second match beginning on Saturday on a more spin-friendly track at Chennais MA Chidambaram Stadium.England triumphed by 227 runs at the same venue earlier this week with skipper Joe Root producing a spin masterclass with a double hundred.Root and his team mates employed the sweep shot -- both traditional and reverse -- to negate turn with only off-spinner Ravichandran Ashwin managing to trouble them occasionally.Rahane told reporters on Friday that the new track chosen for the second test looked more to their liking.It looks completely different. Im sure it will turn from day one, but again well have to wait and see how it plays in the first session, he said.We have to forget what happened in the first test and focus on this, and play good cricket.We know these conditions really well. We have to put our best foot forward tomorrow and play as a team.Against an India lineup known for their proficiency with spin, England off-spinner Dom Bess claimed 4-76 in the first innings while left-arm spinner Jack Leach returned the same figures in the second.Rahane said they cannot not just blindly copy Englands template to try to dominate the spinners in the second match.England came up with some plans playing sweep and reverse sweep, but its not necessary that we are going to play similar shots, the middle-order batsman explained.Its all about what they bowl and how we attack their line and length and play our game.Fit-again spinner Axar Patel is likely to make his test debut on Saturday, while India could also be tempted to play left-arm spinner Kuldeep Yadav, ahead of all-rounder Washington Sundar.Rahane said they had faith in their spin attack, led by veteran Ashwin.If you see their second innings, all our spinners, especially Ashwin, bowled really well, Rahane said of the opening test.In India, if the ball is turning, oppositions are under pressure. We are not too concerned how our spinners are bowling.Im sure theyll come up with a plan tomorrow and bowl really well."}