{"text": "Tokyo 2020 Olympics chief Yoshiro Mori resigned on Friday after his apology for sexist remarks failed to quell domestic and overseas outrage.Following are some of the reactions from Japan and the world of sports.THOMAS BACH, PRESIDENT OF THE INTERNATIONAL OLYMPIC COMMITTEEThe IOC fully respects President Moris decision to step down and understands his reasons for doing so. The IOC will continue working hand-in-hand with his successor to deliver safe and secure Olympic Games Tokyo 2020 in 2021.TOSHIRO MUTO, TOKYO 2020 CHIEF EXECUTIVEWe need to pick the next president urgently. As board members have suggested we have transparent process, we will set up a candidate review committee.ANDREW PARSONS, PRESIDENT OF THE INTERNATIONAL PARALYMPIC COMMITTEEI sincerely hope that the domestic and international reaction over the last seven days can be harnessed so that society places greater emphasis on diversity and inclusion, not just in terms of gender representation, but race, sexuality, and persons with disabilities.MIZUHO FUKUSHIMA, HEAD OF OPPOSITION SOCIAL DEMOCRATIC PARTY (Twitter)This is the result of many, many women raising their voices. Of course this doesnt resolve the problem. We need to create a society of gender equality in all places. Lets get to work!KAZUO SHII, HEAD OF THE JAPAN COMMUNIST PARTY (Twitter)The organising committee, the JOC, and the government need to reflect deeply on their response up to this point. Its necessary to use this as a chance to address the distortions in Japan, which as a society is behind in gender equality.TAMMY PARLOUR, CHIEF EXECUTIVE OF WOMENS SPORT TRUST UK (to Reuters)The wider issue is not what one man says though, but how the Olympic movement can capitalise on its visibility to promote brilliant women across all sports and create greater diversity behind the scenes in leadership positions.ATSUSHI KATSUKI, INCOMING CEO OF BEERMAKER ASAHI GROUP HOLDINGS, A DOMESTIC OLYMPIC SPONSORAs a sponsor it is our position to spare no support to make the Games exciting and successful. Our mission is to make the Games so successful that Mr Moris disturbance can be forgotten.HAYLEY WICKENHEISER, IOC MEMBER AND SIX-TIME OLYMPIAN (Twitter)Progress.KENJI KIMIHARA, MARATHON SILVER MEDALLIST AT 1968 OLYMPICS (to Reuters)That was a problematic comment of very grave nature. I think resignation would set things straight and help realise the Tokyo Games.CROATIAN OLYMPIC COMMITTEE (to Reuters by email)The Croatian Olympic Committee (HOO) fully supports the IOC position on Mr Moris resignation. We are confident that his resignation will not hamper the efforts being made to ensure the Games go ahead and that his successor will carry on seamlessly.The HOO stands firm and decisive in championing gender equality in sports and, that said, we wish to point out that we have concrete activity in place regarding the matter."}