{"text": "WASHINGTON Following are reactions to the death of American casino mogul Sheldon Adelson:U.S. PRESIDENT DONALD TRUMPSheldon lived the true American dream. His ingenuity, genius, and creativity earned him immense wealth, but his character and philanthropic generosity his great name. ... Sheldon was true to his family, his country, and all those that knew him. The world has lost a great man. He will be missed.ISRAEL PRIME MINISTER BENJAMIN NETANYAHUSheldons tremendous actions to strengthen Israels standing in the United States and the connection between Israel and the (Jewish) Diaspora will be remembered for generations. ... Together with his wife, Miriam, Sheldon was one of the greatest donors in history to the Jewish people, Zionism, settlement and the State of Israel.U.S. VICE PRESIDENT MIKE PENCEWhen Abner fell, King David said, Do you not know that a leader and a great man has fallen in Israel this day? Sheldon Adelson was a leader and a great man, whose legacy will inspire generations for years to come.FORMER U.S. PRESIDENT GEORGE W. BUSHHe was an American patriot, a generous benefactor of charitable causes, and a strong supporter of Israel.CHARLES NORTON, PORTFOLIO MANAGER AT PENN DAVIS MCFARLANDWhile its sad to see his passing the company is in good hands with (President and Chief Operating Officer) Rob Goldstein. ... It should be seamless from the companys perspective.U.S. HOUSE OF REPRESENTATIVES REPUBLICAN LEADER KEVIN MCCARTHYHis life made him a fearless advocate for freedom and entrepreneurship and a source of counsel and support to a generation of conservatives, including me. ... He was freedoms greatest friend.U.S. SENATE REPUBLICAN LEADER MITCH MCCONNELLHe climbed from sleeping on tenement floors during the Great Depression as a young boy to literally towering over Las Vegas and beyond. He created countless jobs in the process. And he poured his success into philanthropy  from drug abuse treatment to research into cancer and other diseases to the countless Jewish causes around the world that were especially close to his heart.MACQUARIE RESEARCH ANALYST CHAD BEYNONAdelson built a strong and loyal culture with the appointment and ascension of Rob Goldstein, Wilfred Wong, Patrick Dumont amongst others. We believe the executive structure has long been in place and is well positioned for transition. ... The new leadership of the company could open the door for future M&A given Adelsons preference of developing assets, not acquiring."}