{"text": "(Refiling to make clear in headline and first paragraph that the visit has been completed)PARIS, Feb 12 French Health Minister Olivier Veran went to the eastern area of Moselle on Friday to try to contain highly contagious COVID-19 variants as regional authorities called for a local lockdown.Authorities have so far not ordered a local lockdown but Veran said testing and vaccination campaigns would be intensified in the region.Our (health) system is not overwhelmed, the minister told reporters, adding he will keep working with local authorities.His trip came a day after he said that variants first detected in Brazil and South Africa now accounted for 4% to 5% of all new cases registered in France and there was still time to prevent them spreading.He said the situation was worrying in Moselle, one of the hotbeds of the first wave of infections almost a year ago on the border with Luxembourg and Germany. Veran is due to meet local authorities later in day to discuss a plan of action.Nothing is excluded (in Moselle), government spokesman Gabriel Attal told Europe 1 radio.Franois Grosdidier, mayor of Metz, the areas largest city, called for a real lockdown and a closure of schools.In contrast with some of its neighbours which are struggling to control the more contagious variants, France has resisted resorting to a new lockdown, hoping a national curfew in place since Dec. 15, first starting at 8 p.m. and then at 6 p.m., will be enough to rein in the pandemic.Veran, who noted the variant first detected in Britain now accounted for 25% of confirmed new infections in France, also said the government would decide in coming weeks whether more restrictive measures were necessary at a national level.Some scientists believe President Emmanuel Macron took a gamble by deciding against a new lockdown, with a real chance of a surge in cases ahead.Frances average count of new infections continued to fall on Thursday and the number of people hospitalised with the disease decreased for a third day running.But the total number of patients in intensive care, another measure of the pandemic closely watched by the government, was up by 18 at 3,337.With 3.41 million cases, France is the sixth-most infected country in the world. Its death toll of almost 81,000 is the seventh highest globally. (Reporting by Benoit Van Overstraeten, Geert De Clercq and Matthieu Protard; Editing by Sudip Kar-Gupta, Nick Macfie and Jonathan Oatis)"}