{"text": "(Restores missing material in seventh paragraph.)BUCHAREST, Nov 12 Romanias central bank kept its benchmark interest rate unchanged at 1.50% on Thursday, as expected, warning of extremely elevated uncertainty, and cut the minimum reserve requirement on commercial banks hard-currency liabilitiesPolicymakers said maintaining confidence in the leu, Romanias currency, underpinned monetary policy this year, given the widening budget and current account deficits before a Dec. 6 parliamentary election.Even before the pandemic, Romania was struggling with a widening budget shortfall, eroded by years of political instability and fiscal largesse. Ratings agencies have Romania on their lowest investment grade, with negative outlooks.The bank has delivered three rate cuts worth 1 percentage point overall since March and pledged to inject liquidity in the market to curb the economic fallout brought by restrictions to contain the new coronavirus pandemic.Romania has reported 334,236 coronavirus infections and 8,510 deaths since late February.Preserving confidence in the domestic currency, in the context of widening twin deficits, is a key element of monetary policy conduct this year, implying a gradual and sustainable reduction in interest rates on the money market and on leu-denominated loans, the bank said in a statement.The cut in minimum reserve requirements for the banks hard- currency liabilities to 5% from 6% as of Nov. 24 will release roughly 350 million euros into the market, ING Bank Romania estimated in a research note.We consider the current monetary stance to be well-positioned in the face of multiple factors, the note said.Policymakers said the latest data pointed to a more sizable rebound of economic activity in the third quarter than previously expected, although new restrictions imposed earlier in November were likely to halt it.They also said they expected inflation to fall markedly lower than initially estimated in the short term, before recovering to around the mid-point of its 1.5-3.5% target range.Inflation fell to 2.2% in October. The bank, which will release new inflation forecasts at 1000 GMT on Friday, currently expects annual price growth of 2.7% and 2.5% this year and next, respectively.The Romanian leu was flat against the euro. (Reporting by Luiza Ilie; editing by Larry King)"}