{"text": "(Clarifies museum name, paragraph 11)SEOUL, March 12 A South Korean art critic was astounded when he saw the private art collection of the late Samsung Electronics chairman, after being asked to value it this year.The reason many go to the Louvre is to see the Mona Lisa, and the Sistine Chapel, the Creation of Adam. There are valuable masterpieces that can compare to that in the Lee collection, said the critic, who declined to be identified.The head of the Samsung conglomerate, Lee Kun-hee, died in October leaving an art collection estimated to be worth more than 2 trillion won ($1.76 billion), including masterpieces by Picasso, Monet and Warhol, the critic and another person directly involved in the appraisal told Reuters.Former culture ministers and art groups have called for a new law that would allow the family to donate the art in lieu of at least part of the 11 trillion won ($9.72 billion) bill for inheritance tax for listed stockholdings alone they are expected to be landed with.The aim is to keep the collection in South Korea for exhibition. Putting it up for auction would inevitably mean much going overseas, they said.If we dont have a system in place allowing tax payment by artwork, well lose the collection, said Lee Kwang-soo, president of the Korean Fine Arts Association.The familys law firm, Kim & Chang, has engaged three art groups to appraise the collection, which includes Korean treasures.According to the two people involved in the appraisal, the collection of about 12,000 items includes works covering the flow of Western art history by Renoir, Chagall, Alberto Giacometti, Rothko, Gerhard Richter and Damien Hirst, with some pieces valued at more than 100 billion won ($88 million).The collections total price tag of an estimated 2 trillion won ($1.76 billion) or more far exceeds the $835.1 million that the Rockefeller collection sold for at Christies in 2018.The two people involved in the appraisal declined to be identified as the proceedings were private. Kim & Chang declined to comment.AIMING FOR MASTERPIECESLee had a particular collection philosophy as he accumulated over about 40 years, wrote Lee Jong-seon, a former deputy director of the Samsung Groups museum of art, Leeum, who helped Lee build his collection, in his book Lee Collection.His father, Samsung founder Lee Byung-chul, preferred ancient Korean art and did not buy items he deemed too expensive. But Lee Kun-hee did not weigh the price, rather thinking: If there are masterpieces, the status of the entire collection will rise.Lee Kun-hees philosophy was to aim for masterpieces ... I think his collection philosophy also translated into Samsungs management ideology of being No. 1, Lee wrote.The Lee family is expected to report on the inheritance tax bill by April.The family is expected to try to pay the bill in instalments over five years in an effort to retain his shareholdings in Samsung affiliates to maintain control of the conglomerate, in particular global tech giant Samsung Electronics.Some countries allow taxes to be paid with artwork and offer tax breaks for art donations but not South Korea, said lawyer Park Joo-hee, who specialises in the arts.Art experts blame the lack of such tax rules for leaving South Koreas National Museum of Modern and Contemporary Art without even a single Picasso engraving.The president of Art Market Research Institute, So Jin-su, said that based on the budget for artwork bought by South Korean museums in 2019, it would take the entire museum network up to 132 years to buy the Lee collection.Draft legislation was introduced after Lees death but there has been little progress on it. Even if passed, it is not clear if the family would want to donate the collection in return for tax breaks, given the sums it might fetch, experts say.Choe Byong-suh, visiting professor at Sungkyunkwan University, said he hoped some arrangement could be worked out to keep the collection in South Korea.This is a rare chance to establish a landmark museum, he said. ($1 = 1,132.1500 won) (Reporting by Joyce Lee Editing by Robert Birsel)"}