{"text": "(Corrects to House in third bullet, drops extraneous word set in headline)* Apple jumps ahead of special event on Tuesday* Twitter rises after DB upgrades to buy* White House calls for limited COVID-19 relief bill* Indexes up: Dow 0.43%, S&P 0.79%, Nasdaq 1.40%Oct 12 The tech-heavy Nasdaq led Wall Streets main indexes higher on Monday as optimism about an agreement in Washington over more fiscal support lifted sentiment ahead of the start of quarterly corporate earnings.Apple Inc provided the biggest boost to the three main stock indexes with a 3.7% gain ahead of a special event on Tuesday, which most analysts believe will be used to unveil the new iPhone with 5G capabilities.The Trump administration on Sunday called on Congress to pass a stripped-down coronavirus relief bill as negotiations on a broader package ran into resistance.(President Donald) Trump is falling behind in opinion polls and seems desperate for a deal, so either some agreement will be hammered out soon or the Democrats could win a decisive victory at the ballot box and ultimately deliver an even greater stimulus package, said Marios Hadjikyriacos, investment analyst at online broker XM in Cyprus.A recent Reuters/Ipsos poll showed Americans were steadily losing confidence in Trumps handling of the COVID-19 pandemic, with his net approval on the issue hitting a record low.Growing expectations of a Democratic victory in next months presidential election as well as bets of fresh federal aid have sent Wall Streets main indexes to one-month highs.With the Oct. 15 presidential debate officially canceled, Trump plans to travel to key battleground states this week as his doctor declared he was no longer a transmission risk for the novel coronavirus.Results from big U.S. banks will be in focus this week, with JPMorgan & Co and Citigroup set to report on Tuesday. Bank shares were flat to slightly higher in premarket trading.Goldman Sachs Group Inc, which reports on Wednesday, is considering whether to scale back financial targets set earlier this year due the coronavirus pandemics impact, analysts and sources inside the bank said.The banks management is not expected to move the goalposts on Wednesday, but may change targets in January, a year after they were set, sources said.Overall, analysts expect third-quarter earnings for S&P 500 companies to have fallen 21% from a year earlier, smaller than a 30.6% slump in the second quarter.At 9:42 a.m. ET, the Dow Jones Industrial Average was up 122.21 points, or 0.43%, at 28,709.11, the S&P 500 was up 27.39 points, or 0.79%, at 3,504.52, and the Nasdaq Composite was up 161.88 points, or 1.40%, at 11,741.82.The S&P technology sector climbed 1.5% to lead the gainers. The energy index was the weak spot, as oil prices dropped on easing supply worries.Twitter Inc gained 5.3% after Deutsche Bank upgraded the social media firms shares to buy on expectations of continued growth in 2021.Other tech companies such as Netflix Inc, Amazon.com Inc and Microsoft Corp rose between 1.7% and 2%.Advancing issues outnumbered decliners by a 1.13-to-1 ratio on the NYSE and by a 1.29-to-1 ratio on the Nasdaq.The S&P index recorded 50 new 52-week highs and no new low, while the Nasdaq recorded 112 new highs and three new lows. (Reporting by Medha Singh and Shivani Kumaresan in Bengaluru; Editing by Shounak Dasgupta and Saumyadeb Chakrabarty)"}