{"text": "Regeneron (REGN.O)is pursuing U.S. approval for its COVID-19 monoclonal antibody cocktail as a preventative treatment after it helped cut the risk of symptomatic infections in households where someone else is ill, the U.S. drugmaker said on Monday.REGEN-COV, a combination of casirivimab and imdevimab, protected household contacts from exposure to SARS-CoV-2, with 72% protection against symptomatic infections in the first week, and 93% after that, according to trial data released by the company.In a separate trial, Regeneron also said the treatment reduced overall risk of progressing to symptomatic COVID-19 by 31%, and by 76% after the third day.Regeneron has enlisted Switzerland's Roche (ROG.S) and its massive biotech facility in South San Francisco to make around 2 million doses annually. The cocktailalready has emergency U.S. approval for mild to moderate COVID-19 patients, and the companies are hoping the latest trials convince regulators to expand deployment.\"These data suggest that REGEN-COV can complement widespread vaccination strategies, particularly for those at high risk of infection,\" said Myron Cohen, who leads monoclonal antibody efforts for the U.S. National Institutes of Health-sponsored COVID Prevention Network.A challenge in breaking infection chains, he said, is that some 10% of unvaccinated people in the study who didn't get the Roche-Regeneron drug while living in a household with an infected individual developed symptomatic infection even with efforts to reduce transmission.'HIGH-RISK SETTINGS'\"REGEN-COV could help control outbreaks in high-risk settings\" where people haven't been vaccinated, Cohen said.In the separate trial, Regeneron said the cocktail also cut symptomatic infection risk and helped nearly halve the total weeks that patients experienced symptoms, with the viral burden -- the amount of virus present -- cut by more than 90%.\"These data pave the way for REGEN-COV to be used before patients become symptomatic,\" Katharine Bar, co-principal investigator and a professor at the University of Pennsylvania hospital, said."}