{"text": "Europe's biggest wind power group Iberdrola (IBE.MC) reaffirmed its 2021 growth outlook on Wednesday after reporting rising quarterly earnings supported by rapid building of renewable energy plants and investments in networks.Buoyed by a global shift towards the low-carbon energy sources it has been investing in for two decades, northern Spain-based Iberdrola plans to almost triple its renewable generation capacity to 95 gigawatts (GW) by 2030.Core earnings before interest, tax, depreciation and amortisation rose 1.5% to 2.8 billion euros ($3.4 billion), broadly meeting the average forecast from eight analysts polled by the company.Reiterating guidance for net profit of 3.7 billion to 3.8 billion euros for the full year, Iberdrola also proposed a complementary dividend of 0.252 euros per share, bringing the 2020 shareholder payout to 0.42 euros per share.Wind farms and solar plants sprung up globally at their fastest pace in two decades last year despite disruptions from COVID-19 and are set to continue apace, the International Energy Agency said on Tuesday.  read more Iberdrola added 2.75 GW to its renewable fleet in the first three months of the year and is building a further 8.7 GW. It dedicated half the 2.5 billion euros invested in the period to networks.Power output varies depending on which source is used, but Iberdrola says the 800 megawatt Vineyard Wind project being developed by its U.S. unit Avangrid (AGR.N) will supply more than 400,000 homes.President Joe Biden's administration this week gave long-awaited approval to the project, which will be the first major offshore wind farm in the United States.  read more Chief Executive Ignacio Galan said Biden's climate plans and tax incentives for renewable energy were very positive for Iberdrola.The new U.S. approach is \"absolutely in line with what we have been dreaming for years\", Galan said on a conference call.\"I am sure it is going to provide to our subsidiary Avangrid huge opportunities of growth in renewables ... especially offshore (wind) and in terms of networks and transmission,\" he added.Iberdrola's market value has more than doubled over the past five years, mirroring similar gains by U.S. rival NextEra Energy (NEE.N) and Denmark's Orsted (ORSTED.CO). The Spanish company's shares are now trading back near their levels before the COVID-19 pandemic devastated global markets.($1 = 0.8250 euros)"}