{"text": "WASHINGTON Senate Republicans, while likely to acquit former President Donald Trump at his impeachment trial, showed little enthusiasm this week for a possible second White House bid in 2024 after reliving his supporters deadly storming of the U.S. Capitol.Following days of graphic videos of the melee presented by House managers, Republicans expressed concern about his post-election behavior, including his repeated false claim that the 2020 presidential election was stolen from him - even as they insisted that his trial on a charge of inciting insurrection is unconstitutional.Trump, the first president in U.S. history to be impeached twice, could run for another term in 2024 unless the Senate votes to bar him from future office, an unlikely feat.But the prosecution case by nine Democrats from the House of Representatives stirred painful memories of Jan. 6, when violent Trump supporters stormed the Capitol, interrupting Congress as it worked to certify President Joe Bidens victory and forcing lawmakers to flee. Five people died.A Senate Republican aide on Friday said as many as 10 out of 50 Republicans could vote to convict the former president, more than the six who voted that the trial was constitutional, but still short of the 17 Republicans who would need to join Democrats for a conviction to stick in the 100-seat chamber.Republican Lisa Murkowski told reporters earlier in the week that the evidence against Trump was pretty damning, while she also pledged to listen to the former presidents defense.But displeasure at Trumps post-election performance was palpable even among Republicans who asserted the impeachment trial of a former president was unconstitutional.The presidents actions since the election have been extremely disappointing and not something that I have agreed with, and not something that I ever want to see again, Senator Mike Rounds of South Dakota told reporters.Senator Bill Cassidy, one of the six Republicans who voted that the proceeding was constitutional, cited House manager concerns that a 2024 Trump campaign could lead to renewed violence if he lost.Let me decide if hes guilty or not, Cassidy told reporters when asked if he could vote for Trump again.With Trump out of office, Republicans also predicted that other effective party leaders and White House candidates would emerge from Republican ranks in the coming years.I think there are going to be some very qualified candidates that are going to look at 2024, Rounds said.Republican Senator Ron Johnson, a prominent Trump ally, also said he expected fresh party leaders to show themselves.Whether he (Trump) runs, thats his decision. Whether he can get re-elected, thatll be the decision of the voters, Johnson said."}