{"text": "U.S. President Donald Trump should leave office before Inauguration Day after the Capitol Hill riots, German Finance Minister Olaf Scholz said, adding that Berlin was confident of a good start to relations with his successor Joe Biden.Democrats in the U.S. House of Representatives plan to impeach Trump on Wednesday unless he steps down or is removed before then. They have drawn up charges accusing him of inciting insurrection ahead of last week's siege.  read more Speaking at the Reuters Next virtual forum, Scholz said on Tuesday that his biggest policy goal with the administration of President-elect Biden was to reach a deal by the summer on an OECD blueprint to introduce global rules on corporate taxation.\"Joe Biden is the right man for the next presidency,\" Scholz said during the interview.Biden was well-placed to narrow social divisions in the world's biggest economy and to heal the country following Trump's four years in the White House, he added.Asked if Trump should leave office before Inauguration Day, Scholz said: \"He should. He is responsible for what happened at Capitol Hill, there is no doubt about it. And he should take the responsibility and this is why I think he should leave.\"Transatlantic relations have cooled sharply under Trump, who attacked Germany repeatedly for its export strength and its  relatively low defence spending within the NATO alliance.After bruising meetings of the G7 wealthy nations and NATO with Trump in 2017, Chancellor Angela Merkel said that Europe could no longer completely rely on its allies and that the continent must become more sovereign and independent.\"In the case for transatlantic partnership, there is a good chance for a new chapter,\" Scholz said.Scholz said his biggest goal as finance minister, once Biden takes over, was to conclude talks within the next six months on the OECD level for a global minimum corporate tax rate and rules on how to tax big digital companies internationally.\"We need an agreement in both fields and I want to get it up to summer and to avoid a conflict on this question coming up newly,\" Scholz said.Asked if Berlin had received any positive signals from the incoming administration, Scholz said there was legislation in the U.S. limiting contacts with foreign officials.\"But we know the people. And so we're quite confident that there will be a good start after the 20th of this month.\"For more coverage from the Reuters Next conference please click here  or www.reuters.com/business/reuters-nextTo watch Reuters Next live, visit https://www.reutersevents.com/events/next/register.php"}