{"text": "The upheaval in global labour markets triggered by the coronavirus pandemic will transform the working lives of millions of employees for good, policymakers and business leaders told a Reuters virtual forum on Tuesday.Nearly a year after governments first imposed lockdowns to contain the virus, there is a growing consensus that more staff will in future be hired remotely, work from home and have an entirely different set of expectations of their managers.Yet such changes are also likely to be the preserve of white-collar workers, with new labour market entrants and the less well-educated set to face post-COVID-19 economies where most jobs growth is in low-wage sectors.\"I think it would be a fallacy to think we will go back to where we were before,\" Philippines central bank Governor Benjamin Diokno told the Reuters Next forum.\"We were already geared towards the digital, contactless, industries ... That will define the new normal.\"The pandemic, which according to a Reuters tally has so far infected at least 90.5 million people and killed around 1.9 million worldwide, has up-ended industries and workers across the globe.Hospitality and tourism are among those sectors worst-hit by stringent social-distancing rules and travel bans, while sectors that support the work-from-home economy are adding jobs, albeit often in low-wage roles. \"Driving, warehouse, construction - they're actually ahead of where they were last year,\" Chris Hyams, CEO of the global jobs listings website Indeed, said in an interview to be aired at the forum later on Tuesday.Hyams said job searches on Indeed last year showed that office workers - who before the pandemic would typically flood the website on Monday mornings looking for a change in job - were now more interested in stability in their working life.\"What we saw for the first six months of pandemic was that employees were much less likely to be looking for something new,\" he said, adding those workers had now got used to home-working and were above all keen on retaining such flexibility.But while he said there were already signs that some sectors were now ready to allow up to 70% of their workforces to operate remotely all the time, such benefits would often be reserved for better-educated white-collar workers.  \"We believe equity and inclusion will be the next frontier,\" he warned. \"Disparities that already exist in society are going to be heightened and exposed.\"THE NEW-LOOK MANAGERSome of those sectors most badly hit by the pandemic now face a long haul back to anything like their former health.Australian Competition and Consumer Commission Chairman (ACCC) Rod Sims was pessimistic about the outlook for the aviation industry, seeing no return to normal international travel to and from Australia throughout 2021.\"I think free international travel between Australia and overseas will be a long time away, unfortunately,\" Sims told Reuters Next, noting how the virus has made a resurgence in Australia after being virtually stamped out late last year.Other changes are more subtle, but will start to transform the way workers are hired and managed.Indeed's Hyams said job interviews over video had proven their worth and predicted a \"secular shift\" towards such practices.\"Employers and job-seekers found it safe, more convenient and much faster ... The future of hiring is going to very much start with remote and video interviewing,\" he said.Observers of the workplace also expect the pandemic to fundamentally alter the way managers operate - not least because the current uncertainties mean they must remain open to change.\"It's no longer the role of the CEO to have all the answers,\" said Laura Storm, founder of Regenerators, a collective formed to spur new thinking about products, services and organizations. \"The role of the CEO is to be a chief ecosystem officer or a facilitator.\"Hephzi Pemberton, CEO of Equality Group, a consultancy and executive search firm, agreed.\"My hope is that our leadership will look and feel very different,\" she said, calling for companies to use the moment to fund genuinely long-term diversity and inclusion plans.  For more coverage from the Reuters Next conference, please see .To watch Reuters Next live, visit https://www.reutersevents.com/events/next/register.php"}