{"text": "Here are the top stories and upcoming coverage plans for Reuters text service as of 10:00 p.m. GMT/06:00 a.m. SGT. For a full schedule of news and events, go to our editorial calendar on Reuters Connect here.TOP STORIESGLOBALSOUTHCHINASEA-CHINA/USAChina says it drove away U.S. warship on anniversary of tribunal rulingChinas military said it drove away a U.S. warship that illegally entered Chinese waters near the Paracel Islands on Monday, the anniversary of an international court ruling that held Beijing had no claim over the South China Sea.HEALTH-CORONAVIRUS/BRITAINBe cautious: Johnson goes ahead with lifting Englands COVID curbsBritish Prime Minister Boris Johnson urged people on Monday to show caution when nearly all remaining COVID-19 restrictions are lifted in England next week, saying an increase in cases underlined that the pandemic was by no means over.U.S.USA-BIDEN/INFRASTRUCTURE-CONGRESSU.S. Senate returns for hell of a fight over Biden infrastructure planThe U.S. Senate returned on Monday to one of its most ambitious agendas in years as Democratic President Joe Biden seeks trillions of dollars in infrastructure spending and Republicans promise a hell of a fight against raising taxes to pay for it.USA-ECONOMY/RAIMONDOAging population to hit U.S. economy like a ton of bricks -U.S. commerce secretaryPresident Joe Biden does not yet have enough support from fellow Democrats to secure $400 billion in spending for at-home care for the elderly and disabled that the economy desperately needs, Commerce Secretary Gina Raimondo told Reuters on Monday.BUSINESSTESLA-SOLARCITY/TRIALMusk tells SolarCity trial that Tesla would die if he wasnt CEOElon Musk insisted in court that Tesla Incs board controls the company but also said the electric vehicle maker would die if he wasnt the chief executive, as he ended his first day of testimony on Monday in defense of Teslas 2016 acquisition of SolarCity.GM-ELECTRIC VAN/GM turns to supplier to build initial EV vans while it readies plant in CanadaGeneral Motors Co said on Monday it is turning to a German parts supplier to make the initial, small production run of its new electric commercial van in a move to get the vehicle quickly into the hands of customer FedexENTERTAINMENTSPACE-EXPLORATION/VIRGINGALACTICBillionaire Branson soars to space aboard Virgin Galactic flightBritish billionaire Richard Branson on Sunday soared more than 50 miles above the New Mexico desert aboard his Virgin Galactic rocket plane and safely returned in the vehicles first fully crewed test flight to space, a symbolic milestone for a venture he started 17 years ago.SPORTSSOCCER-EURO/ENGLAND-RACISMEnglands Black players face racial abuse after Euro 2020 defeatBlack players in the England soccer team have been subjected to a storm of online racist abuse after their defeat in the final of Euro 2020, drawing wide condemnation from the squads captain, manager, royalty, religious leaders and politicians.DOPING-SPORT/CANNABISDoping-USADA wants fair cannabis rules as White House calls for meetingThe United States Anti-Doping Agency (USADA) says it wants more flexible rules for athletes who test positive for cannabis after the White House was reported to be seeking a meeting with the World Anti-Doping Agency (WADA) to discuss easing restrictions.UPCOMINGSCIENCE / TECHNOLOGYHEALTH-AUSTRALIA/DIABETES (PIX) (TV)Australian scientists develop pain-free blood sugar test for diabeticsAustralian researchers at the University of Newcastle have created the holy grail of glucose testing in creating a non-invasive, printable saliva test for diabetics.13 Jul 21:00 ET / 01:00 GMTHEALTH-CORONAVIRUS/SPUTNIK-REGULATOR (PIX)European efforts to assess Russias Sputnik V vaccine stymied by data gapsThe developers of Sputnik V have faced repeated issues in dealing with some overseas drugs watchdogs reviewing the vaccine, who have identified a lack of data, including in Europe.13 JulRUSSIA-WEATHER/HEATWAVE (PIX) (TV)Moscow caught in 12-day greenhouse trap as temperatures spike up to 10 degrees above averageRussian capital struggles with a second wave of abnormal heat with a temperature above 30 Degrees Celsius.13 JulHEALTH-CORONAVIRUS/NIGERIA-VACCINESNigerian officials update press on COVID-19 vaccination effortsNigerian officials will hold a press conference to share updates on the nations vaccination efforts against COVID-19. Nigeria is working to secure new shipments of vaccines, as it was scheduled to complete last week vaccinations using the nearly 4 million shots of the Oxford-AstraZeneca shots that it received via the Covax scheme.13 Jul 08:00 ET / 12:00 GMTBUSINESS / ECONOMICSCHINA-ECONOMY/TRADE (PIX) (TV)China releases import, export and trade balance data for JuneChinas customs agency releases trade data for June and the first half of 2021, after exports rose 27.9% in May, with imports rising 51.1%. Chinas exports likely lost some momentum as virus outbreaks and port delays pressured trading despite solid global demand helped by the easing lockdown measures and vaccination drives, a Reuters poll showed on Friday.13 Jul 22:00 ET / 02:00 GMTEU-FINMIN/EU finance ministers discuss economic recoveryEU finance ministers will discuss the economic recovery. They will exchange views on the implementation of the Recovery and Resilience Facility and possibly adopt the first batch of Council implementing decisions on member states plans13 JulCANADA-INSURANCE/MUNICIPALITIES (PIX)After COVID revenue collapse, Canadian municipalities face insurance premium spikeCanadian municipalities reeling from a pandemic-driven hit to revenues are facing an added blow from a jump of as much as 30% in insurance costs, due to more and bigger claims, uncertainty around payout amounts and a shrinking pool of underwriters.13 Jul 01:00 ET / 05:00 GMTGOLDMANSACHS-RESULTS/Goldman Sachs reports second-quarter earningsGoldman Sachs Group Inc reports second quarter earnings with investors focusing on whether the trading and investment banking boom that has driven earnings growth through the COVID-19 pandemic has continued.13 Jul 01:30 ET / 05:30 GMTCENBANKS-DIGITAL/ANALYSIS - Digital rivals? As central banks back e-cash, commercial banks jump on boardAs central banks dabble with digital currencies, commercial lenders from Europe to the United States are ramping up efforts to help shape policy and technical plans, according to more than half a dozen industry executives and public filings.13 Jul 02:00 ET / 06:00 GMTETHIOPIA-TELECOMS/RESULTS (PIX)Ethiopias Ethio telecom due to announce annual resultsState-run Ethio Telecom, expected to be partly sold off as Ethiopia liberalises its telecoms sector, is due to announce its annual results. The company, which in May launched a mobile money service, is looking to sell-off a 40% stake to private investors.13 Jul 03:00 ET / 07:00 GMTHUNGARY-CENBANK/BONDS-TENDERCentral bank bond buying auction results13 Jul 07:00 ET / 11:00 GMTJP MORGAN-RESULTS/JPMorgan reports second quarter profitsJPMorgan Chase & Co is expected to report a jump in second-quarter earnings on Tuesday, bolstered by strong dealmaking activity in the investment bank and the release of funds set aside last year for possible loan defaults during the pandemic.13 Jul 08:30 ET / 12:30 GMTPOLITICS / INTERNATIONAL AFFAIRSCLIMATE-CHANGE/EU-FACTBOXFACTBOX - What could the 12 EU climate policies mean for Europeans?The EU is proposing 12 new climate policies. We look at what might change for consumers if these moves are approved by capitals and European Parliament.13 JulUSA-BIDEN/ (TV)Biden visits Pennsylvania to promote voting rightsU.S. President Joe Biden travels to Philadelphia to deliver remarks on protecting right to vote.13 JulHAITI-PRESIDENT/COLOMBIACOVID stopped Colombian ex-soldier going to Haiti with group tied to assassinationWell interview a former Colombian soldier who, if he hadnt gotten COVID-19, would have gone to Haiti as part of the group of Colombians now connected to assassination of Haitian President Jovenel Moise.13 JulAFGHANISTAN-CONFLICT/SCO (PIX) (TV)Shanghai Cooperation Organisation foreign ministers discuss AfghanistanForeign ministers from the Shanghai Cooperation Organisation, a security grouping comprising Russia, China and ex-Soviet states in Central Asia, discuss the situation in Afghanistan. The council of Foreign Ministers which will meet for two days on July 13-14 is expected to focus on a draft plan of joint action to facilitate Afghanistans reconstruction, Russia said earlier.13 JulCANADA-INDIGENOUS/CHILDRENCanadas indigenous leaders see opportunity for change in publics shock at unmarked gravesCanadas indigenous leaders are encouraged by the longevity and volume of public outcry after the recent discoveries of more than a thousand unmarked graves at former residential schools, giving them hope that this could be a turning point in the countrys genocidal past and pave the wave for a new beginning.13 JulBELARUS-POLITICS/MIGRANTS-LITHUANIA (TV)Lithuanian parliament expected to pass law curbing migrant rightsLithuanian parliament returns from recess to curb migrant rights, streamline asylum reviews. While anti-migrant groups are expected to demonstrate outside the parliament in support of the measures, lawyers and human rights advocates say the proposed legislation is unconstitutional.13 JulNEPAL-POLITICS/COURT (PIX)Ongoing political development after the reinstatement of parliament by the Supreme Court in KathmanduNepals Supreme Court on Monday reinstated its parliament, which was dissolved by caretaker Prime Minister K.P. Sharma Oli in May and ordered that his rival Sher Bahadur Deuba be appointed as prime minister13 JulPHILIPPINES-POPULATION/Philippines statistics authority holds news conference on latest population dataPhilippines statistics authority holds news conference on latest data on population and housing.13 Jul 01:00 ET / 05:00 GMTHEALTH-CORONAVIRUS/ISRAEL (PIX) (TV)Delta variant poses new challenge for Israels COVID strategySix weeks ago Israelis were celebrating a return to normal. With one of the worlds fastest COVID-19 vaccination drives pushing new infections down to single digits and deaths to zero, the face-masks came off and any remaining social distancing curbs had been abolished. But just when Israel thought it was out - Delta pulled it back in. The Delta variants rapid spread began in June and it is now the dominant strain, making up some 90% of cases. Prime Minister Naftali Bennett said on Wednesday that his cabinet was forging ahead with its Soft Suppression strategy - stopping Deltas spread with minimum disruption to daily life.13 Jul 01:00 ET / 05:00 GMTSAFRICA-ZUMA/South African law enforcement officials brief media on protestsSouth African law enforcement officials will brief the media on efforts to contain violent protests that erupted following the jailing of former President Jacob Zuma.13 Jul 04:00 ET / 08:00 GMTARTS / CULTURE / ENTERTAINMENTFILMFESTIVAL-CANNES/ (PIX) (TV)Cannes Film FestivalCelebrities, Film Makers and Movie enthusiasts gather in Cannes for the 74th Cannes Film Festival.13 JulPALESTINIANS-GAZA/ENVIRONMENT (PIX) (TV)Gaza Doctor of The Sea seeks to protect the environment A group of Gaza young men and women built an environment friendly beachfront cafe using tonnes of solid waste in an effort to raise awareness among the local population in the coastal enclave.13 JulHUNGARY-GABOR/FUNERAL (PIX) (TV)Hungarian-born actress Zsa Zsa Gabor to be laid to rest in Budapest cemeteryHungarian-born actress Zsa Zsa Gabor, who parlayed beauty, diamond-studded glamour and nine marriages into a long celebrity career, will be laid to rest in Budapest five years after her death.13 JulCRIME / LAW / JUSTICEBRITAIN-FOREX/COURTBig banks brace as British forex class action seeks go-aheadFive of the worlds most powerful banks will on Monday start battling a proposed multi-billion pound class action in London over alleged foreign exchange (forex) rigging on behalf of pension funds, asset managers, hedge funds and companies.13 JulETHIOPIA-CONFLICT/ARRESTS (PIX)Ethiopian police detain hundreds of ethnic Tigrayans inAddis Ababa after Tigrayan forces advance Ethiopian police have detained hundreds of ethnic Tigrayans in the capital Addis Ababa in the two weeks since Tigrayan forces retook the regional capital, said former detainees, relatives of detainees and a lawyer.13 JulBRITAIN-ENRC/COURTFormer Serious Fraud Office chief Green to testify in London ENRC trialA former head of the UK Serious Fraud Office will testify on Tuesday in Londons High Court in a civil lawsuit brought by Kazakh mining company ENRC against the anti corruption agency and its own former lawyers, Dechert. David Green is one of 21 current and former SFO officers due to testify in the blockbuster case.13 JulPOLAND-EU/COURTPolish top court to rule on conflicts between EU law and ConstitutionPolands Constitutional Tribunal is to rule on whether several articles of EU Treaties comply with the Polish Constitution at the request of the countrys prime minister.13 Jul 07:00 ET / 11:00 GMTCONFLICTS / WAR / PEACEJAPAN-DEFENCE/ (PIX) (TV)Japan to publish annual defence reviewJapan will publish its annual defence white paper.13 JulDISASTERS / ACCIDENTSRUSSIA-FIRES/ (TV)Russian ministry of emergencies resort to military for help in battling wildfires in SiberiaRussian ministry of emergencies resort to military for help in battling huge wildfires in Siberias Yakutia region.13 Jul"}