{"text": "WASHINGTON Democratic presidential candidate Joe Biden pulled further ahead of President Donald Trump in Wisconsin and Pennsylvania, building momentum in two states that could decide the winner of Novembers election, Reuters/Ipsos opinion polls showed on Monday.The polls showed the former vice president leading Trump by 7 percentage points in both states. A week earlier, Biden was up by 6 points in Wisconsin and by 5 in Pennsylvania.Reuters/Ipsos is polling likely voters in six states - Wisconsin, Pennsylvania, Michigan, North Carolina, Florida and Arizona - that will play critical roles in deciding whether Trump wins a second term in office or if Biden ousts him.Below is a state-by-state look at Reuters/Ipsos findings, based on the online responses of likely voters, which include responses from some who cast ballots ahead of the formal Nov. 3 Election Day, which is increasingly common due to the coronavirus pandemic:WISCONSIN (Oct. 6 - Oct. 11):* Voting for Biden: 51%* Voting for Trump: 44%* 20% said they already had voted.* 52% said Biden would be better at handling the coronavirus pandemic. 38% said Trump would be better.* 47% said Trump would be better at managing the economy. 46% said Biden would be better.PENNSYLVANIA (Oct. 6 - Oct. 11):* Voting for Biden: 51%* Voting for Trump: 44%* 51% said Biden would be better at handling the coronavirus pandemic. 42% said Trump would be better.* 50% said Trump would be better at managing the economy. 45% said Biden would be better.FLORIDA (Sept. 29 - Oct. 6):* Voting for Biden: 49%* Voting for Trump: 45%* 50% said Biden would be better at handling the coronavirus pandemic. 41% said Trump would be better.* 49% said Trump would be better at managing the economy. 45% said Biden would be better.* 7% said they already had voted.ARIZONA (Sept. 29 - Oct. 7):* Voting for Biden: 48%* Voting for Trump: 46%* 49% said Biden would be better at handling the coronavirus pandemic. 43% said Trump would be better.* 52% said Trump would be better at managing the economy. 42% said Biden would be better.* 3% said they already had voted.MICHIGAN (Sept. 29-Oct. 6):* Voting for Biden: 51%* Voting for Trump: 43%* 50% said Biden would be better at handling the coronavirus pandemic. 41% said Trump would be better.* 49% said Trump would be better at managing the economy. 44% said Biden would be better.* 10% said they already had voted.NORTH CAROLINA (Sept. 29-Oct. 6):* Voting for Biden: 47%* Voting for Trump: 47%* 47% said Biden would be better at handling the coronavirus pandemic. 45% said Trump would be better.* 52% said Trump would be better at managing the economy. 40% said Biden would be better.* 8% said they already had voted.NOTESThe Reuters/Ipsos opinion polls are conducted online in all six states in English, as well as in Spanish in Arizona and Florida.* In Wisconsin, from to Oct. 6 to Oct. 11, it gathered responses from 1,002 adults, including 577 likely voters, and had a credibility interval of 5 percentage points.* In Pennsylvania, from to Oct. 6 to Oct. 11, it gathered responses from 1,002 adults, including 622 likely voters, and had a credibility interval of 5 percentage points.* In Florida, from Sept. 29 to Oct. 6, it gathered responses from 1,100 adults, including 678 likely voters, and had a credibility interval of 4 percentage points.* In Arizona, from Sept. 29 to Oct. 7, it gathered responses from 1,099 adults, including 663 likely voters, and had a credibility interval of 4 percentage points.* In Michigan, from Sept. 29 to Oct. 6, it gathered responses from 1,098 adults, including 709 likely voters, and had a credibility interval of 4 percentage points.* In North Carolina, from Sept. 29 to Oct. 6, it gathered responses from 1,100 adults, including 693 likely voters, and had a credibility interval of 4 percentage points.GRAPHIC - Where Biden and Trump stand on key issues - hereGRAPHIC - Polling in six key states for the 2020 election - here"}