{"text": "(This Friday story corrects name to TD Bank Group from TD Securities in paragraph 4)BENGALURU The U.S. economy is expected to reach pre-COVID-19 levels within a year as President Joe Bidens planned fiscal package helps boost economic activity, but its likely to take over a year for unemployment to fall to early 2020 levels, a Reuters poll showed.After a pandemic-led 2020, confidence in this years recovery has soared with the growth outlook upgraded in the Feb. 8-11 poll of nearly 120 economists, driven by the proposed $1.9 trillion fiscal stimulus package.Over 90%, or 51 of 56 economists in response to an additional question said the U.S. economy would reach pre-COVID-19 levels within a year, including 23 respondents expecting it within six months.Optimism towards the economic recovery has raised expectations for future growth and inflation. The success of the vaccine deployment and its efficacy will be huge in determining whether the economic forecasts become reality, said Beata Caranci, chief economist at TD Bank Group.Over the last few months, the changes to the forecast have favored a more rapid economic recovery. For the sake of the economy, we hope it continues to surpass our expectations.The U.S. economy, which recovered at an annualized pace of 33.4% in the third quarter from a record slump of 31.4% in the second quarter, grew 4.0% in the fourth quarter, the poll found.While the economy was forecast to slow and grow 2.8% this quarter, it was better than 2.3% predicted in January.The economy was then expected to accelerate and grow 6.0%, 6.3% and 4.6% in the next three quarters, an upgrade from 4.3%, 5.1% and 4.0% predicted for those periods last month.For the full year, growth was forecast to average 4.7% in 2021 and 3.5% next year, an upgrade from 4.0% and 3.3% expected previously.While there are obvious risks that virus mutations deliver setbacks or problems arise with the vaccination program, we think the positives outweigh the negative risks, said James Knightley, chief international economist at ING.Consequently 5% growth looks achievable this year and this is before we consider the potential boost from President Bidens Build Back Better infrastructure and energy plan.Still, all but one of 54 economists with a view said it would take more than a year for the U.S. unemployment rate to reach pre-COVID-19 levels. That includes 33 economists who expected it to take more than two years.The recovery in jobs may take a little more time due to uncertainty over potential structural changes in the economy - home working meaning less people in major cities and perhaps less need for bars, restaurants, retail workers as a result, said INGs Knightley.Conversely, maybe more workers are needed outside of these areas. Getting a good understanding will take time.Apart from the downside economic risks from the virus, relations with trading partners was expected to play a major role, with China particularly in focus.The U.S. president and his Chinese counterpart, Xi Jinping, held their first telephone call as leaders this week, with Biden saying a free and open Indo-Pacific was a priority and Xi warning confrontation would be a disaster for both nations.When asked what would happen to U.S.-China trade relations this year, nearly 90% or 46 of 52 economists said they would stay the same. Only six respondents said they would improve; none expected them to worsen.The U.S. and China will remain locked in global trade and technology competition over the near term despite the change in administration, said Scott Anderson, chief economist at Bank of the West."}