{"text": "Online misinformation that led to violent unrest at the Capitol last week has gone beyond false claims and has reached the point of \"radicalization,\" researchers told a Reuters Next panel on Tuesday.\"This is not about false claims, or even conspiracies, but many of the people at the Capitol are now part of a completely alternate reality,\" said Claire Wardle, co-founder of anti-disinformation non-profit First Draft.She added that people must stop thinking about online conspiracies as existing separately from real-world harm: \"They're not just sitting at home in their pajamas clicking 'yes I agree,' they're out there with ... guns and pipe bombs.\"Violent rhetoric on online platforms ramped up in the weeks before last week's unrest at the Capitol as right-wing groups planned openly for the storming of the Capitol, according to researchers and public postings.  read more Wardle and Graham Brookie, director of the Atlantic Council's Digital Forensic Research Lab, both emphasized that these conspiracy theories would outlast the Trump administration and said it would likely play into upcoming events such as the rollout of the COVID-19 vaccine.  \"One of the biggest trends that we saw throughout 2020 was this convergence of different types of conspiracy theories,\" said Brookie, on the panel moderated by Reuters Fact Check senior producer Christina Anagnostopoulos.    After the unrest, tech companies scrambled to crack down on baseless claims of election fraud and content that could incite violence. Twitter Inc (TWTR.N) and Facebook Inc (FB.O) last week blocked Trump's accounts, while Amazon Web Services (AMZN.O) and the major app stores cut off social media network Parler.  read more However, the researchers criticized the reactive nature of tech giants' actions. \"I'm so frustrated they are taking knee-jerk decisions in the middle of an insurrection,\" said Wardle, who said she was concerned about the lack of transparency and oversight around these decisions.On Monday, Facebook said it would ban content with the phrase 'stop the steal,' which has become a rallying cry around pro-Trump baseless claims of election fraud, before President-elect Joe Biden's Jan. 20 inauguration.  read more The FBI has warned of armed protests being planned for Washington and all 50 U.S. state capitals in the run-up to the inauguration, a federal law enforcement source told Reuters.  read more In a Reuters Next panel on Monday, Camille Francois, chief innovation officer at social media analytics firm Graphika and Preston Golson, director at strategic advisory firm Brunswick Group also emphasized the growing threat of real-world harms from online disinformation in corporate industries, likening its spread to \"a forest fire\" taking hold on combustible material. For more coverage from the Reuters Next conference please click here  or www.reuters.com/business/reuters-next     To watch Reuters Next live, visit https://www.reutersevents.com/events/next/register.php"}