{"text": "Reuters News has named one of its top editors, Alessandra Galloni, as its next editor-in-chief, the first woman to lead the globe-spanning news agency in its 170-year history.A native of Rome, Galloni, 47, will replace Stephen J. Adler, who is retiring this month after leading the newsroom for the past decade. Under his leadership, Reuters has received hundreds of journalism awards, including seven Pulitzer Prizes, the industrys highest honor.A speaker of four languages, and with broad experience covering business and political news at Reuters and previously at the Wall Street Journal, Galloni takes the helm as the news agency faces an array of challenges. Some of these are common to all news media. Others are specific to the organizations complexity: With a worldwide staff of some 2,450 journalists, Reuters serves a range of divergent customers and is also a unit in a much larger information-services business.Since 2008, Reuters has been part of Thomson Reuters Corp (TRI.TO), a corporation with more-lucrative and faster-growing segments than news. Its chief executive, Steve Hasker, who joined Thomson Reuters last year, has focused on aggressively expanding the corporations three largest businesses: providing information, software and services to lawyers, corporations and the tax and accounting profession. Haskers strategy has helped boost Thomson Reuters stock to all-time highs.Reuters News comprises about 10% of Thomson Reuters total $5.9 billion in revenues. Unlike many news organizations, Reuters is profitable. But it is also a drag on the parent companys revenue growth and profit margin, analysts say, and the executive who runs the news business, Reuters President Michael Friedenberg, is pushing to increase sales and boost profitability. Looking forward, Thomson Reuters chief financial officer last month forecast that sales at its Big Three businesses are expected to grow 6% to 7% in 2023, while its news division and printing business are expected to dilute organic revenue growth by about 1% to 2%.Gary Bisbee, an analyst at Bank of America, said he expects Reuters News will continue to be a drag on the growth of the company, but added that as other divisions of Thomson Reuters grow faster, that drag would diminish over time.Thomson Reuters is hoping for a turn-around in the Reuters Events business, which it acquired in October 2019. Almost all in-person conferences last year were canceled or postponed because of the COVID-19 pandemic. But the business has pivoted to a hybrid events strategy for 2021 with both in-person and virtual conferences, and expects its revenues to improve.While some in the industry have speculated that Thomson Reuters might want to sell the news division, three analysts said they dont expect a sale. Douglas McCabe, a media analyst with Enders Analysis in London, said Reuters is a tremendously powerful part of the Thomson Reuters brand, and that the mighty Reuters newsroom behind you and all the really specialized business assets is a great combination.In a statement, CEO Hasker said: Thomson Reuters is committed to the future of Reuters News. It is an important part of the company and is valued across our customer base. The last year has proven beyond question the value of independent, global, unbiased journalism.This year saw the closing of a deal in which the former Financial and Risk business of Thomson Reuters -- now called Refinitiv -- was sold to the London Stock Exchange Group Plc (LSEG.L) in a $27 billion all-stock deal. Under the terms, Reuters News is guaranteed annual payments of at least $336 million to provide news and editorial content to Refinitiv until 2048. That stream of revenue is envied by many in the media industry.Galloni has told colleagues that one of her critical tasks would be maintaining a good relationship with Refinitiv, as it is Reuters biggest customer, accounting for slightly more than half of the news agencys $628 million in revenues last year.The important relationship has been a source of some tension, senior editors say. As part of the contract with Refinitiv, Reuters is required to meet strict performance targets for the news coverage that Refinitiv clients receive, which Reuters has exceeded so far. Thomson Reuters, for its part, noted in its latest annual report that the exclusive deal, while lucrative, limits Reuters ability to sell to other customers in the growing financial-services industry. A Refinitiv spokesman declined to comment.Gordon Crovitz, a former publisher of the Wall Street Journal, said the new editor will nevertheless have to find new sources of revenue. Reuters is in an unusual position because the pledge from Refinitiv frees Reuters News up to be more aggressive in creating new news products to serve new markets, he said. I think theres still a lot of low-hanging fruit for Reuters because of the strength of the brand and the size of the staff.NEW WEBSITEReuters primary competitors include Bloomberg News, the Associated Press, French news agency AFP and visual content provider Getty Images. In addition to its events business, Reuters has been seeking other growth opportunities. Prominent among these is the upcoming launch of a revamped website that is expected to target professionals and eventually begin charging for content.McCabe said convincing consumers to pay for content is challenging because Reuters is a brand that a lot of people recognize but dont intuitively go to. But he is more optimistic that targeting professionals could succeed for Reuters. All the evidence says to me that these are the subscription models that really work, he said.CEO Hasker has told colleagues that he wants to make Reuters more integral to the companys other divisions. To that end, the newsroom recently added to its legal reporting staff.Adler spearheaded a number of moves to modernize Reuters, which gained fame in its early days for using carrier pigeons to relay scoops. In the past decade, the newsroom created teams of investigative, data and graphics journalists, and is using artificial intelligence to speed the delivery of certain breaking financial news. Hasker has said he is eager to continue modernizing the newsroom by getting it to embrace new technologies more aggressively. He and Friedenberg considered a wide range of journalists to succeed Adler, both inside and outside the news agency, according to people familiar with the matter.Among them were two top Reuters editors, Gina Chua and Simon Robinson. The external candidates included David Walmsley, editor in chief of Canadas The Globe and Mail, and Kevin Delaney, former co-chief executive and editor-in-chief of Quartz Media Inc.Galloni, based in London, is known internally as a charismatic presence with a keen interest in business news. She has told colleagues that her priorities would include boosting the Reuters digital and events businesses.She takes the helm after serving as a global managing editor of Reuters, overseeing journalists in 200 locations around the world. At the beginning of her career, she worked at the Reuters Italian-language news service. She received degrees from Harvard University and the London School of Economics. She returned to Reuters in 2013 following about 13 years at The Wall Street Journal, where she specialized in economics and business coverage as a reporter and editor in London, Paris and Rome.\"For 170 years, Reuters has set the standard for independent, trusted and global reporting,\" Galloni said in the Reuters announcement on her appointment, which takes effect on April 19. \"It is an honor to lead a world-class newsroom full of talented, dedicated and inspiring journalists.\"The hunt for the new Reuters editor came as other major media are dealing with succession in the newsroom. Both the Washington Post, where executive editor Marty Baron retired in February, and the Los Angeles Times, where Norman Pearlstine stepped down as executive editor in December, are currently seeking their replacements."}