{"text": "Economic, climate and healthcare upheavals point to the need to move toward developing cleaner energy sources, environmentally friendly jobs and healthier communities, participants in a Reuters Next panel said on Tuesday.A new U.S. presidential administration promising to reverse job losses, re-embrace the Paris climate accord to limit warming and stem the COVID-19 pandemic creates an opportunity to rethink the dominance of fossil fuels over the economy, they said.   \"We have an opportunity right now to responsibly put in place a plan to manage the decline of the oil and gas\" industry, said Janet Redman, climate campaign director at environmental group Greenpeace USA. Shifting incentives away from fossil fuels and investing in public infrastructure and jobs can halt the greenhouse emissions leading to climate warming, she said. U.S. taxpayers spend $20 billion a year to subsidize the cleanup of abandoned sites and lost worker pensions from troubled companies, she said. Fund managers and other investors are pulling money out of fossil fuel suppliers because of dwindling returns, said Kassie Siegel, director of the Center for Biological Diversity's Climate Law Institute. The pandemic-driven decline in oil and gas consumption is accelerating that decline, putting additional projects at risk. \"New fossil fuel extraction doesn't make sense from any group's perspective,\" Siegel said. Communities are pushing back against issuing new permits because of the risk of environmental hazards as economics weaken, she said. There must be a coordinated response to the pandemic, climate change and economic recovery, the panelists said. \"We need big investment, we need big thinking about how to transition communities and working away from fossil fuel production,\" said Peter Erickson, a senior scientist and climate policy director at the Stockholm Environment Institute.Initiatives in Spain to retrain coal miners for jobs in other industries provide models for other countries.\"There are lots of good examples to draw from,\" said Erickson.       For more coverage from the Reuters Next conference please click here  or www.reuters.com/business/reuters-nextTo watch Reuters Next live, visit https://www.reutersevents.com/events/next/register.php"}