{"text": "Here are the top stories and upcoming coverage plans for Reuters text service as of 6 a.m. ET/11 a.m. GMT. For a full schedule of news and events, go to our editorial calendar on Reuters Connect here.TOP STORIESGLOBALUKRAINE-CRISIS/Biden and Putin to speak as Ukraine warnings mountWASHINGTONU.S. President Joe Biden and his Russian counterpart Vladimir Putin will speak on Saturday as Western nations warned a war in Ukraine could ignite at any moment.HEALTH-CORONAVIRUS/CANADA-TRUCKINGProtesters defy injunction order, continue to occupy key U.S.-Canada bridgeWINDSOR, Ontario/WASHINGTON Protesters opposing pandemic restrictions flouted a court order and emergency rules, continuing to occupy a vital Canada-U.S. trade corridor early on Saturday, hours after a judge granted an injunction to end the blockade that has crippled North Americas well-knitted auto industry.U.S.HEALTH-CORONAVIRUS/NEW YORK CITYThousands of unvaccinated New York municipal workers could lose jobs FridayNEW YORK Thousands of unvaccinated New York City municipal workers are up against a deadline on Friday to get a COVID-19 shot or get fired, with Mayor Eric Adams apparently determined to carry out the terminations despite an outcry from union leaders.USA-FED/NOMINEES-RASKINRepublican senator targets Bidens Fed nominee RaskinThe U.S. Senate Banking committees top Republican on Friday took renewed aim at President Joe Bidens nominee to a senior Federal Reserve post, Sarah Bloom Raskin, suggesting she had improperly lobbied the head of the Kansas City Fed on behalf of a fintech firm on whose board she then served.BUSINESSHEALTH-CORONAVIRUS/WALMARTWalmart no longer requires masks for vaccinated U.S. workersWalmart Inc informed staff on Friday that fully vaccinated workers in the United States will no longer be required to wear masks in the companys facilities, effective immediately, unless required by a state or local mandate.RAYTHEON TECH-PROBE/Raytheon says it is a target of a DOJ probe into industry hiring practicesRaytheon Technologies Corp said it is a target of a U.S. Department of Justice investigation into hiring practices in the aerospace industry, the U.S. aerospace and defense firm said in a filing here on Friday.ENTERTAINMENTFILMFESTIVAL-BERLIN/DARK GLASSESHorror legend Argento, 81, brings gory swan song to Berlin Film FestivalBERLIN A period of pandemic-enforced solitude and his actress daughters enthusiasm led Italian horror legend Dario Argento, 81, to snap open his directors chair after a decades absence to make one more of his signature gorefests.PEOPLE-SNOOP DOGG/Snoop Dogg spokesperson calls sexual assault allegations meritlessLOS ANGELES An unidentified woman has filed a civil lawsuit that accuses American rapper Snoop Dogg of sexual assault and battery after she attended one of his concerts in 2013, allegations the musicians spokesperson called a meritless shakedown.SPORTSOLYMPICS-2022-FIGURESKATING/VALIEVAOlympics-Valievas coach breaks silence after hugs at the rinkBEIJING The Russian coach of the 15-year-old figure skater embroiled in an Olympic doping scandal broke her silence on Saturday, saying she was certain Kamila Valieva was clean and innocent.OLYMPICS-2022-SNOWBOARDING/Olympics-Snowboarding-Gold medal-winning knee grab controversy causesBEIJING The mens snowboarding slopestyle final at the Beijing Olympics seemed to have a picture-perfect ending when Max Parrot took gold following a comeback from cancer.UPCOMINGPOLITICS / INTERNATIONAL AFFAIRSHUNGARY-ELECTION/ORBAN(PIX)(TV)PM Orban is due to hold his annual state of the nation speechHungarian Prime Minister Viktor Orban is due to hold his annual state of the nation speech, as the election race heats up ahead of April 3 parliamentary elections.12 Feb 09:00 ET / 14:00 GMTSWISS-VOTE/Swiss go to polls on animal testing ban and restricting cigarette adsSwiss voters will decide on Sunday on whether to become the first country in the world to ban animal testing. A proposal to tighten restrictions on tobacco advertising is also among the issues being considered by the electorate in referendums under the Swiss system of direct democracy13 Feb 18:00 ET / 23:00 GMTBUSINESS / ECONOMICSBRAZIL-MINING/SAMARCO-CREDITORSJudge says Samarco creditors meeting will happen in FebruaryA Minas Gerais Justice court decided that Samarco creditors meeting to vote on the companys judicial recovery. Documents seen by Reuters show the meeting is likely to happen on February 10, but could be posponed for February 17.13 Feb"}