{"text": "Increasing debt distress in emerging markets means that China, now the world's largest official creditor, will need to start  restructuring debts in the same way that Paris Club lenders did in past crises, World Bank Chief Economist Carmen Reinhart told the Reuters Next conference on Tuesday.\"What I think China will need to do to confront this is what previous other creditors in the past had done, which is you have to restructure. And restructure big time, meaning either lower interest rates, longer maturities, write-off in principal or some combination of that,\" Reinhart said in a panel discussion on economic inequality.She said that during the COVID-19 pandemic, China would need to take on a \"new role\" that has been an \"old role\" for Paris Club lenders, as Beijing is now facing for the first time wider spreads and difficulties in countries' ability to service debt on a broad scale.China has signed up to a G20 debt suspension initiative that allows up to 73 of the world's poorest countries to halt payments on official bilateral debts to help fund critical health initiatives, and it has agreed to a further G20 debt restructuring framework.     \"The real challenge is next, when we move to the stage where you have real writedowns to contend with,\" said Reinhart.    Reinhart, a Harvard economist who joined the World Bank in June 2020, has researched and written extensively on financial crises. Last year, she co-authored a scholarly paper on China's overseas lending that found that as much as 50% of it is not reported to the World Bank or International Monetary Fund.    World Bank President David Malpass has warned that without more permanent debt relief, more people in developing countries will slide back into poverty and a repeat of the disorderly defaults of the 1980s could occur. He has pressed China for full participation in the debt relief efforts, including on debt issued by state-owned enterprises.     Emerging market defaults in Latin America and east Asia led to broad-based debt cancellation efforts such as the Brady plan in the late 1980s and the Heavily Indebted Poor Countries (HIPC)initiative in the 1990s.    Asked if another such HIPC initiative were needed, Reinhart said: \"I don't think we're there yet,\" noting that the G20 common framework for debt restructuring takes more of a case-by-case approach.    \"Whether at a later date, one can get creditors to sign on to another initiative, whether it's HIPC-like or Brady-like or whatever form it takes, I don't see that happening over the very near term.\"    She said that both Paris Club creditors and China may have difficulties with such a broad based initiative, which cleared countries' balance sheets, but allowed them to increase borrowing again.\"You ask what it takes to get rid of those cycles - I wish I knew,\" she said, noting that her 2009 book with Harvard economist Kenneth Rogoff, \"This Time Is Different: Eight Centuries of Financial Folly\" chronicles repeated boom-bust cycles in dozens of countries.For more coverage from the Reuters Next conference please click here  or www.reuters.com/business/reuters-nextTo watch Reuters Next live, visit https://www.reutersevents.com/events/next/register.php"}