{"text": "MELBOURNE Rio Tinto Chief Executive Jean-Sebastien Jacques on Friday apologised for distress caused by Rios destruction last month of two ancient and sacred Aboriginal caves in Western Australia, pledging full cooperation with an Australian government inquiry.We are very sorry for the distress we have caused the PKKP in relation to Juukan Gorge and our first priority remains rebuilding trust with the PKKP, Jacques said in a statement, referring to the Puutu Kunti Kurrama and Pinikura (PKKP) people.With state government approval, the worlds biggest iron ore miner destroyed two caves at Juukan Gorge that had previously contained evidence of continual human habitation stretching back 46,000 years as part of its Brockman mine expansion in the iron-rich Pilbara region.Amid heightened global awareness over the treatment of minorities sparked by Black Lives Matter protests around the world, the apology marked Rio CEO Jacques first public comments on the event since it occurred more than two weeks ago.Rio Tinto will fully cooperate with the (government) inquiry, Jacques said in his statement.Head of iron ore Chris Salisbury had previously expressed the miners remorse, although he stopped short of saying Rio had done anything wrong in an interview with Australia media.The miner said on Friday it would also continue to support reforms to Western Australias Aboriginal Heritage Act, under which permission to disturb the sites was granted in a process that denies traditional owners right of appeal.Rio Tinto has a long history of working in partnership and creating shared value with Aboriginal and Torres Strait Islander communities around our operations and across Australia more broadly. We remain absolutely committed to continuing to do so, Jacques said.LEGAL TERRAINAustralias Senate agreed on Thursday to begin a national inquiry into how the destruction of a cultural and historically significant site occurred. Under terms of the inquiry the joint standing committee on Northern Australia must report back by Sept. 30.In Australia, mining companies have to apply for a land use agreement with Traditional Owner groups meaning indigenous communities. The land use agreement is a broad framework that includes how they will operate on the land, and what reimbursement will be considered.As they move to develop, where land users conclude that impact to a heritage site is unavoidable they must obtain the consent of the states Minister for Aboriginal Affairs to proceed under Section 18 of the Aboriginal Heritage Act.The minister also receives advice from a body that represents Indigenous heritage interests as part of the decision-making process. But Traditional Owner groups are not able to appeal the ministers decision.The act has been under review for two years with the time frame for reforms delayed in April 2020 due to coronavirus restrictions.BLANKET APPROVALSCourt records from May 14 show there have been 463 requests under Section 18 that relate to mining leases since July 2010, all of which have been approved.BHP Groups application to disturb 40 culturally significant Aboriginal sites as part of its South Flank mine expansion was approved by the state just days after Rio Tinto blew up the Juukan caves.Fortescue Metals has made at least one application for exemption under the act for its Queens mine expansion, part of its Solomon project, in an area that covers at least 70 heritage sites, the Sydney Morning Herald reported.Fortescue did not immediately respond to a request for comment."}