{"text": "Nigerian property developer Olawale Ayilara is building housing estates in the affluent Lekki district of mega city Lagos, the country's commercial engine. But the cost of the project is expanding rapidly due to the increased price of cement.The price of a 50 kg (110 lb) bag of cement rose by a third, from 2,500 naira  ($6.57) to 3,600 naira ($9.46) around November last year, he said.\"It has a large effect in what the price of building development will be,\" said Ayilara, CEO of LandWey Investments, which is building 12,000 homes spread across 14 sites in Lekki.\"There is nothing the developers can do,\" he said, as he gazed at rows of partially constructed apartments surrounded by wooden scaffolding.Lawmakers last month said the dominance of three large firms was keeping prices high and impeding construction needed to aid the recovery of Africa's largest economy. Nigeria, where a third of the labour force is unemployed, emerged from its second recession in four years in late 2020.  read more Dangote Cement (DANGCEM.LG), founded by Africa's richest man, Aliko Dangote, has 60.6% market share. Lafarge Africa (WAPCO.LG) accounts for 21.8%, while BUA Cement (BUACEMENT.LG) has 17.6%.Their dominance stems from a cement import ban that has been in place for most of the last 20 years to develop self sufficiency in cement production.Cement firms raised prices during Nigeria's 2016 recession to counter low sales volumes, and price have continued to rise.Abdulrahman Ojo, an engineer, is building a mosque in Lagos and, like Ayilara, is struggling to reduce costs.He said he had seen cement costs double in price, from 2,000 naira a bag to 4,000 in recent years. \"There should be a price control,\" he said, stating that his team uses up to 20 bags a day.Nigeria's high prices are part of a continent-wide trend. Final cement prices in Africa are 183% higher, on average, than world cement prices, the World Bank said in a 2016 report.But Nigeria's prices are high, even compared to other African countries, according to Joachim MacEbong, a senior analyst at Lagos-based consultancy SBM Intelligence.He said the government could help by providing incentives to cement companies to enter the Nigerian market, echoing similar calls made by lawmakers last month.The ministry of industry, trade and investment, which oversees the issuance of manufacturing licences, did not respond to a request for comment on calls for the government to ease licensing restrictions.At a building site where a group of men pieced together walls made of concrete blocks held in place by mortar, Ayilara urged the government to intervene.\"They have to come to the table and make sure that they do what is fair by everybody so that we can have a system that is balanced,\" he said.($1 = 380.5900 naira)"}