{"text": "Roberta McCain, whose irrepressible spirit and energy helped shape the maverick tendencies of her older son, the late U.S. Senator John McCain, died on Monday at the age of 108, her daughter-in-law said.It is with great sadness that I announce the death of my wonderful Mother In-law, Roberta McCain, Cindy McCain wrote on Twitter. I couldnt have asked for a better role model or a better friend. She joins her husband Jack, her son John and daughter Sandy.She did not provide further details on the circumstances of her mother-in-laws death.McCain, who lived in Washington, was cherished by her late son, who represented Arizona as a Republican U.S. representative and senator for 35 years. She called him Johnny until his death from cancer at age 81 on Aug. 25, 2018.Roberta McCains vibrance, charm and penchant for speaking her mind made her a popular attraction during her sons unsuccessful 2008 campaign for the presidency.I want to correct you when you start telling all those big lies, she told him during a joint interview.McCain had taken his mother on the trail as a living response to those who thought that at age 71 he was too old to be president. She was 95 at the time, proving that longevity was a family trait, he said.McCain also liked telling the story about his mother being turned down for a car by a rental agency on a trip to France because she was 93. Her solution was to buy a car and tour France as she had intended. Afterward, she had the car shipped to the U.S. East Coast and drove it across the country.She also was known for getting speeding tickets, including one for driving 112 miles per hour (180 kph) on a straightaway in Arizona.Her son, John III, had a distinguished Navy career like her husband, John McCain Jr.; and father-in-law, John McCain Sr., with the two elder Johns reaching the rank of admiral.Roberta Wright and her identical twin, Rowena, were born Feb. 7, 1912, in Muskogee, Oklahoma, the daughters of a wealthy oilman, who taught them to love travel by taking them and their three siblings to sites of interest throughout the United States.Roberta later would take her own three children on similar long educational road trips, as well as regularly touring the world with Rowena while they continued a gin rummy game that reportedly lasted for decades.ELOPING WITH THE ENSIGNRoberta had been a student at the University of Southern California when she met John McCain Jr., then an ensign stationed nearby. Her family did not approve of their relationship, so they eloped to Tijuana, Mexico, in 1933.As John Jr., who commanded submarines during World War Two, rose in rank, the Navy sent them around the world, including postings in London, Honolulu, Connecticut, Washington and Panama, where their son John was born.McCain and her husband were preparing to attend a dinner party in London in 1967 when they got a phone call saying John IIIs fighter jet had been shot down in North Vietnam. It was assumed he had been killed, but the couple decided to go to the dinner and say nothing.A few days later, they learned their son had survived but been captured.Can you believe thats the best news I ever heard in my life? Roberta said in a 2008 interview with C-SPAN.John III was beaten and tortured by the North Vietnamese during his 5-1/2 years as a prisoner of war.From both my parents I learned to persevere, McCain wrote in his 1999 book Faith of My Fathers. But my mothers extraordinary resilience made her the stronger of the two.During his years in Congress, John McCain developed a reputation as a maverick who did not always follow Republican gospel and was willing to work across the aisle with his Democratic colleagues.Ive inherited modest measures of her qualities, sufficient to give me the energy for a busy life and the enthusiasm for it. Im the son and grandson of admirals, he wrote in The Restless Wave, which was published a few months before his death. But I am my mothers son. I always have been. Thank you, mother, thank you.Motherhood was a role to which Roberta McCain clung. After reading an excerpt of his book in which he used a string of profanities on his Vietnamese captors, she told her son she was going to wash his mouth out with soap.He better never speak like that again or Ill smack him bald-headed, she told Time magazine. Of course, he almost already is.The Washington Post reported that McCain flew a Taiwanese flag outside her Washington apartment, which was located near the Chinese Embassy, on the 50th anniversary of the Communist Partys takeover in China.McCain was survived by her son Joseph. Her husband died in 1981 after 48 years of marriage, and her daughter, Jean Alexandra Sandy McCain Morgan, died in 2019."}