{"text": "(Repeats story published late Saturday, with no change to text.)KUALA LUMPUR, Oct 10 Malaysia Airlines will have to shut down if its lessors decide not to back its latest restructuring plan, the chief executive of the airlines parent group was quoted as saying on Saturday.A group of leasing companies has rejected the restructuring plan, bringing the state carrier closer to a showdown over its future, Reuters reported on Friday.Malaysia Aviation Group (MAG) chief executive officer Izham Ismail said the group would have no choice but to shut it down if lessors decide against backing the restructuring plan.There are creditors who have agreed already. There are others still resisting, and another group still 50:50, Izham said in an interview with The Edge weekly.I need to get the 50:50 ones (on board) with those who have agreed. I understand quite a sizeable amount of creditors have agreed.Izham said the plan was to restructure the airlines balance sheet over five years, achieving break-even in 2023 on the assumption that demand in the domestic and Southeast Asian markets returns to 2019 levels by the second and third quarters of 2022.The plan will also require a fresh cash injection from the airlines shareholder, state fund Khazanah Nasional, to help the company over the next 18 months.MAG declined to comment.Lessors claiming to represent 70% of the airplanes and engines leased to the airline group have called the plan inappropriate and fatally flawed and pledged to challenge it, according to people familiar with the matter and a letter from a London law firm seen by Reuters.MAG had earlier warned lessors that Khazanah would stop funding the group and force it into a winding down process if the restructuring plans fail.Izham said the lessors would need to make a decision by Oct. 11, so the airline can decide whether to proceed with its restructuring plan or execute Plan B.Izham said Plan B could involve shifting Malaysia Airlines air operators certificate (AOC) to a new airline under a different name, or leveraging on the AOCs of sister airlines Firefly and MASwings.If you ask me, is Plan B credible? Of course, it is. We have all the skills sets in place. (Reporting by Joseph Sipalan and Anshuman Daga; editing by Richard Pullin and Mark Potter)"}