{"text": "(Repeats late Wednesday item without changes)* Governor Sethaput says BOT sees rising bad debt levels* Says interest rates seen by many as blunt tool* Says economy may shrink q-on-q in third quarterBANGKOK, Aug 12 Thailands central bank will focus on creating conditions for expanding debt relief and credit for firms to boost the flagging economy, the banks chief said, adding that already low interest rates had become a blunt tool for many policymakers.Governor Sethaput Suthiwartnarueput also told Reuters in an interview that, while an economy under pressure from the countrys worst coronavirus outbreak yet might shrink in the third quarter from the second, he did not expect it to contract in 2021 as a whole.Curbs to contain COVID-19 have crippled activity in Thailands dominant in tourism sector, which in a normal year accounts for 11-12% of GDP and 20% of employment, though increased exports and fiscal measures have lent the economy some support.The central banks (BOT) monetary policy committee last week voted 4-2 to hold the one-day repurchase rate at a record low 0.50%.It was the first split decision since a rate cut in May 2020, and some analysts believe a further cut is possible this year. The BOT holds its next policy meeting on Sept. 29.Sethaput said the current rate was no obstacle to what would be a very uneven economic recovery.Asked about the possibility of a cut, he stressed that most of the monetary policy committee had so far not seen a need.We feel that policy rates are a blunt tool, he said.There are more direct, more targeted measures that might more appropriately address the kind of things that are hindering our economic recovery.Expanded access to credit and debt relief were next on the central banks priority list, he said.Thai banks have traditionally been reluctant to lend to smaller businesses due to credit risks, and Sethaput added that the BOT expected bad loans to rise and was worried about high household debt levels.We need to scale up debt restructuring, he said. There are a lot of debtors out there that theyre not going to have adequate cash flow to service debts for quite a while.NO BAHT LEVEL IN MINDSome business groups have said the economy could shrink this year due to the coronavirus.The BOT, which has flagged the fact that only about 7% of its 66 million population have been fully vaccinated as another growth risk and now expects just 150,000 foreign tourists to visit this year, last week cut its 2021 growth forecast to 0.7%.Sethaput said a contraction this year in Southeast Asias second-largest economy - which shrank 6.1% last year as tourism collapsed - was not that likely, and that the bank also remained comfortable with its forecast that exports will grow 17%. Second quarter GDP data is due on Aug. 16.There were 6.7 million foreign tourists in 2020, down from nearly 40 million in 2019.Thailand is preparing to reopen more broadly to foreign visitors later this year, though Sethaput said a still weak tourism sector meant the economy was not expected to reach pre-pandemic levels until the first quarter of 2023, lagging neighbouring countries.Sethaput said the weakening baht reflected weaker economic fundamentals but external vulnerabilities were low.We have no ...predetermined level of the baht in mind, he said. Wed prefer that movements in the exchange rates be driven by economic fundamentals, rather than short-term, speculative type pressures... and be not excessively volatile.Foreign exchange rates had not helped exports much in volume terms, but with margins, he said.The baht has depreciated by 10% against the dollar this year, making it Asias worst performing currency."}