{"text": "(Repeats with no changes)NEW YORK/LONDON, Nov 11 The eurodollar futures market, which tracks short-term U.S. interest rate expectations over the next few years, is betting on a U.S. rate hike by September 2023, moving up by half a year its estimated start of the next tightening cycle.Eurodollar futures have called a policy turn by the Federal Reserve before. Still, the Fed has made it abundantly clear that the U.S. economy needs to overcome tough employment and inflation hurdles before it can even think of raising interest rates.News, however, of a successful late-stage vaccine from Pfizer Inc has fueled optimism that the worlds largest economy will emerge from a pandemic-induced recession and spur inflation.Eurodollar traders had priced on and off since late August that the Fed will lift borrowing rates in mid-2024. Other rate sentiment barometers such as fed funds futures do not suggest a shift toward tightening that soon.The futures are a bet on the direction of the short-term London interbank offered rate (LIBOR), one of the most widely used interest rate benchmarks in global financial markets. Investors hedge interest rate risk in the eurodollar market.On Wednesday, the September 2023 eurodollar futures contract showed an implied yield of 0.50%, suggesting traders are expecting the Fed to deliver a 25 basis-point hike by then.The week before the election, September 2023 futures priced in an implied yield of 45 basis points.Volume on the contract reached records on Nov. 4, the day after the U.S. elections, and Nov. 9, when Pfizer announced its vaccine test results. More than 200,000 contracts turned over on Nov. 4, compared to the last three months average of around 60,000 contracts.If the vaccine plus the stimulus creates a reflationary impulse like the world has never seen - and thats a mighty big if - then the Fed will have no choice but to lift rates earlier than expected, said Stephen Innes, chief global markets strategist, at broker-dealer Axi.The Fed in September said rates would remain near zero until the economy reaches maximum employment, inflation hits the Feds 2% target, and stays moderately above 2% for some time.It may be years though before the economy hits any of those metrics, let alone all three. Most policymakers see inflation reaching 2% only by 2023, with unemployment still above pre-crisis levels.While inflation expectations as measured by breakeven levels on 10-year Treasury Inflation-Protected Securities (TIPS) have been rising the last few weeks, the levels have yet to hit the Feds 2% inflation benchmark.Goldman Sachs, in a recent research note, said it expected the Fed to wait until 2025 before hiking rates.Even under our forecast of a strong growth rebound, labor market conditions will normalize only gradually and inflation looks set to remain below central bank targets, wrote Goldman.Gennadiy Goldberg, senior rates strategist at TD Securities, said what the eurodollar futures market has been pricing in is a bit premature as the Fed will want to overshoot on inflation and keep rates low even when the recovery is well underway.Bets on a rate hike have become evident for as early as the summer of 2022, data showed.The March, June, and September 2022 eurodollar futures contracts showed an implied yield of 32 to 35 basis points, suggesting small chance of Fed tightening in those periods.In June 2018, the eurodollar market suggested that the Fed would cut interest rates at some point when the U.S. central bank was in a tightening mode. As the summer dragged on, the futures contracts predicted a bunch of rate cuts.Fast forward to 2020, the Fed has cut fed funds rates to zero as the coronavirus pandemic caused economic devastation around the world."}