{"text": "(Repeats to additional subscribers)DUBAI, Aug 12 NMC Health has secured loan commitments worth $275 million in a deal which would allow the lenders to improve their prospects of recovering money already owed by the United Arab Emirates troubled hospital operator, two sources said.But the financing, which offers beneficial terms to the debt providers, has created heated discussions among NMC lenders in recent days, with some creditors asking to be more involved in the process, said the sources, who are familiar with the matter.NMC Health Plc, the London-listed holding company for the hospital group, went into administration in April amid allegations of fraud and the disclosure of more than $4 billion in hidden debts, leaving both UAE banks and overseas lenders with heavy losses and prompting legal battles.The companys administrators, Alvarez & Marsal, said last week the firm had secured a $250 million financing facility.The financing allows creditors to elevate existing claims to a more senior level, so every dollar lent under the deal improves chances of recovering an equivalent amount of their debt exposure, said the sources.That prompted lenders to re-open discussions and one fund to provide an extra $25 million, said the sources, with one adding that the lender in question was a U.S. based hedge fund.The structure means proceeds from the easiest to sell and most valuable NMC assets will go to those who provided the money, said one of the sources.The second source said the structure was generally used to incentivise lenders to provide cash to a distressed company.But it has been seen as an attempt by the largest creditors to improve recovery. This soured all the discussions among banks.Abu Dhabi Commercial Bank - the biggest creditor to NMC with an exposure of nearly $1 billion - is providing a large majority of the new financing, said the sources.A spokesman for the administrator said: We actively marketed the financing needs and package...and received two underwritten offers and selected the most attractive and executable one.A number of additional banks are now actively considering their participation. We are continuing to work to satisfy the final conditions of financing.Perella Weinberg - which is advising the company - declined to comment. ADCB did not immediately respond to a request for comment.The financing is conditional on Abu Dhabis international finance centre, Abu Dhabi Global Markets, accepting NMCs UAE entity under its jurisdiction in a process similar to Chapter 11, sources have previously said."}