{"text": "(Repeats from Monday. John Kemp is a Reuters market analyst. The views expressed are his own)* Chartbook: tmsnrt.rs/3otXQZzLONDON, Jan 11 Hedge fund managers are starting to diverge over the likelihood of further oil price increases as Brent futures surge above $50 per barrel and global coronavirus infections accelerate.Hedge funds and other money managers purchased the equivalent of 14 million barrels of futures and options in the six most important contracts in the week ending Jan. 5.Last weeks buying takes total purchases to almost 400 million barrels in the nine weeks since the first successful coronavirus vaccine trials were announced in early November.But the rate of buying has slowed as prices have climbed and the balance of short-term price risks has progressively shifted from the upside through neutral to the downside.In the most recent week, fund managers added 43 million barrels of bullish long positions, but also 30 million barrels of bearish short ones, the largest increase for two months.The total ratio of long to short positions fell to 4.73:1, down from 5.30:1 the previous week, and the first decline since early November (tmsnrt.rs/3otXQZz).Position changes last week were small across all contracts, with minor buying in Brent (+12 million barrels), NYMEX and ICE WTI (+3 million), U.S. gasoline (+2 million) and European gasoil (+2 million) but selling in U.S. diesel (-6 million).From both a positioning perspective and a fundamental one, it is no longer obvious prices will extend their recent blistering rally rather than pull back temporarily.The rapid escalation in prices above $50 from less than $40 two months ago has increased the risk of a short-term reversal, as has the emergence of a concentration of hedge fund positions on the bullish side of the market.From a fundamental perspective, rising prices are already encouraging more shale drilling, with the number of active rigs up by more than 100 in the last five months, which will boost U.S. output in the second half of 2021.Price rises are undermining the commitment to restrict output among OPEC+ and divisions are resurfacing between Russia and Saudi Arabia over whether to focus on boosting prices or protect market share.And the new wave of COVID in North America and Europe, as well as vaccination delays, threaten to delay the resumption of air travel and normal business activity, crimping consumption for longer.Most fund managers remain bullish, but the changing risk profile has sapped the rally of its earlier buying momentum and caused a minority to start anticipating a short-term correction.Related columns:- Hedge funds end 2020 with lopsided oil position (Reuters, Jan. 5)- Oil sees more fund buying, but risks shifting (Reuters, Dec. 7)- Positive oil outlook draws in fund managers (Reuters, Dec. 1)- Oil sees wave of fund buying on early COVID immunisation hope (Reuters, Nov. 23) (Editing by Jane Merriman)"}