{"text": "(Repeats SCHEDULED COLUMN originally published on July 10, no changes)NEW YORK, July 10 Investors will watch next weeks earnings from BlackRock, the worlds largest asset manager, for a snapshot of how the industry performed during the second quarters dramatic rebound in global financial markets.Most expect numbers from industry bellwether BlackRock and other asset managers to reflect the sharp stock market rebound. The S&P 500 rose 20% in the second quarter after falling as much in the first three months of 2020 as the coronavirus pandemic slammed the economy.Since the performance of asset managers tends to be tied to how markets fare, investors see a range of risks ahead, including further acceleration of U.S. coronavirus cases and potential market volatility around the Nov. 3 presidential election.Still, just on a market level, the asset managers are in much better shape coming out of the second quarter than they were coming out of the first quarter, said Macrae Sykes, global financial services sector analyst at Gabelli Funds.BlackRock is scheduled to report on July 17, with T. Rowe Price, WisdomTree Investments and Invesco among asset managers reporting in the following weeks.Analysts expect a strong recovery in the sectors assets under management (AUM) in the second quarter, driven by rising financial markets and improving risk appetite. Higher levels of AUM mean more fees and stronger margins and earnings, analysts said.BlackRocks assets fell to $6.47 trillion at the end of the first-quarter, from $7.43 trillion at the end of 2019.Improving fund flows are also likely to help second-quarter earnings for the group, analysts said. Fixed income flows reversed back into positive territory in April and stayed that way throughout the quarter while equity flows improved from March lows, according to Jefferies.Analysts at Morgan Stanley recently raised their estimate for second-quarter earnings-per-share for traditional asset managers by 19%.Most analysts expect BlackRock to show robust flows into its $2 trillion exchange-traded funds business, with strength in the fixed income and alternatives ETFs offsetting outflows from equities.Investors will also look for details on BlackRocks role in the Federal Reserves debt-buying efforts as the central bank sought to stabilize a corporate bond market roiled by economic fallout of the pandemic.The firms own ETFs accounted for a large share of corporate bond ETFs it bought on behalf of the Fed as part of the central banks relief program. BlackRock waived asset management fees on ETFs purchased on behalf of the Fed.BlackRocks shares are up about 9% year-to-date, outperforming a 3% decline in the S&P 500. The broader sector has not fared as well, with the Refinitiv U.S. Investment Management & Fund Operators Price Return Index is down about 13% for the year.Some investors worry asset managers could take a hit if a resurgent pandemic forces parts of the United States to halt or reverse the reopening of their economies.Analysts at Goldman Sachs last week said the U.S. economy would shrink by 4.6% in 2020, from an earlier forecast of a 4.2% contraction.We remain cautious with equity markets nearing post Covid-outbreak highs amid risk of a market correction should a second coronavirus wave impede the pace of the global economic recovery, analysts at Deutsche Bank said in a note to clients about the sector.The U.S. presidential election could also heighten market volatility. A victory by Democratic challenger Joe Biden could threaten Republican policies championed by President Donald Trump and generally favored by Wall Street, including lower corporate tax rates and fewer regulations, analysts said.A separate indication of the financial industrys health may come next week from several big Wall Street banks set to report earnings, including Goldman Sachs Group Inc and Morgan Stanley."}