{"text": "(Repeats Wednesdays story without changes to text)LONDON, Nov 11 A swathe of top investment banks and funds are piling into emerging market assets on a double-lift in confidence after U.S. President Donald Trumps election defeat and this weeks coronavirus vaccine breakthrough.With poorer economies that rely on natural resources, cheap manufacturing or tourism set to benefit from a recovery in global trade and travel, as well as a more predictable White House, Morgan Stanleys message on Wednesday was simply Gotta Buy EM All!.Its big bets are on the currencies of China, Mexico, Brazil, South Africa, Colombia and Russia and a longer list of hard-currency debt ranging from Ukraines growth-linked sovereign bonds to Mexicos state oil firm Pemex.We see a good chance that the rally can extend into 1Q 21, with plenty of liquidity (investor money) on the sidelines to find its way into risk assets now with reduced uncertainty, said Morgan Stanleys James Lord.Analysts at another big investment bank, Citi, have also become notably more upbeat.They expect both the Indonesian rupee and Thai baht to do particularly well as investors barrel back into trade and tourism-dominated economies.While actual realisation of tourism revenue may still be months away, light at end of the tunnel, together with reduced concerns over ongoing protests, will drive up the baht towards 30 per dollar, wrote Dirk Willer at Citi.Tourism contributed over 10% of Thailands GDP in 2019, one of the highest shares in the world, World Bank data shows.Citi is also diving into Mexican and Colombian local bonds. The bank, like others, sees Latin America benefiting the most from a successful vaccine having already gone overweight duration on the region after the U.S. election.The vaccine news provides an extra boost, simply by improving the global growth outlook and especially the demand including for commodities  from advanced economies, Barclays Christian Keller wrote, adding EM would be a winner from the U.S. election.BULLS IN THE CHINA SHOPIt is not only the vaccine and U.S. policy hopes that are feeding the frenzy.Societe Generale and Citi both flipped from negative to positive on Turkeys lira on Wednesday after President Tayyip Erdogan pledged major policy changes having ushered out his central bank governor and finance minister.Over the course of this week, evidence has been rapidly accumulating that Turkey is eager to execute a dramatic shift in policy-making back toward a more orthodox framework, Societe Generales Phoenix Kalen said.Emerging markets have enjoyed steady inflows in recent months after investors pulled some $100 billion out in early spring, according to IMF estimates.There is also emerging markets traditional lure of the higher interest rates at a time when many richer economies now have either virtually zero or negative rates.What we have been buying more of is emerging debt especially in Asia, including China, where we are getting significantly higher real rates than in the Western world, said Didier Saint-Georges, member of the Strategic Investment Committee at asset manager Carmignac in Paris.UBS head of emerging market strategy Manik Narain estimates the premium Chinese bonds offer now once inflation is accounted for compared to U.S. bonds is now the largest in at least a decade.That yield differential, as it is known, is one of the reasons he expects the countrys currency, the yuan, to keep climbing.A big theme now is how far the PBoC (Peoples Bank of China) will allow the renminbi to strengthen, said Narain. It is not far to getting back to the 6.4 it was at in early 2018 when Trump started to laser in on China."}