{"text": " (Repeats story with no changes to text)\n    * Global diamond supply chains convulsed by pandemic \n    * Diamond polishers in India switch to farming\n    * Miners seek new supply deals to boost margins\n    * Mines from Canada to Lesotho still shuttered\n\n    By Helen Reid, Tanisha Heiberg and Rajendra Jadhav\n    JOHANNESBURG/MUMBAI, Aug 12 - As the coronavirus pandemic\nupended the global diamond industry, shuttering mines from\nLesotho to Canada and disrupting supply chains, Rajen Patel\nswapped diamond polishing for peanut farming.\n   Patel, who worked for a decade in India's Surat where about\n80% of the world's diamonds are polished, joined the exodus of\ngem workers leaving the city as cases of the virus shot up.\nAfter taking up farming in his home village, he has no plans to\nreturn in the coming months.\n    \"I won't earn as much I was earning in Surat, but I won't\nstarve and there is no fear of getting infected with\ncoronavirus,\" he said.\n    Demand for diamonds has plummeted during the pandemic,\nfreezing sales and squeezing prices. With temporary mine\nclosures at risk of becoming permanent, diamond miners are\nseeking ways to extract more value from their stones.\n    The lone bright spot has been steady demand for large,\nhigh-quality diamonds from affluent investors, according to\nfinanciers and sales data. \n    \"There are a lot more enquiries from people seeking to buy\nthese luxury stones as a hedge,\" said Chris Del Gatto, CEO of\nthe DelGatto Diamond Finance Fund, the largest non-bank lender\nto the diamond, jewellery and watch industries.\n    Prices for high quality one-carat diamonds are rising\nsteadily and are currently around 12% higher than at the start\nof the year, in contrast to still-depressed prices for\nlower-quality stones of the same size, data from trading\nplatform RapNet shows.\n    For an interactive graphic, click: tmsnrt.rs/2Pqtl74\n \n \n    \"If you are in that top end, the demand is still there\nbecause the people who go for these type of goods feel the\npressure of the market downturn less,\" said Gus Simbanegavi, CEO\nof Bluerock Diamonds. \n    But only a few miners are lucky enough to have deposits of\nlarge, high-quality diamonds, leaving some producers at risk. \n    GRIM YEAR\n    COVID-19 has forced miners to cancel or delay sales, with\nmajor diamond shows scrapped due to health and travel\nrestrictions. The few sales that have taken place showed rough\ndiamond prices down between 15% and 27%.\n    \"What has happened in the second quarter, I have never seen\nin my life,\" De Beers Chief Executive Bruce Cleaver told\nReuters. \"There was no really properly functioning rough\nmarket.\"\n    Indian imports of rough diamonds plunged from $1.5 billion\nin February to just $1 million in April, data from the Gem &\nJewellery Export Promotion Council shows. \n    For an interactive graphic click here: tmsnrt.rs/2XxZuhs\n \n \n \n    Antwerp, another diamond hub, saw rough imports drop 20%\nyear-on-year in the first half, according to data from Antwerp\nWorld Diamond Centre. The city's exports of polished diamonds\nfell 46%. tmsnrt.rs/2DEez9P\n    \n    REAL OPPORTUNITY \n    In a bid to survive, some miners are trying to change the\ntraditional pricing game by securing a cut of onward polished\ndiamond sales, and miners may eventually have direct tie-ups\nwith luxury jewellery brands, RCC Diamond Consultants managing\ndirector Richard Chetwode predicts. \n    Australia's Lucapa Diamond Co inked a deal with an\nunnamed \"high-end diamantaire\" to sell some of its high-value\ndiamonds from the Mothae mine in Lesotho for $505 per carat plus\na 50% share of the margin on the future polished diamond sale. \n    Lucara Diamond Corp,, which mines in Botswana,\nstruck a deal in July with Antwerp manufacturer HB Group under\nwhich the miner's diamonds larger than 10.8 carats are sold for\na portion of the estimated polished price. \n    \"There is real opportunity within the diamond business as a\nwhole to modernise the sales system,\" said Lucara CEO Eira\nThomas. Lucara has also set up an online diamond sales platform.\n   In the meantime, miners are hoping production cuts will help\nprices recover. With Rio Tinto's massive Argyle diamond mine in\nAustralia among those coming offstream soon, global diamond\nproduction will likely be reined in until 2025, independent\nanalyst Paul Zimnisky forecasts. \n    For an interactive graphic, click here: tmsnrt.rs/3icmNFm\n  \n \n \n \n    Several diamond mines shuttered due to the pandemic have\nalso yet to reopen, including Stornoway Diamonds' Renard mine in\nCanada, Petra Diamonds' Williamson mine in Tanzania, and\nFirestone Diamonds' Liqhobong mine in Lesotho, which the company\nsaid would likely stay closed until April to preserve cash.     \n \n    Meanwhile, Africa-focused Petra Diamonds is in\nrestructuring talks with creditors, while in Canada's Northwest\nTerritories, Rio Tinto's Diavik mine partner has sought creditor\nprotection, saying it cannot afford the miner's cash calls. \n    Even De Beers is feeling the pain, saying job cuts are\nlikely, as it remains unclear whether supply will shrink enough\nto meet plunging demand in the global diamond jewellery market,\nwhich Bain estimated was worth $80 billion in 2019.\n    Industry hopes that the pandemic would boost sales of \nengagement rings as people reassessed life priorities and more\nmade plans to get married have not borne out. \n    In retailer Tiffany & Co's February-April quarter,\nengagement jewellery was the worst-performing category, with\nsales almost halving.\n    Overall, fine jewellery sales are expected to drop 19% this\nyear, compared to a 3% rise last year, according to Euromonitor.\n \n \n \n    \n (Additional reporting by Zandi Shabalala in London; Jeff Lewis\nin Toronto, Silvia Aloisi in Milan, Melissa Fares in New York,\nPolina Devitt in Moscow, Sophie Yu in Beijing; Editing by Amran\nAbocar and Kirsten Donovan)\n  "}