{"text": "(Repeats story first published on Friday, no changes to text)Oct 12 (Reuters) -1/BANKING ON RECOVERYAfter U.S. Q2 results beat expectations, Q3 will show whether dire forecasts for companies bottom lines were justified.Most sectors will again show steep drops in earnings but it should be less dramatic than the previous quarter; expectations are for an average 21% decline, versus the 31% contraction of Q2, when coronavirus-linked lockdowns decimated economic activity.Energy companies are seen faring worst, with earnings down 115% from a year ago, according to Refinitiv. Tech earnings are predicted to fall just 0.5% percent.Banks -- Citi and JPMorgan report on Tuesday -- may see earnings slip 19% on average but there is hope that after two quarters of hefty provisioning against bad loans, potential loan losses have mostly been covered.FACTBOX-What a second Trump term would mean for U.S. financial policy FOCUS-Treasuries on steroids: U.S. banks mortgage bond trading bonanza2/WATCHING THE CURVESWill the Fed do something about the Treasury yield curve?Bets on a spending boost from any incoming administration -- Democrat or Republican -- has seen record shorts build up in long-dated Treasury futures and a jump in long yields has pushed the gap between five-year and 30-year borrowing costs to the widest since 2016.Curve steepening isnt bad news if it signals higher growth and inflation, yet for an economy recovering from recession, too quick a move is a threat and a headache for the Fed.It hasnt committed to capping yields or buying bonds of any particular maturity. But further steepening might test its patience. Fed research suggests bond holdings may need to rise another $3.5 trillion to boost the economy. Policymakers speaking in coming days will certainly be quizzed on that.-Split on applying new framework, Fed struggles over economic outlook as well -Fighting the Fed, or just jostling?: Mike Dolan3/BREXIT ENDGAME?With a UK-imposed Oct. 15 deadline for a post-Brexit EU trade deal upon us, there are signs a bare-bones agreement is taking shape. But is the endgame really in sight?Negotiators warn of a huge amount of textual work even if a deal is struck. Another report suggests the EU is preparing for negotiations to last until mid-November. Several sticking points still remain.The EUs Oct. 15-16 summit will evaluate the progress. Sterling is on the rise meanwhile, but even if a deal is struck, the ebb and flow of Britains new relationship with the EU may continue to hold markets hostage.-UK sees 66% chance of Brexit trade deal but tells EU to hurry up -GRAPHIC-Options signal relief for pound as Brexit deal heaves into view4/SECOND WINDChina returns to work on Monday after a week of rest and, hopefully, recreation.Policymakers and investors will have fresh trade and credit data to weigh up in coming days. But they will also scour railway bookings, box office sales and petrol usage to gauge how consumers spent during vacation. With consumption is still a soft spot in an otherwise remarkable post-COVID rebound, a spending leap could offer a second wind for the economy.One early indicator might be traffic. Back at last years levels for the first time since the outbreak, its a hint that Chinese travellers are out and about, but preferring private transport.-Luxury brands bank on a raring China market as pandemic lays waste to global demand -Sick of staying home: China expects a Golden Week tourism rebound5/VIRTUAL IMFEach year, up to 10,000 policymakers, business people, NGOs and journalists congregate in downtown Washington for the semi-annual IMF/World Bank shindigs. This year, meetings are virtual but there is still pressing business at hand.More than 100 countries have requested IMF help; demand for support could reach $100 billion. One issue is a possible extension of the G20s Debt Service Suspension Initiative (DSSI) for poor countries. Extending that by six months would provide another $6.4 billion of relief, rising to $11.4 billion if it runs to end-2021.But amid warnings 100 million people could fall into extreme poverty, World Bank President David Malpass wants banks and investors to also provide relief to DSSI countries. He may face opposition, with many arguing of defaults that could bar countries from borrowing for years to come.-G7 ministers back extension of debt freeze for poorest nations, urge reforms -Poorest countries face tough choice over G20 debt relief plan"}