{"text": "(Repeats item issued earlier, with no change to text)Aug 11 The coronavirus pandemic dealt a relatively modest $2.5 billion blow to five insurers with large U.S. operations in the second quarter - a cost that was far less than feared and which the industry has absorbed without touching capital, analysts said.American International Group Inc and Chubb Ltd said payouts on claims related to the disease accounted for most of their financial hit, which was mostly on property and casualty policies.Others including Travelers Companies Inc, MetLife Inc and Prudential Financial Inc lost money on their private equity investments due to market declines in the first quarter, which are reported on a three-month lag. Those losses are expected to reverse, since the market has recovered.Insurers had sounded alarms about potentially crippling payouts if they were required to pay claims related to coronavirus on business-interruption policies.Those payouts could still happen, depending on the outcome of litigation. Two cases have so far been decided in insurers favor.It may still be too early to say insurers are not at risk of major claims from the coronavirus and a related respiratory disease, COVID-19, said Piper Sandler analyst Paul Newsome.We still dont know what the extent of COVID claims will be in the third quarter, he said.But insurers now have better predictions about COVID-related mortality and are well-capitalized, said Andrew Kligerman, analyst at Credit Suisse. The industry is positioned to see some growth if and when we can pull through COVID, he said.Here are details of coronavirus-related impacts on the insurers and their outlooks for the rest of 2020:CHUBBChubb tallied $1.16 billion in after-tax coronavirus-related reported and unreported claims, which contributed to a net loss of $331 million for the quarter. The company is based in Zurich, but has a significant presence in the United States.Net premiums written fell by $191 million, mainly from workers compensation and commercial casualty payments, including refunds on auto policies. Chubb said its investment income also fell by an undisclosed amount.The company expects full-year premium revenue to increase, Chief Executive Evan Greenberg said on a conference call.AIGAIG's general insurance business reported $458 million worth of claims and expected claims related to the pandemic in the second quarter, in line with its expectations. So far this year, its tally here of such costs is $730 million.AIG did not break out the impact on its life and retirement business, but said losses on private equity investments, yield compression and higher mortality rates drove a decline in adjusted pre-tax profit for that unit during the quarter.AIG is already seeing signs that the second quarter was a low watermark for sales, Chief Executive Brian Duperreault said.PRUDENTIALPrudential did not detail coronavirus effects specifically, but said its group insurance, retirement and individual life businesses were affected in positive and negative ways. Prudential also recorded $2.7 billion in investment losses, but did not say how much related to coronavirus.The company said it could experience a $70 million earnings decline for every additional 100,000 pandemic fatalities in the United States. Prudential anticipates about $60 million in costs in the second half related to the disease, which will be offset by about $30 million in benefits, such as lower travel and entertainment expenses.TRAVELERSThe pandemic and its effect on the economy resulted in $114 million in direct losses, with the largest impact in workers compensation coverage, Travelers said. Its portfolio of non-fixed income investments lost $234 million before tax due to the market decline in the first quarter, the results of which are reported a quarter later, the insurer said.We expect to experience the impacts of economic disruption on revenue in coming quarters, Chief Financial Officer Dan Frey said on a conference call, though the duration and intensity of the impact remain unclear. On investments, while markets have recovered, fund managers may not be as quick to write back up the valuations they just marked down, he added.METLIFEMetLife lost $555 million on its private-equity investments because of first-quarter value declines. But its core businesses experienced few effects from the pandemic, with gains on some areas being offset by others, Chief Financial Officer John McCallion told Reuters.He predicted a strong recovery in investment income this quarter, and a mid-single-digit return on its private equity portfolio, which was valued at $7.2 billion on June 30. (Reporting by Alwyn Scott Editing by Lauren Tara LaCapra and Richard Pullin)"}