{"text": "(Repeats MARCH 11 story. No change to text.)LONDON, March 12 Investors are piling into Europes energy-and-financials-heavy stock markets, yet dividend expectations remain far gloomier than in the United States, with payouts seen well below pre-pandemic levels for years to come.European markets are benefiting from investors rotating into reflation oriented sectors and cheaply-priced value plays, many of which are good at returning cash to shareholders.Indeed, many companies, including Standard Chartered , Barclays and Volkswagen have restored dividends as markets stabilised and regulators eased the curbs imposed at the height of the pandemic.But dividend expectations remain downbeat. Financial data provider IHS Markit forecasts European dividends will be 10% below 2019 levels next year. But it expects U.S. payouts back at pre-pandemic levels by the end of 2021.Refinitive I/B/E/S estimates peg European dividends at $269 billion in the next 12 months, compared with the $310 billion paid in the year to March 2020. U.S. companies, meanwhile, are seen paying out $510 billion in the next 12 months, approaching the year-ago record of $524 billion.Dividends are always caught in the middle, said Grace Peters, investment strategist at J.P. Morgan Private Bank.People are either chasing strong value stocks or longer-term growth stocks. This is typical early in the economic cycle ... well see more interest in dividends in the latter part of the cycle.Companies payouts to shareholders globally plunged more than 10% on an underlying basis in 2020, but European dividends - not counting Britain - fell by a quarter, Janus Hendersons Global Dividend Index shows.Derivatives pricing is even more pessimistic than that of analysts. Dividend futures, which allow investors to take a position on future payouts, show European dividends as far out as 2028 at 10% below pre-pandemic levels.Some analysts dismiss such futures pricing as overly conservative, possibly because of thin liquidity. They note futures see U.S. dividends flat to slightly lower at current levels even out to 2030.Markets tend to get very gloomy on the dividend outlook. For two-three years after the 2009 financial crisis, futures were implying continued cuts in dividends, said Kiran Ganesh, head of multi asset at UBS Global Wealth Management."}