{"text": "WASHINGTON U.S. Senator Marco Rubio on Friday became the first high-profile Republican lawmaker to support a growing push to unionize Amazon.com Inc workers in Alabama, after several Democratic lawmakers visited the companys facility last week.In an opinion piece in USA Today, Rubio wrote that Amazon has waged a war against working-class values and is looking to crush the union vote in Bessemer, Alabama.Heres my standard: When the conflict is between working Americans and a company whose leadership has decided to wage culture war against working-class values, the choice is easy  I support the workers. And thats why I stand with those at Amazons Bessemer warehouse today.Rubios backing is noteworthy as Republicans traditionally favor businesses and investors looking to squelch unionizing efforts.Amazon workers at the Alabama facility began voting by mail in February on whether to join the Retail, Wholesale and Department Store Union (RWDSU) and become the first group of U.S. Amazon employees to unionize. The unions President Stuart Appelbaum welcomed the support from Rubio and said this fight should not be a partisan issue.President Joe Biden also recently expressed support for the Amazon warehouse employees and defended workers rights to form unions.Last week, Democratic U.S. Representatives Andy Levin, Jamaal Bowman, Cori Bush, Terri Sewell and Nikema Williams visited the facility and met workers and organizers.An Amazon spokesperson said when Senator Rubio says Amazon is waging war on working class values, does he mean our $15 starting wage, comprehensive benefits, or the paid parental leave we provide for hourly workers?.Rubios column did not address Amazons wages or benefits. It said Amazon uses anticompetitive strategies to crush small businesses, bans conservative books and blocks traditional charities from participating in its AmazonSmile program.Amazon offers $15 an hour minimum wage to its workers and has continued to advocate for the federal minimum wage to be raised to that level.Rubio has clashed with Amazon before, as part of a group of conservative lawmakers who wrote to the online retailer in February after it stopped selling a book that Amazon said framed transgender and other sexual identities as mental illnesses.The pressure on Amazon has also continued to mount from other areas in Washington.On Friday, Senator Bernie Sanders invited Amazon founder Jeff Bezos, the worlds richest person, to appear before his Senate Budget panel for a hearing on income and wealth inequality.The Amazon spokesperson said Jeff is unable to attend the hearing but that the company supports the senators efforts to reduce income inequality."}