{"text": "MOSCOW Russia tapped the global debt market on Thursday for the first time this year by opening order books on two sovereign euro-denominated Eurobonds in a bid to secure additional funding, two financial market sources said.Moscow has been seeking additional sources of funding to make up for a budget shortfall caused by lower oil prices and the coronavirus pandemic, with plans to increase its public debt to nearly 19% of gross domestic product this year.The country is placing 750 million euros ($885.60 million) in a seven-year euro-denominated Eurobond, setting its final yield guidance at around 1.125%, the sources said. The guidance had initially been set at 1.25%.The other issue, a 12-year Eurobond, is 1.25 billion roubles and has a final yield guidance of 1.85% after sources initially said it would be around 2%.The finance ministry usually issues comments after the Eurobond placement is completed.Bids for the Eurobonds exceeded 2.7 billion euros ($3.2 billion), one of the sources said, with the bulk of the interest coming from domestic investors.The issue is very attractive, especially if you look at relative pricing guide, said Sergey Dergachev of Union Investment. Russia is a rare issuer compared to other countries... and euro-issuance out of Russia has become very illiquid a few weeks after issuance, so you get some liquidity premia.Demand for Russias sovereign issue, organised by state-run banks VTB Capital, Gazprombank and Sberbank CIB, could be limited by U.S. sanctions.In 2019, Washington imposed restrictions for U.S. banks on buying sovereign Eurobonds directly from Russia but they do not restrict the buying of Russian Eurobonds on the secondary market and do not apply to other banks.For us, one of the main things we focus on is liquidity ... Given a big portion of investors out of the U.S. wont be able to trade or invest, I would be concerned, Alejandro Arevalo, fund manager with Jupiter Asset Management, said.As of Oct. 1, foreign investors held 57.5% of Russian Eurobonds, according to the central bank.Russias Eurobond issue is designed more to remind investors of its presence on the global debt market rather than just to plug holes in its budget, because it has been borrowing heavily at home.On Wednesday, Russia borrowed more than $4 billion in rouble treasury bonds, fulfilling the governments fourth-quarter borrowing plan of 2 trillion roubles ($25.82 billion).Russia last tapped the global debt market in 2019, when it made two Eurobond issues in which it raised $5.5 billion and another 750 million euros.Its previous plans to raise $3 billion in Eurobonds this year were thwarted by the COVID-19 pandemic and by increased risks of Western sanctions, prompting Moscow to focus on borrowing at home instead."}