{"text": "MOSCOW Russia said on Wednesday the first batch of the worlds first COVID-19 vaccine would be rolled out within two weeks and rejected as groundless safety concerns aired by some experts over Moscows rapid approval of the drug.The vaccine, called Sputnik V in homage to the worlds first satellite launched by the Soviet Union in 1957, has yet to complete its final trials and some scientists said they feared Moscow may be putting national prestige before safety.It seems our foreign colleagues are sensing the specific competitive advantages of the Russian drug and are trying to express opinions that in our opinion are completely groundless, Health Minister Mikhail Murashko said the day after President Vladimir Putin announced it had won regulatory approval.On the streets of Moscow, some Russians said they would be too scared to try the vaccine, while others agreed with their government that scepticism expressed by foreign experts was driven by jealousy.I dont trust Russian vaccines in general, I definitely wont get vaccinated, said Ekaterina Sabadash, 36, speaking outside Moscows Bolshoi Theatre.Alexander, a photographer, was also wary. Until it goes through (final) clinical trials and we get some confirmed results, I would be scared to get it done, he said.Others said they understood why Russia was in a hurry to get a new vaccine and trusted it, but doubted they would really have a say in whether to have it.Im a teacher and theyll recommend we get it, said Irina Fashchevskaya, a Moscow resident. Well be forced to do it.Officials have said that the vaccine, developed by Moscows Gamaleya Institute, would be administered to people, including doctors, on a voluntary basis in the final trial. Mass roll-out in Russia is expected to start in October.Scientists from Germany the United States and Britain have queried the wisdom of approving the vaccine before testing is complete, saying it was risky from a safety point of view.Kirill Dmitriev, head of Russias RDIF sovereign wealth fund, has spoken of an information war against his country, an assertion that finds sympathy with Russians weary of what they regard as years of Western condescension.Mikhail Mechyov, a 42-year-old Moscow resident, said he saw jealousy behind Western warnings.Its natural to be cautious, but they are aimed at belittling the achievement of our country, he said. I think a lot has been done and its great there is a vaccine.RUSSIAN WARNINGThe Moscow-based Association of Clinical Trials Organizations (ACTO), a trade body representing the worlds top drugmakers in Russia, had urged the health ministry to postpone the vaccines approval until the final trial had been completed.Its the ambition, the desire to be first in a field in which, unfortunately, Russia cannot vie for a top spot, executive director Svetlana Zavidova told Reuters.Our task is now to warn the population because we so far dont understand how they (the authorities) are going to carry out mass vaccination.Final trials, normally carried out on thousands of participants, are considered essential in determining safety and efficacy. Only about 10% of clinical trials are successful.The Philippines and Kazakhstan have expressed interest in the vaccine, while a senior World Health Organization says it has not received enough information to evaluate it.Roman, a taxi driver in the Vladimir region, invoked a conspiracy theory to explain why he would be avoiding it.Its all about a global plan to put microchips into people being pushed by Bill Gates. I have zero trust, he said.Heidi Larson, who leads the Vaccine Confidence Project (VCP), a global surveillance programme on vaccine trust, said she feared Russias rush could further dent public trust.A survey in 19 countries, carried out by VCP and Business Partners to CONVINCE, a U.S./UK initiative that is partly government funded, is set to show that Russians were the least trusting of vaccines.Putin, who said the vaccine had already been administered to one of his daughters without any problems, and a string of other officials have insisted it is safe."}