{"text": "MOSCOW Russia said on Friday it would be ready to sever ties with the European Union if the bloc hit it with painful economic sanctions, a statement that Germany described as disconcerting and incomprehensible.Ties between Russia and the West, already at post-Cold War lows, have come under renewed pressure over the arrest and jailing of Kremlin critic Alexei Navalny.Three European diplomats told Reuters on Thursday the EU was likely to impose travel bans and asset freezes on allies of Russian President Vladimir Putin, possibly as soon as this month.Pressure for sanctions has grown since Moscow infuriated European countries last week by expelling German, Polish and Swedish diplomats without telling the EUs foreign policy chief, who was in Moscow for a visit. Paris and Berlin say there must be a response.Russian Foreign Minister Sergei Lavrov was asked in an interview published on the ministrys website on Friday whether Moscow was moving towards cutting ties with the EU.We proceed from the fact that were ready (for that). In the event that we again see sanctions imposed in some sectors that create risks for our economy, including in the most sensitive spheres, Lavrov said.We dont want to isolate ourselves from global life, but we have to be ready for that. If you want peace then prepare for war.A German Foreign Ministry spokeswoman said these statements are really disconcerting and incomprehensible.The Kremlin offered a softer interpretation of Lavrovs words later on Friday. It said Russia wanted to develop ties with EU rather than sever them, but that Moscow felt it had to be ready for Brussels to take steps to cut ties.If the EU goes down that path then yes, we should be ready, because you have to be ready for the worst, Kremlin spokesman Dmitry Peskov told reporters on a conference call.Of course, if we encounter an extremely destructive line that damages our infrastructure and our interests, then of course Russia has to be ready in advance for those kinds of unfriendly steps.The foreign ministry later said Moscow would be prepared to cut ties if Brussels initiated such a break, the RIA news agency reported."}