{"text": "* KOSPI rises, foreigners net buyers* Korean won strengthens against U.S. dollar* South Korea benchmark bond yield rises* For the midday report, please clickSEOUL, Oct 12 Round-up of South Korean financial markets:** South Korean shares rose for an eighth straight day on Monday, as U.S. stimulus hopes boosted investor sentiment. The won climbed to its highest close since April 2019, and the benchmark bond yield also rose.** The benchmark KOSPI ended up 11.77 points, or 0.49%, at 2,403.73, the highest close since Sept. 18.** The Trump administration on Sunday called on Congress to pass a stripped-down coronavirus relief bill, as negotiations on a broader package ran into resistance.** Chip giants Samsung Electronics and SK Hynix led the gains, jumping 1.2% and 3.1%, respectively.** Celltrion soared 4.4% after the company received regulatory approval for late-stage clinical trials of an experimental COVID-19 treatment.** The nations exports for Oct. 1-10 plunged near 30%, as fewer working days due to holidays outweighed strong chip demand.** The countrys central bank is expected to keep interest rates on hold on Wednesday as its concerns over rising household debt and property prices would most likely put a bar on any policy changes.** Foreigners were net buyers of 138.0 billion won ($120.31 million) worth of shares on the main board.** The won ended trading at 1,146.8 per dollar on the onshore settlement platform, 0.57% higher than its previous close at 1,153.3, after hitting the strongest level since April 24, 2019.** In offshore trading, the won was quoted at 1,147.1 per dollar, down 0.3% from the previous day, while in non-deliverable forward trading its one-month contract was quoted at 1,147.1.** MSCIs broadest index of Asia-Pacific shares outside Japan was up 0.33%.** In money and debt markets, December futures on three-year treasury bonds fell 0.07 points to 111.76.** The most liquid 3-year Korean treasury bond yield rose by 1.8 basis points to 0.925%. ($1 = 1,147.0100 won) (Reporting by Joori Roh; Editing by Aditya Soni)"}