{"text": "* KOSPI falls, foreigners net sellers* Korean won weakens against U.S. dollar* South Korea benchmark bond yield risesSEOUL, Aug 12 Round-up of South Korean financial markets:** South Korean shares snapped a seven-session rally on Wednesday, tracking overnight Wall Street losses due to uncertainties about a U.S. stimulus deal, while improving unemployment data capped the fall. The Korean won weakened, while the benchmark bond yield rose. ** By 0224 GMT, the benchmark KOSPI fell 6.40 points, or 0.26%, to 2,412.27. The index had closed up 1.35% at its highest close since June 14, 2018 on Tuesday. ** Foreigners were net sellers of 128.6 billion won ($108.46 million) worth of shares on the main board.** Local shares are undergoing a technical correction, following a dip in Wall Street, mainly as investors are taking profits, says Seo Sang-young, an analyst at Kiwoom Securities. ** U.S. stocks closed lower on Tuesday, with the S&P 500 and Dow snapping a seven-day winning streak and falling late in the session on growing uncertainty about a stalemate in Washington over a fiscal stimulus deal.** S.Koreas July unemployement rate fell for a second month to 4.2% as business sentiment improved from the fallout of the coronavirus crisis.** Shares of Samsung Electronics fell 0.52%, while that for Hyundai Motors dropped 1.96%. Shares of Celltrion declined 2.3%. ** The won was quoted at 1,185.7 per dollar on the onshore settlement platform, 0.01% lower than its previous close at 1,185.6. ** In offshore trading, the won was quoted at 1,186.3 per dollar, down 0.1% from the previous day, while in non-deliverable forward trading its one-month contract was quoted at 1,185.8. ** MSCIs broadest index of Asia-Pacific shares outside Japan was down 0.92%,. ** The KOSPI has risen 9.76% so far this year, and/but gained 14.7% in the previous 30 trading sessions. ** The won has lost 2.5% against the dollar so far this year. ($1 = 1,185.7000 won) (Reporting by Cynthia Kim and Jihoon Lee; Editing by Rashmi Aich)"}