{"text": "* KOSPI falls, foreigners net sellers* Korean won weakens against U.S. dollar* South Korea benchmark bond yield risesSEOUL, Jan 12 Round-up of South Korean financial markets: ** South Korean shares fell on Tuesday, tracking Wall Street losses, as investors worried equities may be running too hot and weighed the possibility of tapering by the Federal Reserve. The Korean won weakened, while the benchmark bond yield rose.** By 0132 GMT, the benchmark KOSPI fell 13.92 points, or 0.44%, to 3,134.53.** The KOSPI has risen 9.09% so far this year, and gained 21.0% in the previous 30 trading sessions.** Foreigners were net sellers of 445.6 billion won ($405.21 million) worth of shares on the main board. ** There is some profit-taking as investors began to debate whether higher interest rates in the United States could jeopardize the current environment of easy financial conditions, said Seo Sang-young, an analyst at Kiwoom Securities.** Dallas Federal Reserve President Robert Kaplan on Monday said he expects broad distribution of coronavirus vaccines to unleash strong economic growth later this year, allowing the U.S. central bank to begin to pull back on some of its extraordinary monetary support.** Shares of Samsung Electronics fell 0.88%, while mobile app operator Kakao lost 0.7%.** The won was quoted at 1,099.4 per dollar on the onshore settlement platform, 0.19% lower than its previous close at 1,097.3. ** In offshore trading, the won was quoted at 1,099.4 per dollar, down 0.2% from the previous day, while in non-deliverable forward trading its one-month contract was quoted at 1,098.7. ** MSCIs broadest index of Asia-Pacific shares outside Japan was down 0.45%. ** The trading volume during the session in the KOSPI index was 576.15 million shares. Of the total traded issues of 904, the number of advancing shares was 449. ** The won has lost 1.2% against the dollar so far this year. ** In money and debt markets, March futures on three-year treasury bonds fell 0.06 points to 111.53. ** The most liquid 3-year Korean treasury bond yield rose by 1.3 basis points to 0.983%, while the benchmark 10-year yield rose by 2.7 basis points to 1.720%. (Reporting by Cynthia Kim; Additional reporting by Jihoon Lee; Editing by Ramakrishnan M.)"}