{"text": "* KOSPI down 2% for day, foreigners net sellers* Korean won falls most since early May* South Korea benchmark bond yield rises* For the midday report, please clickSEOUL, June 12 Round-up of South Korean financial markets: ** South Korean stocks fell 2% on Friday, posting their biggest weekly decline since mid-March, after Wall Street shares dived overnight on renewed fears of a second wave of coronavirus infections. The Korean won weakened, while the benchmark bond yield rose. ** As of 06:30 GMT, the Seoul stock markets main KOSPI fell 44.48 points, or 2.04%, to 2,132.30. For the week, it lost 2.27%, the biggest since an 11.6% drop in the week to March 20. ** There are concerns about a second wave (of COVID-19 infections in the United States). Because its still a concern and not a fact just yet, the momentum for an upturn could come back after a couple of days of losses, said Noh Dong-kil, an analyst at NH Investment & Securities.** Samsung Electronics Co fell 3.68% and SK Hynix dropped 3.73%, while Samsung Biologics jumped 7.76%.** About half a dozen U.S. states, including Texas and Arizona, are grappling with a rising number of coronavirus patients filling hospital beds, fanning concerns that the reopening of the economy may spark a second wave of infections.** The S&P 500 slumped 5.9% in its steepest one-session loss since March 16 on Thursday. Investors also reacted to dour economic forecasts from the Federal Reserve.** Foreigners were net sellers of 265.5 billion won worth of shares on the main board. ** The won was quoted at 1,203.8 per dollar on the onshore settlement platform, 0.61% lower than its previous close at 1,196.4 and marking the sharpest daily loss since early May. ** In money and debt markets, June futures on three-year treasury bonds fell 0.01 point to 112.08, while the 3-month Certificate of Deposit rate was quoted at 0.79% in late afternoon trade. ** The most liquid 3-year Korean treasury bond yield rose by 0.4 basis point to 0.841%, while the benchmark 10-year yield rose by 0.7 basis point to 1.388%. (Reporting by Cynthia Kim, Jihoon Lee; Editing by Subhranshu Sahu)"}