{"text": "    * KOSPI falls, foreigners net sellers\n    * Korean won weakens versus U.S. dollar\n    * South Korea benchmark bond yield falls\n\n    SEOUL, June 12 Round-up of South Korean\nfinancial markets:\n \n** South Korean shares were on track to post their first weekly\ndrop in a month as they slumped on Friday, tracking a rout on\nWall Street on renewed fears of a second wave of coronavirus\ninfections. The Korean won weakened, while the benchmark bond\nyield fell.\n    \n** As of 01:40 GMT, the Seoul stock market's main KOSPI        \nfell 58.50 points, or 2.69%, to 2,118.28. The index was poised\nto snap three consecutive weekly gains, down 2.91% so far in the\nweek.\n    \n** \"Worries of a second U.S. virus wave are hitting shares after\nan overnight U.S. slump,\" said Na Jeong-hwan, an analyst at DS\nInvestment & Securities.\n \n** \"Pharmaceutical, bio and software shares, which are seen to\nbenefit from the outbreak, are defending the overall drop. The\nfall today is likely to be a temporary dip.\"\n        \n** Samsung Electronics Co             fell 3.87% and SK Hynix\ndropped 3.95%, while Samsung Biologics             jumped 6.16%.\n\n** About half a dozen U.S. states, including Texas and Arizona,\nare grappling with a rising number of coronavirus patients\nfilling hospital beds, fanning concerns that the reopening of\nthe economy may spark a second wave of infections.              \n    \n** The S&P 500 slumped 5.9% in its steepest one-session loss\nsince March 16 on Thursday. Investors also reacted to dour\neconomic forecasts from the Federal Reserve.                    \n \n \n** Foreigners were net sellers of 208.1 billion won worth of\nSouth Korean shares on the main board on Friday. \n \n** The won was quoted at 1,207.7 per dollar on the onshore\nsettlement platform           , 0.94% lower than its previous\nclose at 1,196.4.\n \n** MSCI's broadest index of Asia-Pacific shares outside Japan\n                was down 1.77%. Japanese stocks         fell\n1.94%. \n \n** In money and debt markets, June futures on three-year\ntreasury bonds         rose 0.03 point to 112.12, while the\n3-month Certificate of Deposit rate was quoted at 0.79%.\n \n** The most liquid 3-year Korean treasury bond yield fell by 0.1\nbasis point to 0.836%, while the benchmark 10-year yield fell by\n2.3 basis points to 1.358%.\n\n (Reporting by Cynthia Kim, Jihoon Lee; Editing by Subhranshu\nSahu)\n  "}