{"text": "* KOSPI falls, foreigners net buyers* Korean won weakens against U.S. dollar* South Korea benchmark bond yield falls* For the midday report, please clickSEOUL, Nov 12 Round-up of South Korean financial markets:** South Korean shares snapped an eight-session rally to end lower on Thursday, as the initial euphoria around a potential coronavirus vaccine started to fade, denting investor sentiment. The Korean won and the benchmark bond yield also fell.** The benchmark KOSPI fell 10.25 points, or 0.41%, to close at 2,475.62, reversing a 1.35% gain in the previous session.** Recent rally added pressure on KOSPI. Though the coronavirus vaccine is a good news, the time lag for commercialisation and production as well as surging infections in Europe and the United States is worrisome, said Daishin Securitis analyst Lee Kyoung-min.** Work to distribute the experimental COVID-19 vaccine developed by Pfizer Inc and BioNTech SE is gearing up after the companies announced successful interim data on Monday, but it will not be coming to local pharmacies for the general public any time soon.** Foreigners were net buyers for a sixth straight session, purchasing 485.6 billion won ($435.66 million) worth of share, the longest buying streak since mid-January. They have bagged a total 3.75 trillion won worth shares for the past six days.** The won ended at 1,114.8 per dollar on the onshore settlement platform, 0.43% lower than its previous close at 1,110.0.** In offshore trading, the won was quoted at 1,114.7, down 0.2% from the previous day, while in non-deliverable forward trading its one-month contract was quoted at 1,114.9.** In money and debt markets, December futures on three-year treasury bonds rose 0.10 points to 111.63, while the 3-month Certificate of Deposit rate was quoted at 0.66% in late afternoon trade.** The most liquid 3-year Korean treasury bond yield fell by 2.3 basis points to 0.966%, while the benchmark 10-year yield fell by 1.4 basis points to 1.644%. ($1 = 1,114.6400 won) (Reporting by Joori Roh; Additional reporting by Jihoon Lee; Editing by Rashmi Aich)"}