{"text": "* KOSPI rises, foreigners net buyers* Korean won strengthens against U.S. dollar* South Korea benchmark bond yield falls* For the midday report, please clickSEOUL, July 12 Round-up of South Korean financial markets:** South Korean shares posted their biggest daily rise in nearly two months on Monday, tracking Wall Streets record closing highs, though gains were capped by spiking COVID-19 cases and caution ahead of U.S. inflation data due this week.** The won strengthened, while the benchmark bond yield fell.** The benchmark KOSPI ended 28.52 points, or 0.89%, higher at 3,246.47, logging the sharpest gain since May 18 and rebounding from a 1.07% decline on Friday.** Among heavyweights, technology giant Samsung Electronics rose 0.38%, while peer SK Hynix added 0.42%. Battery maker LG Chem and internet giant Naver gained 0.72% and 1.92%, respectively.** Foreigners were net buyers of 35.9 billion won ($31.39 million) worth of shares on the main board.** South Koreas toughest anti-COVID-19 curbs took effect in Seoul to quell its worst-ever outbreak, with the country reporting 1,100 new cases for Sunday.** The outlook for U.S. inflation and the speed of the Federal Reserves future policy tightening are back in focus ahead of Tuesdays consumer price data and Fed Chairman Jerome Powells testimony from Wednesday.** Meanwhile, South Korean exports for the first 10 days of July rose 14.1% year-on-year, according to customs agency data, which slowed from a 40.8% surge in the June 1-10 period.** The won ended at 1,147.0 per dollar on the onshore settlement platform, 0.18% higher than its previous close at 1,149.1.** In offshore trading, the won was quoted at 1,145.7, while in non-deliverable forward trading its one-month contract was quoted at 1,146.5.** In money and debt markets, September futures on three-year treasury bonds rose 0.02 point to 110.34.** The benchmark 10-year yield fell by 0.8 basis point to 2.024%. ($1 = 1,143.7300 won) (Reporting by Joori Roh; Editing by Subhranshu Sahu)"}