{"text": "* KOSPI falls, foreigners net buyers* Korean won weakens against U.S. dollar* South Korea benchmark bond yield fallsSEOUL, Nov 12 Round-up of South Korean financial markets:** South Korean shares fell on Thursday as the initial euphoria around a potential coronavirus vaccine started to fade as investors realise obstacles remain before the drug can be commercialized. The won and the benchmark bond yield weakened.** By 0117 GMT, the benchmark KOSPI was down 4.58 points, or 0.18%, at 2,481.29, having closed at a 2-1/2-year high on Wednesday following upbeat trade data and hopes of a vaccine.** Work to distribute the experimental COVID-19 vaccine developed by Pfizer Inc and BioNTech SE is gearing up after the companies announced successful interim data earlier on Monday, but it will not be coming to local pharmacies for the general public any time soon.** Local shares are undergoing technical corrections after highs touched this week as many investors are realizing that it may take longer than a few months for vaccines to be commercialized, said Na Jeong-hwan, an analyst at DS Investment & Securities.** Shares of Samsung Electronics declined 0.33% and LG Electronics fell 0.35%. ** Foreigners were net buyers of 6.5 billion won worth of shares on the main board. ** The won was quoted at 1,112.0 per dollar on the onshore settlement platform, 0.18% lower than its previous close at 1,110.0. ** MSCIs broadest index of Asia-Pacific shares outside Japan was up 0.23%. ** The KOSPI rose 12.91% so far this year, and gained 9.4% in the previous 30 trading sessions. ** The trading volume during the session in the KOSPI index was 506.07 million shares. Of the total traded issues of 905, the number of advancing shares was 379. ** The won strengthened 4.0% against the dollar so far this year. ** In money and debt markets, December futures on three-year treasury bonds rose 0.06 points to 111.59. ** The most liquid 3-year Korean treasury bond yield fell by 0.9 basis points to 0.980%, while the benchmark 10-year yield dipped by 1.4 basis points to 1.644%. (Reporting by Cynthia Kim and Jihoon Lee; Editing by Sherry Jacob-Phillips)"}