{"text": "    * KOSPI rises, foreigners net buyers\n    * Korean won strengthens against U.S. dollar\n    * South Korea benchmark bond yield falls\n\n    SEOUL, March 12 Round-up of South Korean\nfinancial markets:\n    \n    ** South Korean shares jumped on Friday and were set for\ntheir biggest weekly jump in five, as easing worries about\ninflation, rising bond yields and final approval for $1.9\ntrillion U.S. stimulus bill lifted global risk appetite. The won\nstrengthened, while the benchmark bond yield fell.\n    \n    ** The benchmark KOSPI         soared 34.95 points, or\n1.16%, to 3,048.65 by 0207 GMT, after ending up 1.88% on\nThursday. It is set for a 0.8% gain for the week, its biggest\nrise in five weeks.\n    \n    ** Among the heavyweights, technology giant Samsung\nElectronics             rose 0.73% and peer SK Hynix            \njumped 2.19%, while LG Chem             and Naver            \nadded 1.17% and 1.74%, respectively.\n    \n    ** The U.S. House of Representatives gave final approval to\nPresident Joe Biden's COVID-19 relief bill, one of the largest\neconomic stimulus in American history, giving him a first major\nvictory in office.             \n    \n    ** The European Central Bank said on Thursday it would\naccelerate money-printing to keep a lid on euro zone borrowing\ncosts, signalling to sceptical markets that it is determined to\nlay the foundation for a solid economic recovery.             \n    \n    ** South Korea decided to extend social distancing rules\nwith a ban on private gatherings of more than four people even\nas it continues its vaccine roll-out.             \n    \n    ** Foreigners were net buyers of 164 billion won ($145.11\nmillion) worth of shares on the main board. \n    \n    ** The won was quoted at 1,129.4 per dollar on the onshore\nsettlement platform           , 0.58% higher than its previous\nclose at 1,135.9.\n    \n    ** In offshore trading, the won        was quoted at 1,130.2\nper dollar, unchanged from the previous day, while in\nnon-deliverable forward trading its one-month contract\n              was quoted at 1,130.0.\n    \n    ** The most liquid 3-year Korean treasury bond yield fell by\n1.3 basis points to 1.166%.\n\n($1 = 1,130.2000 won)\n\n (Reporting by Joori Roh; Editing by Rashmi Aich)\n  "}