{"text": "    * KOSPI falls 1%, foreigners net sellers\n    * Korean won weakens against U.S. dollar\n    * South Korea benchmark bond yield rises\n\n    SEOUL, May 12 Round-up of South Korean financial\nmarkets:\n    \n    ** South Korean shares fell 1% on Wednesday, as foreigners\ncontinued to sell on inflation worries ahead of U.S. consumer\nprice index data due later in the day. The won weakened, while\nthe benchmark bond yield rose.\n    \n    ** The benchmark KOSPI fell 32.26 points, or 1.01%, to\n3,177.17 as of 0231 GMT, extending losses to a second straight\nsession.\n    \n    ** Among the heavyweights, technology giant Samsung\nElectronics             fell 0.99% and peer SK Hynix            \nfell 1.22%, while LG Chem             fell 2.96% and Naver\n            fell 1.72%.\n    \n    ** Investors worry that faster inflation amid slow\nemployment recovery may lead to dampened consumption, said Seo\nSang-young, an analyst at Mirae Asset Securities. Foreigners are\nseen to sell mainly semiconductor shares, he added.\n    \n    ** Foreigners were net sellers of 1.1 trillion won ($1.01\nbillion) worth of shares on the main board after net selling the\nthird-biggest amount a day before.\n    \n    ** Meanwhile, South Korea's unemployment rate fell to an\neight-month low in April, while the number of people employed\nrose at the sharpest pace in nearly seven years as the economic\nrecovery continues.             \n    \n    ** The won was quoted at 1,122.5 per dollar on the onshore\nsettlement platform, 0.26% lower than its previous close at\n1,119.6.\n    \n    ** In offshore trading, the won was quoted at 1,122.1 per\ndollar, down 0.2% from the previous day, while in\nnon-deliverable forward trading its one-month contract was\nquoted at 1,122.2.\n    \n    ** In money and debt markets, June futures on three-year\ntreasury bonds fell 0.04 points to 110.91, \n    \n    ** The most liquid 3-year Korean treasury bond yield fell by\n0.1 basis points to 1.127%, while the benchmark 10-year yield\nrose by 1.7 basis points to 2.156%.\n\n($1 = 1,122.3100 won)\n\n (Reporting by Jihoon Lee; Editing by Rashmi Aich)\n  "}