{"text": "    * KOSPI rises, foreigners net sellers\n    * Korean won weakens against U.S. dollar\n    * South Korea benchmark bond yield falls\n\n    SEOUL, Aug 12 Round-up of South Korean financial\nmarkets:\n** South Korean shares treaded water on Thursday, as optimism\nover Wall Street's overnight gains was offset by worries over\nChina's regulatory crackdown and weakness in local chip stocks.\n      \n    \n** The benchmark KOSPI         rose 1.04 points, or 0.05%, to\n3,221.66 as of 0306 GMT. The Korean won weakened and the\nbenchmark bond yield also fell.\n    \n** Among the heavyweights, technology giant Samsung Electronics\n            fell 1.27% and peer SK Hynix             fell 3.79%\nand Naver             fell 0.56%. LG Chem             rose 2.7%.\n    \n** Foreign investors are selling Samsung Elec and SK Hynix as\nthey are increasingly worried about the sector's outlook, said\nPark Kwang-nam, an analyst at Mirae Asset Securities.\n\n** The regulatory storm that washed billions from Chinese\ncorporate valuations in the name of curbing excesses, exposes\nnot only the policy risk under President Xi Jinping's\nincreasingly activist tenure, but also the uncertainty over\nimplementation.             \n    \n** Keeping markets afloat, the Dow Jones Industrial Average and\nS&P 500 closed at record levels on Wednesday, as data indicated\nU.S. inflation growth may have peaked.     \n    \n** Foreigners were net sellers of 878.1 billion won worth of\nshares on the main board. \n    \n** The won was quoted at 1,159.1 per dollar on the onshore\nsettlement platform           , 0.23% lower than its previous\nclose at 1,156.4.\n    \n** In offshore trading, the won        was quoted at 1,158.8 per\ndollar, down 0.4% from the previous day, while in\nnon-deliverable forward trading its one-month contract\n              was quoted at 1,159.1.\n    \n** The KOSPI has risen 12.12% this year, but has lost 2.3% in\nthe previous 30 trading sessions.\n    \n** The won has lost 6.3% against the dollar this year.\n    \n** The most liquid 3-year Korean treasury bond yield rose by 0.7\nbasis points to 1.426%, while the benchmark 10-year yield fell\nby 0.9 basis points to 1.925%.\n\n (Reporting by Cynthia Kim, additional reporting by Jihoon Lee;\nEditing by Amy Caren Daniel)\n  "}