{"text": "    * KOSPI rises, foreigners net buyers\n    * Korean won strengthens against U.S. dollar\n    * South Korea benchmark bond yield falls\n\n    SEOUL, July 12 Round-up of South Korean\nfinancial markets:\n    \n    ** South Korean shares rose on Monday to be track for their\nbiggest jump in nearly eight weeks, although the gains were\ncapped by spiking COVID-19 cases and caution ahead of U.S.\ninflation data due later in the week. \n    \n    ** The won firmed, while the benchmark bond yield fell.\n    \n    ** The benchmark KOSPI         rose 28.56 points, or 0.89%,\nto 3,246.51 by 0220 GMT, rebounding from a 1.07% decline on\nFriday. It is set to post its biggest gain since May 18.\n    \n    ** Among the heavyweights, technology giant Samsung\nElectronics             rose 0.50% and peer SK Hynix            \nadded 1.26%. LG Chem             and Naver             climbed\n0.84% and 0.36%, respectively.\n    \n    ** Foreigners were net buyers of 10.4 billion won ($9.09\nmillion) worth of shares on the main board. \n    \n    ** South Korea's toughest anti-COVID-19 curbs took effect in\nSeoul on Monday to quell its worst-ever outbreak, with the\ncountry reporting 1,100 new cases for Sunday.             \n    \n    ** The outlook for U.S. inflation and the speed of the\nFederal Reserve's future policy tightening are back in focus\nahead of Tuesday's consumer price data and Fed Chair Jerome\nPowell's testimony from Wednesday.\n    \n    ** Meanwhile, South Korean exports for the first 10 days of\nJuly rose 14.1% year-on-year, according to customs agency data,\nwhich slowed from a 40.8% surge in the June 1-10 period.\n            \n\n    ** The won was quoted at 1,146.7 per dollar on the onshore\nsettlement platform           , up 0.21%.\n    \n    ** In offshore trading, the won        was quoted at\n1,145.9, while in non-deliverable forward trading its one-month\ncontract               was quoted at 1,145.8.\n    \n    ** In money and debt markets, September futures on\nthree-year treasury bonds         rose 0.05 point to 110.37.\n    \n    ** The most liquid 3-year Korean treasury bond yield fell by\n1.1 basis points to 1.364%.\n\n($1 = 1,143.7300 won)\n\n (Reporting by Joori Roh; editing by Uttaresh.V)\n  "}