{"text": "The S&P 500 and the Dow Jones indexes retreated from record levels on Monday, as investors geared up for the start of the corporate reporting season and a key inflation report later this week.A pullback in the benchmark 10-year bond yield  from 14-month highs in April eased worries about higher borrowing costs, helping richly valued technology stocks gain ground and drive the S&P 500 and the Dow to record levels.\"We are seeing a little bit of a reversal from last week where the tech sector was strong, the financials and energy were weak. Today we see the opposite, so it is profit taking,\" said Peter Cardillo, chief market economist at Spartan Capital Securities in New York.Among the 11 major S&P 500 sectors, technology (.SPLRCT)  and communication services shares (.SPLRCL) were the top decliners, after the Russell 1000 Growth index (.RLG) outperformed the Russell 1000 Value index (.RLV) for the last two consecutive weeks.U.S. consumer price data for March and $271 billion of U.S. Treasury auction this week could end a recent lull in the bond market, reigniting a rise in yields that worried investors in the first quarter.  read more Federal Reserve Chair Jerome Powell on Sunday said the U.S. economy is at an \"inflection point\" with expectations that growth will pick up speed in the months ahead, but also risks if a hasty reopening leads to a continued increase in coronavirus cases.  read more \"With all the macro things coming out and the bond auctions, a fight is brewing between the bond market and the Fed. The only thing that's going to come to the rescue is earnings and guidance. This first quarter is going to be compared to pre-pandemic time,\" Cardillo said.Goldman Sachs (GS.N), JPMorgan (JPM.N) and Wells Fargo (WFC.N) will kick off the first-quarter earnings season on Wednesday, giving investors a new catalyst to either buy or sell off stocks in a market at all-time highs.S&P 500 earnings are expected to have jumped 25% in the quarter from a year ago, according to Refinitiv IBES data, the biggest quarterly gain since 2018, when tax cuts under former President Donald Trump drove a surge in profit growth.At 11:55 a.m. ET, the Dow Jones Industrial Average (.DJI) was down 29.74 points, or 0.09%, at 33,770.86, the S&P 500 (.SPX) was down 4.59 points, or 0.11%, at 4,124.21 and the Nasdaq Composite (.IXIC) was down 75.02 points, or 0.54%, at 13,825.17.Tesla Inc (TSLA.O) rose 2.8% after Canaccord Genuity upgraded the electric-car maker's shares to \"buy\" and said the company could become \"the brand\" in energy storage. U.S. shares of Alibaba  jumped 9.1% after the ecommerce company said it does not expect any material impact from the antitrust crackdown in China that will push it to overhaul how it deals with merchants.  read more Shares of Nuance Communications Inc (NUAN.O) surged 16.7% as  Microsoft Corp (MSFT.O) said it will buy the artificial intelligence and speech technology company in a $19.7 billion deal.  read more Declining issues outnumbered advancers for a 1.15-to-1 ratio on the NYSE and a 2.01-to-1 ratio on the Nasdaq."}