{"text": "The S&P 500 (.SPX)\n                and Dow Jones industrial average (.DJI) dipped below record levels on Monday as investors paused ahead of the start of the corporate reporting season and a key inflation report later this week.Stocks sold off after strong gains in recent days that were driven by a pullback in the benchmark 10-year bond yield  from 14-month highs.\"We are seeing a little bit of a reversal from last week where the tech sector was strong, the financials and energy were weak. Today we see the opposite, so it is profit taking,\" said Peter Cardillo, chief market economist at Spartan Capital Securities in New York.Among the 11 major S&P 500 sector indexes, communication services (.SPLRCL) and energy (.SPNY) shares were the steepest decliners. The financials index (.SPSY) hit a record high ahead of big Wall Street names kicking off earnings season on Wednesday.Goldman Sachs (GS.N), JPMorgan (JPM.N) and Wells Fargo (WFC.N) will be the first to report first-quarter earnings, giving a new catalyst to either buy or sell off stocks in a record-high market. \"The optimism is improving now that these banks are going to return to normal, with buybacks and dividends, and because of the outlook for Treasury yields, they are going to have a better outlook going forward,\" said Ed Moya, senior market analyst at OANDA.Federal Reserve Chair Jerome Powell said on Sunday the U.S. economy was at an \"inflection point\" with expectations that growth will pick up speed in the months ahead, but he warned that a hasty reopening could lead to a continued increase in coronavirus cases.  read more U.S. consumer price data for March, due Tuesday, could drive Treasury yields higher.S&P 500 earnings are expected to have jumped 25% in the quarter from a year ago, according to Refinitiv IBES data. That would be the biggest quarterly gain since 2018, when tax cuts under former President Donald Trump boosted profit growth.The S&P 500 briefly broke above its record high set on Friday, before slipping into negative territory.At 1:50 p.m. ET, the Dow Jones Industrial Average (.DJI) fell 101.87 points, or 0.3%, to 33,698.73, the S&P 500 (.SPX) lost 5.03 points, or 0.12%, to 4,123.77 and the Nasdaq Composite (.IXIC) dropped 53.56 points, or 0.39%, to 13,846.62.Tesla Inc (TSLA.O) rose 3.3% after Canaccord Genuity upgraded the electric-car maker's shares to \"buy,\" saying the company could become \"the brand\" in energy storage. U.S. shares of Alibaba Group Holding Ltd (9988.HK)\n                 jumped 8.9% after the ecommerce company said it expected no material impact from China's antitrust crackdown that pushes it to overhaul how it deals with merchants.  read more Shares of Nuance Communications Inc (NUAN.O) surged 16.2% after Microsoft Corp (MSFT.O) said it would buy the artificial intelligence and speech technology company in a $19.7 billion deal.  read more Declining issues outnumbered advancing ones on the NYSE by a 1.26-to-1 ratio. On Nasdaq, a 2.03-to-1 ratio favored decliners.The S&P 500 posted 69 new 52-week highs and no new lows; the Nasdaq Composite recorded 80 new highs and 66 new lows."}