{"text": "The S&P 500 jumped on Wednesday but finished just short of its February record closing high, in a broad rally led by tech-related stocks.The index in afternoon trading briefly surpassed its record high closing level of 3,386.15 from Feb. 19, before the onset of the coronavirus crisis in the United States that caused one of Wall Streets most dramatic crashes in history.The index reached as high as 3,387.89. Its intraday record of 3,393.52 was also set on Feb. 19.The Nasdaq and Dow also rose sharply. The Nasdaq was the first of the three major indexes to bounce back to an all-time high in June. The Dow remains below its February peak.With a better-than-feared second-quarter earnings season largely over, investors are preparing for the risk of a closely contested U.S. presidential election in the fall.They also are awaiting news on stimulus talks. A breakdown in bipartisan talks over the next federal aid bill to help tens of millions of Americans suffering in the coronavirus pandemic entered a fifth day, with neither side ready to resume negotiations.Clearly the market has been outperforming the economy by a wide stretch recently. There may be a little bit of relief in that you now have basically two centrist candidates on the Democratic ticket, said David Kelly, chief global strategist at JPMorgan Asset Management.Democratic candidate Joe Biden on Tuesday picked Senator Kamala Harris as his choice for vice president.Data showed U.S. consumer prices increased more-than-expected in July, but high unemployment is likely to keep inflation under control, allowing the Federal Reserve to continue pumping money into the economy.Advancing issues outnumbered declining ones on the NYSE by a 1.70-to-1 ratio; on Nasdaq, a 1.34-to-1 ratio favored advancers.The S&P 500 posted 33 new 52-week highs and no new lows; the Nasdaq Composite recorded 80 new highs and 25 new lows.Volume on U.S. exchanges was 9.38 billion shares, compared with the 10.23 billion average for the full session over the last 20 trading days."}