{"text": "LONDON Saudi Arabias share of the oil market is set to rise this decade to its highest since the 1980s as investment in production elsewhere dries up in the wake of the coronavirus crisis, J.P. Morgan said in a report.Oil prices have plunged more than 40% this year after an unprecedented collapse in demand, prompting oil and gas companies to announce spending cuts that will total $625 billion by the end of the decade, according to the Wall Street bank.The investment crunch will lead to a loss of output that is set to push benchmark Brent oil prices to $60 a barrel within two years, J.P. Morgan analyst Christyan Malek told Reuters.(GRAPHIC - JPM oil supply and demand: )https://fingfx.thomsonreuters.com/gfx/ce/jznpnbakzpl/Pasted%20image%201591958372838.pngThe U.S. bank expects global oil demand to average 91 million barrels per day (bpd) in 2020, 9 million lower than earlier estimates, with consumption only recovering to pre-pandemic levels of 100 million bpd in November 2021.But changes in consumption patterns will lead to a permanent demand loss of 3 million bpd this decade compared with previous forecasts, J.P. Morgan forecasts.Oil supply, meanwhile, is set to fall by 5 million bpd due to a lack of investment in new output and the closure of some fields. With the lowest production costs and biggest capacity, Saudi Arabia is best placed to take up the slack, the bank said.Saudi Arabia will come out on top in the fight for market share as non-OPEC and U.S. production fades, Malek said.U.S. shale oil production, which grew sharply throughout the 2010s, will barely rise this decade, climbing only to 11 million bpd by 2030 from 10.9 million this year, the bank forecast.Before the slide in oil prices, shale output was expected to reach 17 million bpd by the end of this decade.As a result, J.P. Morgan expects members of the Organization of Petroleum Exporting countries (OPEC) to fill the supply gap, once oil prices reach $60 a barrel, which is the price OPEC countries need on average to balance their budgets.While OPECs market share fell from a peak of 39% of total oil supply in 2016 to 33% in 2020-21, the bank expects the group to regain a market share of about 40% by 2025.Saudi Arabias market share is set to grow from 11.6% in 2020 to 15% over the period, a level not seen since the 1980s, Malek said."}