{"text": "HOUSTON Tropical storm Sally strengthened off the west coast of Florida on Saturday and was poised to become a Category 1 hurricane, bringing high winds, heavy seas and flash flooding to the U.S. Gulf Coast, the National Hurricane Center said.Louisiana Governor John Bel Edwards declared a state of emergency and called on residents still recovering from the last storm and pandemic restrictions to prepare for the storm.Sally is expected to drop between 6 and 12 inches (15-30 cm) of rain along the central Gulf Coast and could cause flash flooding from Florida through Louisiana, NHC forecaster Richard Pasch said.The storm track was disrupting oil-production in the U.S. Gulf of Mexico for a second time in less than a month. An evening NHC forecast called for the storms maximum sustained winds to reach 85 miles per hour (137 kph) ahead of a Tuesday landfall.Tropical storm Sally is not projected to approach the size or intensity of Hurricane Laura in August, but it will cause up to 12-foot (4.2m) swells offshore, said Jim Foerster, chief meteorologist for DTN, an energy, agriculture and weather data provider.Laura rampaged across the Gulf of Mexico three weeks ago and grew into a Category 4 hurricane with 150 mph (240 kph) winds. It shut hundreds of offshore oil facilities, leveled coastal Louisiana towns and left residents of Louisiana and Texas without power for weeks.Oil companies evacuated staff from some offshore platforms on Saturday as Sally reached warm Gulf of Mexico waters. Winds were 40 miles per hour (65 kph), according to a midday measure.Chevron Corp and Murphy Oil Corp evacuated offshore production platforms, and Chevron was preparing to halt output at two, spokespeople said. Chevron said its Pascagoula, Mississippi, refinery is following storm preparedness procedures.Offshore oil producers Hess, BP, BHP and Occidental Petroleum said they were monitoring the storm and prepared to take actions. Laura halted up to 1.5 million barrels per day of output and a half dozen refineries, two of which are still in the process of making repairs.Further off in the Atlantic Ocean is tropical storm Paulette, which is expected to become a hurricane on Saturday night as it approaches Bermuda, and behind it are storm Rene and tropical depression 20."}