{"text": "WILMINGTON, Del. U.S. law enforcement agencies securing Joe Bidens Jan. 20 presidential inauguration swearing-in ceremony dramatically scaled up their budgets following the Capitol riot last week, according to a person involved with the planning.The Secret Service-led effort to fortify the quadrennial event will create a more solemn production on the steps of a Capitol building that was the scene of a bloody siege by supporters of outgoing President Donald Trump, the person said.Far fewer people than usual will attend the ceremony, which already had been scaled back due to the COVID-19 pandemic and now also will have a bulked-up security detail, he said.Bidens allies have been on edge about the security protocols after Trump supporters challenging the congressional certification of Bidens election victory stormed the building last Wednesday.The riot sent lawmakers into hiding and left five people dead, including a Capitol Police officer. Dozens of people have been charged in the violence and hundreds more cases are expected.Though the president-elects inaugural committee does not shoulder the burden of securing the event, it also bolstered its own fundraising efforts in recent days should there be a need for more support staff, contractors, equipment or supplemental private security.Based on what we saw last week that is priority No. 1, and were not taking it lightly, the person involved with the planning said. Were trying to raise as much as we can.Democrats on Monday introduced an article of impeachment accusing the Republican Trump of inciting insurrection after urging supporters to fight the election result.The FBI has warned of armed protests being planned for Washington ahead of the event, a federal law enforcement source said. The National Guard prepared to send up to 15,000 troops to Washington, and the Secret Service said it would begin its special security arrangements almost a week earlier than originally planned.We are confident in our security partners who have spent months planning and preparing for the inauguration, and we are continuing to work with them to ensure the utmost safety and security, a senior inauguration committee official said.NOT AFRAIDThe stringent procedures for securing Bidens personal safety also have been enhanced since the Capitol incident. Additional vehicles block paths to Bidens house on a tree-shrouded residential street in Greenville, Delaware.Instead of parking in a straight line, the SUVs shuttling Biden and his security now arrange themselves in a jagged formation that shields the president-elects door from view as he exits.A dump truck has been installed as a barricade in the middle of the street outside the theater Biden uses as a television studio, while a city bus stop there was closed.Biden remains adamant he will take the oath in public.Im not afraid of taking the oath outside, Biden told reporters on Monday, days after expressing total confidence in the Secret Service and emphasizing they are a different agency than Washingtons Capitol Police.Organizers had already scrapped the two-century old tradition of a parade down Pennsylvania Avenue from the Capitol to the White House, lunch with Congress and glitzy evening parties celebrating the new president.Instead, Biden is expected to take a train from Delaware and be administered the oath of office at a socially distanced event that organizers are telling people to watch on television, before being escorted part of the way to the White House by ceremonial military troops. Later, he will visit Arlington National Cemetery, a military cemetery, with three former U.S. presidents. Trump will not take part.Amy Cooter, a senior sociology lecturer at Vanderbilt University who has studied extremist groups, said she thought holding the inauguration entirely virtually would be smart, given the calls online for violence against Democratic politicians.But Cooter said she understands that some members in the incoming administration oppose shedding the usual trappings of a peaceful transition of power.Ive heard whispers of people thinking that would be giving in to terrorism, she said. They want it to look normal."}