{"text": "WASHINGTON The need to divert National Guard troops to Washington to provide security for next weeks inauguration of President-elect Joe Biden could hinder the distribution of coronavirus vaccines in various U.S. states, a Democratic lawmaker said on Monday.Washington is reeling from the Jan. 6 attack on the U.S. Capitol by supporters of President Donald Trump and authorities are working to head off possible civil unrest during Bidens Jan. 20 swearing-in at the Capitol.As many as 15,000 National Guard troops have been authorized to be sent to Washington.Democratic Representative Tim Ryan, who chairs a House committee that oversees the U.S. Capitol Police and security around the Capitol, said that National Guard troops could also be dispatched to several state capitals amid reports that Trump supporters will be staging protests around the nation next week.Ryan said he spoke with National Guard officials on Monday and was told that the huge new demands on the troops could strain some operations.The vaccine issue (distribution) would be affected by this. Thats just food for thought about the ripple effect happening because of what were dealing with in Washington, Ryan told reporters.It will probably take away from some of the vaccine distribution in some of the states if we call on them to come to Washington, Ryan said.Some states have been using the National Guard to help distribute coronavirus vaccines to cities and towns as they ramp up an effort to vaccinate up to 300 million people in the United States.The country has registered more than 22.6 million cases of COVID-19, the deadly illness caused by the coronavirus. Nearly 376,000 people in the United States have died, with no sign yet of the pandemic subsiding.About 9 million people have received the first of two doses of the vaccine, far below the 20 million by the end of 2020 that the Trump administration had projected.Biden has criticized the slow pace of vaccination and said he wanted 100 million Americans vaccinated in the first 100 days of his administration starting on Jan. 20.Ryan did not provide details on how many people might have to delay getting vaccinated if National Guard troops from various states come to Washington."}