{"text": "MELBOURNE As news broke on Friday that Melbourne would head into a snap lockdown to contain an outbreak of COVID-19, Serena Williams was already on court at the Australian Open playing potentially her last match in front of crowds at the tournament.It was a distraction neither Williams nor her opponent Anastasia Potapova would have wanted before their third round match at a Grand Slam that has been on high alert since it started on Monday.Williams completed a 7-6(5) 6-2 win in the sunshine at Rod Laver Arena then gushed about her daughter Olympia learning tennis in the on-court interview, drawing cheers from fans.Actually, I didnt know at all until the match was over. I think its good that I didnt know, Williams later told reporters.Its rough. Its going to be a rough few days for I think everyone. But well hopefully get through it.The tournament will go on but Williamss bid for a record-equalling 24th Grand Slam title will proceed without fans in the terraces for at least five days from Saturday.Barring the home hero and world number one Ash Barty, Williams is arguably the hottest ticket in the womens draw at Melbourne Park, where she has won seven titles.I feel like Ive always had a great reaction from the Australian crowd, to be honest, said the American.Ive always felt like Australia has been a place Ive always loved to play.Although it was not her best tennis on Friday, Williams gave the crowd ample suspense as she slumped to a 5-3 deficit in an error-strewn first set.She survived two set points before getting the match back on serve when Potapova double-faulted.From there, it was all on Williamss terms.If there was any doubt about her motivation to compete at the age of 39, it would have been crushed when, in one thrilling rally, she grinned broadly as she scrambled behind the baseline to retrieve a lob and flicked it over her head.The shot landed in and bounced up nicely for Potapova but the Russians smash thudded into the net.I wouldnt be in Australia if I didnt love what I do, said Williams, who will face seventh seed Aryna Sabalenka for a place in the quarter-finals.I think that love is one of the single greatest things in the world that you can have.It propels you to be your best in your job, whether its playing tennis or whether its doing something else."}