{"text": "JERUSALEM A helicopter with the U.S.-led Multinational Force and Observers (MFO) in the Egyptian Sinai crashed on Thursday near the resort town of Sharm el-Sheikh, killing seven members of the peacekeeper force, the MFO said.Those killed were five Americans, a French national and a Czech national, all of them military service members, the MFO said in a statement. It added that one American MFO member survived and was medically evacuated.An earlier statement had said that eight peacekeepers were killed, including six Americans.An official briefed on the incident, who could not be identified by name or nationality, told Reuters it was an accident caused by mechanical failure.The Czech Defence Ministry released a statement confirming a Czech army member was among those killed in the helicopter crash. The statement said the cause of the crash was a technical fault.In a tweet, the U.S. Defence Department said its initial report of six service members was incorrect and that five U.S. service members had been killed and one hospitalized.The Israeli military said it evacuated the injured peacekeeper to a hospital in Israel.The MFO was installed to monitor the demilitarization of the Sinai under the 1979 Egyptian-Israeli peace accord. It has decreased in size in recent years as the neighbouring countries tightened security cooperation against Islamist-led Sinai insurgents.However both Israel and Egypt have, in the past, opposed proposals by Washington to reduce U.S. participation in the MFO, whose website lists some 452 Americans among the forces 1,154 military personnel.Cairo sees the MFO as part of a relationship with Israel that, while unpopular with many Egyptians, has brought it billions of dollars in U.S. defence aid, sweetening the foreign-enforced demilitarisation of its sovereign Sinai territory.For Israel, the MFO offers strategic reassurance in a region where allegiances can shift. In a statement of condolence, Israeli Foreign Minister Gabi Ashkenazi described the MFO as extremely important ... to maintaining security and stability.The MFO statement said the helicopter was on a routine mission when it crashed. The Israeli military said in a statement it had offered to send a rescue team to the scene.According to its website, the MFO draws personnel from 13 countries and covers an area of more than 10,000 square kilometres (3,860 square miles) in the Sinai."}