{"text": "Airbus (AIR.PA)on Monday announced the biggest shake-up in its top ranks since Chief Executive Guillaume Faury took the helm  two years ago, sparked by the departure of two key executives.The French CEO said the shake-up, reducing its executive committee in size and doing away with the split ownership of technical resources dating back to a former structure driven by European politics, would lead to greater internal cohesion.Dirk Hoke, head of the Defence & Space division, and Chief Technology Office Grazia Vittadini will both step down on July 1, the company said in a statement.Hoke, who has been leading efforts to co-develop a European fighter with France's Dassault Aviation (AVMD.PA), will be replaced in the top defence spot by production chief Michael Schoellhorn, whose role as chief operating officer will be filled by military aircraft boss Alberto Gutierrez. Hoke and Vittadini are both leaving to pursue opportunities outside the aerospace group, Airbus said without elaborating.The move comes days after Airbus and Dassault Aviation  reached a critical deal after weeks of tense discussions over the share of work on the Future Combat Air System - a Franco-German-Spanish fighter project. The deal still faces political uncertainty in a German election year and national differences over technology rights, but is seen as a milestone for Europe's largest defence project.One person familiar with the matter said Hoke, an ex-autos  executive once seen as a potential CEO, had been in discussions over his departure for some months. Faury's three-year term expires next year but there are no indications that he plans to step down, having steered Airbus through the COVID-19 pandemic.TECHNOLOGY STREAMLINEDAirbus is also merging technology and engineering as a result of a cascade of changes resulting from the departures, putting long-term and current research under one roof.The military aircraft unit will be run by Jean-Brice Dumont, whose current job as head of engineering will be merged with Vittadini's technology role under a single new engineering boss, Sabine Klauke, who moves from defence to the wider role.Previously, engineering functions had been split between two positions on the top management committee in a throwback to a disjointed structure abandoned in 2013, leading to what several sources described as turf battles over resources.Airbus - once a notorious battleground for Franco-German political and economic divisions - said the shake-up would lead to deeper co-operationbetween its various activities.Although passports no longer dictate hiring policy, the shake-up remains carefully balanced, with one fewer French seat on the top committee but France awarded greater visibility over the Airbus portion of FCAS. Airbus is officially linked with Germany and Spain on FCAS, while Dassault represents France."}