{"text": "Shares in South Korean auto battery maker SK Innovation Co Ltd soared on Monday after it buried the hatchet with LG Energy Solution, freeing up both firms to expand in the United States, where electric cars have become a Biden administration priority.SK Innovation (096770.KS) agreed to pay its rival, an LG Chem Ltd (051910.KS) unit, 2 trillion won ($1.8 billion) to drop all litigation in a bitter trade secrets dispute. That was far less than expected with some estimates putting settlement costs at 7 trillion won.  read more Its shares rocketed 15% higher while shares of LG Chem also rose, climbing 1%.The row had threatened a $2.6 billion Georgia plant that SK is building to supply Ford Motor Co (F.N) and Volkswagen AG (VOWG_p.DE) and is seen as key to the growing industry.SK had vowed last month to walk away from the Georgia plant if a decision by the U.S. International Trade Commission decision that favoured LG Chem was not overturned.  read more The settlement will \"enable us to accelerate the construction of the Georgia, U.S. plant and actively promote additional investment and cooperation in line with the development of the U.S. and global electric vehicle (EV) industry,\" SK Innovation CEO Kim Jun said in a message to employees seen by Reuters.The U.S. market is important for both firms as Chinese battery makers such as Contemporary Amperex Technology Co Ltd (CATL) (300750.SZ) don't have a foothold. Korean firms have also found it difficult to gain ground in China - the world's biggest market for electric vehicles - as Beijing has pushed policies to support domestic manufacturers.\"The U.S. EV market is considered the place where South Korean EV battery makers have the best shot for sustainable growth in the future,\" said Kang Dong-jin, analyst at Hyundai Motor Securities.U.S. President Joe Biden said in a statement that the  settlement was \"a win for American workers and the American auto industry.\" Both Ford and Volkswagen also welcomed the agreement.Volkswagen is a big client for both Korean battery makers and analysts said their longer-term prospects will hinge in part on how they respond to the German automaker's decision last month to move the bulk of its cars to a new unified prismatic battery and away from the pouch-style battery they specialise in.  read more SK's main clients are Volkswagen and Hyundai Motor Co (005380.KS), while LG has a more diversified client base, supplying both those automakers but also General Motors Co (GM.N) and Tesla Inc (TSLA.O), analysts say.LG has said it plans to invest more than $4.5 billion in the United States to meet growing EV demand and is considering building a second battery joint venture in Tennessee with GM.  read more \"We will play an active role in successfully expanding the supply of batteries and electric vehicles through bold and preemptive investments,\" LG Energy Solution President Kim Jong-Hyun said in a message to employees.($1 = 1,124.5100 won)"}