{"text": "Combative self-made billionaire Sheldon Adelson, who assembled the worlds largest casino empire and used his fortune to nurture conservative politicians and policies in the United States and Israel, has died at age 87.The American casino mogul, raised in a poor Jewish immigrant family in Boston as the son of a cab driver, established lavish hotels and casinos in Las Vegas, Macau and Singapore, and headed the worlds largest casino company, Las Vegas Sands Corp.Adelsons wealth made him a formidable figure in American and Israel politics and in the news media. He was a vigorous supporter of U.S. President Donald Trump, former U.S. President George W. Bush and Israeli Prime Minister Benjamin Netanyahu as well as a prolific donor to U.S. Republican politicians and foe of Democrats, including former U.S. President Barack Obama.He was an American patriot, a generous benefactor of charitable causes, and a strong supporter of Israel, Bush said in a statement.Adelson died on Monday night from complications related to treatment for non-Hodgkins lymphoma, a cancer of the lymphatic system, Las Vegas Sands said in a statement on Tuesday.With a net worth of $33.4 billion as of this week, Adelson ranked as the worlds 38th richest person on the Bloomberg Billionaires Index.Known for his extensive philanthropy and business ventures in Israel and donations to Jewish causes, Adelson counted Netanyahu as a close friend.Sheldons tremendous actions to strengthen Israels standing in the United States and the connection between Israel and the (Jewish) Diaspora will be remembered for generations, Netanyahu said in a statement.Adelson and his Israeli-born physician wife Miriam gave more than $218 million to Republican and conservative causes in the 2020 U.S. election cycle, according to the Center for Responsive Politics, which tracks political spending, more than anyone else.They were prolific backers of Trumps 2016 presidential bid and remained supportive throughout his turbulent presidency. The casino magnate was in regular contact with Trump after he took office and saw some of his cherished goals relating to Israel come to fruition including the moving of the U.S. embassy to Jerusalem in a break with decades of American policy. Adelson attended the embassy dedication ceremony in May 2018.Im against very wealthy people attempting to or influencing elections. But as long as its doable, Im going to do it, Adelson told Forbes magazine in 2012.Adelson, a college dropout, was short and stocky, had thinning red hair and in later years used a motorized scooter because of a medical condition that made it difficult to walk. But his appearance belied his clout and drive.His empire in the United States, Macau and Singapore was exemplified by the Venetian resort casino in Las Vegas, which boasted replicas of landmarks from Venice, Italy, like canals, the Rialto Bridge and the bell tower of St. Marks Basilica. He filled his gambling hubs with trendy restaurants and shops, making them luxury destinations for business travelers and tourists alike.A TRUMP HONORIn November 2018, Trump awarded Adelsons wife the highest U.S. civilian honor, the Presidential Medal of Freedom, a move critics assailed as a presidential thank you for the couples financial backing. During the White House ceremony, Trump hailed the Adelsons for protecting the sacred heritage of the Jewish faith, placed the medal around her neck and kissed her on both cheeks.I know that a lot of people think that guys like me succeed by stepping on the broken backs of employees and other people, but they dont understand that we, too, have philosophies and ideals that we adhere to very scrupulously, Adelson said at a Las Vegas event in 2008, according to the New Yorker magazine.Adelson also backed Bush, who served eight years as president, then poured tens of millions of dollars into failed 2008 and 2012 efforts to defeat Obama.Adelson changed the Israeli media landscape in 2007 by launching Israel Hayom, a free right-wing daily newspaper that took a pro-Netanyahu line.Adelson wrote in his newspaper in 2012 that Netanyahu was not my puppet. He was responding to former Israeli Prime Minister Ehud Olmert, who had accused Netanyahu of intervening in a U.S. election by opposing Obama in the name of an American billionaire (Adelson) with a clear interest in the vote.Although initially reluctant to donate to Trumps presidential bid, he became a Trump backer even as some other wealthy Republican donors stayed away. Trump won his first major newspaper endorsement of the 2016 general election when the Adelson-owned Las Vegas Review-Journal supported him.Adelson and his family paid $140 million in December 2015 to buy the Review-Journal - the citys most prominent newspaper - in a secret transaction. The purchase price reflected a 75% premium over what it had sold for nine months earlier. After the familys ownership was revealed, a flood of reporters and editors left the newspaper.Detractors described Adelson - who engaged in a court battle with his own sons, feuds with former associates and lawsuits against journalists - as vengeful and mean.Over time, I observed Mr. Adelson plot vendettas against anyone whom he believed stood in his way. However minuscule the perceived affront, he was certain to go ballistic, using his money and position to bully any opponent - great or small - into submission, Shelley Berkley, who worked for Adelson before serving from 1999 to 2013 as a Democratic U.S. congresswoman from Nevada, wrote in a Las Vegas newspaper in 1998.Adelson was born in Boston in 1933. At age 12, he began selling newspapers on street corners. By 16, he ran a candy vending-machine business.Earlier in his business career Adelson dabbled in entrepreneurial ventures before launching in 1979 a Las Vegas computer trade show that became the worlds biggest. He used its success as a springboard to buy the aging Las Vegas Sands Hotel, then built the largest privately owned U.S. convention center and later the Venetian.Macau, a former Portuguese colony Macau and Hong Kong neighbor known for gambling, reverted to Chinese rule in 1999. Foreign casino companies got their shot after a Hong Kong businessmans Macau gambling monopoly ended.When China opened up Macaus gambling sector to foreign casino operators in 2001, Adelson was the quickest off the mark, building Sands Macau and then resorts and a convention center on Macaus Vegas style Cotai strip, ushering in an era of staggering growth.By 2004 Adelson opened his first casino and Macau later became the worlds top gambling center. Las Vegas Sands initial public offering in December 2004 made him a multibillionaire.Adelson has been credited with helping to broaden Macaus appeal away from the hard-core gambling parlors that had flourished for decades under the monopoly of former gambling kingpin Stanley Ho.While visiting a Macau casino project in 2007, Adelson defended Chinas communist rulers against critics of the Asian giants human rights record, including U.S. lawmakers.His domain also included the $6 billion Marina Bay Sands in Singapore, which opened in 2010, and a casino in Bethlehem, Pennsylvania.After his first marriage ended, in 1991 Adelson married Miriam Ochshorn, a doctor who specialized in drug addiction treatment. One of Adelsons sons from his previous marriage, Mitchell, died in 2005 at age 48 of a drug overdose."}