{"text": "ZURICH This week has seen a flurry of good news from COVID-19 vaccine developers, with Pfizer Inc. and BioNTech SE trumpeting early data indicating their mRNA candidate is more than 90% effective.A Russian project came out a day later, touting 92% efficacy for the Sputnik V candidate, named after the Soviet-era satellite, based on a smaller data set.HOW DO MANUFACTURERS ARRIVE AT EFFICACY NUMBERS?In Pfizers case, it waited until 94 volunteers in its late-stage clinical trial of more than 43,500 people - half got the vaccine, the other half got a placebo - tested positive after developing symptoms.For 90%-plus efficacy, no more than eight people among those who tested positive had received the vaccine, with the rest having received the placebo.Roughly speaking, its probably around eight to 86 cases in the treated and placebo groups, David Spiegelhalter, a Cambridge professor of risk and an expert in statistics, told Reuters.You dont need a lot of fancy statistical analysis to show that this is deeply impressive. It just hits you between the eyes.In Russia, Sputnik V-developer Gamaleya Institute reached its preliminary 92% efficacy figure based on 20 illnesses in 16,000 volunteers as its late-stage trial progresses. It aims to reach 40,000 people.Of the 16,000 people, about quarter got the placebo.It suggests that there is some effect, but its insufficient to estimate the magnitude of it, Spiegelhalter said.HOW MANY PEOPLE MUST GET SICK IN BIG VACCINE TRIALS?Some experts say that, ideally, 150 to 160 people in a trial of tens of thousands of participants must get sick before making a reliable assessment of a vaccines efficacy. Thats a bit of a rule of thumb, though, open to interpretation.There is no such regulatory standard requiring X number of events for making a reliable decision, the government-funded Swiss Clinical Trial Organisation said. The amount of (infections) has to be seen in relation to the disease and its risk profile. Its rather a case-by-case evaluation.Typically, regulators strive to have at least 95% certainty that the trial read-out is not the result of random variations with nothing to do with the tested compound.For trial sponsors there is safety in numbers as a large enough trial can ensure that 95% reliability hurdle is cleared.But the larger the underlying clinical benefit, the fewer trial participants needed to create that clarity.In Pfizer and BioNTechs trial, they planned a final analysis when 164 people had become sick, with multiple, pre-planned interim analyses along the way. They skipped an analysis at 32 patients, and once they were ready to release a look at the 62-person mark, 94 had come down sick.Details from the Russian trial are unclear, without access to its protocol.HOW DO THESE RESULTS STACK UP TO OTHER DRUGS, OR VACCINES FOR OTHER ILLNESSES?In normal drug trials, for diseases like terminal cancer, benefits of new medicines may be less apparent, with survival benefits of just a few months sometimes revolutionary for patients at deaths door.For vaccines, however, marginal protection is inadequate, and the World Health Organization ideally wants to see at least 70% efficacy in trials, while the U.S. Food and Drug Administration wants at least 50%.The 90% efficacy reported in the Pfizer and Russian trials beats those, and appears to exceed that of typical flu vaccines, which the U.S. Centers for Disease Control and Prevention (CDC) estimate reduce the risk of sickness by 40%-60%.For other shots, the CDC estimates the efficacy of a two-shot measles vaccine at 97%, and a two-dose chicken pox vaccine at 90%. Two doses of polio vaccine are 90% effective, rising to nearly 100% with a third.CAN WE EXPECT EFFICACY RATES TO HOLD UP AS TRIALS ADVANCE?Pfizer acknowledged on Monday that its final vaccine efficacy percentage may vary. Still, Spiegelhalter said the studys design seems likely to generally hold up, based on the 94 sick participants.In this case, the effect is so huge, even if there is a little bit of fallback - if the effects become slightly smaller over time - that is very unlikely to be significant.WHAT ABOUT REAL-WORLD EFFICACY, SHOULD THE VACCINES BE APPROVED?The interim data is promising, since it appears to demonstrate that a vaccine can be effective in preventing COVID-19.The jump to mass vaccinations, however, presents new hurdles, in particular for an mRNA vaccine like Pfizer and BioNTechs that must be stored and shipped at minus 70 degrees Celsius (-94F).Moreover, the Pfizer-BioNTech vaccine requires two doses, ideally 21 days apart. If people do not stick to the timetable, it may affect the vaccines efficacy.Protection against the mumps, for instance, drops from nearly 90% to 78%, if people dont get a follow-up shot.Swiss epidemiologist Marcel Tanner, president of Switzerlands Academies of Arts and Sciences and one of the governments top COVID-19 science advisers, expects possible variations in efficacy among older people, whose immune systems wane with time, or those with immune disorders.Efficacy says, Does it work? Effectiveness says, Can it be applied? Can you carry the efficacy to the people? Tanner said. But no question: 90% efficacy, at that stage, is a pretty good result."}