{"text": "ZURICH German engineering group Siemens gave a cautious outlook on its recovery from the COVID-19 pandemic, saying on Thursday it expects government and company investments next year to lag the global rebound in economic growth.The trains to factory software-maker said it expected the downturn to linger and structural changes such as the auto sectors move away from diesel cars to weigh on demand.Although it was optimistic about massive government stimulus, like the $2 trillion package under discussion in the United States, firm details are yet to materialise, Deputy Chief Executive Roland Busch said.Busch will become CEO next year when Joe Kaeser steps down after seven years in charge. Busch has been in operational charge at Siemens since October.Siemens also said it expects moderate revenue and earnings improvement in 2021, described as increases of around 3 to 5%.The cautious outlook sent Siemens shares 2.6% lower in early trading, despite Kaeser signing off with a beat on industrial profit.For the three months to end-September, Siemens posted adjusted earnings before interest, tax and amortisation (EBITA) of 2.64 billion euros ($3.11 billion) in its industrial business, beating analyst forecasts for 1.98 billion euros in a company-gathered poll.Group revenue of 15.31 billion euros missed forecasts for 15.50 billion euros, although orders of 15.56 billion euros were better than expected. Both figures were lower than a year earlier as demand was hit by the coronavirus pandemic.Siemens reported mixed Q4 results taking into account expectations that have risen following beats in the sector, JP Morgan analyst Andreas Willi said.However, here the outlook is more cautious, calling for a return to growth in the second half with only modest growth for the year.The company also expects fluctuations in foreign currencies to reduce net profit by around 500 million euros next year.Kaeser, who has spent 40 years at Siemens and remains CEO until February 2021, has reshaped the company since taking charge in 2013.During his tenure, Siemens moved away from a sprawling light bulb to gas turbine conglomerate to focus on smart buildings and factory automation as well as its mobility division, which makes trains and rail signaling.In 2018, the executive floated medical equipment maker Siemens Healthineers, and this year separated and listed Siemens Energy. The two companies along with the remaining industrial Siemens were all placed for the future, Kaeser said.The 63-year-old was unusually reticent to discuss his legacy, saying it was for others to judge if he was successful.One important metric here is total shareholder return, which nearly reached 100 percent over this period, clearly outperforming the DAX index, he told reporters.Could it have been better? Absolutely. But it also could have been worse  much worse, he added.($1 = 0.8498 euro"}