{"text": "AUGUSTA, Ga. There is something uniquely different about playing in silence at Augusta National, even for professional golfers who have quickly adjusted to life without spectators since the PGA Tour resumed in June after a three-month coronavirus shutdown.Without the famous gallery roars that usually echo through the pines and are inextricably linked to many famous moments at the Masters, there was no way of guessing what was happening on other parts of the course in the first round on Thursday.The bush telegraph was silent, with only a couple of dozen people at times following golfs new main man, Bryson DeChambeau.Two groups behind him Tiger Woods looked like another mere mortal, without the energy normally generated by his heaving mass of fans.Shots that normally would inspire ear-splitting roars instead were greeted with one or two people clapping, if that.When Tony Finau holed a bunker shot at the 15th, one female spectator let out an enormous shriek that punctuated the silence, but that was the exception to the rule.Spectators or not, however, the players were extremely grateful to get a chance to play a tournament which for a while was in danger of being scrapped altogether.The fact that were able to compete for a Masters this year, considering all thats been going on, its a great opportunity for all of us, defending champion Woods said after a four-under-par 68 that left him three shots behind clubhouse leader Paul Casey.Englands Casey said he had struggled for motivation without crowds, until now that is.I was vocal earlier in the year about not enjoying golf in a pandemic, said the Englishman.The Masters, though, still has a buzz to it. Theres an energy and a little bit of a vibe. Yes, its clearly a lot less than what we are used to, but theres something about this place ... I felt excited to be here.As soon as I stepped foot on property on Monday, Ive never been so happy to pass a COVID 19 test in my life.Former U.S. Open champion Webb Simpson, two strokes from the lead, got a quick reminder of the difference without a gallery.I chipped in on (the first hole) no claps, he said.Normally, there would be a nice roar (but) were so thankful to be here.Its not the normal Masters that were used to, but still way better than not having one, so were really happy that its going on."}