{"text": "CARACAS Three small investment funds have started buying defaulted Venezuelan bonds as hopes of a change of government are fading and the South American nation is proposing a restructuring, according to sources and documents.Canaima Capital Management, headquartered on the English Channel island of Guernsey, Uruguay-based Copernico and Cayman Islands-based Altana have bought heavily discounted bonds with face value of hundreds of millions of dollars, according to eight finance industry sources in Caracas, New York, Miami, Madrid and London.The funds appear to be part of a small group of contrarian investors bucking the broader market consensus, which maintains there is little value in Venezuelan bonds that have not been serviced in nearly three years amid an economic crisis.The funds believe it is time to act and to evaluate legal options instead of waiting for a friendly negotiation with allies of Juan Guaido, who is recognized by more than 50 countries as Venezuelas interim president, even though he still hasnt taken power.The funds argue investors may be unable to recover missed interest payment after 2020 due to a statute of limitations clause in the bonds covenants - an assertion flatly denied by the main committee for Venezuela creditors.Nonetheless, the efforts to amplify these concerns has fueled nervousness and increased the willingness of bondholders to sell their notes, according to four Venezuelan finance industry sources.Altana, which two sources said was offering to buy bonds this year, has already taken legal action against Venezuela to try to force payment. In an Oct. 8 complaint filed with the United States District Court for the Southern District of New York, the fund demanded payment from Venezuela on $108 million of defaulted bonds.That came after investment funds Casa Express and Pharo Gaia Fund in late September won a $400 million summary judgment on defaulted Venezuelan bonds in U.S. courts, a setback for Guaidos team that could prompt more bondholders to seek judgments rather than waiting for a negotiation.If the only way to stop the statute of limitations is to sue, we have to sue, unless we reach some kind of agreement, said Celestino Amore, managing director of London-based firm IlliquidX, which is working with Canaima Capital Management.He added that emerging market investors are particularly attuned to prescription clauses after they were invoked on some Argentine bonds in 2015.Luke Allen, an independent non-executive director of Canaima, said in a statement that the company was pleased to have joined forces with IlliquidX and that the firm was focusing on launching our dedicated Venezuelan sovereign debt opportunity vehicle.It was not immediately evident how much assets Canaima has under management.Copernico, which according to its pitch document has $600 million in assets under management, has accumulated Venezuelan bonds with a face value of between $100 million and $500 million, according to three people familiar with the matter.Copernico did not respond to requests for comment.U.S. sanctions prohibit American individuals and funds from buying Venezuelan securities, but such rules do not appear to apply to Copernico, Canaima and Altanta because they are based outside of the United States.BOLD MOVEBonds issued by Venezuelas government trade near 7% of face value while those issued by state oil company PDVSA fetch around 3%, according to Refinitiv Eikon data.The bonds do not generate income because Maduros government stopped servicing them in 2017.Copernico and Canaima argue that investors are approaching a three-year statute of limitations on lawsuits against Venezuela and PDVSA, per bond covenants.Finance Minister Delcy Rodriguez repeated this argument in a September call for investors to negotiate a restructuring, a call that was largely ignored because U.S. sanctions prohibit dealings with members Maduros government.Venezuelas finance ministry said in a Monday statement that bondholders had until Nov. 13 to respond to the offer, an extension of 30 days from the prior deadline.The Venezuelan Creditors Committee, which groups U.S. investors, has repeatedly said the prescription clause is only triggered once Venezuela and PDVSA transfer interest or principal payments to the financial institutions charged with distributing them to investors.Because this in most cases has not happened since 2017, most bondholders believe the clause is irrelevant. In a statement this month, the committee reiterated its willingness to work towards an amicable restructuring.Guaidos special prosecutor this month also said that the prescription clause has not been activated.But not all funds have been calmed by those statements. Discussions of the statute of limitations issue has encouraged some nervous bondholders to unload their notes.It was a bold move, one that favors these funds, said a financial adviser in Caracas familiar with the case, referring to Rodriguez reference to the prescription clause."}