{"text": "LONDON, April 12 Perus financial markets looked set for a rough ride on Monday after socialist candidate Pedro Castillo, who had largely slipped under the radar, took the lead in the first round of the countrys presidential election.Official results were still to be announced, but exit polls pointed to far-left candidate Castillo facing off against pro-business Keiko Fujimori in a second-round run-off vote in June.While often politically turbulent, Peru has been one of the more steadfast and reliable markets in Latin America in recent years, attracting international money managers into its bonds and sol currency.The currency was yet to start trading on Monday but bonds were beginning to react with benchmark Peruvian debt down around 0.5 cents on the dollar and spreads - the risk premium over U.S. Treasuries - widening out around 10 basis points according to traders.We did not anticipate a scenario in which an extreme-left candidate, who just a week ago was printing below 5% of voting intention, managed to win the first round, analysts at JPMorgan said in a note.Castillo had tapped into public anger which has been fired up in Peru over the last year.The economy crashed to its hardest fall in three decades last year as the COVID-19 pandemic hammered the copper-rich country. Tough lockdowns failed to stem the spread, with Peru one of the hardest hit in the world per capita.Meanwhile, politicians have come under fire. President Martin Vizcarra, who had been popular, was impeached by Congress last year over allegations of corruption. His successor resigned shortly after following deadly street protests.I would say it is negative for bonds overall as political volatility is here to stay in Peru, said Natalie Marshik managing director emerging markets at Stifel, adding that Perus Congress would be fragmented after the election.The short-end (of the bond market) and belly has already sold off and I would expect more weakness, although a plus point was that Peru does have a strong balance sheet.The market volatility is also likely to be a exacerbated after last week saw the sol score its best weekly jump in over a decade as rising copper prices helped it bounce back from record lows the previous week.Castillos three (policy) pillars are pretty scary, said Jupiter Asset Managements Alejandro Arevalo. Hes talking about nationalisation, about the government taking control of the economy.Hes in favour of governments or revolutions like in Cuba, Ecuador, Venezuela, so its something that could bring significant volatility to the market. (Reporting by Marc Jones and Tom Arnold; Editing by Susan Fenton)"}