{"text": "Connected speaker maker Sonos Inc (SONO.O) on Wednesday raised its annual sales forecast above Wall Street expectations as the company said it believes it can beat a global chip shortage to keep shipping products, sending shares up as much as 14%.In an interview with Reuters, CEO Patrick Spence said Sonos has direct relationships with its chip suppliers and started ramping up its orders for semiconductors last year. He said Sonos believes it can work through supply shortages to meet the new forecast and ship its Roam portable speaker.We feel like were mitigating and got ahead of it as much as anyone could have, Spence told Reuters. \"We've shown (chipmakers) that this is real demand and we're turning inventory around super quickly.\"The Santa Barbara, California-based company forecast fiscal 2021 sales at a midpoint of $1.65 billion, above its prior forecast of $1.55 billion and above analyst expectations of $1.56 billion, according to IBES data from Refinitiv. For the company's fiscal second quarter ended April 3, the company said sales were $332.9 million, up 90% from the prior year, and adjusted profits were 31 cents per share, versus a loss of 34 cents per share a year earlier.Analysts had expected fiscal second-quarter sales of $248.41 million and an adjusted loss of 22 cents per share, according to Refinitiv data.Sonos faced competitive pressure when major technology firms such as Amazon.com Inc (AMZN.O), Alphabet Inc's (GOOGL.O) Google and Apple Inc (AAPL.O) released smart speakers, some of which targeted Sonos' core market of premium-priced products focused on audio-quality.In recent months, both Apple and Google have discontinued their largest, highest-priced smart speakers to focus on smaller, cheaper speakers that showcased their voice-assistants and smart home features. Sonos has stuck to a focus on audio quality and being a neutral player, Spence said.\"Their strategic intent in getting into the space is different than ours,\" Spence said. \"We're the only ones across those big tech companies who support all of the music services, and we also do it for voice assistants.\""}