{"text": "South Korean Prime Minister Chung Sye-kyun arrived in Iran on Sunday to help try to restore a 2015 nuclear deal between Iran and world powers and free up $7 billion in Iranian funds trapped in South Korea, Seoul officials said.Chung is the first South Korean prime minister to visit Iran  in 44 years amid icy relations between the two countries due to Iran's military cooperation with North Korea.Tension rose after Iran seized a South Korean ship and its sailors in the Strait of Hormuz in January, accusing them of polluting the waters, and demanded South Korea release $7 billion in assets frozen in South Korean banks under U.S. sanctions.Chungs trip comes days after Iran released the tanker and its captain, the last member of its 20-strong crew, with South Korea vowing to help secure the release of the funds. Iran and world powers held talks last week aimed at reviving the 2015 nuclear deal that former U.S. President Donald Trump abandoned three years ago.After talks on Sunday with Iranian First Vice President Eshaq Jahangiri, Chung displayed his willingness to support efforts to revive the deal, aimed at preventing Tehran from acquiring nuclear weapons, formally named the Joint Comprehensive Plan of Action (JCPOA), according to Iranian and South Korean media reports.A return to the JCPOA would help improve relations between Seoul and Tehran, Chung said, pledging to step up cooperation with Washington and other countries over the Iranian funds.The Biden administration is trying to find a way to rejoin the accord and lift the sanctions at talks in Vienna with Iran, mediated by European signatories. Seoul officials have said they only can release the Iranian billions with a nod from Washington. \"The JCPOA negotiations are being pursued constructively and it seems ... development of ties and problem resolving are necessary for the wellbeing and advancement of both nations,\" Chung told a joint news conference, according to Iran's state news agency IRNA.Iran's foreign ministry said unblocking Iran's funds was important to advance relations.\"Our ties have been affected by this issue,\" ministry spokesman Saeed Khatibzadeh told reporters on Monday. \"Some solutions have been discussed, but it remains to be seen to what extent and to what extent they will be operational.\"Chung, who visited Iran in 2017 as the national assembly speaker, invited Jahangiri to South Korea, and promised to provide medical supplies and expand COVID-19 cooperation, IRNA said.An apparent cyber attack at Iran's Natanz nuclear facility on Sunday was caused by an act of \"nuclear terrorism\", the country's nuclear chief, Ali Akbar Salehi, said, according to state TV, adding that Tehran reserves the right to take action against the perpetrators.Israel's Kan public radio cited intelligence sources, whose nationality it did not disclose, as saying that Israel's Mossad spy agency had carried out a cyber attack at the site.Israel, which has accused Iran of seeking to build nuclear weapons that could be used against it, has not made an official comment on the incident. "}