{"text": "SEOUL South Korea reported a record 950 daily coronavirus cases on Saturday, exceeding the late February peak of 909, with the president calling the countrys third wave of COVID-19 an emergency.The South Korean authorities warned they may tighten social-distancing restrictions to their strictest level but held off for now.Of the Friday cases reported by the Korea Disease Control and Prevention Agency (KDCA), 928 were locally transmitted and 22 were imported, bringing the total to 41,736 infections with 578 deaths.More than 70% the domestically transmitted cases were from Seoul and its neighbouring areas, where about half of the nations 52 million people live.This is indeed an emergency situation, said President Moon Jae-in, ordering the mobilisation of police, military personnel and public medical doctors in an effort to curb the further spread of the coronavirus, chiefly driven by small, widespread clusters..We plan to extensively expand drive-through and walk-through coronavirus testing methods ... as preemptive measures to track down infected people and block the spread, Moon said in a Facebook post.South Korea is likely to see a further rise in the caseload with significant increases in testing, he added.The surge has been a blow to South Koreas vaunted pandemic-fighting system, which used invasive tracing, testing and quarantine to blunt previous waves without lockdowns, keeping daily infections below 50 for much of the summer.I was worried when I heard the daily coronavirus count was beyond 900 infections, Chae Hyeong-chan, 29, told Reuters on a visit to Seoul for a doctors appointment from the port city Incheon.I had to take the subway today, which made me worried, because Im afraid I might be exposed to the risk of infection. I will try to return home as soon as possible.The third wave comes despite tougher social-distancing rules that took effect on Tuesday, including unprecedented curfews on restaurants and most other businesses. The country has reported about 600 cases a day this week.Greater Seoul is under level 2.5 restrictions. Raising that to 3, the highest of the five levels, would require schools to switch to remote learning, allow only essential workers in offices and ban gatherings of more than 10 people.Prime Minister Chung Sye-kyun said the government will make all-out efforts to halt the third wave.If we dont curb the spread now, escalating social distancing restriction to Level 3 would be inevitable, Chung told an emergency meeting.Authorities urged people to stay home and cancel all face-to-face meeting as new infections have been spotted from personal meetings.While we cannot avoid contact with our family at home, meetings with your friends and colleagues at work are not safe. Please cancel them, senior KDCA official Lim Sook-young told a briefing."}