{"text": "SEOUL South Korea and the United States will kick off their annual joint military drills this week but without mobilising U.S.-based troops after scaling back the programme due to coronavirus concerns, a military source in Seoul said on Wednesday.The allies have been discussing how to adjust the exercises, which usually begin in August, with the coronavirus threatening to disrupt the travel of U.S. personnel.The programme involves tens of thousands of soldiers from both sides, though it is largely focused on computerised simulations rather than live field training.The exercises will be held from Aug. 16-28 but in a reduced scale, though the timeframe was extended by a couple of days to disperse participants and minimise night activities, the military source said, adding that a formal announcement would soon be made.Seouls defence ministry spokesman said the plans have not yet been finalised. Jacqueline Leeker, a spokeswoman for U.S. Forces Korea (USFK), said regular training is aimed at maintaining trust, proficiency and readiness but did not provide details.The 28,500-strong USFK has reported at least 65 COVID-19 cases among its troops, employees and their families since July, prompting concerns among some South Korean residents near their base. All were confirmed upon arrival or while in two-week mandatory quarantine.Leeker said the U.S. Army has stepped up its preventive control measures, and requires soldiers to undergo a test before travelling internationally, effective Aug. 21.The combined drills are closely monitored by North Korea which calls them a rehearsal for war and had already been reduced in recent years to facilitate U.S. negotiations aimed at dismantling Pyongyangs nuclear programmes.OPCON TRANSFERThis years exercises also provide a chance to assess South Koreas readiness to take over wartime operational control (OPCON), and the change could complicate President Moon Jae-ins drive to complete the transfer before his term ends in 2022.The United States agreed to hand it over on the conditions that South Korea has secured key military capabilities to lead the combined defence posture and effectively counter North Koreas nuclear and missile threats, and that there is a security environment conducive to a transfer.The allies will determine whether the conditions are met after three rounds of capability tests, the first of which was done last year.The military source said this years test has limits, as Washington is not bringing evaluators because of coronavirus concerns.Park Won-gon, a professor at Handong Global University, said at least 300 evaluators are required for the test.Now that the second-round evaluation is postponed, the final test and the decision will likely take place after Moons term is over, he said.To meet the requirements, resolving the North Korean nuclear issue is also essential, in which stalled negotiations and the upcoming U.S. presidential election play a factor, Park added."}