{"text": "* KOSPI falls, foreigners net sellers* Korean won weakens against U.S. dollar* South Korea benchmark bond yield risesSEOUL, Jan 12 Round-up of South Korean financial markets: ** South Korean shares closed down for a second session on Tuesday, tracking Wall Street losses, as foreign investors net sold shares as they weighed the possibility of the Federal Reserve pulling back on buying of bonds and the potential risks to the current easy-money environment. The Korean won weakened, while the benchmark bond yield rose. ** By 06:32 GMT, the benchmark KOSPI fell 22.50 points, or 0.71%, to 3,125.95.** Foreigners were net sellers of 618.6 billion won worth of shares on the main board.** Investors are worrying about an overheat of equity market and talks of rising interest rates encouraged more selling, says Lee Kyoung-min, an analyst at Daishin Securities. ** Dallas Federal Reserve President Robert Kaplan on Monday said he expects broad distribution of coronavirus vaccines to unleash strong economic growth later this year, allowing the U.S. central bank to begin to pull back on some of its extraordinary monetary support. ** Shares of Samsung Electronics fell 0.44%, while Hyundai Motor dropped 2.43%. ** The won was quoted at 1,099.9 per dollar on the onshore settlement platform, 0.24% lower than its previous close at 1,097.3. ** In offshore trading, the won was quoted at 1,099.4 per dollar, down 0.2% from the previous day, while in non-deliverable forward trading its one-month contract was quoted at 1,098.8. ** MSCIs broadest index of Asia-Pacific shares outside Japan was down 0.45%. ** The KOSPI has risen 8.79% so far this year, and gained 21.0% in the previous 30 trading sessions. ** The trading volume during the session in the KOSPI index was 1,374.26 million shares. Of the total traded issues of 905, the number of advancing shares was 408. ** The won has lost 1.2% against the dollar so far this year. ** In money and debt markets, March futures on three-year treasury bonds fell 0.04 points to 111.55. ** The most liquid 3-year Korean treasury bond yield rose by 0.6 basis points to 0.976%, while the benchmark 10-year yield rose by 2.2 basis points to 1.715%. (Reporting by Cynthia Kim; Additional reporting by Jihoon Lee; Editing by Shailesh Kuber)"}