{"text": "Southeast Asia's biggest ride-hailing and food delivery firm Grab Holdings is in talks to go public through a merger with a U.S. special purpose acquisition company that could value it at nearly $40 billion, people familiar with the matter said.A deal, if confirmed, would make it the largest ever blank-check transaction.Two sources said on Friday that Grab was in talks with Silicon Valley-based technology focused investment firm Altimeter Capital Management but had also held discussions with other so-called special purpose acquisition companies (SPACs).Altimeter has backed two SPACs - Altimeter Growth Corp (AGC.O) and Altimeter Growth Corp 2 (AGCB.N).The sources said that Singapore-based Grab, which has expanded rapidly from its beginnings as a ride-hailing firm in 2012 to become Southeast Asia's most valuable startup worth more than $16 billion, had not finalised any deal.Reuters first reported in January, citing sources, that Grab was exploring a listing in the United States and its IPO could raise at least $2 billion.  read more A traditional listing, for which Grab, had hired Wall Street banks earlier this year, was still possible, said the sources who declined to be identified as they were not authorised to speak to the media.Altimeter did not immediately respond to a Reuters request for comment, while Grab declined comment.SPACs, exchange-listed shell companies that raise money through IPOS and merge with firms by enticing them with shorter listing timelines, have been the darlings of Wall Street since last year. Such structures raised a record $82 billion last year and the trend has accelerated in 2021.Other recent large SPAC deals include UMW Holdings Corp's (UWMC.N) $16-billion merger with a blank-check firm backed by billionaire Alec Gores, and the $24-billion deal that luxury electric vehicle maker Lucid Motors struck with a Michael Klein-backed SPAC.Grab is backed by many global investors including SoftBank Group Corp (9984.T) and Mitsubishi UFJ Financial Group (8306.T).The Wall Street Journal reported on Thursday that Grab was in talks with Altimeter. It did not specify which of Alitmeter's SPACs Grab was in talks with. It said Grab is expected to raise between $3 billion and $4 billion from private investors, as part of the SPAC merger.(https://bit.ly/3rD4XR6)"}