{"text": "MADRID Supermarkets, department stores and consumer-goods firms in Spain offered to help overloaded health authorities with coronavirus vaccinations on Friday, while the government said more than 1 million people had already received two shots.Five major retail associations said in a letter to health authorities that their members - many of which already carry out annual inoculations of staff - could administer COVID-19 jabs to their workers to ease the pressure on the health service.Companies including El Corte Ingles, Carrefour and IKEA, said they could operate in strict compliance with the national vaccination strategy.Although Spain initially said its primary-care network could handle the vaccination plan, an acceleration in vaccine deliveries expected in the second quarter after recent delays is prompting regional authorities to consider converting big venues into makeshift injection centres.Madrid will use stadiums, while other regions such as Andalusia, Valencia and Catalonia are weighing their options, potentially even using cathedrals. The Andalusian city of Ronda has already opened drive-thru vaccination stations.To hit a national target of inoculating 70% of the 47 million strong population by the end of summer, some regions may hire retired physicians, students or pharmacists to help out.In an initial phase aimed at protecting nursing home residents and workers and frontline medics, Spain has administered 2.4 million doses, with just over a million people each receiving their two shots.Nearly all those vaccinations so far have been with the Pfizer/BioNTech shot, on a regime of two doses separated by about three weeks. Spain is also using the Moderna vaccine.Authorities will soon deploy AstraZenecas vaccine, which is approved for 18-55 year olds, to a broader section of society, including domestic workers and physiotherapists.With Spains 14-day infection rate down to 496 cases per 100,000 people from almost 900 in late January, several regions have begun to relax restrictions.The death toll from the virus rose by 530 to 64,747 on Friday, while the tally of cases climbed by 14,581 to 3.06 million.Bars in the central region of Castilla-La Mancha reopened on Friday but customers must download a QR code before entering to aid contact tracing. Meanwhile, Madrid will extend its 10 p.m. curfew by an hour to 11 p.m. from next Thursday."}