{"text": "A father allegedly killed his two young daughters at his house before dumping their bodies at sea off the Spanish island of Tenerife, according to a preliminary judicial investigation published on Saturday into the case which has shocked the nation.The disappearance of the girls prompted angry demonstrations in cities across Spain on Friday.  read more \"All Spain is shocked, all our support for the families whose pain is absolutely unbearable and unimaginable, all our rejection of sexist violence, the vicarious violence that some still deny in our country,\" Prime Minister Pedro Sanchez said on Friday during a visit to Costa Rica.Toms G., who is missing, is the main suspect in the disappearance of Olivia, 6, and Anna, 1, after he failed to return the girls to their mother as agreed at the end of April.A court issued an international warrant on Saturday for his arrest on suspicion of two counts of aggravated homicide and one of domestic violence.The suspect killed the children at his house in Tenerife on April 27, a court document said.He allegedly took their bodies in his car to his boat and dumped both overboard wrapped in towels and placed in sports bags at around 10:30 p.m. the same night.\"The plan of the accused was to cause his ex-partner the greatest pain she could imagine, by deliberately causing uncertainty about the fate that Olivia and Anna had suffered at his hands,\" the court document said.Olivia's body was found on Thursday in a sports bag weighted by an anchor at a depth of 1,000 metres (3,281 feet), near to where her father's boat was found drifting.A second sports bag found at the scene was empty, a court statement said.After disposing of his daughters' remains, Tmas G. returned to port in his boat but was stopped by a police patrol boat for breaking a coronavirus curfew, said investigators.He left the port in his boat again after midnight on April 28 and has not been seen, they said.An autopsy found that Olivia died from pulmonary oedema, according to the Canary Islands Superior Court."}