{"text": "CARACAS/MEXICO CITY Last year, China replaced the United States as the No. 1 importer of oil from Venezuela, yet another front in the heated rivalry between Washington and Beijing.The United States had imposed sanctions on Venezuelas state-owned oil company as part of a bid to topple that countrys socialist president, Nicolas Maduro. U.S. refineries stopped buying Venezuelan crude. Caracas ally China, long a major customer, suddenly found itself the top purchaser. Through the first six months of 2019, it imported an average of 350,000 barrels per day of crude from Venezuela.But in August, Washington tightened its sanctions on Venezuela, warning that any foreign entity that continued to do business with the South American countrys government could find itself subject to sanctions. State-owned China National Petroleum Corp, known as CNPC, stopped loading oil at Venezuelan ports that month. Chinas import data showed purchases started to slow, and by late 2019, abruptly stopped.Chinas largest oil company, like customers in some other countries, seemed to be knuckling under to U.S. President Donald Trumps threats, despite Chinese President Xi Jinpings professed support for Maduro.But China never stopped buying. Crude from Petroleos de Venezuela SA, or PDVSA, kept arriving at Chinese ports with the help of a Switzerland-based unit of Rosneft, Russias state-owned oil company, and a roundabout delivery method that made it appear as if the oils origin was Malaysia, Reuters has found.Between July 1 and Dec. 31, tanker ships delivered at least 18 shipments totaling 19.7 million barrels of rebranded Venezuelan crude to Chinese ports, Reuters determined. That finding is based on a review of ship-tracking data, internal PDVSA documents and interviews with four petroleum analysts who have tracked flows of Venezuelan oil around the globe.A unit of CNPC chartered at least one of those tankers, meaning it was responsible for the oil aboard, the ship-tracking data show. That vessel, called the Adventure, took on Venezuelan crude on July 18 and discharged it in China on Sept. 4, the data show. No charter information was available for the other ships that offloaded crude in China.CNPC did not respond to requests for comment.Those 18 shipments represented more than 5% of Venezuelas total exports in 2019, worth around $1 billion at market prices for the countrys flagship crude grade, known as Merey, based on OPEC figures. The sales provided much-needed support to Maduros government, though Reuters could not determine how much was added to state coffers; PDVSA often sells its crude at steep discounts, and some of its sales go to pay down debt rather than generate cash.The mislabeled shipments have continued into this year, Reuters found. The review used data available on financial information provider Refinitiv Eikon, photos culled from satellite imagery and Automatic Identification System (AIS) data transmitted by oil tankers. New York-based Refinitiv is part-owned by Reuters parent company, Thomson Reuters.The Company has always been conducting and is conducting its business in full compliance with applicable international legislation, Rosneft said in a June 5 statement in response to questions for this article.Russias energy ministry did not reply to a request for comment.Chinas indirect imports of Venezuelan crude fall into something of a gray zone, according to Peter Harrell, a sanctions expert at the Center for a New American Security think tank in Washington.Harrell believes U.S. sanctions give Washington authority to punish foreign companies that purchase PDVSA oil through a middleman - particularly if the company knows or should have known it was Venezuelan crude. But that does not obligate the U.S. government to act.At the end of the day, these sanctions are fundamentally policy calls, Harrell said.Reuters could not independently verify if China knew the oil that reached its shores via Rosneft Trading came from Venezuela.The U.S. Treasury Department, which enforces trade sanctions, declined to comment.Asked about the Reuters findings, Elliott Abrams, the U.S. State Departments special representative for Venezuela, said in an interview that potential U.S. sanctions against Chinese companies purchasing transshipped crude were on the table.We will be taking individual actions with respect to STS transfers, Abrams said.Chinas General Administration of Customs did not respond to requests for comment. The Foreign Ministry told Reuters there was nothing improper about Chinas dealings with Venezuela. The ministry said U.S. sanctions had severely affected relations between Venezuela and the rest of the world, but said Beijing intends to continue trading with the country.Neither PDVSA, Venezuelas Oil Ministry, nor the Information Ministry - which responds to media inquiries on the governments behalf - responded to requests for comment. Venezuelan officials have repeatedly described U.S. sanctions on their country as illegal and unilateral.Oil analysts since last year have said Venezuelan oil was making its way to China by way of STS transfers. This account is the first to reveal the extent of those shipments and demonstrate how systematic the tactic has been. Reuters also reviewed internal PDVSA documents that showed the Rosneft unit was involved in moving the oil.So much PDVSA oil was shipped to China this way that the countrys total 2019 imports of Venezuelan oil averaged 283,000 barrels a day. Thats 24% higher than the 228,700 barrels a day reported by Chinese customs, according to Reuters calculations based on comparisons of the Refinitiv Eikon data to official Chinese customs data.That was not enough to offset entirely the impact that U.S. sanctions had on PDVSA; U.S. refiners were importing an average of 500,000 barrels per day when the sanctions were imposed in January 2019. But it helped Venezuela keep its oil industry alive at a time when the drop in demand from foreign buyers was creating a glut onshore, nearly forcing PDVSA to halt production in key oil fields.The STS maneuvers mirror tactics that Iran, whose oil industry is also under U.S. sanctions, has used to ship its oil to China for years. As Reuters documented in reports in 2019 and 2015, Iranian oil often is labeled as coming from neighboring Iraq.A representative of the operator of a Chinese terminal where one such shipment unloaded in 2019 denied that the origin of the oil was Iranian.Alireza Miryousefi, spokesman for Irans mission to the United Nations in New York, said in a statement how we sell or export our oil is no ones business. He said U.S. sanctions on Irans oil exports are illegal.The Chinese shipments of Venezuelan crude were unusual for a variety of reasons, oil analysts said.STS transfers typically are used for legitimate purposes - such as offloading oil from deep-water drilling ships or pumping oil from large tankers onto smaller vessels that can navigate narrow or shallow waterways. The use of this technique to transport oil from Venezuela to China was not seen until the middle of last year, the oil analysts said.Tankers leaving Venezuela loaded with PDVSA crude did not travel straight to China as they had in the past. Instead, 15 tankers whose routes were reviewed by Reuters left Venezuela and first headed for the coast of Malaysia, tracking data show. A few miles offshore, in the Malacca Strait, each rendezvoused with a second, empty tanker that had pulled alongside.The full tanker then pumped its load into the waiting vessel, and in some cases into multiple smaller vessels. Eighteen of those receiving ships then headed to China, where the Venezuelan crude was offloaded and recorded as a product of Malaysia, Chinese customs records show.Reuters could not ascertain who changed the crudes labeled origin before it reached Chinese customs, nor whether doing so expressly violated any maritime laws or local laws in any applicable jurisdictions.Michelle Bockmann, markets editor and analyst at Lloyds List, a shipping trade publication, said the relabeling was highly uncommon. With the exception of Iran, Bockmann said she could not recall any other instance of crude changing identities in this way.The imports were a break from Chinas past practice. China routinely has imported oil from countries such as Brazil and Russia using STS transfers. But Chinese customs accurately recorded the true countries of origin in those cases, according to Chinese customs data and Emma Li, a Singapore-based oil analyst with Refinitiv.In addition, Malaysia is a mid-sized oil producer that has not traditionally sold crude to China in the volumes recorded by Chinese customs last year, the records show. Chinas stated 2019 imports from Malaysia were 400% higher than levels recorded just three years earlier, and the highest ever recorded by Refinitiv Eikon, whose figures date to 2006.The Malaysia External Trade Development Corporation, the government agency largely in charge of foreign trade, did not respond to requests for comment, nor did Malaysias state-owned oil company Petronas.This triangulated trade in Venezuelan oil is now in the crosshairs of the Trump administration.The company that lifted the oil from Venezuela for the China shipments identified by Reuters was Rosneft Trading, according to internal PDVSA documents reviewed by Reuters. Until late March, it was a major player in Venezuelas oil industry. The U.S. Treasury on Feb. 18 hit Rosneft Trading with sanctions for allegedly helping Venezuela sidestep the U.S. pressure campaign and sell its oil abroad.Among the tactics employed by Rosneft Trading were STS transfers, U.S. officials allege. By using one ship to haul crude out of Venezuela, then a second to deliver it to China, Rosneft Trading attempted to blur the chain of ownership and disguise the oils provenance, Abrams, the State Departments special representative for Venezuela, told Reuters, without providing further proof of Rosnefts intentions.The whole purpose is to evade, the whole purpose is to mislead, Abrams said.On March 28, Rosneft announced it was ending its Venezuela operations and selling all its assets in the country to another, unnamed Russian state-owned firm.Rosneft has no ongoing business involvement, assets or operations in Venezuela; therefore, there is no subject for providing further comments, the company said in its June 5 statement to Reuters.The Trump administration, meanwhile, gave Rosneft Trading customers until May 20 to unwind their contracts with the company or face U.S. sanctions. Asked whether Chinese customers were involved in hiding the Venezuelan origin of the crude, Abrams said that Asian clients often did not care how it gets to them, what its labeled, as long as theyre getting what they bought.Chinas Foreign Ministry said in a statement it was not aware of the STS transfers in question.The cooperation between China and Venezuela will be carried out normally no matter how the situation changes, the statement read. Its legitimate and benefits the people of both countries and will not be affected by any unilateral sanction measures.Reuters could not ascertain the final customers for the PDVSA crude in China. But Venezuelas heavy Merey blend is a favored feedstock for refineries making asphalt in China, according to industry sources there.One of the earliest STS transfers involved the Adventure, a tanker chartered by a CNPC subsidiary. On July 18, it took on 1.9 million barrels of Venezuelan crude from another vessel in Malaysian waters, then headed for China, Refinitiv Eikon data show.The manager of the Adventure, Greece-based Eastern Mediterranean Maritime Ltd, said it had never entered into any agreement with PDVSA or any company sanctioned by the United States, and that it respects and complies in full with U.S. sanctions. The maritime company said the cargos bill of lading and certificate of origin said the oil had come from Malaysia.PIT STOP IN MALAYSIAMalaysia is a popular location for STS transfers of crude because of its proximity to Singapore, one of the worlds largest oil trading and storage hubs. One of the STS transfers reviewed by Reuters occurred near Malaysias port of Kuala Linggi; the rest took place outside the countrys Tanjung Bruas port.To demonstrate how these STS transfers work, Reuters used records available on Refinitiv Eikon to reconstruct a shipment to China of 2 million barrels that left the Jose terminal in northeastern Venezuela on Aug. 5, 2019.The oil was carried aboard a Liberia-flagged vessel called the Delta Aigaion, according to Refinitiv Eikon data and an internal PDVSA document seen by Reuters. The crude was a heavy blend known as Merey 16, which is unique to Venezuela, and the customer was listed as Rosneft Trading, the PDVSA document shows.The Delta Aigaion sailed to waters off Malaysia near the port of Tanjung Bruas. There, the crew used a STS transfer to offload the Merey 16 to another tanker, the Malta-flagged Lipari, on Oct. 28, according to Refinitiv Eikon data. The Lipari then headed for China, discharging its crude on Dec. 12 at the port of Zhanjiang, the data show.Refinitiv Eikon ship-tracking data shows the location of ships and indicates how full they are. In this case, the data showed that the draft of each ship changed dramatically while the two were in the same location off Malaysias coast at the same time. The draft is the vertical distance between the waterline and the bottom of a vessels hull - a sign of how heavy a load it is carrying. The draft measurements showed that the Delta Aigaion arrived in Malaysia full and left empty, while the opposite was true for the Lipari - an indication that an oil transfer between the two took place.In a photo taken using a European Space Agency radar satellite and provided to Reuters by San Francisco-based earth imaging company Planet Labs, the Delta Aigaion and the Lipari can be seen approaching one another to start the oil transfer on Oct 28. The authenticity of that photo was verified by oil industry data provider TankerTrackers.com, which specializes in satellite image analysis for vessel tracking.Refinitiv Eikon retrieves location information from satellite images as well as from land-based sensors that collect data from ships transponders. Ships are required by international maritime law to carry transponders to transmit information about their position, speed and destination. The U.S. government has accused tankers and shipping firms transporting oil from Venezuela and Iran of manipulating this data to evade authorities, either by flashing false destinations or simply turning off their transponders.The Delta Aigaion, while on its way to Venezuela in July after leaving its previous berthing in India, never indicated it was heading to the South American country, Refinitiv Eikon data show. The tanker listed its destination as For Orders, a message meaning it had not yet received instructions on where to go next.Delta Tankers Ltd and TMS Tankers Ltd, the shipping companies that manage the Delta Aigaion and Lipari, respectively, did not respond to requests for comment. MMC Corp Bhd and T.A.G. Marine Sdn Bhd, which operate the Tanjung Bruas and Kuala Linggi ports, respectively, did not respond to requests for comment.When the Lipari unloaded in the southwestern Chinese city of Zhanjiang, Chinese customs labeled the crude as Singma blend, a grade of crude that did not exist in the market before last year. Customs recorded the country of origin as Malaysia.Li, the Refinitiv analyst, said the labeling of the crude as a blend appears to be incorrect. If the crude were a blend of different grades - a practice common in the oil industry - the STS operation would have involved multiple vessels bringing crude from separate origins, Li said. Ship-tracking data show no indication that this occurred. It doesnt look like theres any blending, Li said.For 14 of the 18 tankers reviewed by Reuters, the grade of crude recorded by Chinese customs was Singma or Mal, another blend that did not exist before last year, data compiled by Li show. In other cases, the Venezuelan crude was given the names of more established Malaysian grades such as Miri or Kimanis, or was not specified, according to the data compiled by Li. Merey 16, the Venezuelan blend, was not mentioned.ROSNEFT EXITThe arrival of Venezuelan oil in China via STS transfers continued through at least the first two months of 2020. During January and February, Chinese customs once again reported no imports of Venezuelan crude. However, nearly 130,000 barrels per day of PDVSA oil arrived at Chinese ports in those two months from seven tankers that had done STS operations, according to the Reuters review.With U.S. pressure on Venezuela rising, it is unclear whether the tactics PDVSA and its partners employed over the past year to export Venezuelan oil will remain viable.Even before it announced its complete withdrawal from Venezuela on March 28, Rosneft had not lifted any crude from the countrys ports for around a month. Meanwhile, global oil prices have plunged in recent months due to a collapse in demand resulting from the spread of the novel coronavirus. Venezuelas crude output has dropped by more than 20% this year to below 700,000 barrels per day.Still, there are signs the discreet trade will continue.With few established oil companies willing to buy oil directly from Venezuela over fears of provoking Trump, two little-known Mexican firms - Libre Abordo and Schlager Business Group - recently emerged as the largest intermediaries for PDVSA crude. The companies told Reuters they had a deal with Maduros government to supply goods, including corn and water trucks, in exchange for the oil, which they then resell.The U.S. Federal Bureau of Investigation has been investigating the two companies, among others, as part of an inquiry into possible violations of U.S. sanctions on PDVSA, according to three people familiar with the matter.The Mexican firms said swaps of goods for Venezuelan oil were permitted under U.S. sanctions as long as no cash payments reached Maduros government. The companies said they have no knowledge of any U.S. investigation into their practices.On Feb. 11, a Panama-flagged tanker named the Athens Voyager loaded some 700,000 barrels of crude near western Venezuelas Amuay oil port, according to Refinitiv Eikon data. Its customer was Libre Abordo, according to an internal PDVSA document viewed by Reuters.On Sunday, April 5, the fully loaded Athens Voyager arrived at its destination: the Linggi STS hub off the coast of Malaysia. There it pumped its cargo onto a Liberia-flagged vessel named the Loyalty A on April 17.The manager of the Athens Voyager, Greece-based Chemnav Shipmanagement Ltd, deferred comment to the vessels owner, Marshall Islands-based Afranav Maritime Ltd. The manager of the Loyalty A, Jacinta Marine Corp of Lagos, Nigeria, did not respond to a request for comment.On June 2, the U.S. Treasury Department announced sanctions against Afranav Shipmanagement for its alleged role in trading Venezuelan oil. It said the Athens Voyager had lifted oil from Venezuelan ports as recently as mid-February.Afranav did not respond to requests for comment.Libre Abordo, meanwhile, declared bankruptcy on May 31. It said its arrangement with Venezuela had been suspended by Maduro, and that it was the target of an international pressure campaign driven by Washington.In a June 8 email to Reuters, Libre Abordo confirmed that the oil transported aboard the Athens Voyager was registered in its name. On June 10, Libre Abordo said further that the documentation of origin reflected that the crude came from Venezuela. The company said it sent the oil to Malaysia, where it was offloaded to another ship at the behest of the final customer, whose name it would not disclose.According to Refinitiv Eikon data, the receiving vessel, the Loyalty A, is currently en route to Qingdao, China."}