{"text": "WEST ALEXANDRIA, Ohio It took the deadly disruption of the COVID-19 pandemic to expose a deeper, more intractable U.S. public-health crisis: For more than a decade, the worlds richest nation has been losing the battle against diabetes.Long before the pandemic, Kate Herrin was among the millions of Americans struggling to control their diabetes.Her problems often stemmed from her government-subsidized medical insurance. Doctors routinely rejected her Medicaid plan, and she repeatedly ran out of the test strips she needed to manage her daily insulin injections. She cycled in and out of emergency rooms with dangerously high blood-sugar levels, or hyperglycemia.Then COVID-19 hit. Herrin  poor and living alone  rarely left her apartment, ordering fast-food delivery instead of risking the grocery store. She stopped going in for regular lab tests. She had a harder time than ever securing medical supplies. Her health deteriorated further.On Dec. 15, Herrin and Elicia Heaston, her best friend, were swapping messages on Facebook midday when Herrin abruptly dropped off the conversation. Heaston called Herrins phone and got no answer. When a few more hours passed without any word, Heaston and her husband drove from their home in rural West Alexandria, Ohio, to Herrins apartment nearby and pounded on the door. No lights were on, but they could hear the television.Heaston called 911. When firefighters arrived, they found the 42-year-old dead on the bathroom floor. Herrins rescue dogs, Honey and Sugar, were lying quietly next to her.The coroner attributed the heart attack that killed Herrin to complications of type 2 diabetes.She was afraid COVID would kill her, Heaston said. Instead, it isolated her, and her diabetes got worse. She didnt need to die at 42.COVID-19, which has killed more than 600,000 people in the United States, has had an especially devastating impact on the millions of Americans with diabetes. Health professionals and scientists noticed early on that many severely ill coronavirus patients also had the chronic disease. The U.S. Centers for Disease Control and Prevention (CDC) cites research showing that 40% or more of the people who died with COVID-19 also had diabetes.And those numbers dont reflect the damage the pandemic inflicted on diabetes patients who, like Herrin, never got sick from the virus but fell victim to the isolation and disruption it caused.Deaths from diabetes last year surged 17% to more than 100,000, based on a Reuters analysis of CDC data. Younger people  those ages 25 to 44  suffered the sharpest increase, with a 29% jump in deaths. By comparison, all other deaths except those directly attributed to the coronavirus rose 6% last year, Reuters found.This grim toll is the result of a public-health failure that long predates the pandemic  and that is almost certain to persist after COVID-19 abates. After years of advances in treating diabetes, progress stalled about a decade ago. Since then, despite billions of dollars spent on new treatments, the prognosis for people with diabetes has been getting worse as the number of patients with the disease has increased, especially among working-age and even younger people.IT DIDNT HAVE TO BE THIS BADLate in the last century and early in this one, medical breakthroughs steadily chipped away at rates of diabetes-related deaths and complications in the United States. But the trend reversed as rising obesity and its consequences  like diabetes, hypertension and cardiovascular disease  more than offset improved therapies.From 2009 to 2015, CDC data show that among diabetes patients, rates of hospitalization for hyperglycemic crises soared by 73%, and deaths by 55%. From 2010 to 2015, a jump in the rate of lower-limb amputations  always a risk for diabetes patients  erased more than one-third of a 20-year decline. The sharpest increases in these numbers were among adults 44 and younger. A Reuters analysis of more recent state-level data found that the trend has persisted. By 2019, U.S. deaths attributed primarily to diabetes reached their highest rate in eight years.So when the pandemic struck, Americans with diabetes were in poorer health than they had been in years, increasing their vulnerability just as the virus overwhelmed the U.S. healthcare system.It didnt have to be this bad, said Dr Robert Pearl, a Stanford Medical School professor and former chief executive of the Kaiser Permanente Medical Group. If we had spent more time and effort toward preventing and better managing diabetes, thousands of patients wouldnt have needed hospitalization in the first place, Pearl said. And many of them would still be alive.The reasons for the worsening outlook for diabetes patients are rooted in the American lifestyle and medical system.More Americans are developing diabetes earlier, even in childhood, because of long-term societal shifts toward sedentary lifestyles and unhealthy diets, according to researchers and doctors. Younger patients often have a harder time managing their disease, develop complications faster, and tend to have less consistent access to medical care, doctors say. Some patients ration their medications and limit doctor visits to avoid the hefty out-of-pocket costs of increasingly common high-deductible insurance plans, backed for years by employers, insurers and policymakers. The focus in U.S. healthcare on treating crises over preventing them doesnt help, downplaying the importance of lifestyle changes that could lessen the severity of the disease.Over and over again, the problem is worse in young adults, and there isnt improvement in older adults, said Ed Gregg, a former CDC researcher who is now a professor at Imperial College in London. The magnitude of the increase has set us back 15 to 20 years.Dr Giuseppina Imperatore, who oversees disease surveillance and other areas in the CDCs Division of Diabetes Translation, said that the recent trends on diabetic complications and deaths are definitely concerning, and that the agency is still trying to fully understand whats driving the poor outcomes, particularly among younger adults. She also told Reuters that the impact of the COVID pandemic on people with diabetes cannot be overstated.AN AMERICAN PROBLEMThe failure to effectively treat diabetes carries enormous consequences for patients, their families and society at large. Roughly 34 million people, or about 1 in 10 Americans, have diabetes. Treating them costs more than $230 billion a year  more than the U.S. Navys annual budget  much of that borne by taxpayers through government-sponsored Medicare insurance for the elderly and Medicaid for the poor.About 1.6 million people have type 1 diabetes, an autoimmune disease of unknown cause that requires lifelong insulin injections when the pancreas stops producing the hormone. Without insulin, cells are unable to absorb glucose, their primary source of energy, and the sugar builds up in the blood.But the vast majority of patients, accounting for most of the increase in new cases in recent years, have type 2 diabetes, a chronic condition linked to genetics, weight gain and inactivity. These patients bodies dont make enough insulin or dont use it well. Diet and exercise can help manage the disease, but many also need medication that helps them use the insulin their bodies produce. Many eventually require insulin injections.For all diabetes patients, life revolves around checking their numbers. That means testing their current blood glucose levels several times a day. And it means visiting a lab every few months to test their hemoglobin A1c, a measure of their glucose levels over the preceding three months. The higher the number, the worse it can be for a patient.Uncontrolled diabetes wreaks havoc on the body. Acute hyperglycemia can lead to coma or even death. Over time, the disease degrades blood vessels and damages major organs, leaving patients prone to heart disease, stroke, kidney failure, amputations and blindness.While the coronavirus battered diabetes patients around the world, the longer-term reversal of fortunes is a particularly American problem. The U.S. mortality rate for diabetes was 42% higher than the average among 10 other industrialized countries in 2017, according to the Organization for Economic Cooperation and Development. In the British medical journal Lancet, researchers in 2018 gave the United States a score of 62 out of 100 on the quality of diabetes care. Most Western European countries scored in the 90s. The United States trailed Libya, Iran and Vietnam.Other countries have more of a safety net to get people through hard times, said Steven Woolf, a professor at the Virginia Commonwealth University School of Medicine who studies death rates from diabetes and other causes. People here are more vulnerable to the economic shocks of job losses, the last recession and now the pandemic.Reversing the gloomy outlook for diabetes patients isnt easy. Advances in medication and technology to help patients better manage their condition often fail to reach those whose access to care is hampered by their race, income or type of insurance, according to experts in diabetes and public health. And reducing those disparities, they said, would have to come with major investments in primary care and a coordinated effort to curb obesity and inactivity.The current approach has failed, said Dr David Kerr, director of research and innovation at the Sansum Diabetes Research Institute in Santa Barbara, California. And just creating more expensive pharmaceuticals is not going to cut it at a population level.THE FEAR EFFECTIn the early days of the COVID-19 pandemic, the CDC and other agencies recommended that hospitals and medical offices postpone elective procedures and nonessential visits to limit spread of the virus and keep the most vulnerable out of harms way. Doctors offices and clinics halted in-person appointments for many patients with chronic conditions like diabetes. Diabetes education classes and patient support groups disbanded.Telehealth and phone calls helped fill the void, but not all care could be delivered remotely. Some patients didnt get blood drawn for regular A1c readings. Some of the neediest patients didnt have smartphones or a reliable internet connection. And after some wound-care centers closed, remote monitoring couldnt provide care that relies on touch and feel, such as evaluating the chronic sores that diabetes patients are prone to suffer.Many patients became fearful and reluctant to seek care  until they were in crisis. Sandra Arevalo, director of community and patient education at Montefiore Hospital in Nyack, New York, said she knew several patients who had amputations, were admitted to intensive care or died after delaying care. The diagnosis was uncontrolled diabetes, but it was caused by COVID fear, Arevalo said. COVID caused more damage than we realized.John Cupo, a 68-year-old building systems manager in Las Vegas, was diagnosed with type 2 diabetes more than a decade ago and struggled for years with diabetic neuropathy  nerve damage resulting in pain and numbness in his legs. Then, in November 2019, he spotted a sore on his left foot. His podiatrist blamed diminished blood circulation due to diabetes and treated the sore. Cupo agreed to visit every other week for checkups.But on March 16, 2020, the pandemic upended his routine. That day, his employer, the University of Nevada Las Vegas, told him to start working from home. I didnt leave my house after that. I was hearing all the reports about COVID-19 on the news. I didnt want to go out, Cupo said. He canceled his doctor appointments. That was a mistake.On May 2, Cupo noticed that several of his toenails had fallen off. The skin underneath had turned black, a telltale sign of tissue death. He decided to visit his podiatrist, who urged him to go to the emergency room.But COVID-19 was beginning to spread across the country. Cupo was afraid to go near a hospital. The reports were relentless on the television. They said if you have diabetes or high blood pressure, plus age, youre compromised. I thought, Oh man, I have all of those things,  Cupo said. They were telling everyone, Dont go to the ER. Over the phone, Cupos primary care doctor recommended a vascular surgeon. In early June, doctors performed a peripheral artery bypass in a last-ditch attempt to restore blood flow to Cupos foot.It was too late. About a week later, Cupos big toe was black. He braved a visit to the emergency room, where staff gave him intravenous antibiotics and sent him home. Days later, doctors amputated four toes on his left foot. At a follow-up appointment the next week, his whole foot looked dead, and doctors feared an infection was spreading. That day, June 25, a surgeon amputated Cupos left leg just below the knee.Cupo had a difficult four-month recovery, including additional surgery after a bad fall reopened his amputation wound. He has since grown accustomed to his prosthetic and the phantom pains from his amputated leg. I believe I would still have my leg if it wasnt for COVID scaring me to stay home, he said.While national data are not yet available, some U.S. hospitals have reported spikes in major amputations, which are above or below the knee. At the University of Illinois Hospital in Chicago, for example, they shot up 42% last year, according to Dr William Ennis, the hospitals section chief for wound healing and tissue repair.He said one patient refused to come in for a routine follow-up visit after spotting hospital workers donning biohazard suits under white triage tents. He was so frightened by what he saw, Ennis said. The doctor said staff shortages due to the pandemic made it hard to schedule home healthcare visits for his homebound patients.YOUNG AND VULNERABLECupo conforms to the conventional idea of the type 2 patient who is diagnosed later in life. But the ranks of the newly diagnosed are shifting younger. In part, thats because, since the 1970s, more and more Americans are growing up and living in obesogenic environments where they get less exercise, eat more processed foods high in carbohydrates and fat, and gain excessive weight at an earlier age.It is our physical inactivity, diets and environmental conditions that have caused this, said Woolf, the Virginia Commonwealth researcher. He was co-author of a recent study by the National Academies of Sciences, Engineering and Medicine that found that diabetes and other endocrine and metabolic diseases are killing working-age adults at faster rates than in prior decades, across all racial and ethnic groups.The isolation and inactivity imposed by the pandemic compounded many of those risks, triggering medical emergencies and life-altering diagnoses for some young people.At Childrens National Hospital in Washington, D.C., diagnoses of type 2 diabetes among patients 8 to 20 years old nearly tripled in the first year of the pandemic. The severity of the cases worsened, too. Among the new patients, 23% had diabetic ketoacidosis  a dangerous buildup of acid in the blood due to lack of insulin  compared with 4% a year earlier. Only five of the 141 new patients had COVID-19 when they were diagnosed.Doctors said they believe that pandemic-induced school closures and decreased physical activity contributed to the spike. It was really pointing us to the indirect effect of social distancing, said Dr Brynn Marks, a pediatric endocrinologist at Childrens National.One of the hospitals new type 2 patients is 15-year-old Adedotun Adebayo of Glenarden, Maryland. He had been vomiting for days when, on March 25 this year, he passed out at church. His mother, Oyebola Omoyele, who moved to the United States from Nigeria with her three sons several years ago, called 911. Please do everything to save my boy, she sobbed to the operator. I need my son back.Adebayo woke up two days later in intensive care, connected to a tangle of tubes and wires, recovering from diabetic ketoacidosis. I was scared and thought, Am I going to die?  he said. It was great to have my mom there. But I didnt want to cry and stress her out.Before the pandemic, Adebayo was an active teenager, playing basketball most afternoons at a local gym, singing in the church choir and taking courses at a community college as part of high school. When classes went online, his weight ballooned to 183 pounds on a 5 foot 8 frame. I was alone and not doing anything, he said. Most of the time, I was laying on the sofa.Now, Adebayo said, he tries to wake up earlier and eat a better diet. He counts the carbohydrates in his food so he can correctly dose his meal-time insulin injections. He also takes metformin, the first-line drug for type 2 diabetes, and his mother keeps a close eye on his glucose monitor. We need to face this reality, she said.In younger people, type 2 diabetes is often more severe than in cases that develop later in life, said Dr Deborah Wexler, clinical director of the diabetes center at Massachusetts General Hospital and an associate professor at Harvard Medical School. The potential for damage starts earlier, and younger patients tend to have a harder time managing a complicated medication regimen, a healthy diet and regular exercise amid other competing priorities in life, Wexler said. This is a harder problem for the patient and clinician to manage, she said.At the same time, many younger patients, more so than their older counterparts, are missing out on newer, more-effective drugs for lowering blood glucose in type 2 patients.Diabetes has become a cash cow for the drug industry. Annual sales of insulin and other diabetes drugs surpassed $75 billion in 2020, according to the IQVIA Institute for Human Data Science. Thats up from $24 billion in 2011 and second in total revenue only to drugs for inflammatory conditions such as rheumatoid arthritis.But a Johns Hopkins University study published in the New England Journal of Medicine in June that tracked more than 6,000 type 2 patients from 1999 through 2018 found that the drugs werent getting to many patients who needed them, especially younger patients and those without insurance.Nearly 20% of patients between the ages 20 to 44 with raised A1c levels took no glucose-lowering drugs, compared to 10% of those 45 and older, said Dr Elizabeth Selvin, who co-authored the study. The gap was even more pronounced between insured and uninsured patients of all ages.The newer drugs can reduce the risk of heart disease and promote weight loss, but they are very expensive and many of the patients that really need them  are not covered, said Dr Nestoras Mathioudakis, co-medical director of the Baltimore Metropolitan Diabetes Regional Partnership at Johns Hopkins.In the private insurance market, more than 40% of young and middle-age adults have high-deductible health plans, requiring them to pay hundreds of dollars for routine care and medications before coverage kicks in. To avoid those costs, some diabetes patients forgo filling prescriptions or visiting a doctor regularly. In a 2017 study, Dr J. Frank Wharam of Duke University and other researchers found that lower-income workers and their family members with diabetes had 22% more emergency-room visits for preventable complications after switching to a high-deductible plan.The American Diabetes Association recommends that patients at least once a year get a checkup, a foot and eye exam, and A1c and cholesterol tests. Another Johns Hopkins study, published in April, found that only 44% of diabetes patients 65 and older met those goals, and just a quarter of patients under 65. Those who didnt receive this baseline care were more likely to be low-income, uninsured and have uncontrolled diabetes, said Dr Jung-Im Shin, the studys lead author.A SHORT, TROUBLED LIFEMany diabetes patients have a hard time staying on top of their disease, especially when other challenges  financial, familial, medical  complicate their lives. The pandemic only raised these hurdles.For Kate Herrin, life was challenging long before she died alone in her bathroom from uncontrolled diabetes.When she was a teenager in the Dallas suburbs, her parents divorced. Soon after, her mothers death gave rise to the depression that plagued Herrin for the rest of her life.She was diagnosed with type 2 diabetes in 2007 at age 29. By then, she had lost custody of her three children and was back living with her father, a recovering alcoholic who was also dealing with diabetes. She struggled to hold down any job for long.In the ensuing years, she rarely had her diabetes under control, unable to find doctors who accepted Medicaid and continually frustrated in her attempts to get the supplies she needed. She vented frequently to the tightly knit circle of friends she made on Facebook.I have called endocrinologists in the Metroplex and beyond, she wrote in 2017, referring to the Dallas-Fort Worth area. None take Medicaid.Each state manages its Medicaid program, dictating what services to cover and how much it will pay medical providers. Low reimbursements are a big reason only 68% of family doctors, who treat most type 2 patients, are willing to accept new Medicaid patients, according to a 2019 federal report. That compares with 90% or more who accept patients on private insurance and Medicare.When the meter Herrin used to test her blood glucose started giving her error messages, she assumed it was broken. Shawntiah Jones, a medical student she had befriended on Facebook, had seen this mistake among other diabetes patients: Herrins blood sugars were so high that the meter couldnt render a score. I told her, Its not broken. You need to go to the doctor,  said Jones, now a family doctor in Mississippi.After her fathers death in 2018 from a diabetes-related stroke, Herrin checked herself into a psychiatric facility, where her depression and diabetes improved with regular care.Upon her release, her friend Heaston invited her to live at her house in West Alexandria, a town of 1,300 people surrounded by corn fields in the southwest corner of Ohio. Living in Heastons basement, Herrin enrolled in Ohios Medicaid program. As in Texas, Herrin struggled to secure consistent care and basic supplies, such as test strips.Money was tight. Herrin was getting by on food stamps, $775 a month in Social Security disability payments, and a little cash she earned as an administrative assistant for Heaston, who works in marketing. Heaston bought her a glucose monitor for about $40 when Herrin had difficulty getting one through her insurance. Sometimes she also had to ask Heaston for money to buy test strips when she ran low. Test strips can cost $50 to $100 or more a month, depending on the number needed.She also endured constant pain in her feet and legs from neuropathy. In December 2019, she went to the emergency room after her legs grew painfully swollen from the damage to her circulation caused by persistently high blood sugar.In May 2020, as the coronavirus was taking hold, Herrin found an apartment nearby. She was elated to send for her two rescue dogs, which she had to leave behind in Texas. Im getting my doggos back, yall, Herrin messaged to friends.But the pandemic appeared to sap Herrins motivation to eat better and exercise more often as she hunkered down at home. Already overweight, she ordered pizza, chicken wings and other fast-food deliveries, often late at night.Less than a month after moving, she called Heaston at 5 a.m. She was dizzy and had blurred vision, and she needed a ride to the hospital. Under pandemic rules, Heaston dropped her at the entrance and waited in the parking lot. Herrins blood glucose nearly topped 300 milligrams per deciliter, at the threshold of a medical emergency, her medical records show. She was treated and released the same day.In the weeks that followed, she grew more frustrated trying to find diabetes supplies. This is why I hate shitty Medicaid. The only places that accept it are a million miles from anywhere and dont have extended hours, Herrin messaged Heaston one Friday in late September. She fumed that the medical office with her supplies had closed at 5 p.m. and wouldnt reopen until Monday.Dr Mary Applegate, medical director of Ohios Medicaid program, acknowledged that many diabetes patients dont receive the care and support they need to manage their disease, leading to poor outcomes and higher medical costs. To help rectify that, she noted, Ohio eased restrictions this year on diabetic testing supplies and continuous glucose monitors to improve access at pharmacies. The state also began reimbursing medical providers for diabetes education and support services.The pandemic made all of the disparities in healthcare much more visible, and we feel even greater urgency to get the entire state to outcomes we would be proud of, Applegate said.Ohios recent efforts came too late for Herrin. When the engine on her 2002 Honda Civic gave out in November, she didnt have the money to fix it. So when her doctors office at Kettering Health, a regional health system, called Herrin to come in for overdue lab work, she said she had no way to get there, her medical records note. It had been more than a year since her last diabetes lab test. Kettering Health declined to comment on Herrins care.Ten days before Christmas, Herrin died in her bathroom. In her final moments, she clutched her phone, searching on it for symptoms of a heart attack.Heaston and her husband were allowed into Herrins apartment after the coroner arrived. They found it littered with empty take-out food containers and clothes strewn on the floor. On the kitchen floor lay a bag of insulin vials and injection pens.In the following days, some of Herrins online friends received Christmas presents she had mailed before she died.One of her friends, Kim Missino, also has type 2 diabetes  a full-time job, as she put it. Her Medicare plan covers visits to an endocrinologist near her home in Norwich, Connecticut, and other specialists. And during the pandemic, Missino had her husband by her side, nudging her to stay on top of her illness. For Herrin, Missino said, the isolation and the financial and logistical issues proved overwhelming.It just got so out of control for her, Missino said."}