{"text": "RIO DE JANEIRO Travel across Brazil and youll spot signs almost everywhere for BR Distribuidora, the owner of South Americas largest gas station chain. The familiar green-and-yellow logo of the company, formerly a unit of state oil giant Petrobras, is a fixture in big cities and hamlets alike.Less well-known is BRs effort to purge its retail network of alleged crooks. In 2019, the company booted hundreds of independent franchisees from its network for purported irregularities, a BR spokesman told Reuters, including evading fuel taxes and ripping off customers with adulterated gasoline. In all, BR stripped its name from 730 outlets, roughly 10% of its Brazilian network at the time, the company said.But other suspected criminals continue to operate BR stations, Reuters has found. A major franchisee in the state of Rio de Janeiro, for example, has been indicted by state prosecutors at least 12 times for fuel-related crimes over the past 15 years and is currently on trial for his alleged participation in a sprawling fuel-smuggling ring, according to court documents reviewed by Reuters. He has not been convicted in any of the court cases examined by the news agency.BRs situation is not unique. Crooks have infiltrated the four largest gasoline chains in Brazil, where they are estimated to control hundreds, if not thousands, of stations, according to Reuters interviews with more than two dozen industry and law enforcement officials. The news organization also reviewed thousands of pages of court cases and enforcement records from Brazils oil regulator.Cheats sell stolen gasoline and rig pumps to short customers the full amount they paid for, the interviews and documents show. More serious crimes abound, too. Some entrepreneurs use their stations to launder cash for gangs like the First Capital Command, South Americas largest organized crime group, authorities allege, as well as for militias - violent criminal enterprises composed in part by retired and off-duty cops.In southern Brazil, a station owner is facing trial for the 2017 murder of the head of an industry watchdog that was investigating suspected fraud at the businessmans operations.Gas station graft is lucrative. Ill-gotten gains at Brazils pumps amount to 23 billion reais ($4.15 billion) annually, according to a November estimate from the Instituto Combustivel Legal, or ICL, an industry group founded last year to combat fraud.Brazils President Jair Bolsonaro has blamed unscrupulous gas station owners for cheating the treasury and fleecing motorists amid public anger over recent fuel prices hikes.Its a business worth billions, Bolsonaro said during a live broadcast on multiple social media platforms in February.In statements to Reuters, Brazils largest fuel distributors by market share - BR, Ipiranga, Raizen and Ale - acknowledged grappling with bad actors in their retail outlets, all of which are owned by independent franchisees. Together these four firms account for nearly half the gas stations in Brazil. The distributors said they work diligently to cull miscreants, feeding information about alleged misconduct to police, prosecutors and regulators.These companies have ties to some of the biggest names in the oil industry. Raizen Combustiveis SA, for example, is a joint venture between Royal Dutch Shell PLC and local ethanol producer Cosan SA; it oversees roughly 5,000 Shell-branded gas stations in Brazil, according to the most recent data from Brazils oil regulator. Ale Combustiveis, with around 1,500 stations, is a unit of Switzerlands Glencore PLC. Top player BR, the former subsidiary of Petroleo Brasileiro SA, boasts approximately 7,800 locations. Ipiranga is a subsidiary of So Paulo-based Ultrapar Participacoes SA and has 7,105 stations in Brazil.Lawsuits aimed at stripping alleged wrongdoers of their franchises can take years to wend their way through Brazils court system, industry officials said. Periodic purges, like BRs 2019 housecleaning, can amount to whack-a-mole, with bad actors finding ways to gain control of other stations, said Carlo Faccio, the head of ICL.The situation of the fuel industry is very bad, he said. Were very far behind. Theres a lot we have to do.No government agency tracks how many gas stations are linked to convicted or suspected criminals in Brazil. Reuters analyzed court records in the state of Rio de Janeiro, which authorities say is a hotbed of this illicit activity.The news organization identified 20 station owners who have been indicted or convicted for fuel-related offenses since 2015. Collectively, the 101 gas stations they own amount to roughly 4% of all retail fuel outlets in Rio state. Most of those owners were linked to organized criminal groups, according to prosecutors and court documents they submitted in various criminal cases.Guilherme Vinhas, a partner at the Rio de Janeiro law firm Vinhas e Redenschi Advogados who has worked for all of the largest distributors, said criminal infiltration of the retail fuel sector had become a major concern for his clients.The companies are monitoring this, Vinhas said, and theyre worried.IRRESISTIBLE OPPORTUNITYFuel-related crimes are common in oil-producing nations in emerging markets.In Mexico, for example, thieves tapping into pipelines cost state oil company Pemex 15 million pesos ($728,000) per day, Chief Executive Octavio Romero Oropeza said last year. This purloined fuel frequently is fenced by complicit gas station owners, Mexican authorities say.Still, industry executives say Brazils fuel crooks are among the worlds worst, due in part to a tax regimen they say invites cheating. Fuel taxes here vary widely from state to state. For example, the state tax on ethanol, sold in virtually all Brazilian gas stations, is 32% in Rio de Janeiro state, compared to 13% in neighboring So Paulo. That creates an incentive for criminals to purchase fuel from low-tax jurisdictions and resell it in high-tax states to crooked station owners who charge customers the higher tax and pocket the difference, industry officials said.Its the most complex (tax system) that I know, Marcelo Arajo, the chief executive of Ipiranga, said during a virtual oil industry conference in December.Criminals in Brazil reap 7.2 billion reais ($1.3 billion) annually from fuel tax evasion alone, according to a 2019 study by the Fundao Getlio Vargas, a Rio de Janeiro think tank. Adulterating gasoline with ethanol or other liquids is another trick to boost profits, authorities said.But some of the biggest rewards for station owners, authorities and company sources said, comes from using their outlets to launder money for criminal organizations.Among the Rio gas station owners with criminal records identified by Reuters is Cleber Clebinho Oliveira da Silva. He currently owns two gas stations in Rio, according to corporate registration records: one an independent station unaffiliated with any national brand, the other a franchised location for Ipiranga.In 2018, da Silva was convicted in state court of belonging to the Justice League, one of Rios largest criminal militias. Da Silva, now 37, was sentenced to six years in prison. He has remained free as he appeals that decision.In 2019, da Silva was sentenced to pay a fine and carry out community service in a separate case for using his independent station to launder the Justice Leagues illicit profits. The nature of the community service and amount of the fine was not specified in the sentencing document. Authorities say the Justice League is involved in a variety of illegal activities, including fuel smuggling, auto theft and protection rackets.Prosecutors did not establish how much money da Silva laundered. But in his decision, the judge cited witness testimony alleging that the stations monthly revenue more than quadrupled to 900,000 reais ($163,000) after da Silva purchased a piece of the business in 2015.Within a year of that conviction, da Silva purchased another station, this one a franchised location for Ipiranga, corporate registration and regulatory records show.Ipiranga told Reuters that da Silva was not an owner of that station when it entered the companys distribution network in 2008, and that it was unaware of his involvement. If this person currently has a stake ... he did it completely behind the back of Ipiranga and in a way that goes against what is written on the franchise contract, the company said in an e-mailed statement.Da Silva could not be reached for comment. His attorney did not respond to requests for comment and declined to provide contact information for his client.Another alleged crook is Jos Rodrigo Gallo de Faria, a former Shell franchisee in Rio de Janeiro. In 2019, state prosecutors indicted de Faria for receiving stolen gasoline, according to a copy of the indictment seen by Reuters. He is free pending trial.Police described de Faria in that indictment as the main sponsor of the so-called called Xerem Militia, which specializes in robbing fuel from pipelines. According to the indictment, the militia in April 2019 illegally tapped into a pipeline in a working class neighborhood near the city of Rio de Janeiro, setting off an explosion that killed an eight-year-old girl. De Faria was not implicated in the girls death.A lawyer for de Faria, Ralph Hage, said his client was innocent and could document that his fuel was purchased legally. Hage did not provide proof of those legal purchases to Reuters, but said he would produce the relevant documentation in court.Raizen, which oversees the Shell brand in Brazil, declined to comment about de Faria. His outlet no longer bears the Shell logo. In January, a few weeks after Reuters first contacted Raizen about de Faria, his station exited the Shell network and turned independent, according to registration records filed with Brazils national oil regulator.One of the best-known figures among Rio de Janeiros gas station owners is Mario Marinho Augusto de Castro, who owns a stake in at least 43 outlets in the state, according to corporate registration records reviewed by Reuters.De Castro has been the target of at least 15 law enforcement investigations over the past two decades, all involving fuel, according to state police records reviewed by Reuters.At present he is defending himself in at least five criminal cases. In one of those cases, filed in 2008, prosecutors charged de Castro with participating in a large criminal organization that smuggled low-tax fuel into Rio state.At least 18 of de Castros stations are franchised locations for BR, and at least seven stations are franchised locations for Shell, the records show.Renato Alves, a lawyer for de Castro, said his client has never been convicted of a crime and denies wrongdoing in all ongoing court cases. He said de Castros multiple franchise agreements with BR and Raizen show he is well-respected in the industry. Alves added that the sheer number of government regulations de Castro must contend with across his large portfolio of stations has made his client vulnerable to undeserved indictments.BR said it had no knowledge of a criminal conviction related to the activities of Mr. Mario Augusto de Castro, adding that the company will reinforce the mechanisms that it uses to curb suspected wrongdoing by its franchisees.Raizen declined to comment about de Castro.FIGHTING BACKFuel distributors frequently press lawsuits against franchisees they suspect of irregularities in an effort to terminate their franchise agreements, according to several company sources and court cases reviewed by Reuters.But those cases can take years to work their way through Brazils crowded courts, the interviews and legal records show. Even victories dont bring swift relief.Non-compliant (franchisees) typically take advantage of all sorts of legal maneuvers to delay compliance with judicial decisions, a spokeswoman for BR wrote in an e-mail.Brazilian law dictates that retail gas stations cannot be owned by oil producers or distributors. Rather, they must be owned by independent third parties - usually individuals - who are free to buy and sell stations among themselves. While franchise agreements typically give distributors the right to approve these transactions, such sales nonetheless create a backdoor through which unscrupulous actors can buy into well-known chains by dealing directly with station owners, said Dlio Campos, a spokesman for Glencores Ale network.In some cases, despite contractual conditions forbidding it, property can change hands without the companys consent having been obtained, Campos said.Da Silva, the convicted money launderer, purchased his Ipiranga station in 2019 from two individuals with a pre-existing franchise agreement with the company, regulatory records show.Ipiranga said any ownership stake by da Silva happened without its knowledge. Da Silva could not be reached for comment. His lawyer did not respond to a request for comment.Authorities say fuel crime has become so lucrative to Brazils underworld that those trying to stop it are at risk.On March 23, 2017, Fabrizzio Machado da Silva, the head of the Brazilian Association for Fighting Fuel Fraud, an industry watchdog in southern Brazil, was shot to death outside his home in the city of Curitiba. Police allege the hit was arranged by Onildo Chaves de Crdova II, an area businessman upset at the associations investigations into potential fuel adulteration and pump rigging at three of his independent gas stations, according to the criminal indictment and Luis Roberto de Oliveira Zagonel, a lawyer for da Silvas family.State prosecutors charged Chaves with murder. He is free pending trial. No trial date has been set.A lawyer for Chaves, Andr Pontarolli, said his client is innocent. He added that police probes into Chaves business practices have not resulted in any indictments.The Fighting Fuel Fraud group, meanwhile, disbanded shortly after da Silvas murder, Zagonel said."}