{"text": "WASHINGTON, D.C. During the 10 months theyve spent hunkered down in a military barracks turned housing project, the grandson has grown taller and the grandmother has gotten smaller.Rochelle Woody has been the towering figure in her grandsons world since luck brought them together a decade ago when Omari Scott was 6. At age 71, Rochelle now leans over a cane after two recent spinal surgeries. Omari lifts barbells in the living room at night, and hears her praying in bed. She wants to keep a roof over their heads. Their landlord, the District of Columbia Housing Authority, has been seeking their eviction.The pair cant imagine where theyd go. Rochelle tells Omari its something he shouldnt worry about. She has faith in a higher authority.Gods too good to me for that to happen, Rochelle says.Shes at risk for falls, so Omari doesnt leave home much. Plus, the virus is raging out there. It has already killed three in their family, cousins in New York, Georgia, Virginia.Omari reached 6 feet tall before his 16th birthday last month. He thinks the growth spurt will help him when high school football starts up again. Hes a wide receiver, reliant on speed. When he does go out, its usually to sprint along the waterfront in their neighborhood, two miles due south of Capitol Hill.Hell stop around Buzzard Point, endorphins pumping, and take in the view where the Potomac and Anacostia rivers meet. He phones his grandma at home. You OK? Sometimes he promises to cook pancakes for dinner.They live two miles due south of Capitol Hill, the scene of last weeks deadly insurrection by a mob intent on overturning the result of Novembers presidential election.Theyve lived together since 2010, when a lonely Rochelle first discovered the grandson she never knew she had.Last month, as the capital got its first winter flurries, Rochelle and Omari met a reporter at a safe distance outside their red brick building. Despite their age and height gaps, anyone could guess theyre family. They have the same deep-set brown eyes, high-arched cheekbones and cautious smile.Thats how I knew he was mine, says Rochelle, a grandmother of 10. All my grandbabies look like me.EVICTIONS STORM BREWSRochelle and Omari are just one example of a family struggling through a winter like no other in American memory.The director of the U.S. Centers for Disease Control has warned it could be the worst in the public health history of this nation.Vaccination campaigns could end the pandemic sometime this year, but millions of households are at risk of eviction before that, with infection rates at record highs and the economy in shambles.This isnt the first time that Rochelle has had payment disputes with landlords, but the pair have never gone homeless.Rochelle says she didnt receive the letter from the D.C. Superior Court ordering her to show up for an eviction hearing back in January 2020. Seen by Reuters, it was marked return to sender, showing she was not made aware of the court date. As a result, she missed the hearing, where a judge granted the Housing Authority permission to proceed.United States Marshals were poised to execute the eviction back in April. Then the pandemic put Rochelles case and others like it on hold. Since last spring, state and federal reprieves have allowed many renters in arrears to stay in their housing, even as thousands of new eviction cases pile up in courthouses. More than 208,000 have been filed so far in the 27 U.S. cities tracked by the Princeton University Eviction Lab.Under Washingtons current moratorium, tenants such as Rochelle could still face eviction by late May. Thats a longer breathing spell than renters elsewhere can expect: A nationwide moratorium, enacted by the CDC in September, is set to expire at the end of this month. A new federal stimulus package offers U.S. renters at least some relief  a $600 check and up to $25 billion in rental and utility assistance funds to be distributed through states.Advocates for low-income tenants are optimistic that more stimulus funds and extended moratoriums could be forthcoming once President-elect Joe Biden takes office.Still, they warn of a potential tsunami of U.S. evictions this year. The nonprofit National Low Income Housing Coalition estimated that U.S. tenants were already $70 billion behind on rent in late 2020, and that up to 19 million Americans could face eviction in the coming months without further interventions.In its latest Household Pulse Survey last month, the U.S. Census Bureau reported that 35% of U.S. adults lived in households where eviction or foreclosure was very likely or somewhat likely over the next two months.Landlords, of course, have also been left reeling. A recent D.C. Superior Court ruling protects their right to access the courts, even with evictions on hold.With the capitals shortage of affordable housing, thousands of households were already behind on rent when the pandemic hit. The moratoriums only delay the day of reckoning that they face, the December 16 ruling says.Where evictions do proceed around the country, they could quickly fuel the virus spread in low-income communities of color already at highest risk, according to a research article in the Journal of Urban Health last month.Rochelle fears the virus, but says shes most worried about how an eviction could derail her grandsons progress. After childhood struggles in school punctuated by suspensions and an ADHD diagnosis, hes flourished in recent years, with better grades, triumphs on the football field and calls from college coaches to discuss potential scholarships.Retired and disabled, Rochelle relies on a monthly $1,593 Social Security check. She and her lawyer say she made rent payments last year. A January 2020 court filing said her monthly rent was $519. It also showed she owed the Housing Authority $13,130 immediately to avoid eviction. The arrears, her lawyer says, carried over from her prior Housing Authority apartment. She says the landlords maintenance lapses there caused a ceiling to collapse, detached cabinets and a rodent infestation.A spokesman for the public housing landlord, Jose Sousa, said the agency cant comment on individual cases but always works with our families who may be in violation of their lease obligations to identify solutions other than eviction.Before COVID, Rochelle made extra money by driving her compact Mitsubishi Mirage for a ride-share service, but she wont chauffeur strangers around now. I just dont want anyone in my car, she says.The housing case against Rochelle is complicated. In essence, shes lived under the threat of eviction since 2015, when the payment dispute began over conditions in her prior apartment.The Housing Authority eventually agreed to move her, she says, but not until she signed an agreement and payment plan for back rent. The terms meant she could face eviction if she ever missed a payment, even at her new address.Rochelle has found a lawyer, Sebastien Monzon Rueda, who works pro-bono at nonprofit Legal Counsel for the Elderly on D.C. eviction cases.The type of agreement Rochelle signed takes advantage of unrepresented tenants, says Monzon Rueda. Renters, especially older, disabled ones, should not be placed in jeopardy because of a dispute over a past apartment, he says. There has been no ruling yet on a motion he filed in November to seek dismissal of the eviction case.DISCOVERING A GRANDSONRochelle, a self-described creature of Washington, never expected to end up in public housing, let alone facing homelessness. When she was growing up, she lived in the affluent Northwest quadrant of town, near Georgetown University.She and Omari now live steps away from where, in the 1940s, the legendary soul singer Marvin Gaye spent his troubled childhood in a public tenement. Much has changed in southwest D.C. since then, but some things havent. Its remaining public housing tenants are overwhelmingly Black and poor.Their two-bedroom unit is cramped, its blinds falling apart and paint peeling along baseboards, but it has served them as a safe harbor. At times over the past year, the pairs hunkering down at home has been literal, like on the early December evening when they heard eight gunshots right outside.The area is also home to a few of the countrys most powerful tenants, hidden from view. Down the street are the blast-proof walls of Fort McNair Army Base, where U.S. military top brass live in stately historic homes.Rochelle started working at age 14. When she was Omaris age, she passed the U.S. civil service test. She went on to get a bachelors degree in education, a masters in criminal justice.For the first 18 years of her career, she held government jobs, for the U.S. Navy, and the former U.S. Health, Education and Welfare Department, among other agencies. Stints in sales and as a paralegal followed, with occasional gigs as a clothing model.Her love life was less successful. By the late 1980s, her three marriages had all ended badly. Marriage isnt for me, says Rochelle, who had her two sons with her second husband. But children are.She paused her career in 1994 when doctors found two brain aneurysms. Surgeries to remove them required her to learn how to walk and talk again, but the remarkable recovery stalled in 2010 when spinal pain made her retire from 9-to-5 work. Her savings dwindled, and she felt isolated.Rochelle discovered Omari that same year. Her younger son, who had recently been incarcerated, was told by a friend that an ex-girlfriend had borne his son. The child, he was told, had ended up in foster care.Rochelle and her son applied to go see Omari at a D.C. Boys and Girls club where he was playing Pee Wee football. The boy was skeptical when he first saw his relatives. I didnt think I had a dad, he told them.As they drove away that day, Rochelle and her son cried about it. You think about what that does to a kids self-esteem, she says.A judge granted custody to Rochelle and her son, but problems soon arose. Her son had little patience with the hyperactive boy. You leave this child with me, she told him.Omari didnt take to classroom learning. Rochelle had to teach him the basics, letters and counting, using rap songs as a mnemonic device.Over the next years, Omari cycled through seven elementary schools, none of which met Rochelles approval. Sometimes hed be expelled for fighting. There were consultations with school psychologists, and he was sometimes placed in special education classes. Doctors prescribed him Adderall.His acting out at school eventually subsided, and he stopped the meds years ago. It took time, but all he needed was to know he was loved, Rochelle says.Its a mantra she says she follows with all the children who have come into her life. While shes contending with her own legal and medical issues, Rochelle has also begun coursework for a third degree, in child psychology. She wants to go into private practice. In the evenings she writes and is working on a book. Its working title: Help, My Child Is Broken.In one passage, she writes: I have been loved, lied to, rich, poor, happy and unhappy. I will always be rich in my heart!FOOTBALL DREAMSAt home since the spring, Omari has been doing virtual schooling. His favorite class is English, and he now reads voraciously. In a favorite novel, All American Boys, a teenage Black protagonist, Rashad, reels from a police beating whose aftermath has divided his high school. In the end, Rashads injuries  sustained when he was falsely accused of shoplifting  forces his peers to grapple with racism. Omari read the book as millions joined Black Lives Matter demonstrations around the country last year.During breaks, Omari helps with household chores. Some of Rochelles other grandkids visit. He rarely mixes with people outside the family.I dont really have friends, he says.Omaris high school football season has been lost to the pandemic too. Calls from college coaches have dried up. One did request a Zoom session to watch Omari drill, but Rochelle nixed that. Whats this coach gonna see? The boy cant run in the apartment.Maybe next summer, they think.All I know is the strong survive, he says."}