{"text": "NEW YORK From the start of the pandemic, Itai Lahan, co-founder chief executive of Cloudinary, had one main priority: his employees.We have a team of 300 right now ,and it has been and always will be about the people for us, said Lahan, 44, whose company provides cloud-based image and video management for thousands of websites and brands. We made a decision early on to have Cloudinary be this rock of stability and island of sanity in this sea of craziness.The Santa Clara, California-based company made a conscious decision to do our best not to part ways with any individual, he added.Lahan talked to Reuters about leading a remote workforce. Edited are excerpts below.Q. Whats an early lesson you learned on the importance of people in an organization?A. When I was growing up in Israel, I studied the recorder, and my teacher wanted his students to be teachers as well. When I was 13 or 14, I took on my very first students. I clearly remember learning a huge sense of responsibility and taking a lot of pride in it.I learned that my success is the success of my students, and that pride in seeing them grow and be successful is something Ive kept with me to this day.Q. How has your business changed and adjusted in this pandemic?A. Businesswise, were very fortunate. Cloudinary is about media, images and videos. Visual imagery is a critical component of every online business.During the pandemic, the need for online engagement with customers only increased, but our customers needs were all different. Some were doing great, others had different challenges.Q. How are you helping your employees during COVID-19?A. We offered people the possibility of reducing their work hours if they needed it, just to take the time with family. And we asked them if there was any way that we could help them focus on mental health.We now have weekly town halls. Its one hour and not mandatory. And were doing a lot of work to make sure our new employees are taken care of with good online onboarding.In the U.S., we had food served in the office, so we started offering a stipend. Its $200 monthly. The amount is just added to paychecks, so it can be spent however employees would want to.Q. What kind of support is most valuable to your employees now?A. Were all very unique individuals. Every person is experiencing this in a dramatically different way. We had team members that were crying to keep the office open because they needed that support. Other employees were calling for the exact opposite.Cloudinary was always incredibly flexible: 25% of our team was working from home even before the pandemic. It was a good basis for how to navigate these waters. We already knew that this was doable.Q. How are you handling working from home?A. I need that separation between work and home, so for me there are daily routines.I have a 7:45 a.m. meeting with our leadership team. It gets me out of bed. I have a good cup of coffee and start the day right. If Im wearing a Cloudinary branded shirt, I know that Im working. Its the small stuff.I have a daughter and two boys. I have a lunch date with my kids at least twice a week.For me, working is intense. You work hard, and its emotionally and professionally challenging. You need a break, so finish the day at a certain hour. Go rest, and go back energized in the morning.Q. Whats the best job advice you have received?A. In Israel, theres mandatory army service. When youre 18 years old, you go to the army.I was working with a commander to interview new people for a job, and I was very focused on figuring out if a person was good and a professional fit. And someone said to me, Look, youre so focused on the professional qualifications, but were hiring someone whos going to be sitting shoulder-to-shoulder with you for the next three years. So you should find someone youre really excited to be working with."}