{"text": "Grace Walker, 17, was captain of the girls tennis team at her Minnesota high school until the coronavirus pandemic wiped out her season.Now her state is one of 20 across the country where lawmakers want to block transgender athletes like her from participating on high school and university sports teams that conform with their gender identity.The wave of legislation has become another flashpoint in the U.S. culture war, with Republicans pushing back against the Biden administrations efforts to expand transgender rights. Former President Donald Trump is among those in his party who say the laws are needed to keep the playing fields fair for women and girls.The Republican governor of Mississippi on Thursday signed a law banning students designated as male at birth from womens and girls sports, and South Dakotas Republican governor has vowed to sign a similar measure passed on Monday in her state.Opponents call the measures discriminatory and say transgender athletes should be allowed every opportunity to freely compete.Walker, who also is a member of the cheerleading squad for the boys basketball team, says she is a normal teenager who wants to participate without politics getting in the way.I think its fairly silly, she said in a Zoom interview. This isnt attacking what they think it is. Its attacking kids.A recent Politico/Morning Consult poll found 53% of registered voters support banning transgender athletes from competing in womens sports, versus a third who oppose such a ban.Those pushing for the restrictions cite a handful of examples where transgender women and girls have achieved high-level athletic success. Some refer to trans women as men and use the term biological sex, a term transgender people find offensive because it asserts that ones gender assigned at birth is immutable.Even one male entering into female competition affects all the girls in that sport. It makes the competition unfair for all of them, said Emilie Kao, director of the Richard and Helen DeVos Center for Religion and Civil Society at The Heritage Foundation, a conservative think tank.The sports legislation is among 73 bills filed in U.S. statehouses this year that would restrict transgender rights, said Cathryn Oakley, state legislative director for the Human Rights Campaign advocacy group.Other bills seek to limit the medical treatment offered to transgender youth, or curb the ability to change gender markers on state identity documents.This is about our opponents trying to create a problem where there just isnt one, Oakley said. They are looking to scapegoat trans people and specifically trans kids in an effort to score political points.LEVELING THE PLAYING FIELDProponents of the legislation said it was needed after President Joe Biden, a Democrat, signed an executive order on his first day in office in January to combat discrimination against people for their gender identity or sexual orientation.Children should be able to learn without worrying about whether they will be denied access to the restroom, the locker room, or school sports, Bidens order said.Collegiate and Olympic governing boards have rules on hormone treatments for transgender athletes, but critics say they are insufficient.Linnea Saltz, a former womens track athlete at Southern Utah University, recalls watching a transgender opponent defeat her teammates at a championship meet last year.To think that there was a biological male that could come in and essentially blow me out of the water was kind of just discouraging, said Saltz, who was referred to Reuters by Mississippi state Senator Angela Hill, lead author of that states bill.Mississippis law is due to take effect on July 1.Rose Saxe, deputy director of the American Civil Liberty Unions lesbian, gay, bisexual and transgender project, said the flurry of measures nationwide violate the U.S. Constitutions equal protection clause and the Title IX of the education code, which bans discrimination the basis of sex.The first-of-its-kind Fairness in Womens Sports Act passed last year in Idaho and was blocked by a federal judge as unconstitutional.Saxe said the ACLU will consider suing more states if students are excluded from sports as a result of new bans.We are watching carefully, Saxe said."}