{"text": "LONDON The pound shed early gains against a weaker dollar on Friday to be 0.6% lower on the day as a combination of stronger appetite for risk, unprecedentedly weak economic data and Brexit concerns weighed on the British currency.The pound had a poor week, slipping back after it had risen 3.9% against the dollar in 10 consecutive days of gains.It recovered against the dollar on Friday, touching $1.2653 in earlier trade, before falling 0.6% on the day to $1.2528 at 1504 GMT. Against the euro, the pound flattened at 89.69 pence.Analysts suggested sterling was behaving like a risk currency, strengthening when improving global market sentiment weakens demand for the safe-haven dollar.Vasileios Gkionakis, head of FX strategy at Lombard Odier, said the pounds losses this week made sense because market participants had been complacent in view of ongoing Brexit risks and the coronavirus-induced economic slump.Little progress has been made on Brexit ... the UK economy is going to lag the rest of the developed markets, so levels at $1.27-$1.28 were a bit of a stretch for sterling, he said.Britains economy shrank by a quarter over March and April, data showed on Friday. Bank of England Governor Andrew Bailey said the central bank had to be ready to do more to help.The country has also made very little headway in talks about a future trade relationship with the European Union, negotiators have said, and it confirmed on Friday it would not extend a Brexit transition period that is due to end on Jan. 1.Asset manager Candriam told clients that it expected further depreciation of the pound, as their view on Britain was negative given its performance in managing the COVID-19 crisis and a lack of progress in sealing a deal with the EU.This all alongside a massive fiscal deficit, inflated debt to GDP and a current account deficit which requires financing, Candriam said.From next week, much of Britains retail sector is authorised to reopen as long as shops follow social distancing rules."}