{"text": "* Graphic: World FX rates in 2020 tmsnrt.rs/2egbfVh* Graphic: Trade-weighted sterling since Brexit vote tmsnrt.rs/2hwV9HvLONDON, Jan 12 Sterling gained against the dollar on Tuesday as the greenback took a breather from its recent rally, allowing the British currency to gain some respite after four consecutive sessions of losses.Dollar gains on the back of rising U.S. Treasury yields pushed the pound to $1.3451, its lowest since Dec. 29 in the past week, as investors bet on massive fiscal stimulus in the U.S.On Tuesday, the pound recovered some of those losses as riskier currencies rallied alongside a rebound in stock markets. It traded 0.3% higher to the dollar at $1.3549 and 0.2% higher to the euro at 89.76 pence.Sterling is showing tentative signs of recovery despite the decent dollar momentum after a weak start to the year, strategists at ING said in a note to clients. We maintain a rather optimistic near-term stance on sterling considering that the majority of bad news appears to be already in the price.With Brexit largely in the pounds rear-view mirror, investors are focusing more intently on Britains economy, which looks likely to tip back into recession. It shrank in the final quarter of 2020 and the first quarter of 2021 - following a record fall of over 20% in output in the first two months of lockdown last year.Finance minister Rishi Sunak warned on Monday that Britains economy would get worse before it got better, with the country now in its third national lockdown and struggling to contain the spread of COVID-19.A third lockdown has forced investors to consider the possibility of the Bank of England cutting interest rates below zero.Market pricing shows investors expect negative rates from Britains central bank as early as May. ING said it remained reluctant to forecast negative rates from the BoE.The BoEs deputy governor Ben Broadbent is due to give a speech on COVID and consumer spending at 1000 GMT.British consumer spending fell in December at the fastest rate in six months, with pubs and restaurants especially hard hit by a resurgence of coronavirus cases, a survey by payment card provider Barclaycard showed."}