{"text": "The dollar fell slightly on Monday and a gauge of global equity markets slid from record highs last week as investors wait to see whether an expected jump in U.S. earnings will justify stock prices already trading at very high premiums.Solid demand for $96 billion in new three- and 10-year U.S. Treasury notes kept a move higher in yields in check as the market looked to key data releases this week, including a reading on U.S. consumer price inflation and retail sales.The dollar slipped toward a three-week low as Treasury yields remained just above recent lows, while oil prices rose on optimism over a rebound in the U.S. economy as coronavirus vaccinations accelerated.MSCI's all-country world index (.MIWD00000PUS), a gauge of equity performance in 50 countries, fell 0.16% from Friday's record peak. The global benchmark's price-to-earnings ratio is at its highest level since early 2010.The S&P 500's P/E ratio on a forward 12-month basis is 23.5, a more than 40% premium to its 20-year average, according to CFRA.Traders want to see results and whether company guidance supports anticipation of a rebounding U.S. economy, said Fiona Cincotta, senior financial markets analyst at City Index, the retail division of StoneX Financial.\"There is some optimism,\" Cincotta said of overall market sentiment.\"Slightly more upbeat guidance from the big banks, that's going to help,\" Cincotta added.JPMorgan Chase & Co (JPM.N), the largest U.S. bank by assets, reports earnings on Wednesday, as do Goldman Sachs Group Inc (GS.N) and Wells Fargo & Co (WFC.N). The S&P financials sector (.SPSY) hit a record high on Monday before retreating in anticipation of bank results, which start earnings season.The benchmark S&P 500 rallied before the bell on Wall Street, but closed barely lower. The Dow Jones Industrial Average (.DJI) fell 0.16%, the S&P 500 (.SPX) lost 0.02% and the Nasdaq Composite (.IXIC) dropped 0.36%.Share prices will likely move higher should estimates continue to morph into better-than-expected results and guidance, said Sam Stovall, CFRA chief investment strategist.Analysts expect S&P 500 companies to report a 25% jump in earnings from a year ago, according to Refinitiv IBES data. That would be the strongest performance for the quarter since 2018.Optimism about vaccination programs and an ensuing rebound is driving stocks. Total market capitalization of global equities hit $90 trillion last week, according to Refinitiv data.European shares eased from record highs as investors held off from making big bets before earnings season. The benchmark pan-European STOXX 600 index (.STOXX) ended about 0.5% lower after closing at a record high on Friday.Britain's more export-oriented FTSE 100 (.FTSE) fell 0.4%, Germany's DAX (.GDAXI) and France's CAC 40 (.FCHI) both slid 0.13%, while Italy's FTSE MIB (.FTMIB) gained 0.11%.Earlier in Asia, Tokyo's Nikkei (.N225) edged down 0.77%, and South Korean stocks (.KS11) rose 0.12%.India's Nifty 50 index (.NSEI) slid 2.4% as the country overtook Brazil with the second-highest number of COVID-19 cases globally.  read more Chinese blue chips (.CSI300) lost 1.5% before the release of a series of economic data from China.Shares in Alibaba Group Holding Ltd  surged 9.3% on relief that China's record 18 billion-yuan ($2.75 billion) fine on the e-commerce giant, which makes up more than 8% of the MSCI emerging markets index, was not more onerous.China imposed a sweeping restructuring on Jack Ma's Ant Group, the fintech conglomerate whose record $37 billion initial public offering was derailed by regulators in November.  Alibaba is an affiliate of Ant Group.The 10-year U.S. Treasury  note rose 0.5 basis point to 1.6711%.\"Low inflation and dovish central banks should limit the rise in bond yields during the recovery,\" said Andrew Pease, global head of investment strategy at Russell Investments.Data on Tuesday is expected to show U.S. inflation jumped in March. Retail sales data is expected to show a surge, perhaps with a double-digit gain, when a report is released on Thursday.The dollar softened after the pullback in Treasury yields.The dollar index  fell 0.115%, with the euro  up 0.1% to $1.1908. The Japanese yen  strengthened 0.30% versus the greenback at 109.40 per dollar.Gold fell as the slight uptick in Treasury yields dimmed  bullion's appeal.U.S. gold futures  settled down 0.7% at $1,732.70 an ounce.Crude prices remained rangebound as growing expectations of surging U.S. economic activity are balanced by the slow rate of vaccination in Europe and anticipation of additional supply from Iran in coming months.Brent futures  rose 33 cents to settle at $63.28 a barrel. U.S. West Texas Intermediate (WTI) futures settled up 38 cents at $59.70 a barrel."}