{"text": "NEW YORK Stocks ticked down from six-month highs on Thursday on concern over a stalled U.S. economic relief deal, while oil fell and the euro edged up against the U.S. dollar.Treasury yields hit multi-week highs after record supply at a 30-year bond auction drew poor demand.Initial claims for U.S. state unemployment benefits dipped below 1 million last week for the first time since mid-March, but the expiration at the end of July of a $600 weekly jobless supplement likely contributed to the decline.Data showed the worlds largest economy regained only 9.3 million of the 22 million jobs lost between February and April. But Wall Street has recovered most equity market losses, and the benchmark S&P 500 was within a few points of a record high.Our take on a new high, if it happens, is that its another reminder to investors how disconnected the stock market and the economy have been this year. Stocks have soared but the economy  its improved, yes  but a million initial claims is still not good, said Ryan Detrick, senior market strategist at LPL Financial in Charlotte, North Carolina.A sell-off in benchmark government bond markets also eased, as investors digested the biggest-ever 10-year U.S. debt sale, and some surprisingly robust U.S. inflation figures.U.S. Treasury yields rose to multi-week highs after the Treasury auction of a record amount of 30-year bonds.(GRAPHIC: World stocks shaking off the virus - )https://fingfx.thomsonreuters.com/gfx/mkt/dgkvldozmvb/Pasted%20image%201597321643162.pngOil prices eased after underwhelming data, but the weak dollar limited losses. Traders kept an eye on U.S. stimulus headlines.Overall, neither yesterdays OPEC or todays IEA release appeared to have much effect on an oil market that is still primarily focused on the ongoing expansion in risk appetite that remains undeterred by lack of progress in formulating a viable U.S. stimulus deal, said Jim Ritterbusch of Ritterbusch and Associates.(GRAPHIC: 2020 Global asset performance - )https://fingfx.thomsonreuters.com/gfx/mkt/qzjpqwbqkpx/Pasted%20image%201597236564783.png"}