{"text": "Stocks took a breather on Tuesday, easing from record highs as political turmoil in Washington and rising coronavirus cases gave pause, though a selloff in U.S. Treasuries extended as investors reckon on a big spending government.The yield on benchmark U.S. government 10-year debt , which rises when prices fall, gained as much as 2.4 basis points to a fresh ten-month high of 1.1580%. MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) fell 0.5% after touching an all-time high on Monday, led by a 2.6% drop in South Korea as investors took some profit from a soaring Kospi (.KS11). Drugmakers lifted Japan's Nikkei (.N225) to a fresh three-decade high after reports of another effective COVID-19 treatment, though the index eased to be 0.16% lower in the afternoon.Strong inflows helped Chinese blue chips (.CSI300) 1.11% higher. S&P 500 futures  were 0.05% weaker and London's FTSE futures were 0.13% lower in Asia on Tuesday. A resurgent U.S. dollar clung to four days of gains against other major currencies, holding the euro  and yen  close to multi-week lows. \"We've seen a very strong week or so (in equities) and I think the lower moves we are seeing are a bit of profit-taking,\" said Chad Padowitz, chief investment officer at Talaria Capital in Melbourne.\"I don't think higher interest rates or inflation expectations are being an area of concern for equities at the moment.\"Political uncertainty tempered the mood somewhat as Democrats introduced a resolution to impeach U.S. President Donald Trump, accusing him of inciting insurrection following a violent attack on the Capitol last week.  read more Overnight, the Nasdaq (.IXIC) led modest losses on Wall Street, falling 1.3% as investors sold tech giants who have taken actions against Trump and his supporters. Twitter (TWTR.N) tumbled 6.4% on Monday after it permanently suspended Trump's account last Friday. SHORT SQUEEZEThe U.S. yield curve is steepening because investors expect a big-spending, big-borrowing United States government after Democrats last week won control of both houses of Congress.The yield on U.S. 10-year debt is up 23 basis points already this year and the spread between the two-year and 10-year Treasury yields  is now wider than 100 basis points for the first time since July 2017.  \"Treasuries have gone back to March levels,\" said Mark Beardow CIO from Darling Macro in Sydney. \"What's different between now and then is clearly the situation around COVID, the Fed's policy and the key thing has been the new government in the U.S. but some of those other factors could reassert themselves in the short run.\"Flows from the huge and sudden selloff have supported equities while tapping the brakes on short dollar positions. Renewed focus on inflation expectations will have investors closely watching U.S. CPI data due on Wednesday.         Meanwhile, the dollar index  bounced 1.5% from last week's nearly three-year low as investors trim what have become very large short positions.Elsewhere, investors are expecting guidance on the extent to which executives see a rebound in 2021 earnings and the economy from  results and conference calls from JP Morgan, Citi (C.N) and Wells Fargo (WFC.N) on Friday. U.S. crude  was slightly lower at $52.16 per barrel and Brent  was 0.22% lower at $55.54. Gold  which has been sold as U.S. yields rise because it pays no interest, steadied at $1,850 an ounce. "}