{"text": "An index of stocks across the world dipped on Friday but still posted its strongest weekly gain in five, while benchmark U.S. Treasury yields climbed to 13-month highs, partly on optimism after a $1.9 trillion recovery package was signed into law.On Wall Street, the S&P 500 drifted higher to end up 0.1% on the day and 2.6% for the week, its strongest weekly showing since early February. The Nasdaq underperformed as the rotation from growth to value continued. The Dow Industrials hit an intraday record high every day this week.The Friday spike in Treasury yields supported the dollar, which closed the week down 0.3% against a basket of currency peers , the biggest drop in four weeks.With U.S. stimulus coming and vaccine rollouts reopening economies against a backdrop of super-loose monetary policy, some analysts expect inflation to pick up.  read more \"We are back to the idea that more growth is more inflation and investors are a little nervous about current yield levels which is affecting tech stocks,\" said Victoria Fernandez, chief market strategist at Crossmark Global Investments in Houston.\"It's all about the pace in which yields grow and the market seems to be comfortable with another 10-20 basis points jump in the benchmark yield if backed up by strong data that shows economic recovery.\"    The Dow Jones Industrial Average (.DJI) rose 293.05 points, or 0.9%, to 32,778.64, the S&P 500 (.SPX) gained 4 points, or 0.10%, to 3,943.34 and the Nasdaq Composite (.IXIC) dropped 78.81 points, or 0.59%, to 13,319.87.The Dow had its biggest week so far this year with a 4.1% advance and the Nasdaq posted its first positive week in four, up 3.1%.    The pan-European STOXX 600 index (.STOXX) lost 0.26% on Friday and MSCI's gauge of stocks across the globe (.MIWD00000PUS) shed 0.06%.Emerging market stocks lost 0.69%. Overnight, MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) closed 0.64% lower, while Japan's Nikkei (.N225) rose 1.73%.U.S. 10-year Treasury yields  rose above 1.6% and posted their seventh consecutive weekly rise.\"The bias in rates is still higher barring an unforeseen setback on the vaccines or explicit Fed action,\" said Gregory Faranello, head of U.S. rates at AmeriVet Securities in New York.U.S. data showed producer prices posted in February their largest annual gain in nearly 2-1/2 years, but the currently high unemployment rate could make it harder for businesses to pass on the higher costs to consumers.  read more Benchmark 10-year notes  last fell 28/32 in price to yield 1.6247%, from 1.527% late on Thursday.The recent, sharp, market moves give even more importance to next week's meeting of the U.S. Federal Reserve for clues to its views on rising yields and the threat of inflation.In currency markets, the dollar index  rose 0.243%, with the euro  down 0.27% to $1.1952.\tThe Japanese yen weakened 0.49% versus the greenback at 109.04 per dollar, while Sterling  was last trading at $1.3924, down 0.47% on the day.Markets are likely to remain volatile in the second quarter, particularly for the dollar, which was much stronger than expected at the start of the year, said Cliff Zhao, chief strategist at China Construction Bank International.\"The strong U.S. dollar may weigh on some liquidity conditions in the emerging markets,\" he said.The Institute of International Finance on Thursday urged the Fed to give guidance on its managing of higher yields to avoid even more outflows from emerging markets.Oil prices fell, with both Brent and WTI down slightly for the week after rising more than 10% over the past two.On Friday, U.S. crude  fell 0.67% to $65.58 per barrel and Brent  was at $69.20, down 0.62% on the day.Spot gold  added 0.1% to $1,723.75 an ounce. Silver  fell 0.82% to $25.86.Bitcoin  last fell 1.92% to $56,661.44."}