{"text": "MSCI's gauge of stocks across the globe rose for a 10th straight session on Friday and hit another record high as investors anticipated new fiscal aid from Washington to help the U.S. economy recover, while benchmark U.S. Treasury yields rose to their highest levels since March. On Wall Street, all three major indexes hit record closing highs, with energy, financial and materials leading gains among S&P sectors as investors snapped up cyclical and under-priced value stocks.  read more  All three indexes also posted gains for the week.     The Cboe Volatility Index (.VIX), Wall Street's fear gauge, ended below 20 for the first time since February 2020, shortly before the coronavirus pandemic roiled U.S. stocks.  read more      \"We're underestimating the lag effect of all the money in the system as more and more vaccinations are delivered and as more of the country reopens\" from business shutdowns, said Thomas Hayes, chairman and managing member of hedge fund Great Hill Capital LLC in New York.\"We are continuing this rotation that would be consistent with the new business cycle, and as (bond) yields go up, value and cyclicals will lead,\" Hayes said.     U.S. President Joe Biden pushed for the first major legislative achievement of his term, turning to a bipartisan group of local officials for help on his $1.9 trillion coronavirus relief plan.  read more     The dollar was slightly higher, coming off its strongest level for the day, as risk appetite returned to the market, while Bitcoin  was down 1.3% on the day at $47,356, after hitting a record high of $49,000. It posted gains of roughly 20% in a milestone week marked by the endorsement of major firms such as Elon Musk's Tesla (TSLA.O).    The Dow Jones Industrial Average (.DJI) rose 27.7 points, or 0.09%, to 31,458.4, the S&P 500 (.SPX) gained 18.45 points, or 0.47%, to 3,934.83 and the Nasdaq Composite (.IXIC) added 69.70 points, or 0.5%, to 14,095.47.The U.S. stock market will be closed on Monday because of the Presidents Day holiday.The pan-European STOXX 600 index (.STOXX) rose 0.64% and MSCI's gauge of stocks across the globe (.MIWD00000PUS) gained 0.37%.In the bond market, investors closed positions ahead of a long U.S. weekend, while inflation expectations edged up to a six-year high. Benchmark 10-year yields  rose to 1.203%, just pipping an 11-month high of 1.20% that was set on Monday. The dollar index rose 0.042%, with the euro down 0.08% to $1.2118.  read more Oil prices climbed more than 2%, hitting the highest levels in more than a year on hopes a U.S. stimulus will boost the economy and fuel demand.  read more Brent crude  rose $1.29 to settle at $62.43 a barrel after rising to a session high of $62.83, the highest since Jan. 22, 2020. U.S. oil  gained $1.23 to $59.47 after rising to a session high of $59.82, the highest since Jan. 9, 2020.Spot gold dropped 0.1% to $1,823.46 an ounce."}