{"text": "NEW YORK There is no question that we are all more dependent on technology than ever. So what happens when that tech does not work?In the past, Emily Dreyfuss used an old-school strategy: She yelled.When Amazons Alexa spat out wrong answers or misunderstood questions, Dreyfuss let the virtual assistant have it.I used her as a scapegoat for my feelings, said Dreyfuss, a writer and editor for Harvards Shorenstein Center. When you have a non-sentient and annoying device in your home, who isnt doing what you want, I talked to her in not the nicest terms. And my husband ganged up on her, too.Tech frustrations like this have happened to all of us. Your wifi is always dropping out. Your passwords do not work. Your laptop crashes, and you lose everything you were working on. Just reading about those possibilities could be enough to raise your blood pressure.Technology can damage our state of mind, and new research is bearing that out: Computer giant Dell Technologies, in partnership with neuroscience firm EMOTIV, put people through a gauntlet of bad tech experiences, and then measured their brainwaves to gauge their reactions.Test subjects had trouble logging on, or had to navigate sluggish applications, or saw their spreadsheets crash.The moment people started using bad technology, we saw a doubling of their levels of stress, said Olivier Oullier, EMOTIVs president. I was a bit surprised by that, because you rarely see those levels going so high.Tech stress had a lasting effect, Oullier added.People dont relax back into calmness quickly. It takes a long time.Company bottom lines have suffered along with the mental health of employees. Constant frustration with bad tech affects how staffers handle their daily workloads, especially younger workers. Gen Z and Millennial test subjects saw a whopping 30% productivity drop as a result.Bad experiences affect you regardless of computer literacy, said Cile Montgomery, who leads customer experience initiatives for Dell. But young people seem to be even more impacted, because they expect technology to work.REAL WORLD: EVEN WORSEAs shocking at the EMOTIV results are, Oullier said the effects of crummy technology are probably even more severe in the real world, for two reasons.First, subjects of the experiments knew they were being tested, which probably limited their frustration. Second, during this pandemic year, our baseline levels of stress are high. So stress that is doubling from bad tech is doubling from a higher starting point.Remote work environments are not helping. In an office, IT support might come over and help you troubleshoot tech problems. In your kitchen or rec room, you are often on your own.Right now our computers and operating systems are our only windows to the world, says Oullier. When youre stuck at home and all you have is a computer provided by your employer, you might not have access to tech support. Thats why its so important when youre remote, to have technology that works.There are a few takeaways from this new brain research. First, companies must be more cognizant of the emotional impact of poor tech setups, and the ensuing blow to productivity. That might require more up-front investment, work-from-home equipment upgrades and ongoing tech support.Such proactive steps could pay dividends down the road, Oullier says, because of multiplier effects. If you are beset by tech screwups, you likely approach your workstation with dread and aversion. If everything flows smoothly, you can quickly dive into the work at hand.If companies do all that, they might see a surprising bottom-line boost, and end users like Emily Dreyfuss will be happy.Some things are in your control, and some things are outside of your control, says Dreyfuss, who has been looking to Stoic philosophers to help her keep an even keel. You have to find peace in moments of chaos -- and that means not yelling at your devices."}