{"text": "Swiss voters rejected a trio of environmental proposals on Sunday, including a new law intended to help the country meet its goal for cutting carbon emissions under the Paris Agreement on Climate Change.A new CO2 law was narrowly rejected, with 51.6% of voters opposing it in a nationwide referendum conducted under the country's system of direct democracy.The result was a defeat for the Swiss government which supported the new law that included measures such as increasing a surcharge on car fuel and imposing a levy on flight tickets.The rejection meant it would now be \"very difficult\" for Switzerland to reach its 2030 goal of cutting carbon emissions to half of their 1990 levels and to be become net neutral on emissions by 2050, Environment Minister Simonetta Sommaruga said.\"Today's no is not a no to climate protection, it is a no to the law on which we have voted,\" Sommaruga told a news conference.\"Debates in the last few weeks have shown that many people want to strengthen the climate protection but not with this law,\" she said.The government would now seek to extend uncontroversial measures like a duty for fuel importers to invest in climate protection projects, and attempt to forge a new consensus with the population on climate policies, she added.Also rejected was a proposal which would have made Switzerland only the second country in the world to ban artificial pesticides outright, and another proposal to reduce their use by redirecting subsidies to farmers who no longer used the chemicals.Supporters had argued that pesticides were linked to health risks, while opponents had claimed a ban on pesticides would have led to more expensive food, job losses for the Swiss food processing industry, and greater dependence on imports.Antoinette Gilson, one of the authors of the artificial pesticides initiative, said the results did not mean the Swiss were unconcerned about the environment, but were more worried about immediate problems at present.\"People find it very hard to think about problems in the future, and don't see the urgency of these problems,\" she said. \"When they are having a difficult time during the COVID-19 pandemic they are thinking about immediate concerns more.\"Agrochemicals makers Syngenta and Bayer (BAYGn.DE) both welcomed the result.\"It is a clear vote for a productive, resource-efficient agriculture,\" Bayer said.Separate referendums to support a temporary law providing financial support for businesses during the COVID-19 pandemic and a law to give police extra powers to tackle terrorism were both approved by 60% and 57% of voters respectively."}