{"text": "AMMAN Syrian President Bashar al Assad said on Wednesday that sweeping new U.S. sanctions amounted to a new stage of economic warfare against his government and were part of long-standing U.S. efforts to choke the living standards of Syrians.In a speech to deputies at the presidential palace, Assad also blamed the sanctions, known as the Caesar Act, for a fall in Syrias currency to new record lows, with panic buying of dollars by Syrians worried about their economic situation.Assad urged his subjects to support the currency, which has lost around almost two thirds of its value since the start of Syrias nearly decade-old conflict that has killed hundreds of thousands of people and made millions refugees.Our support of the pound is a source of our strength, Assad said, criticizing a scramble by ordinary Syrians to buy foreign currencies as a safe haven to cushion themselves from skyrocketing inflation.The pound touched a record low of 3,000 to the dollar in June as many feared the new sanctions would tighten the noose around Assad and worsen Syrias dire economic plight.It traded at 47 to the dollar before protests against Assads rule erupted in March 2011.The collapse of the currency has driven up inflation and aggravated hardship as Syrians struggle to afford food, power and other basics.Assad said Western adversaries were waging a long-term economic war that Syria could withstand by raising its food self-sufficiency and by cracking down on corruption, which he said was wasting public funds needed to raise living standards.The Caesar Act is not a separate case, it is another phase in stages of sanctions that preceded it for years and which have caused huge damage, he told the deputies.Washington says the goal of the new sanctions is to hold Damascus to account for war crimes and deter it from further pursuing the war. The sanctions exempt humanitarian aid.Earlier, state media had flashed that Assad had suffered low blood pressure for a few minutes while delivering a speech to parliament, before resuming normally, and that it would broadcast it later in the evening.Assad was shown in a pre-recorded speech asking for a chair to rest after he stopped the address, and in the edited footage he reappeared on television in front of the deputies.Doctors are the worst patients, in truth I have not had anything to eat since yesterday. I had some sugar and salt, the 55-year-old former eye doctor said, without elaborating."}