{"text": "WASHINGTON Taiwan is in discussions with the United States on acquiring underwater sea mines to deter amphibious landings as well as cruise missiles for coastal defense, Taiwans de facto ambassador to United States said on Wednesday.Speaking to the Washingtons Hudson Institute think tank, Hsiao Bi-khim said Taiwan was facing an existential survival issue, given Chinas territorial and sovereignty claims over the island and needed to expand its asymmetric capabilities.What we mean by asymmetric capabilities is cost effective, but lethal enough to become deterrence - to make any consideration of an invasion very painful, she said.Hsiao said Taipei was currently working with the United States on acquiring a number of hardware capabilities, including cruise missiles that would work in conjunction with Taiwans indigenous Hsiung Feng missile system to provide better coastal defense.Other systems under discussion included underwater sea mines and other capabilities to deter amphibious landing, or immediate attack, she said.Earlier, Taiwanese President Tsai Ing-wen told the online event she had made expanding accelerating development of Taiwans asymmetric defense capabilities its number-one priority.Hsiao said Taiwan also wanted to strengthen defenses on islands its controls in the South China Sea, which Beijing claims almost in its entirety.For Taiwan, our priority in our survival involves building up the defense of Taiwan itself, but also of the islands that Taiwan currently controls in the South China Sea, she said.Taiwan has been bolstering its defenses in the face of what it sees as increasingly threatening moves by Beijing.It said in May it plans to buy land-based Boeing-made Harpoon anti-ship missiles and U.S. sources said last week Washington was negotiating the sale of at least four sophisticated aerial drones to Taiwan for the first time.Washington broke off official ties with Taipei in 1979 in favor of Beijing but is still Taiwans biggest arms supplier and is bound by law to provide it with the means to defend itself.The Trump administration has emphasized its support for Taiwan as U.S. relations with Beijing sour over issues including human rights and trade.This week, U.S. Health Secretary Alex Azar became the highest-level U.S. official to visit Taiwan in four decades, a trip condemned by China, which routinely denounces U.S. arms sales to Taipei."}