{"text": "Twenty-five Chinese air force aircraft including fighters and nuclear-capable bombers entered Taiwan's air defence identification zone (ADIZ) on Monday, the island's government said, the largest reported incursion to date.While there was no immediate comment from Beijing, the news comes after the U.S. State Department on Friday issued new guidelines that will enable U.S. officials to meet more freely with Taiwanese officials, further deepening ties with Taipei. read more Chinese-claimed Taiwan has complained over the last few months of repeated missions by China's air force near the self-ruled island, concentrated in the southwestern part of its air defence zone near the Taiwan-controlled Pratas Islands.The latest Chinese mission involved 14 J-16 and four J-10 fighters, as well as four H-6K bombers, which can carry nuclear weapons, two anti-submarine aircraft and an early warning aircraft, Taiwan's Defence Ministry said.It was the largest daily incursion since the ministry began regularly reporting Chinese Air Force activities in Taiwan's ADIZ last year.The ministry added that combat aircraft were dispatched to intercept and warn away the Chinese aircraft, while missile systems were also deployed to monitor them.The Chinese aircraft all flew in an area close to the Pratas Islands, according to a map the ministry provided.China has in the past described such missions as being to protect the country's sovereignty and deal with \"collusion\" between Taipei and Washington.The United States, which like most countries has no formal diplomatic ties with Taiwan, has watched with alarm the stepped up tensions with Beijing.U.S. Secretary of State Antony Blinken said on Sunday the United States is concerned about China's aggressive actions against Taiwan and warned it would be a \"serious mistake\" for anyone to try to change the status quo in the Western Pacific by force. read more China describes Taiwan as its most sensitive territorial issue and a red line the United States should not cross. It has never renounced the possible use of force to ensure eventual unification."}