{"text": "1/GONG HEI FAT CHOY!Its the Lunar Year of the Ox. Since the same Chinese character can be used to denote a bull, some investors might see that as a good omen for world markets.Higher bond yields could spoil the party at some point, but for now equity markets are charging on, not least in Asia, where Japans Nikkei is at three-decade highs and Chinese blue-chip stocks a whisker off 2007 peaks. European and U.S. shares have rallied 50% and 80% respectively from March 2020 lows.Markets are oiled, of course, by plentiful monetary and fiscal stimulus. But if vaccine rollouts and falling COVID case loads unleash pent-up consumer demand, economic recovery will follow. Those hopes have lifted copper, a reliable growth barometer, to eight-year highs.Recovery wont be smooth, but then, oxen are reputed to be strong and patient. In China, too, they are having to be patient -- pandemic-linked curbs exclude the usual high-spending week- long holiday with travel and parties. Hopefully, next year.-Record $58.1 bln pours into global equity funds-China New Year travel slumps amid coronavirus(Graphic: World stocks - )https://fingfx.thomsonreuters.com/gfx/mkt/bdwpknakrvm/Pasted%20image%201613126480362.png2/CAPITOL HILLWall Street has been fixated on GameStop and the retail trading frenzy unfolding on Reddit forums.But on Thursday, action moves to Capitol Hill, when executives from companies at the center of the action - Robinhood, Melvin Capital and Citadel Securities - are expected to testify before a House panel here exploring the trading turmoil.It could be the first of several investigations to uncover what happened when retail traders sent shares in otherwise nondescript companies like GameStop to the moon, squeezing out hedge funds that had gone short on those companies.For those who lost money or made fortunes from the \"stonks\", the hearings will be riveting. GameStop shares, meanwhile, have dramatically deflated, while short interest www.datawrapper.de/_/DkfMh- a measure of shares on loan - has slumped.-Robinhood, Melvin Capital, Citadel execs expected to testify in Congress on GameStop turmoil -sources(Graphic: GameStop's short interest has fallen in recent weeks - )https://fingfx.thomsonreuters.com/gfx/mkt/qzjpqgeewpx/Pasted%20image%201613098181977.png3/BANKING FOR BRITAINBarclays kicks off the reporting season for Britains banks when it announces 2020 results on Feb. 18.Investors want to see how loan books are holding up as the pandemic plays out. Government support schemes such as mortgage holidays and furloughs have largely deferred the pain, and with banks having taken hefty provisions already, the market is not expecting much deterioration in balance sheets.Lenders with investment banking arms, including Barclays and HSBC, could report a strong 2020, as they benefited from pandemic-induced market volatility. Analysts will question banks on when they will restore largely abandoned profitability targets and may renew calls for dividends to be resumed.Barclays is followed by NatWest on Feb. 19. HSBC, Lloyds and Standard Chartered report on Feb. 23, 24 and 25 respectively.(Graphic: UK bank shares still far from covering Corona losses - )https://fingfx.thomsonreuters.com/gfx/buzz/nmopazjqwva/Pasted%20image%201613119812300.png4/PAY ATTENTION TO MR BONDBonds have a track record of getting it right on the economy, so pay attention to what they say.U.S., German and UK 30-year yields are up 20 to 30 basis points this year. Even Swiss 30-year yields have risen toward 0%, up 21 bps in 2021 so far.Okay, yields remain super low and not a sign of any inflation surge. But if the moves are a signal that extreme pessimism on the economy is abating, it will be a relief for policymakers.The reflation focus may increase bond markets sensitivity to economic data. Flash PMIs, due on Feb. 19 across major economies, have taken a back seat lately. That may change.-Euro area 30-year sovereign borrowing costs back above 0%(Graphic: Rise in 30-year bond yields so far in 2021  )https://graphics.reuters.com/GLOBAL-MARKETS/dgkplzweqpb/chart.png5/ WHEN CHIPS ARE DOWNOne side effect of pandemic-era remote working is a global semiconductor shortage, a squeeze stemming from soaring demand for electronics but now rippling across industries.Carmakers, for instance, are being forced to cut production just as sales pick up. Chipmakers are seeing surging demand from 5G telecoms, data centres, industrial electronics and the internet of things.We will hear more in coming days as the likes of carmakers Daimler and Renault report earnings. Governments from France to the United States are wading in too, promising to ensure a lack of chips doesnt throttle economic recovery.-GM CEO says chip shortage could hit profits by $2 bln, but trucks wont be hurt(Graphic: Global semiconductor sales - )https://fingfx.thomsonreuters.com/gfx/mkt/jznpnozdmvl/Global%20semiconductor%20sales.PNG"}