{"text": "1/ROBINHOOD AND THE MERRY TRADERSRise and rise again until lambs become lions, runs an oft-quoted line from the 2010 film Robin Hood. The motto is being taken seriously by all those merry men and maidens chasing shares in little-known or even bankrupt firms, using a mobile trading app called Robinhood.Frenzied traders also piled into bankrupt names Hertz and JC Penney, pushing shares 300-500% higher. Some Chinese fintech companies were pumped up for no apparent reason -- possibly they were climbing the charts on Robintrack, a site tracking activity on the Robinhood app.Seasoned traders are scratching their heads. Big punts on small Chinese firms wont impact broader markets but retail cash coursing through mainstream shares will further widen the disconnect between equity prices and the global economy.(GRAPHIC - Pump and dump: Some of Robinhooders' favorite trades: )https://fingfx.thomsonreuters.com/gfx/buzz/gjnpwydeapw/Pasted%20image%201591950950144.png2/WATCH THAT VIXThe June 11 equity selloff brought the spotlight back onto the Cboe Volatility Index or VIX -- Wall Street's \"fear gauge\". It pared a weeks-long drift lower to rise above 40, tmsnrt.rs/2Yl9tGo its highest close since April 23, amid renewed fears for U.S. growth and the coronavirus trajectory.A raft of U.S. data due in coming days might allay some concerns if they reveal an economy on the mend. April retail sales plunged a record 16.4% but hopefully that was the nadir. Industrial production and housing starts are the other anticipated data points.The VIX could react, however, if infections rise further. Also, with U.S. presidential election campaigning getting underway, VIX futures are starting to capture political risks -- theres a visible bump in volatility expectations closer to the Nov. 3 vote.(GRAPHIC - VIX jumps on renewed economic fears: )https://fingfx.thomsonreuters.com/gfx/editorcharts/jbyvrlabave/eikon.png3/BOE WAR CHESTAll central banks are battling coronavirus damage but the Bank of England also has Brexit to contend with. Aprils 20% GDP slump leaves Britains economy the same size as in 2002; this year could bring the biggest contraction in 300 years.The BOE is expected to give itself another 100 billion pounds in firepower at its June 18 meeting, adding to the expansion announced in March. Some reckon it could stretch to 200 billion pounds.What about letting interest rates go negative? Unlikely -- the BOE says it needs more time to weigh that.Unfortunately, policy makers dont know if coronavirus cases will surge again or whether the government can reach a trading arrangement with the EU by Dec. 31. If Britain is cast adrift without a trade deal, all bets are off on the economic outlook - and indeed on how much QE the BOE will eventually have to do.(GRAPHIC - Central bank assets JPG: )https://graphics.reuters.com/GLOBAL-CENTRALBANKS/010041ZQ4CT/GLOBAL-CENTRALBANKS.jpg4/TICK TOCKThe clock is ticking again for the European Union, which has two pressing matters to deal with.First Brexit. On June 15, Britain and the EU will attempt to revive stalled talks on post-Brexit ties. Theres been little progress on a free-trade agreement and little time left to extend the end-2020 deadline for an deal.Then, on June 18-19, EU leaders will debate a recovery fund to repair COVID-19 damage. Most members support the European Commission proposal. But a quartet dubbed the Frugal Four - Netherlands, Austria, Denmark and Sweden -- remain sceptical. For the proposal to succeed, it must get the nod from everyone. Any delay will be a major setback for the euro and southern European bonds.(GRAPHIC - Euro, euro zone bond markets during the coronavirus crisis: )https://fingfx.thomsonreuters.com/gfx/mkt/bdwpkdbabvm/Pasted%20image%201591955351780.png5/TWO AND THREEData from the worlds second and third-largest economies will soon tell us how large a gap there is between hope and reality. China releases retail sales, industrial output and house price data, while Japan has trade figures and a central bank meeting.The Bank of Japan wont do much on June 15-16, given its yield curve is already set to a tune conducive for growth and its balance sheet continues to expand.China should show a multi-track recovery -- an industrial sector slowing less markedly, a timid consumer and a housing market feeding on cheap credit.Authorities are switching towards more targeted lending, away from just easing broad cash conditions, but its too early to see that play out in data.(GRAPHIC - China money markets, structured deposits, yuan: )https://fingfx.thomsonreuters.com/gfx/mkt/oakpeqlkjpr/Pasted%20image%201591935274272.png"}