{"text": "SHANGHAI/HONG KONG Chinese online insurance technology firm Waterdrop Inc is receiving pushback from domestic regulators on its planned U.S. initial public offering as its business model is seen as risky, four people familiar with the situation told Reuters.Waterdrop, which is backed by internet giant Tencent Holdings, has been working with financial advisers since mid last year on going public and had already made a confidential filing for the float, said three of the people.The China Banking and Insurance Regulatory Commission (CBIRC), however, has questioned the companys business risks, which has slowed down the IPO process, they said. CBIRC even told founder Shen Peng this month that it would not suggest that Waterdrop go public at this point, said one of the sources.Beijing-headquartered Waterdrop distributes insurance policies online and provides illness crowd-funding. It was not immediately clear what exactly CBIRC felt was risky in its business.Waterdrop denied in an emailed statement that Chinese regulators were opposed to its capital markets plan, adding that its senior managers are in regular communication with regulators.CBIRC did not immediately respond to a request for comment. The sources declined to comment as the information is private.The scrutiny on Waterdrop and its IPO comes as Chinas financial regulators have stepped up supervision over the countrys financial technology companies after the halting of Ant Groups $37 billion IPO in November due to financial risks.Waterdrop does not need Chinese regulatory approval to list in the United States as, like many other mainland startups, its incorporated offshore, but CBIRCs reservations about the IPO do not bode well for such companies share sale plans in general.Waterdrop had aimed to go public by end-2020 but is now looking to list in the second quarter, according to two of the sources. It was not immediately known how much Waterdrop is seeking to raise or at what valuation.The company last month shut down its online healthcare mutual aid platform, which provided users with a shared basic health plan covering various types of critical illnesses, amid regulatory headwinds.Waterdrop said the programme had served 80 million users. Such platforms are, however, not licensed by the CBIRC.The mutual aid platform was considered one of the main generators of user traffic and clipping it would mean a major business model change for the company, said two sources familiar with the company.Founded in 2016 by Shen, a former executive at Chinese food delivery and local services giant Meituan, Waterdrop raised $230 million in a pre-IPO round in August led by reinsurer Swiss Re and Tencent at a valuation of about $2 billion.It also counts IDG Capital, Boyu Capital and Meituan as investors.Bank of America and Goldman Sachs, which are advising Waterdrop on its IPO, declined to comment. (This story refiles to correct name of company in paragraph 13 to Meituan from its former name Meituan Dianping)"}