{"text": "HONG KONG Chinas Tencent said on Wednesday it did not believe a U.S. move to ban transactions on its international messaging to payments WeChat app would apply to its domestic Weixin platform, potentially limiting fallout from the move.Tencent is the latest Chinese tech giant caught in the crosshairs of an escalated Sino-U.S. cyber war after President Trump said last week the United States would ban WeChat-related transactions in the country.In a call after reporting a 37% rise in second-quarter net profit, executives tried to soothe market sentiment and said the company was in the process of seeking further clarification from relevant parties.Chief financial officer John Lo said Tencents initial reading was that the U.S. executive order was focused on WeChat in the United States and it did not believe its other businesses there would be affected.The U.S. accounts for less than 2% of Tencents total revenue, said James Mitchell, chief strategy officer, and likely less than 1% of total advertising revenue.If you look at the executive orders from May 2019 and then obviously the executive order a couple of days ago, they specify very clearly they cover U.S. jurisdiction, and consequently we dont see any impact on companies advertising on our platform in China, he said.Revenue from online games, which accounts for one-third of total sales, jumped 40% in the second quarter, primarily driven by smart phone games including Peacekeeper Elite and Honour of Kings, as the coronavirus put a dent in other entertainment options.However, the company postponed a blockbuster release of \"Dungeon and Fighter Mobile\" game here, planned for Aug. 12, citing upgrades needed to the game's addiction prevention system. It did not indicate a new release date.Social networks, fintech and business services, and social advertising revenues all grew by nearly 30%.Media advertising revenues fell by 25% however, amid a challenging macro environment and delayed content production and releases.The worlds largest gaming firm by revenue booked a 33.1 billion yuan ($4.8 billion) profit for the three months through June, ahead of an average analysts estimate of 27.56 billion yuan, according to data from Refinitiv.Revenue rose 29% to 114.88 billion yuan, versus market expectations of 112.76 billion yuan.($1 = 6.9474 Chinese yuan renminbi)"}