{"text": "Tesla Inc Chief Executive Elon Musk has been sued by a shareholder who accused him of violating his 2018 settlement with the U.S. Securities and Exchange Commission over his Twitter use.According to a complaint unsealed late Thursday in Delaware Chancery Court, which also names the electric car companys board as defendants, Musks erratic tweets and the failure of Tesla directors to ensure he complied with the SEC settlement have exposed shareholders to billions of dollars of losses.The complaint highlighted several Musk posts on social media platform Twitter, including his assessment last May 1 that Teslas stock price was too high, prompting a more than $13 billion tumble in Teslas market value.Chase Gharrity, the plaintiff, said Musks actions and the directors inaction have caused substantial financial harm, and that they should pay damages to Palo Alto, California-based Tesla for breaching their fiduciary duties.The lawsuit was filed even though Teslas share price has soared nearly fivefold since Musks too high tweet, giving Tesla a valuation well above $600 billion, and the SEC has not publicly accused Musk of recent violations.It could pressure the SEC into taking some sort of recourse, said Charles Elson, a University of Delaware professor and corporate governance specialist.Tesla did not immediately respond on Friday to requests for comment. Gharritys lawyers, Musks lawyers in the SEC case, and the SEC did not immediately respond to similar requests.The SEC settlement followed Musks August 2018 tweet that he had funding secured to possibly take Tesla private in a $72 billion transaction. In reality, Musk was not close.Musk and Tesla each paid $20 million in civil fines, and Tesla lawyers agreed to vet some of Musks tweets in advance.The settlement was later amended to clarify when pre-approvals were required, prompted by a unvetted tweet by Musk about Teslas vehicle production forecast.Last April, a San Francisco federal judge said Tesla and Musk must face a lawsuit claiming Musks going-private tweet defrauded shareholders. That case remains pending.The case is Gharrity v Musk et al, Delaware Chancery Court, No. 2021-0199."}