{"text": "Tesla Inc (TSLA.O) will no longer accept bitcoin for car purchases, Chief Executive Elon Musk said on Wednesday, citing long-brewing environmental concerns for a swift reversal in the companys position on the cryptocurrency.Bitcoin fell more than 10% after Musk tweeted his decision to suspend its use, less than two months after Tesla began accepting the worlds biggest digital currency for payment. Other cryptocurrencies, including ethereum, also fell before regaining some ground in Asia trade.The use of bitcoin to buy Tesla's electric vehicles had highlighted a dichotomy between Musk's reputation as an environmentalist and the use of his popularity and stature as one of the world's richest people to back cryptocurrencies.Some Tesla investors, along with environmentalists, have been increasingly critical about the way bitcoin is \"mined\" using vast amounts of electricity generated with fossil fuels.Musk said on Wednesday he backed that concern, especially the use of \"coal, which has the worst emissions of any fuel.\"\"Cryptocurrency is a good idea on many levels and we believe it has a promising future, but this cannot come at great cost to the environment,\" he tweeted. Tesla shares fell 1.25% after hours.Tesla revealed in February it had bought $1.5 billion of bitcoin, before accepting it as payment for cars in March, driving a roughly 20% surge in the cryptocurrency.Tesla would retain its bitcoin holdings with the plan to use the cryptocurrency as soon as mining transitions to more sustainable energy sources, Musk said.Bitcoin is created when high-powered computers compete against other machines to solve complex mathematical puzzles, an energy-intensive process that currently often relies on electricity generated with fossil fuels, particularly coal.At current rates, such bitcoin mining devours about the same amount of energy annually as the Netherlands did in 2019, the latest available data from the University of Cambridge and the International Energy Agency shows.Analysts said Musk's about-face was inevitable.\"The environmental impact from mining bitcoins was one of the biggest risks for the entire crypto market,\" said Edward Moya, a senior market analyst at currency trading firm OANDA.Meltem Demirors, chief strategy officer at digital asset manager CoinShares Group, said Tesla was unlikely to have sold many, if any, cars using bitcoin and the backflip generated positive publicity while simplifying payment processes.\"Elon was getting a lot of questions and criticisms and this statement allows him to appease critics while still keeping bitcoin on his balance sheet,\" Demirors said.Mark Humphery-Jenner, an associate professor of finance at the University of New South Wales, said he was more concerned about Tesla management's \"very hasty and precipitous\" decision-making.Musk did not say in his Twitter comments whether any vehicles had been purchased with bitcoin and Tesla did not immediately respond to a request for comment.CRYPTOCURRENCY SUPPORTSome bitcoin proponents note that the existing financial system - with its millions of employees and computers in air-conditioned offices - uses large amounts of energy too.Musk reiterated he remained a strong believer in cryptocurrencies.\"We are also looking at other cryptocurrencies that use <1% of bitcoin's energy/transaction,\" he tweeted on Wednesday.Just a day earlier, Musk had polled Twitter users on whether Tesla should accept dogecoin, a currency he has helped turn from a joke into a valuable commodity.He announced on Sunday that his commercial rocket company SpaceX will accept dogecoin as payment to launch a lunar mission next year - just hours after he sent the cryptocurrency spiraling downward when he called it a a hustle during a guest-host spot on the Saturday Night Live comedy sketch TV show.CHINA DOMINANCEThe dominance of Chinese bitcoin miners and lack of motivation to swap cheap fossil fuels for more expensive renewables could mean there are few quick fixes to the cryptocurrency's emissions problem.Chinese miners account for about 70% of bitcoin production, data from the University of Cambridge's Centre for Alternative Finance shows. They tend to use renewable energy - mostly hydropower - during the rainy summer months, but fossil fuels - primarily coal - for the rest of the year.Officials in Beijing are conducting a check on data centres involved in cryptocurrency mining to better understand their impact on energy consumption, sources told Reuters last month.In theory, blockchain analysis firms say, it is possible to track the source of bitcoin, raising the possibility that a premium could be charged for green bitcoin."}