{"text": "NEW YORK Former champion Naomi Osaka is wearing a different facemask for each of her matches at the U.S. Open this year. They each carry the name of a Black American and aim to highlight racial injustice in the United States to a wider audience:ROUND ONE - BREONNA TAYLORTaylor, 26, was shot dead by police in her apartment in Louisville, Kentucky on March 13.One police officer involved was fired by the citys police department in June. Two other officers have been placed on administrative reassignment. No criminal charges have been filed against any of the three.ROUND TWO - ELIJAH MCCLAINMcClain, 23, died after a violent encounter with police officers in Aurora, Colorado in August last year.His family filed a lawsuit against the city and its police last month, alleging murder and routine use of excessive force against Black people.ROUND THREE - AHMAUD ARBERYArbery, 25, was fatally shot after being pursued by armed white men as he jogged through a suburban neighborhood in Georgia in February.Three white men have been charged with the murder of Arbery in a case that spurred a national outcry after cellphone video of the shooting was leaked on the internet.ROUND FOUR - TRAYVON MARTINMartin was a Black teenager whose killing by civilian George Zimmerman in Florida in 2012 helped spark the 'Black Lives Matter' movement reut.rs/2ZzpTfP.QUARTER-FINALS - GEORGE FLOYDFloyd died in hospital on May 25 after Minneapolis police officer Derek Chauvin knelt on the 46-year-olds neck for nearly nine minutes during an arrest.His death triggered mass protests against racial injustice and police brutality in the United States that have spread internationally.Chauvin and three other Minneapolis police officers were fired a day after a video of the incident emerged. Chauvin was subsequently charged with second-degree murder and the other three officers with aiding and abetting.SEMI-FINALS - PHILANDO CASTILECastile was a 32-year-old Black man shot and killed by Minnesota police during a traffic stop in a St. Paul, Minnesota, suburb, in 2016, prompting protests.His girlfriend livestreamed the aftermath of the incident on social media, garnering national attention for the case.A jury acquitted an officer on charges of felony manslaughter and reckless discharge of a firearm.FINAL - TAMIR RICERice was a 12-year-old African-American boy who was fatally shot by police officer Timothy Loehmann in Cleveland, Ohio in 2014 while he played in a playground with a toy gun that fired plastic pellets reut.rs/3hwLhZm.In April 2016, Cleveland officials agreed to pay $6 million to settle a federal civil rights lawsuit filed by Rices family.Loehmann was fired in 2017 after an internal investigation found he provided inaccurate information on his application to join the police."}