{"text": "MINSK Protesters formed human chains and marched through the streets of Belarus carrying flowers on Wednesday in anger at a crackdown by strongman President Alexander Lukashenko that has prompted the European Union to consider new sanctions against Minsk.Security forces have clashed with protesters for three consecutive nights after Lukashenko claimed a landslide re-election victory in a vote on Sunday that his opponents say was rigged. Police have detained around 6,000 people.Lukashenko has sought better relations with the West amid strained relations with traditional ally Russia. Brussels lifted sanctions, imposed over Lukashenkos human rights record, in 2016, but will weigh new measures this week.Lithuania, Poland and Latvia jointly offered to mediate between Lukashenko and the protesters, and threatened sanctions at a European or national level if the offer was declined.A former Soviet collective farm manager, the 65-year-old Lukashenko has ruled Belarus for more than a quarter of a century but faces increasing anger over his handling of the coronavirus pandemic, a sluggish economy and human rights.Women dressed in white formed a human chain outside a covered food market in the capital Minsk, holding flowers in the air and chanting slogans, while a crowd also gathered outside a prison where protesters were being kept.I cannot leave my children at night but I can come during the daytime and say my piece, said Minsk resident Yelena. They have stolen not just my vote but 26 years of my life. Yes, I think so, and this regime must go away.CLASHESThe Belarusian interior ministry said 51 protesters and 14 police officers had been injured in clashes on Tuesday night.In Brest, a city in southwestern Belarus on the Polish border, police fired live rounds after some protesters it said were armed with metal bars ignored warning shots fired in the air, the ministry said. One person was injured.Lukashenko has accused the protesters of being in cahoots with foreign backers from Russia and elsewhere to topple his government, and compared them to criminal gangs.The core of all these so-called protesters today comprises people with a criminal history and the unemployed, he said at a government meeting on Wednesday.Belarusian authorities earlier tied opposition leader Sviatlana Tsikhanouskayas husband to a plot by suspected Russian mercenaries to destabilise the country ahead of the election. She denied the allegation in an interview with Reuters.In Tuesday nights clashes, security forces beat some of the protesters, sometimes dragging people out of cars before attacking them.United Nations human rights chief Michelle Bachelet condemned the detention of 6,000 people, including bystanders, as well as minors, suggesting a trend of massive arrests in clear violation of international human rights standards.Some of the detainees were lined up in a row on state television this week, looking subdued and promising not to engage in revolutionary activities.State media also broadcast footage of a van in Minsk with Russian number plates saying it was packed with ammunition and tents.Tracked down by Reuters, Valdemar Grubov, the vans owner, said he was a film producer and that the vehicle contained only his own personal effects.He said he had been unable to retrieve the van due to COVID-19 restrictions and was not involved in any alleged foreign plot.Tsikhanouskaya, a 37-year-old former English teacher who took on Lukashenko in the vote, has fled to neighbouring Lithuania to join her children there. She urged her compatriots not to oppose the police and to avoid putting their lives in danger.But the protests continued into the evening on Wednesday as thousands took to the streets of the capital.We are scared but what else can we do? We are not being aggressive. We are women standing here who also have a voice, said Minsk resident Zhenya. We are scared of being arrested but we want to be heard."}