{"text": "NEW YORK Three of 10 Americans who lost work during the coronavirus pandemic said they may have trouble paying for food or housing after a $600-per-week enhanced unemployment payment expired last month, according to a Reuters/Ipsos poll released on Wednesday.The poll conducted Monday and Tuesday found that Americans divide blame for its expiration - and the weeks-long standoff in Congress over how to replace it - pretty evenly between Democrats and Republicans.The $600 weekly payments, approved as part of a $3 trillion package that Congress approved early in the crisis, became a lifeline for the tens of millions of Americans thrown out of work in a pandemic that has prompted widespread business closures.It expired on July 31, and weeks of talks between top congressional Democrats and the White House failed to produce agreement on a new round of funding. Republican President Donald Trump on Saturday signed a memorandum aimed at restoring half that federal payment, though economists wanted that even if the maneuver overcomes possible legal challenges, it will likely have little impact.The poll was conducted amid a surge of coronavirus cases in many states and as the Nov. 3 presidential and congressional elections draw closer.Three out of 10 people surveyed by Reuters/Ipsos reported that they will have a very difficult time meeting basic needs, which includes paying for rent or buying groceries. Half said they are under some stress but we will be able to meet our basic needs.The poll found that Americans blame negotiators on both sides of the partisan divide for the governments inability to extend benefits for those who have been struggling to manage during the pandemic. Twenty-eight percent of American adults said congressional Democrats should receive most of the blame, while 15% said they blame congressional Republicans and another 14% said Trump was most at fault. Thirty-two percent said all share the blame equally.The Reuters/Ipsos poll was conducted online, in English, throughout the United States. It gathered responses from 1,215 U.S. adults, including 139 who said they had received the weekly coronavirus unemployment benefit. The poll has a credibility interval, a measure of precision, of about 3 percentage points."}