{"text": "Central banks are going from famine to feast. After years of trying to generate more inflation, theres suddenly plenty of it: U.S. consumer prices rose by a whopping 4.2% in April compared with a year earlier, the fastest pace since 2008.In the old days, Wednesdays eye-popping data might have hastened monetary policy tightening. But Federal Reserve Chair Jerome Powell, like his global peers, thinks the phenomenon is transient and will wait for the economys Covid-19 scars to heal. The strategy will be tested by three scarcities: in commodities, in intermediate goods that businesses need to make finished products, and in the labour market.Rising prices for raw materials, from lumber to iron ore, have boosted the Bloomberg Commodity Index, which tracks 21 commodities, by 20% so far this year. Its from a low base, and also theres more demand because the global economy is recovering. This, on its own, wont trigger an inflationary spiral.But throw in supply disruptions, and price pressures are a bit more acute. Intermediate goods, like semiconductors, are costlier, and healthier growth means it is easier for their makers to pass on higher charges to customers. JPMorgans April survey of global purchasing managers showed the strongest rise in selling prices on record. When companies like Procter & Gamble (PG.N) and Kimberly-Clark (KMB.N) say they will charge more for some products in the United States, consumers pay more at the checkout.Granted, supply disruptions will ease. But whether U.S. inflation stays high will depend on how long an odd scarcity of labour persists. The unemployment rate is a relatively high 6.1%, yet an Institute for Supply Management service sector survey last week said some companies experienced difficulties in April in finding and retaining skilled and unskilled labour. A jump in average hourly earnings and a rise in the length of the average working week in the same month also point to a paucity of labour.This too may pass. Pandemic-era childcare problems, which are keeping some parents out of the workforce, will ease. Many on enhanced unemployment benefits will return to work. In the meantime, demand for labour is roaring back: job openings hit a record high in March. Employers may therefore have to pay more to fill vacancies and retain staff who see prices on the shelf going up. That could usher in a self-feeding inflation cycle which might be too much, even for Powell.Follow @swahapattanaik on TwitterCONTEXT NEWS- U.S. consumer prices rose 0.8% in April from March, the Labor Department said on May 12. The annual inflation rate jumped to 4.2%, the biggest year-on-year increase since September 2008."}