{"text": "STONEHAVEN, Scotland Three people died in a train derailment in eastern Scotland on Wednesday that left carriages overturned and piled on top of each other on a steep wooded slope, making it hard for emergency services to access the scene.Dark smoke billowed from the site of the accident for most of the day after the ScotRail train derailed in the morning in a narrow valley near Stonehaven, south of the city of Aberdeen.Aerial footage showed one carriage detached from the rail tracks and lying on its side some distance down the slope. Another was completely overturned and had two carriages resting on it, one of which was also overturned.Two air ambulances and about 30 emergency service vehicles could be seen in a field just above the site. With rescue workers hampered by the steep terrain and dense woodland, it took many hours for casualty numbers to be confirmed.My deepest condolences are with the loved ones of those who lost their lives in this tragic incident, said Nicola Sturgeon, first minister of Scotlands semi-autonomous government.The British Transport Police said the driver was believed to have been among the dead. Six people were taken to hospital with injuries not thought to be serious, and officers believed everyone who had been on board was accounted for.The force gave no indication on the causes of the derailment, saying only that it was investigating.Stonehaven and the surrounding area had been hit by floods in recent days following heavy rain and some reports suggested a landslide may have played a part in the derailment, although that was not confirmed by the authorities.FEW PASSENGERSBritish Prime Minister Boris Johnson said he was saddened to learn of the very serious incident and his thoughts were with all those affected.The train appeared to have been carrying very few passengers. The government has been advising Britons to avoid public transport wherever possible as part of efforts to reduce transmission of the coronavirus.Britain has one of Europes lowest rates of fatal rail accidents, with a stronger safety record than Germany or France in recent years, according to Eurostat data that includes unauthorised people on railway tracks and at level crossings.For passengers, European railways are very safe, with just 13 rail passenger deaths across the European Unions 28 member states in 2018, according to the most recent available data from Eurostat. One of those was in Britain.The worst rail disasters in Britain in recent decades were a 1999 collision between two trains at Ladbroke Grove, in London, in which 31 people died, and a 2001 accident near Selby in Yorkshire, northeast England, in which 10 people died after a car ran onto the track and was hit by two trains."}