{"text": "The data, released by the countrys biggest bank along with its annual profit announcement on Wednesday, shows Australias A$7.2 trillion housing market is being propped up by temporary relief payments for people left jobless by shutdowns to stop the virus spreading.That raises the risk of a sharp downturn in house prices when the payments stop and banks call in loans they deferred for coronavirus-impacted borrowers. Already the Australian government has extended a COVID jobless benefit by three months to December, at a reduced rate.Its a real timebomb, said Richard Holden, an economics professor at University of New South Wales.One of the tricky things for the banks is how aggressive theyre going to be in enforcing loans.About 1.3 million Australians have applied for the COVID jobless benefit, called JobSeeker, according to government figures, while economists estimate at least another 6 million people - a quarter of the population - are having their wages subsidised by a separate relief package for shuttered companies.CBA, which has a quarter of Australian home loans, said it had deferrals currently on about 135,000 mortgages, or 8% of its book. Of those deferred loans, 14% involved borrowers receiving JobSeeker benefits and nearly half that number had no other income earner to help service it.If many of those were forced to sell, it would have a notable impact on the market, said David Bassanese, chief economist at BetaShares Exchange Traded Funds.If youve got desperate sellers or forced sales, it could have a depressing effect on prices. That is the big risk: do (banks) keep deferring? Someones got to pay for this.RISK OF STEEP HOUSING DOWNTURNCBA, which has said house prices could fall nearly a third by the end of 2022, said it was contacting all customers with deferred mortgages to discuss options like returning to full or part payment, or converting their loans to interest only.Deferrals ... have provided obviously significant support and flexibility for customers, CBA Chief Executive Officer Matt Comyn said on an analyst call.The test is going to be how effectively we can make the orderly transition away from repayment deferrals, he added.Prime Minister Scott Morrison has said he expects to keep offering some form of COVID-specific jobless payment after the current cut-off.A housing downturn could further damage the economy, with the pandemic sending the nation spiralling into recession for the first time since 1991.For now, house prices have stayed relatively unaffected, with nationwide prices down a total of about 1% through May and June, although still up nearly 8% from a year earlier, according to property consultant CoreLogic. [reut.rs/2XUZBDY]Nationwide auction clearance rates are about two-thirds, down from about three quarters a year earlier, but higher than in other recent dips.Were expecting a fall, but were not expecting that big of a fall, said St George Bank senior economist Janu Chan.You still have some sort of support measures and there is also the possibility we could get some more."}