{"text": "LONDON Iridium has become the latest precious metal to undergo a spectacular price rally, after supply shortages and expectations it will be used to produce hydrogen to power a greener economy lifted its value by 160% in two months.The difficulty of raising output means prices could rise further, analysts said.A byproduct of platinum and palladium mining, iridium is vital for many industries. In shipping, it enables the chlorination of ballast water to stop vessels transporting invasive marine species, and for electronics, it is used in crucibles able to withstand the heat of crystal-making.It can also serve as a catalyst in electrolysis to split water into oxygen and hydrogen, which is increasingly in demand as a cleaner source of power than fossil fuels.Prices have climbed to a record high of $4,390 an ounce from $1,685 on Dec. 12, accelerating a rally that began in 2016, when iridium cost around $500 an ounce.Iridiums rise echoes that of other platinum group metals such as rhodium and palladium, which shot to all-time highs because of supply deficits.Youve got increasing concerns on supply and very weak liquidity in the market, said Emma Townshend, an executive at Impala Platinum, which mines the metal.Iridium supply is not growing. Iridium demand is growing, she said.The closure for several months last year of a processing facility run by Anglo American Platinum (Amplats) in South Africa created a supply shortfall just as the demand outlook improved, analysts at Heraeus Precious Metals said.The stronger demand picture is based on expectations of an economic rebound, as well as anticipation that demand for hydrogen will increase use of iridium.Iridium has the longest processing time of all the PGMs, so supply is set to be impacted (by the Amplats closure) well into 2021, providing support for sustained high prices, Heraeus analysts said.South Africa produces 80-85% of the worlds iridium. Amplats is a major producer and processes material for other miners.Around 250,000 ounces are produced each year, compared with around 10 million ounces of palladium and 8 million ounces of platinum. Because the market is small, miners do not change production in response to demand or prices.Inventories have been run down, said Jeffrey Christian at consultants CPM Group. No one knows how much is left, but its not a lot, he said."}