{"text": "BEIRUT Ten years into Syrias conflict, President Bashar al-Assad has survived the bloody insurgency which started out with peaceful protests in March 2011.He holds sway over many parts of the country, helped by Russias military presence and Irans Shiite militias.Hostile Turkey still controls swathes of territory in the northwest and the U.S. has a presence in the northeast, a major oil and wheat producing area.But Assads biggest challenge now is the economy.Post-war discontent with corruption, spiralling food prices, a collapsed currency, worsening power cuts and gasoline shortages have aggravated hardships for many families who have lost loved ones.This is a timeline of how the conflict began with peaceful pro-democracy protests, then developed into a multi-sided conflict that sucked in world powers, killed hundreds of thousands of people and displaced millions more.* March 2011 - The first big protests against Assads rule that began in Deraa in southern Syria spread across the country. Security forces respond with arrests and shootings.* June 2012 - World powers meet in Geneva and agree on the need for a political transition, but divisions on how to achieve it will foil years of U.N.-sponsored peace efforts.* July 2012 - Assad launches air raids on towns and cities that had rebelled against his rule, as once peaceful protesters now carry arms. Thousands are killed.* Aug. 2013 - Washington declares the use of chemical weapons a red line, but a gas attack on densely populated rebel-held Eastern Ghouta on the outskirts of Damascus kills hundreds of civilians without triggering a U.S. military response.* Jan. 2014 - An al Qaeda splinter group seizes Raqqa before grabbing territory across Syria and Iraq, declaring a caliphate and renaming itself Islamic State.* Sept. 2014 - Washington builds an anti-Islamic State coalition and starts air strikes, helping Kurdish forces turn the jihadist tide but creating friction with ally Turkey.* March 2015 - As Assads forces lose ground in many towns and cities that rose up against his one-party Baath rule, a mainstream armed insurgency composed of former demonstrators and army defectors is slowly undermined by Islamist militants helped by foreign jihadists coming to Syria.* Sept. 2015 - Russia joins the war on Assads side, deploying warplanes and giving military aid that, with the help of Iran, swiftly turns the course of conflict against the rebels.* Aug. 2016 - Alarmed by Kurdish advances on the border, Turkey launches an incursion with allied rebels, making a zone of Turkish control that it later extends in 2018.* Dec. 2016 - The Syrian army and its allies defeat rebels in their biggest urban base of Aleppo after months of siege and bombardment, confirming Assads momentum.* March 2017 - Israel acknowledges launching air strikes against Hezbollah in Syria, aiming to degrade the strength of Iran whose elite Quds forces and Shiite militias from Afghanistan and Lebanon steadily expand their influence in Syria.* April 2017 - The United States launches a first cruise missile attack on a Syrian government airbase near Homs after a poison gas attack on rebel-held Khan Sheikhoun.* Nov. 2017 - U.S.-backed, Kurdish-led forces defeat Islamic State in Raqqa. That offensive, and a rival one by the Syrian army, drives the jihadists from nearly all their land.* April 2018 - After months of blockade and air raids, the Russian-backed army recaptures Eastern Ghouta, before retaking the other insurgent enclaves in central Syria, and then the rebels southern bastion of Deraa in June.* Sept. 2018 - A Russian-Turkish deal over Idlib and the rebel-held northwest freezes the frontlines and reduces the bombing raids that killed hundreds of civilians in the last major opposition bastion.* March 2019 - As its local allies take Islamic States last area in the east, the United States decides to keep some troops in Syria after earlier saying it would pull out.* April-Dec. 2019 - Russian-backed forces launch a campaign in the northwest that ends with the capture of a strategic rebel town of Khan Sheikhoun in August, a site of a major chemical attack on civilians.* A Russian-Turkish summit in October reduces fighting until Moscow resumes a major assault in December that pushes deeper into the last opposition bastion.* Dec. 2019 - March 2020 - The Russian-led offensive in northwest Syria displaces about one million civilians, marking the worst humanitarian crisis since the conflict began. Ankara sends thousands of soldiers across the border to help stem the offensive. Turkey says it will not stop Syrian refugees from reaching Europe and opens its borders. Thousands flee for Greece.* March 2020 - Turkey and Russia agree a ceasefire for Idlib, vowing to hold joint patrols and establish a secure corridor near the M4 highway.* March-Aug. 2020 - Syria struggles with widespread transmission of COVID-19 that adds to the countrys hardships.* May 2020-March 2021 - The government faces severe fuel shortages and Syrians queue for hours for subsidised bread, signs of a faltering economy. The government is forced to ration supplies and apply several rounds of steep price hikes.* May 2020 - The first public signs of a fallout between Assad and his cousin tycoon Rami Makhlouf surface, with the later posting videos about the rift on social media.* June 2020 - The United States announces the toughest U.S. sanctions against Damascus known as the Caesar Act, with wider powers to freeze assets of anyone dealing with Syria, regardless of nationality, and covering more sectors from construction to energy.* Dec. 2020-March 2021 - Israel steps up its air strikes against various parts of Syria, especially the east, hitting targets to prevent further Iranian entrenchment.* Feb. 2021 - Joe Bidens U.S. administration carries out an airstrike in Syrias east alongside the Iraqi border against a structure belonging to what it said were Iran-backed militia. Syria calls the attack cowardly.* March 2021 - The Syrian pound hits new lows, trading close to 4,000 to the dollar as the economy weakens amid severe foreign currency shortages."}