{"text": "Here is a timeline of developments since China imposed national security legislation in Hong Kong this year, making anything Beijing regards as subversion, secession, terrorism or colluding with foreign forces punishable by up to life in prison.June 30: Beijing unveils details of the national security law, which takes effect just before midnight on the eve of the anniversary of its handover from British to Chinese rule on July 1.July 1: Police arrest more than 300 people as protesters take to streets. Ten are arrested under the new national security law.Britain promises to grant those in Hong Kong with British National Overseas (BNO) passports five years of limited stay to work or study as a pathway to citizenship.July 2: Government says protest slogan Liberate Hong Kong, Revolution of our times could constitute subversion.July 3: United Nations says it is alarmed at arrests in Hong Kong under new law.July 5: Hong Kongs Education Bureau urges schools to review textbooks to make sure they do not violate security law.First person charged under the new law is denied bail.Facebook Inc, Google Inc and Twitter Inc say they have suspended processing government requests for user data in Hong Kong.July 8: New national security office employing mainland agents is set up in a Hong Kong hotel. Protest anthem Glory to Hong Kong is banned in schools.July 14: Beijings top representative office in Hong Kong warns that primary elections to select democracy candidates for Legislative Council elections in September could violate the national security law.July 15: President Donald Trump orders an end to Hong Kongs special status under U.S. law. Beijing warns Washington of retaliatory sanctions.July 17: Taiwanese officials in Hong Kong are told their visas will not be renewed unless they sign a document supporting Beijings claim to Taiwan under its one China policy.July 20: Britain announces it will suspend its extradition treaty with Hong Kong.July 28: The University of Hong Kong (HKU) sacks veteran pro-democracy activist Benny Tai from his tenured position as an associate professor of law.July 29: Police arrest four people under the security law, the first such detentions outside of street protests.July 30: Hong Kong disqualifies a dozen pro-democracy candidates from running in the September election, citing reasons including collusion with foreign forces and opposition to the new law.July 31: Chief Executive Carrie Lam postpones the September election, citing a spike in coronavirus cases.Aug. 7: The United States imposes sanctions on Luo Huining, the head of Chinas Liaison Office in Hong Kong, Chief Executive Lam and other current and former officials Washington accuses of curtailing political freedoms in Hong Kong.Aug. 10: Media tycoon Jimmy Lai is arrested under the national security law, and detained over suspected collusion with foreign forces, as police search the offices of his Apple Daily newspaper.Aug. 26: The Guangdong Coast Guard arrests 12 people sailing in mainland Chinese waters from Hong Kong to Taiwan where they planned to apply for political asylum.Sept. 6: Police fire rounds of pepper balls at protesters and arrest almost 300 during demonstrations on the day of the postponed legislative elections, to oppose the postponement and the national security law.Sept. 12: Relatives of some of the 12 detained in China, donning masks and hats to shield their identities, make a public appeal for information on the fugitives and for them to be allowed to call home and consult lawyers appointed by the families and not by the Chinese government.Sept. 14: Hong Kong government says it will not intervene in the case of the 12 detained in China.Sept. 18: One of 14 foreign judges on Hong Kongs highest court says he has resigned over the national security law.Oct. 1: Carrie Lam hails the citys return to stability at China National Day celebrations as riot police arrest dozens while patrolling the route of a banned anti-government march.Nov. 9: The United States imposes sanctions on four more Chinese officials in Hong Kongs governing and security establishment over their alleged role in implementing the national security law.Nov. 10: Hong Kong says it is suspending extradition agreements and pacts on mutual legal assistance with the Netherlands and Ireland, weeks after both countries joined Britain, the United States, Canada, Australia, New Zealand, Germany and Finland in suspending extradition treaties with Hong Kong.Nov. 11: Hong Kong expels four opposition members from its legislature shortly after Beijing passes a resolution allowing local authorities to expel legislators deemed a threat to national security or not holding allegiance to Hong Kong, without having to go through the courts."}