{"text": "TOKYO Tokyo 2020 Olympics chief Yoshiro Mori resigned on Friday and apologised again for sexist remarks that sparked a global outcry, leaving the troubled Olympics searching for a chief five months from the opening ceremony.The resignation of the 83-year-old former prime minister further erodes confidence in organisers ability to pull off the postponed Summer Games during a coronavirus pandemic.A selection committee made up of an equal number of men and women, and centred around athletes, would choose a new president for the Tokyo 2020 organising committee, the groups chief executive Toshiro Muto told a news conference.We need to pick the next president urgently, Muto said, without saying when. The new president needed experience in the Olympics or Paralympics and a really high-level understanding of gender equality, diversity and inclusion, he said.The issue has focused global attention on gender disparity in the worlds third-largest economy. Former Prime Minister Shinzo Abe championed a policy of Womenomics but activists and many women say Japan still has a long way to go - especially in the workplace.Mori sparked a furore when he said during an Olympic committee meeting this month that women talk too much. He initially refused to step down.My inappropriate comments caused big trouble. Im sorry, Mori said on Friday, adding the most important thing was the success of the Tokyo Games.Mori again fanned the flames on Thursday by asking the mayor of the Olympic Village, 84-year-old Saburo Kawabuchi, to take over the job. That triggered widespread public dismay about the post going to another octogenarian man and media later reported that Kawabuchi turned the job down.We cant give the impression that things have changed unless we install a woman or see a generational shift, a government source told Broadcaster Fuji News Network.Seiko Hashimoto, a pioneering female lawmaker and seven-time Olympian, was among the candidates to replace Mori, media said. Born just days before the 1964 Tokyo Olympics opened, her first name is based on the Japanese word for the Olympic flame.Hashimoto said she had not been asked to replace Mori and that Japan would stay focused on preparations.DAMAGEThe controversy has done serious reputational damage to the Tokyo Olympics, said one source involved in the Games, requesting anonymity due to the sensitivity of the matter and adding that many officials want a woman to replace Mori.In Washington, White House spokeswoman Jen Psaki was asked at a regular briefing for a reaction to Moris resignation and the remarks that led to it, and replied: We certainly didnt approve of those comments.Japanese Prime Minister Yoshihide Suga, who has seen his governments popularity plunge over its handling of the coronavirus crisis, said the selection process should be based on rules and transparency.The International Olympic Committee (IOC) said it was as committed as ever to staging the Games, which are due to open on July 23.The IOC will continue working hand-in-hand with his successor to deliver safe and secure Olympic Games Tokyo 2020 in 2021, IOC President Thomas Bach said in a statement.Tokyo Governor Yuriko Koike, herself a pioneer as Tokyos first female leader, avoided a direct answer when asked during a news conference who Moris successor should be. She said, however, that the person should embody Olympic ideals of inclusivity and be somebody the world can accept.Diversity and harmony - thats something that the person at the top needs to understand, embody and broadcast, she said.Tammy Parlour, head of the Womens Sports Trust in Britain, told Reuters the Olympics were a chance to showcase equality.The wider issue is not what one man says though, but how the Olympic movement can capitalise on its visibility to promote brilliant women across all sports and create greater diversity behind the scenes in leadership positions, she said."}