{"text": "TOKYO Coronavirus cases in the Greater Tokyo area are showing signs of creeping up, Japanese Health Minister Norihisa Tamura said on Friday, raising questions about whether a state of emergency can be lifted on schedule on March 21.The Japanese government last week extended the emergency declaration for Tokyo and three neighbouring prefectures by 14 days, saying COVID-19 cases hadnt fallen far enough, and that new, more infectious coronavirus variants posed a threat.A decision on whether the state of emergency could be lifted in the Tokyo area, which accounts for about 30% of Japans population, would ultimately be made after hearing the views of experts, Tamura said in televised remarks.Lifting the measures will be based on putting in place a system to ensure theres not a rebound in cases, he said.Restrictions such as shorter business hours for restaurants and bars have helped reduce new cases in Tokyo to roughly a tenth of a peak of 2,520 cases on Jan. 7. But the numbers are far from Tokyo Governor Yuriko Koikes target of bringing the seven-day average to 70% of the preceding week.The number of new positive cases has stopped decreasing, and we need to be very vigilant about the possibility of a resurgence due to mutated strains, Koike said on Friday during a meeting with health experts.The seven-day average of new cases in Tokyo has been stuck in the mid- to high-200s since late February, while the daily tally exceeded 300 for the second straight day on Thursday.Tokyo - and Japan - are racing to bring coronavirus cases under control and vaccinations well under way as it prepares to host the Summer Olympics, scheduled to start on July 23. Overall, Japan has so far recorded about 441,000 coronavirus cases and 8,400 deaths.Japans COVID-19 inoculation campaign began only last month with health workers and has been moving slowly, hampered by a lack of supply.Japan expects to receive 9,188 cartons of vaccine developed by Pfizer Inc and BioNTech SE each week in May, or about 1.8 million vials, up from 10,475 cartons for all of April, said Taro Kono, the minister in charge of the vaccination effort.In May, we will receive 9,188 boxes each week. That will roughly be worth about 10 million shots a week, Kono told a news conference. We expect June volume will be even bigger than May.In a move to make the most of the vaccine available, Japan will use specialised syringes capable of extracting six doses from each Pfizer vial from the week of April 12 to inoculate medical workers, Kono said.Most of Japans stock of syringes consists of regular versions that can draw just five doses from each vial, sparking fears that millions of doses could be wasted.Kono declined to provide details on six-dose syringe procurement, such as which manufacturers will be providing them to Japan.Kono also said Japanese Prime Minister Yoshihide Suga will be vaccinated before taking a trip to the United States next month for a meeting with U.S. President Joe Biden.Suga will go to the U.S. in the first half of April and will become the first foreign leader to meet face-to-face with Biden, Chief Cabinet Secretary Katsunobu Kato told reporters earlier."}