{"text": "Toshiba Corp (6502.T) directors will hold an emergency meeting on Sunday to discuss reassigning the candidates for three key board committees ahead of a June 25 shareholder meeting, two people with direct knowledge of the matter told Reuters.The Japanese conglomerate's board will consider reassigning the candidates for the audit, nominating and compensation committees, after major shareholder advisory firms recommended against some of the candidates, the people said.They declined to be identified because the information is not public.The emergency meeting comes as Toshiba has been thrown into crisis by revelations this week that management and board members colluded with the Japanese government to pressure foreign investors.  read more The people gave no further detail on the reassignment of the candidates. Toshiba said in a statement it does not disclose the schedule or topics of board meetings.According to a shareholder-commissioned investigation released on Thursday, Toshiba's leadership reached out to the Ministry of Economy, Trade and Industry (METI) to get it to \"beat up\" foreign shareholders.Adding to the pressure, shareholder advisory firm Institutional Shareholder Services Inc (ISS) on Saturday  recommended that shareholders should vote against the re-appointment of board chairman Osamu Nagayama and four other directors.Four of the company's independent directors, all non-Japanese, have already said they were no longer in support of the full slate of director candidates nominated by Toshiba.ISS singled out current members of the nomination and audit committees.\"One could argue that as the investigation report was just released on June 10, there was no time to change director candidates,\" ISS said in its report, which was seen by Reuters.However, it added it was \"unthinkable that members of the nomination committee were unaware of the significance of the incident and accompanying shareholder concerns,\" as allegations have long been raised, it said.Glass Lewis, another U.S. advisory firm, has also urged shareholders at this year's AGM to vote against the re-appointment of the same five directors."}