{"text": "LONDON Britain will introduce new rules for companies to try to prevent goods linked to Chinas Xinjiang region entering the supply chain, foreign minister Dominic Raab said on Tuesday, toughening Londons response to allegations of forced labour.Addressing parliament, Raab said there was harrowing evidence of forced labour among Muslim Uighurs in Xinjiang after the United Nations estimated at least 1 million members of the minority among others were held in internment camps.China denies the accusation. A foreign ministry spokesman denounced the accusations of abuse in Xinjiang as Western lies.Raab said Britain wanted to make sure it was free from any products that had links with Xinjiang, where he cited the reports of the camps housing more than 1 million Uighurs, forced labour and the forced sterilisation of Uighur women.We must do more and we will, he said.Xinjiangs position in the international supply chain network means that there is a real risk of businesses and public bodies around the world, whether its inadvertently or otherwise, sourcing from suppliers which are complicit in the use of forced labour.It is not clear how many products connected to Xinjiang enter the supply chain in Britain.A Chinese foreign ministry spokesman called on Britain to reverse the decision on its new rules immediately.The so-called forced labour issue is in its entirety lies, a fabrication based on nothing, by people and organisations in the US and a few Western countries, the spokesman, Zhao Lijian, told a regular news briefing in Beijing.China would take all necessary measures to protect its national interests, sovereignty, security and development interests, Zhao said.Britains stance marks a further deteriorataion in its relationship with China just five years after London hailed the start of a golden era in ties and President Xi Jinping was feted in a state visit to the capital that included a dinner hosted by Queen Elizabeth.Since then, Britain has criticised China over Hong Kong and ordered the removal of equipment made by Chinas telecoms giant Huawei from its 5G network.Raab said Britain would check sourcing more thoroughly and toughen the Modern Slavery Act to include fines. It would also bar from government contracts any companies that do not comply with procurement rules, and launch a Xinjiang-specific review of export controls.This package put together will help make sure that no British organisations, government or private sector, deliberately or inadvertently are profiting from, or contributing to, human rights violations against the Uighurs or other minorities in Xinjiang, he said.After Britain finally left the European Union at the end of last year, Prime Minister Boris Johnson wants to forge an independent role for Britain in foreign affairs.But the government has resisted calls from some in the ruling Conservative Party to introduce Magnitsky-style sanctions, with Raab saying he was keeping the possibility in reserve.Magnitsky-style sanctions target individuals accused of human rights violations and are named after Sergei Magnitsky, a Russian lawyer who was arrested in 2008 after alleging that Russian officials were involved in large-scale fraud. He died in a Moscow prison in 2009.Some opposition lawmakers criticised the government for not going far enough and questioned what kind of impact the new measures would have.Raab said Britain still wanted a positive and constructive relationship with China but we wont sacrifice our values or our security.During a U.N. Security Council meeting on Tuesday, Britains Minister of State for Middle East and North Africa James Cleverly criticized China for using counterterrorism as a way to justify severe and disproportionate measures against the Uighurs and other ethnic minorities in Xinjiang.Chinas U.N. Ambassador Zhang Jun rejected the comments and told the 15-member council: The various narratives on Xinjiang are purely political motivated.They are devoid of any facts and are a sham political game through and through. We urge relevant countries to stop fabricating lies, stop practicing double standards on counterterrorism and stop interfering in Chinas internal affairs, Zhang said."}