{"text": "CIUDAD HIDALGO, Mexico In the days before U.S. President Joe Bidens inauguration, Mexican soldiers patrolling the banks of the wide Suchiate River found few migrants amid the flow of trade across the water from Guatemala.The likely explanation lay hundreds of miles to the south, where baton-wielding Guatemalan security forces beat back one of the largest U.S.-bound migrant caravans ever assembled, according to a Reuters photographer and other witnesses.Were scared, Honduran migrant Rosa Alvarez told a reporter by telephone as she fled with many others toward the nearby hills, two young children in tow.The operation was part of a U.S.-led effort, pursued by past American administrations and accelerated under former President Donald Trump, to pressure first the Mexican and then the Central American governments to halt migration well short of the U.S. border.Under the Biden administration, the same general strategy is likely to continue, at least for the near term, according to six U.S. and Mexican sources with knowledge of diplomatic discussions.Biden has been gradually unraveling many Trump-era immigration policies. Yet the new administration has encouraged Mexico and Guatemala to keep up border enforcement in their countries to stem northward migration, according to two Mexican officials and a U.S official, all speaking on condition of anonymity.Diplomats and experts at immigration think tanks told Reuters that it would be politically expedient for the Biden administration to keep asylum seekers and other migrants from trekking en masse to the countrys southern border, especially as Mexico and the United States are being ravaged by the coronavirus pandemic and seeking to contain its spread.They also said any rush to the U.S border could hand Bidens political opponents ammunition to sink the rest of his immigration agenda, which includes providing a pathway to citizenship for immigrants already in the United States and reducing asylum application backlogs.The Biden administration has not specifically endorsed militarized action, however, and has vowed to treat migrants with dignity.They want the relevant countries to have appropriate border controls, said one former U.S. official familiar with the matter, who also spoke on condition of anonymity. It doesnt mean that they hold everyone back and beat back migrants. Thats not the objective here.A White House spokesperson declined to comment, referring Reuters to recent public remarks by Roberta Jacobson, a special assistant to the president specializing on the southwest border.Jacobson told reporters on a recent call that the administration had not talked with Mexico specifically about how it deploys its security forces on its own soil. She added, however, that the two countries diplomats, as well as Biden and Mexican President Andrs Manuel Lpez Obrador, had spoken about the need to jointly work on managing migration. She stressed the importance of addressing its root causes such as poverty and corruption.Two other administration officials, including Juan Gonzalez, the presidents lead adviser on Latin American policy, recently underscored U.S. support for immigration enforcement well south of the U.S. border.I need to recognize here the work that (Guatemalan) President (Alejandro) Giammattei has done in managing the migration flows when the caravans started out, Gonzalez told the El Salvadoran investigative website El Faro after the January crackdown.The Mexican government has informed the new U.S. administration that it intends to keep current immigration enforcement measures in place because it is in Mexicos sovereign interest to secure its own borders, one senior Mexican official said, speaking on condition of anonymity.Biden already faces pressure from leading Republican lawmakers who accuse his administration of undermining immigration enforcement.The new administration has sketched out a massive proposal for blanket amnesty that would gut enforcement of American laws while creating huge new incentives for people to rush here illegally at the same time, Republican Senate Minority Leader Mitch McConnell of Kentucky said on the Senate floor after Bidens first day in office.Biden officials have repeatedly pleaded with asylum seekers not to migrate now, stressing that the administration needs time to enact its domestic immigration changes.At the same time, human rights advocates say leaning on Mexico and Central America to halt mass migration violates peoples rights to seek asylum. It also potentially subjects them to further violence and abuse on their journeys north, they say.Weve seen time and time again that militarized approaches dont really stop people from leaving, said Daniella Burgi-Palomino, co-director of the Latin America Working Group, an organization dedicated to influencing U.S. policy.REGIONAL CONTAINMENTAbout 8,000 people, including many women and children, joined Januarys migrant caravan shortly before Bidens inauguration, aiming to arrive in the United States after he took office.The Trump administration had all but locked down the U.S. southern border and forced some asylum applicants to wait for months in Mexico. It also had prodded Mexican and Central American governments, largely through threats, to confront migrant caravans.For instance, Mexico in 2019 deployed 20,000 National Guard and soldiers to police its borders to stave off Trumps threats to impose tariffs on Mexican goods.Mexico, Guatemala, El Salvador and Honduras coordinated a regional containment strategy ahead of the January caravan, Martin Alonso Borrego, director of Latin America and the Caribbean for Mexicos foreign ministry, told Reuters.After a Jan. 11 meeting among the countries, Guatemala declared emergency powers in nearly a third of its states and deployed up to 4,000 soldiers, police officers and air force personnel.As Bidens inauguration approached, rumors that a large migrant group was forming in Honduras prompted Mexico to beef up its military presence at its own southern border and send buses to Guatemala to aid in the return of caravan members.The crackdown in mid-January provided some respite to Mexican troops on the Suchiate River. It also inspired fear among migrants.Honduran migrant Alvarez and her family spent days in Guatemalas hills trying to make their way toward the Mexican border. Were without money and food, she said, before Reuters lost touch with her.In the mid-January confrontation in Guatemala, the Reuters photographer and other witnesses saw a wall of security forces confront hundreds of migrants, beating some and deploying tear gas. Some migrants threw rocks. Guatemalan immigration authorities reported an unspecified number of injuries.Guatemalas human rights ombudsman Jordan Rodas said it was outrageous to see the scenes of how the military brutally received our Honduran brothers and sisters.Immigration experts and people familiar with the Biden administrations thinking say Washington may try to exercise more oversight down the line over how Mexican and Central American authorities conduct border containment operations.Proponents of greater U.S. immigration control say it would be a mistake to pull back on the Trump-era pressure.Its not clear how effectively Guatemala and Mexico can block them, especially if the numbers get bigger and especially if they are not pressured to do so by Biden, said Jessica Vaughan, policy director for the Center for Immigration Studies, which favors lower levels of immigration."}