{"text": "Traders are not betting on a quick rebound from the stock market dip, in contrast to prior selloffs, options data showed on Wednesday, as U.S. stocks sold off sharply with high-flying tech names particularly hit.Investors' tendency to look past minor wobbles in stocks as the S&P 500 rallied about 90% over the past year or so has been a key feature of the equity market since it rebounded from March 2020 pandemic lows and has helped make market pullbacks shallow and brief. That, however, may be changing.On Wednesday, Wall Street's major indexes extended their decline from earlier this week after stronger-than-expected inflation data stoked worries of tighter monetary policy to combat what many investors fear could be a prolonged period of inflation. The S&P 500 Index ended 2.1% lower while the Nasdaq Composite (.IXIC) closed down 2.7%.The tech index is down more than 7% from its recent high.   read more Rather than positioning for a quick rebound, as they have typically done in recent past, traders in the options market are laser-focused on defensive plays.\"The really irrationally bullish equity options traders that I have been warning about for a long time have finally gone away,\" said Randy Frederick, vice president of trading and derivatives for the Schwab Center for Financial Research.Options market measures, including skew - a gauge of demand for upside vs downside - show investors extremely concerned about further weakness for U.S. stocks.There are few takers for upside bets in equity index options even as defensive options remain in high demand, Charlie McElligott, managing director, cross-asset macro strategy at Nomura, said in a note.For S&P 500 options, the 30-day implied-volatility skew is higher than it has been 87% of the time over the past 52 weeks, data from options analytics firm trade alert showed.On Tuesday, the trading in S&P puts - contracts often used for bearish bets - outpaced that in calls - options used for bullish wagers - by a margin of 2-to-1, the highest this measure has been since February. The ratio was similarly high on Wednesday.The elevated ratio was likely due to less retail call buying as well as more put trading, Susquehanna International Groups Chris Murphy said.That is not to say betting on upside is completely dead.For instance, ARK Innovation (ARKK.P), the flagship exchange-traded fund managed by star stock picker Cathie Wood, which has fallen in 10 of the last 12 trading sessions, logged a net inflow of $373 million on Monday, helping slash its net outflows for the month to date to $145 million, according to data from ETF.com.Meanwhile, the Cboe Volatility Index (.VIX) an options market gauge of expectations for near-term volatility - jumped to a two-month high of 26.96 on Wednesday, highlighting investors' jangled nerves.The VVIX Index (.VVIX), which measures the cost of hedging with VIX options, jumped as high as 145.5 on Wednesday.The VVIX being north of 120 points to a market that is \"wound really tight,\" Nomura's McElligott said."}