{"text": "U.S. President Donald Trump enjoys broad support among farmers, but some are unhappy about the impact of his trade and biofuel policies on crop prices and international demand for U.S. agricultural products. Democrat challenger Joe Biden has seized on the biofuel issue, pledged a more multilateral approach to international trade, and promises to make farming more environmentally friendly.Here are some key campaign issues:TRADETrump challenged trade deals between the U.S. and many of its top commercial partners. Those included some of the largest export markets for U.S. farmers. Trumps trade war with China, a top buyer of soybeans, dairy and pork, in particular was a sore spot for the president among rural voters.The series of tariffs imposed on Chinese goods since 2018 have resulted in billions of dollars in lost crop sales. That hurt a U.S. farm economy already impacted by extreme weather and a global glut of soybeans and grains, which has depressed prices and farm income.In response, the administration has rolled out nearly $30 billion in cash aid payments to U.S. farmers since 2018, and then billions more with the coronavirus-impact aid this year, according to U.S. Department of Agriculture data.The U.S. and China signed a Phase 1 trade deal in January. Though Chinas purchases of U.S. agricultural goods remain below the promised $36.5 billion this year, Chinas increased purchases of corn and soybeans have helped commodity prices recover and pleased farmers.While Biden has called the tariffs disastrous, he may end up keeping some in place if he wins the election, say former and current advisers.Biden, who has a history of supporting free trade, said that he will pursue trade policy that works for American farmers. But he faces conflicting interests over trade - including labor unions who want jobs protected, and those who want action on climate change.Biden would end an artificial trade war against the European Union, while working to address persistent imbalances in agricultural trade between the two blocs, adviser Tony Blinken. The U.S. and Europe should work together to counter Chinas commercial practices, Blinken added.BIOFUELSTrump has a mixed record on his handling of the nations biofuel laws. The issue has a direct impact on corn farmers because corn is used to make the ethanol blended into gasoline under the biofuels mandate.Trumps administration has about quadrupled the number of waivers it has given to oil refiners, exempting them from a requirement to blend biofuels into their fuel. That means less demand for the corn to make the fuel - and lower crop prices for farmers.Still, Trump has granted a few wins for the biofuel industry. His administration, for instance, has allowed for expanded sales of gasoline with more ethanol in it (E15), helped secure an extension of Brazils agreement not to impose tariffs on U.S. ethanol imports, and recently rejected a slew of waiver requests from refiners.Biden supports U.S. biofuel blending requirements and has attacked Trumps granting of refinery waivers.Some question how ethanol in the fuel mix fits into Bidens long-term goals around zero-emissions vehicles. Higher ethanol content in gasoline reduces carbon emissions in the short-term, but in the long term the growing number of electric vehicles would reduce fuel demand, and ethanol demand with it.REGULATIONS & THE ENVIRONMENTTrump has often denounced environmental regulations as unnecessary red tape, and his administration has taken steps to weaken or undo them. It has repealed Obama-era rules that expanded waterway protections, and his Interior Department plans to reopen the Grand Staircase-Escalante National Monument in Utah to cattle grazing.His administration also withdrew a final rule raising USDA standards for organic livestock and poultry production that was published to the federal register during the waning days of Barack Obamas presidency.Although the rule, which had broad support among organic producers, was published when Biden was vice president, the Biden Plan for Rural America does not specifically mention organic agriculture.A Biden presidency would make a sharp shift in other environmental regulations for farmers, though. Biden has proposed boosting use of clean-energy sources, which could open the door for more grain-based biofuels.Biden has also proposed U.S. agriculture achieve net-zero emissions, and receive farm income subsidies based on environmental practices such as carbon sequestration. He wants to expand programs to boost bio-based manufacturing, to turn farm byproducts such as corn stocks and manure into chemicals, materials and fabrics."}