{"text": "SAN DIEGO Paulo Batista is lifting weights and hitting the books, striving to fulfill his fathers dying wish for him to join the U.S. military. But he says all he has heard from the armed forces is either silence or a door slamming shut.Batista is transgender, effectively banned from military service under a policy announced by U.S. President Donald Trump in 2017 and formally adopted in 2019, reversing a policy former President Barack Obamas administration had enacted, after extensive review, to allow transgender military service.Still, Batista continues his quest, hopeful of a waiver or a policy change that might let him in, even as military recruiters rebuff his entreaties. He pumps iron in his garage, his muscular and tattooed arms able to bench press 275 pounds (125 kg). He pops out 100 push-ups a day.He is also studying for the Armed Services Vocational Aptitude Battery, a test developed by the Pentagon to measure a recruits potential.My heart is sold for this as a career. Theres a feeling about wearing that uniform, said Batista, 36, who is too old for the Army or Marines and has focused on the Navy and Air Force. When you love what you do, its no longer a job, and serving my country would never be a job.The U.S. Supreme Court has ruled the Trump transgender policy can stand while it faces four separate lawsuits in lower courts.Although most transgender military personnel as of 2019 were allowed to continue serving, new recruits have been kept out.To my knowledge, there are zero transgender people who have sought to enlist who have been able to enlist since the ban went into effect, said Jennifer Levi of GLBTQ Legal Advocates & Defenders, one of the groups suing the Trump administration.Democratic presidential nominee Joe Biden, who was Obamas vice president, has pledged to instruct the Pentagon to restore the right of transgender people to serve in the military if he wins the Nov. 3 election. Polls show Biden leading Trump.The Defense Department said no officials were available to comment for this article and did not respond to a Reuters request for data on the enlistment of transgender recruits.Batista was still presenting as female in 2002 when he entered the militarys Junior Reserve Officers Training Corps, but dropped out to care for his sick father.Fred Batista died of cancer in 2007 at age 69.I want to do nothing more than to make the one man, my hero, prouder of me from above, Batista said. The true American dream we all know is pure freedom, no matter who or what you are."}