{"text": " (Recasts with bond auction results, updates yields, adds\nanalyst comments, upcoming auctions, reverse repo volume)\n    By Karen Pierog\n    CHICAGO, Aug 12 U.S. Treasury yields ticked\nslightly higher on Thursday after a 30-year bond auction failed\nto give the market any convincing direction, while cash flowing\ninto to an overnight Federal Reserve facility hit a new record\nhigh. \n    The 30-year yield, which hit a session high of\n2.035% following the auction, was last up less than a basis\npoint at 2.0081%. \n    The benchmark 10-year yield was last less than a\nbasis point higher at 1.3607%.\n    The $27 billion of 30-year bonds were sold at a high yield\n2.040% and with a bid-to-cover ratio, a gauge of demand, of \n2.21.\n    \"You had a really pretty normal result relative to average\nso I think the market looked through the auction results and\njust kind of kept on doing what it was doing,\" said Tom Simons,\na money market economist at Jefferies in New York, adding that a\nreally weak or really strong auction would have had the\npotential to move rates more.\n    Yields, meanwhile, were continuing their slow march higher\nahead of an expected announcement by the Fed on tapering its\nasset purchases and with the latest inflation readings, Simons\nsaid. \n    U.S. producer prices increased more than expected in July,\nsuggesting inflation could remain high as strong demand fueled\nby the economic recovery from the coronavirus pandemic continues\nto hurt supply chains.\n    That report on Thursday from the Labor Department followed\ndata on Wednesday that showed U.S. consumer price increases\nslowed in July even as they remained at a 13-year high on a\nyearly basis amid tentative signs inflation has peaked as\nsupply-chain disruptions caused by the pandemic work their way\nthrough the economy.\n    Inflation expectations have risen this week with the\nbreakeven inflation rate on five-year U.S. Treasury\nInflation-Protected Securities (TIPS) climbing to\n2.616% on Thursday. It was 2.552% on Monday.\n    The Labor Department also reported on Thursday that initial\nclaims for state unemployment benefits fell 12,000 to a\nseasonally adjusted 375,000 for the week ended Aug. 7.\n\n    \"It's the third decline in a row, so that's giving people\nmore optimism that the next jobs figures will be reasonably\nstrong,\" said Kathy Jones, chief fixed income strategist at the\nSchwab Center for Financial Research in New York.\n    The U.S. Treasury on Thursday announced auctions for $27\nbillion of 20-year bonds next Wednesday and $8 billion of\n30-year TIPS on Aug. 19.\n    Auctions earlier this week were solid, with Wednesday's\n10-year note auction the strongest since 2012 possibly as a\nresult of foreign demand, Citi analysts said in a research\nreport on Thursday.\n    The amount of cash pouring into the Fed's overnight reverse\nrepurchase agreement facility hit a new record high of $1.087\ntrillion on Thursday, topping the previous record of $1.039\ntrillion set on July 30.\n     A closely watched part of the yield curve that measures the\ngap between yields on two- and 10-year Treasury notes\n was last 2.29 basis points steeper at 113.60 basis\npoints.\nAugust 12 Thursday 2:19PM New York / 1819 GMT\n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.05         0.0507    0.000\n Six-month bills               0.05         0.0507    -0.002\n Two-year note                 99-206/256   0.2247    0.004\n Three-year note               99-196/256   0.4538    0.003\n Five-year note                99-10/256    0.8229    0.011\n Seven-year note               99-40/256    1.1263    0.007\n 10-year note                  98-248/256   1.3607    0.002\n 20-year bond                  105-128/256  1.9142    0.006\n 30-year bond                  108-48/256   2.0081    0.004\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap         8.75         0.25    \n spread                                               \n U.S. 3-year dollar swap        10.00         1.00    \n spread                                               \n U.S. 5-year dollar swap         8.50         0.00    \n spread                                               \n U.S. 10-year dollar swap        0.25        -0.75    \n spread                                               \n U.S. 30-year dollar swap      -29.25         0.50    \n spread (Reporting by Karen Pierog; editing by Jonathan Oatis and Chizu\nNomiyama)\n  "}