{"text": " (Updates prices, adds details on upcoming auctions, Clarida\ncomments)\n    By Chuck Mikolajczak\n    NEW YORK, May 12 U.S. Treasury yields climbed on\nWednesday following a much stronger than expected reading on\nconsumer prices that heightened concerns the economy may be\nheading towards a sustained period of higher inflation. \n    The Labor Department said the consumer price index surged\n0.8% in April after rising 0.6% in the prior month. The \"core\"\nreading, which excludes the more volatile food and energy\nportions, jumped 0.9%. Expectations called for overall CPI to\nrise 0.2% and the core reading to climb 0.3%.\n    The yield on 10-year Treasury notes was up 5.9\nbasis points to 1.683%.  \n    \"Obviously the numbers came in hotter than what had been\nexpected but that doesnt answer the most important question and\nthat simply is whether these inflationary pressures we are\nseeing, if they are going to be with us longer than just 2021,\nand that is the piece that is really going to dictate what\nmonetary policy looks like going forward,\" said Jim Barnes,\ndirector of fixed income at Bryn Mawr Trust in Berwyn,\nPennsylvania. \n    Barnes noted that given how much the CPI number beat\nexpectations, the move in yields was relatively tame.  \n    The yield on the 30-year Treasury bond was up\n3.9 basis points to 2.391%. \n    The U.S. Federal Reserve has repeatedly stated that it views\nany inflation to be transitory in nature. On Wednesday, Fed Vice\nChair Richard Clarida said it will be \"some time\" before the\nU.S. economy is healed enough for the Federal Reserve to\nconsider pulling back its crisis levels of support and he\nexpects the rise in prices to be temporary.\n    \n    The breakeven rate on five-year U.S. Treasury\nInflation-Protected Securities (TIPS) was last at\n2.766%, after closing at 2.697% on Tuesday, near its highest\nclose in just over a decade.\n    The 10-year TIPS breakeven rate was last at\n2.577%, indicating the market sees inflation averaging 2.5% a\nyear for the next decade.\n    More supply is scheduled to enter the market later today,\nwith a Treasury auction of $41 billion in 10-year notes\nscheduled for 1 p.m. EDT (1700 GMT) and $27 billion of 30-year\nbonds on Thursday.\n    \n      May 12 Wednesday 11:38AM New York / 1538 GMT\n                               Price                  \n US T BONDS JUN1               155-29/32    -1-1/32   \n 10YR TNotes JUN1              131-244/256  -0-128/2  \n                                            56        \n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.015        0.0152    0.000\n Six-month bills               0.035        0.0355    0.001\n Two-year note                 99-234/256   0.1688    0.008\n Three-year note               99-176/256   0.355     0.025\n Five-year note                99-120/256   0.8595    0.058\n Seven-year note               99-112/256   1.3348    0.062\n 10-year note                  95           1.6826    0.059\n 30-year bond                  89-16/256    2.3907    0.039\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap        10.25         0.75    \n spread                                               \n U.S. 3-year dollar swap        11.00        -1.50    \n spread                                               \n U.S. 5-year dollar swap         8.25         0.25    \n spread                                               \n U.S. 10-year dollar swap       -3.00         0.00    \n spread                                               \n U.S. 30-year dollar swap      -30.00         0.00    \n spread                                               \n \n\n    \n\n    \n (Reporting by Chuck Mikolajczak; \nEditing by Chizu Nomiyama and Andrea Ricci)\n  "}