{"text": "    * U.S. yield curve flattens after steepening the last few\nsessions\n    * U.S. consumer prices unchanged in October\n    * U.S. 30-year bond auction shows solid results\n\n (Adds new comment, U.S. 30-year auction outcome, updates\nprices)\n    By Gertrude Chavez-Dreyfuss\n    NEW YORK, Nov 12 U.S. Treasury yields sank on\nThursday, weighed down by the persistent rise in coronavirus\ncases around the world and data showing inflation remained\nbenign in the world's largest economy.\n    The U.S. yield curve, viewed in part as a gauge of risk\nappetite, also flattened on Thursday, after steepening the last\nfew sessions on positive COVID-19 vaccine news from Pfizer Inc\n early this week. Analysts said investors are realizing\nthat distributing the vaccine to the world would take time.\n    Demand at the $27 billion U.S. 30-year bond auction on\nThursday was decent, analysts said, although the yield of 1.68%\nexceeded market expectations at the bid deadline. The\nbid-to-cover ratio was 2.29, slightly higher than the August\nrefunding but the same number as the October reopening. \n    Indirect bidders, which include foreign central banks, took\n61.9% of the total, a little better than the 59.8% takedown at\nthe August refunding.\n    \"The 30-year auction was solid,\" said Jim Vogel, senior\nrates strategist, at FHN Financial in Memphis. \"We had good\nparticipation in the face of a 9 basis-point rally in the\n30-year and therefore we have kept the price gains in Treasuries\ntoday.\"\n    Thursday's data on U.S. consumer prices, which were\nunexpectedly unchanged in October, kept yields lower. Excluding\nthe volatile food and energy components, CPI was also flat after\nrising 0.2% the prior month.\n    In afternoon trading, U.S. benchmark 10-year yields were\ndown at 0.884%, from 0.989% late on Tuesday. Bond\nmarkets were closed on Wednesday for Veterans Day. \n    Stan Shipley, fixed income strategist at Evercore ISI in New\nYork, said the 1% yield on the 10-year note is a big\npsychological level. \n    \"But it's going to take a little bit of effort to get\nthrough that 1%, and today's CPI number didn't help. Rising\ncoronavirus cases every day won't help either,\" he added.\n    On Thursday, the U.S. Centers for Disease Control and\nPrevention (CDC) reported 10,314,254 cases, up 143,408 from its\nprevious count, and said the number of deaths had risen by 1,479\nto 241,069.\n    U.S. 30-year yields fell to 1.645% from\nTuesday's 1.76%.\n    On the front end of the curve, U.S. two-year yields slipped\nto 0.176% from 0.185% on Tuesday.\n    The U.S. yield curve, meanwhile, flattened, with the spread\nbetween the two-year and 10-year narrowing to 70 basis points\n.\n    U.S. President-elect Joe Biden moved ahead with planning his\nnew administration on Thursday as his fellow Democrats in\nCongress blasted Republican \"shenanigans\" challenging Donald\nTrump's election loss.\n    The post-election uncertainty has weighed on bond investors\nas well and kept a lid on U.S. rates.\n    In Thursday's research note about the U.S. election outcome,\nFitch Ratings said it expected a \"noisy but ultimately orderly\"\nshift of power to the Biden administration. The ratings agency\nsaid it also expected Republicans to keep control of the U.S.\nSenate, noting that a divided government could pose a \"serious\nobstacle to legislation that would address structural issues.\"\n    \n      November 12 Thursday 3:25PM New York / 2025 GMT Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.09         0.0913    -0.005\n Six-month bills               0.1          0.1014    -0.003\n Two-year note                 99-230/256   0.1768    -0.008\n Three-year note               100-14/256   0.2317    -0.026\n Five-year note                99-72/256    0.3964    -0.064\n Seven-year note               99-16/256    0.6378    -0.088\n 10-year note                  99-240/256   0.8815    -0.108\n 20-year bond                  95-12/256    1.4132    -0.118\n 30-year bond                  93-172/256   1.6448    -0.115\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap         8.25         0.50    \n spread                                               \n U.S. 3-year dollar swap         7.25         1.25    \n spread                                               \n U.S. 5-year dollar swap         5.50         0.50    \n spread                                               \n U.S. 10-year dollar swap       -1.00        -1.75    \n spread                                               \n U.S. 30-year dollar swap      -34.50         0.00    \n spread (Reporting by Gertrude Chavez-Dreyfuss; Additional reporting by\nRoss Kerber in Boston; Editing by Chizu Nomiyama, Jonathan Oatis\nand Richard Chang)\n  "}