{"text": " (Updates yields, adds analyst comments)\n    By Karen Brettell and Karen Pierog\n    April 12 Smooth auctions of three- and 10-year\nnotes on Monday kept a move higher in U.S. Treasury yields in\ncheck as the market looked ahead to this week's 30-year bond\noffering and key data releases, including consumer price\ninflation.\n    The benchmark 10-year yield was last up nearly a\nbasis point at 1.6746%, holding below a 14-month high of 1.776%\nreached on March 30. The three-year yield was last\n1.9 basis points higher at 0.3549%. \n    \"The 3-year and 10-year Treasury auctions were generally\nnon-events for markets,\" said Bill Merz, chief fixed income\nstrategist at U.S. Bank Wealth Management. \"Investors were\nwatching for signs of weak demand, but slightly higher yields\nleading up to the auctions gave investors adequate compensation\nfor taking down the new supply.\"\n    The $38 billion auction of 10-year notes resulted in a high\nyield of 1.680% and a bid-to-cover ratio, a gauge of demand, of\n2.36 times.\n    Meanwhile, $58 billion of three-year notes were sold at a\nhigh yield of 0.376% and with a bid-to-cover ratio of 2.32\ntimes..\n    Combined with a $24 billion auction of 30-year bonds on\nTuesday, $120 billion in coupon supply hits the market this\nweek, testing investor appetite for debt.\n    Yields have dipped from one-year highs reached last month on\nimproving demand for the debt, though they remain elevated with\ninvestors concerned that faster economic growth and rising price\npressures will continue to push yields higher.\n    Increasing supply as the government finances higher fiscal\nspending and widening deficits is adding to the yield increases.\n    Aside from the auctions, the market is also focused on key\ndata this week, including U.S. consumer price data for March due\non Tuesday. Investors are betting that price pressures will\nincrease due to increased fiscal and monetary stimulus and as\nbusinesses reopen from COVID-19 related closures. \n    \"We've built so much in terms of inflation expectations into\nthe market right now that you almost have to have a high CPI\nreport maybe for the next three or four months or people are \ngoing to have to maybe reassess how much concern that they've\nalready built in about inflation,\" said Jim Vogel, senior rates\nstrategist at FHN Financial in Memphis, Tennessee.\n    Comparisons with last year are also likely to be strong, due\nto a drop in inflation a year ago when businesses closed due to\nCOVID-19.\n    This is the first month were going to see the big base\neffect pump up the year-over-year comparisons, said Tom Simons,\na money market economist at Jefferies in New York.\n    Market participants are aware of the effect, however, and\nthe Federal Reserve has indicated it will look through any\ntemporary inflation, making it unlikely that a strong number\nwill create a hawkish response from the U.S. central bank.\n    I dont think there is a real risk that the hiking timeline\nis pulled forward or anything like that, Simons said.\n    Data on Friday showed that U.S. producer prices notched\ntheir largest annual gain in 9-1/2 years last month.\n\n    The two-year Treasury yield, which typically\nmoves in step with interest rate expectations, was last up 1.6\nbasis points at 0.1728%. \n    A closely watched part of the yield curve, which measures\nthe gap between yields on two- and 10-year Treasury notes\n, was less than a basis point flatter at 150 basis\npoints.\n    April 12 Monday 3:26PM New York / 1926 GMT\n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.0175       0.0177    0.005\n Six-month bills               0.0375       0.038     0.000\n Two-year note                 99-232/256   0.1728    0.016\n Three-year note               99-178/256   0.3549    0.019\n Five-year note                99-82/256    0.8903    0.022\n Seven-year note               99-100/256   1.3419    0.012\n 10-year note                  95-8/256     1.6746    0.009\n 20-year bond                  94-48/256    2.2394    0.016\n 30-year bond                  90           2.3426    0.004\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap        11.75        -0.50    \n spread                                               \n U.S. 3-year dollar swap        14.75        -0.25    \n spread                                               \n U.S. 5-year dollar swap        10.50        -0.75    \n spread                                               \n U.S. 10-year dollar swap        1.75        -0.75    \n spread                                               \n U.S. 30-year dollar swap      -22.75        -0.75    \n spread (Reporting by Karen Brettell in New York and Karen Pierog in\nChicago; Editing by Jonathan Oatis and Dan Grebler)\n  "}