{"text": "(Updates prices; adds auction results, Mester comments)NEW YORK, Jan 12 Longer-dated U.S. Treasury yields dipped on Wednesday after a reading on inflation was largely in line with expectations and did not alter views on the path of Federal Reserve policy.The consumer price index increased 0.5% last month, just above the 0.4% expectation, the Labor Department said on Wednesday. In the 12 months through December, the CPI surged 7.0%, the biggest year-on-year increase since June 1982 but in line with the forecast of economists polled by Reuters.This report does not pressure the Fed to accelerate its interest rate thinking at this particular moment, said Jamie Cox, managing partner at Harris Financial Group in Richmond, Virginia.The markets should be happy with this because the inflation data is not as bad as what markets had predicted and would force markets to reprice an ever growing number of interest rate hikes throughout 2022.After initially moving higher immediately after the CPI data, the yield on 10-year Treasury notes reversed course and was down 2.1 basis points to 1.725%.The yield on the 10-year reached 1.808% on Monday, its highest since Jan. 21, 2020.Cleveland Fed President Loretta Mester said on Wednesday the central banks bond holdings should be reduced as fast as they can without disrupting financial markets given the firmer standing of the economy.The Feds Beige Book report said the economy expanded at a modest pace through the end of last year, with American firms saying supply chain disruptions and labor shortages inhibited growth while the rise in prices was solid.U.S. interest rate futures implied at least three rate hikes from the central bank in 2022 following the CPI data. The market currently sees about an 80% chance of a rate hike of at least 25 basis points at its March meeting, according to the CME FedWatch Tool.Even as some market participants see the Fed hiking rates four times this year to combat rising prices, others believe U.S. inflation may be nearing its peak.Benchmark 10-year yields dipped as more aggressive rate hikes are also seen as likely to dent growth and inflation longer-term. The yield had reached 1.808% on Monday, its highest since Jan. 21, 2020.The yield moved off its lows of the day, however, following a Treasury auction of $36 billion in 10-year notes, which was seen as decent by analysts, with better-than-average demand for the debt at 2.51 times the notes on sale.The yield on the 30-year Treasury bond was down 0.1 basis points to 2.071%.Treasury will sell $22 billion in 30-year bonds on Thursday.A closely watched part of the U.S. Treasury yield curve measuring the gap between yields on two- and 10-year Treasury notes, seen as an indicator of economic expectations, was at 81.2 basis points after flattening to 80.8, the smallest gap since Jan. 3.Shorter-term yields were higher, with the two-year U.S. Treasury yield, which typically moves in step with interest rate expectations, up 1.2 basis points at 0.911%.The breakeven rate on five-year U.S. Treasury Inflation-Protected Securities (TIPS) was last at 2.872%, after closing at 2.92% on Tuesday.The 10-year TIPS breakeven rate was last at 2.525%, indicating the market sees inflation averaging 2.5% a year for the next decade.The U.S. dollar 5 years forward inflation-linked swap , seen by some as a better gauge of inflation expectations due to possible distortions caused by the Feds quantitative easing, was last at 2.401%. (Additional reporting by Reporting by Devik Jain in Bengaluru; editing by Jonathan Oatis and Nick Zieminski)"}