{"text": " (New throughout, updates prices and yields, market activity and\ncomments, adds 10-year auction results)\n    By Karen Brettell and Herbert Lash\n    NEW YORK, Jan 12 U.S. Treasury yields traded\nlower on Tuesday as strong demand for the Treasury Department's\n$38 billion sale of benchmark 10-year notes had traders covering\nshort positions, which reversed  an early rise in yields.\n    Yields had jumped about 20 basis points in the past week on\nexpectations that new fiscal stimulus will boost economic growth\nand increase Treasury supply after Democrats won control of the\nSenate.\n    The notes sold at a high yield of 1.164%, almost a basis\npoint below where they had traded before the auction. Dealers\ntook a lower than average share of 20% of the debt, reflecting\nstrong investor demand.\n    Investors now are waiting to see if demand will persist on\nWednesday at the sale of $24 billion in 30-year Treasury bonds.\n    \"I'm not surprised to not see a huge rally because we do\nstill have the 30-year to get through tomorrow,\" said Patrick\nLeary, chief market strategist and senior trader at Incapital in\nMinneapolis.\n    Consolidation is likely at these levels, Leary said.\n    \"Maybe we trade as low as 1.07%, 1.05% before finding a\nfloor on the range, but then slowly move higher over the coming\nmonths.\"\n    The catalyst for jump in rates were the two elections in\nGeorgia last week, which sparked the return of a reflation\ntrade.\n    \"The Georgia Senate run-off elections really changed the\nlandscape for the outlook pretty significantly as there is now\npotentially very significant additional stimulus,\" said Tom\nSimons, money market economist at Jefferies in New York.\n    President-elect Joe Biden said on Friday that he will\ndeliver a plan costing \"trillions\" of dollars on Thursday.\n    The proposal includes relief for state and local governments\ngrappling with the pandemic, and new support for people who lost\ntheir jobs or cannot afford rent. Biden also called for raising\nthe minimum wage to $15 and sending out $2,000 in direct cash\npayments.\n    Earlier, the yield on benchmark 10-year notes\nreached 1.187%, the highest since March 20. The yield curve\nbetween two-year and 10-year notes steepened to\n103.40 basis points, the widest gap since May 2017, before\nparing gains to trade at 99.10. \n    Thirty-year bond yields reached 1.915%, also the\nhighest since March 20.\n    Five-year note yields jumped to 0.533%, the highest since\nMarch 26, as investors prepared for the prospect that the Fed\ncould begin raising rates as soon as 2023. That would be earlier\n than previously expected. \n    \n      January 12 Tuesday 9:31 AM New York / 1431 GMT\n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.085        0.0862    -0.005\n Six-month bills               0.09         0.0913    0.000\n Two-year note                 99-244/256   0.1489    0.004\n Three-year note               99-168/256   0.24      0.006\n Five-year note                99-74/256    0.5202    0.022\n Seven-year note               98-108/256   0.8589    0.028\n 10-year note                  97-84/256    1.1632    0.029\n 20-year bond                  94-176/256   1.6913    0.015\n 30-year bond                  94-16/256    1.8861    0.008\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap         7.25         0.25    \n spread                                               \n U.S. 3-year dollar swap         6.50        -0.75    \n spread                                               \n U.S. 5-year dollar swap         7.25         0.00    \n spread                                               \n U.S. 10-year dollar swap        0.50         0.25    \n spread                                               \n U.S. 30-year dollar swap      -25.00         1.25    \n spread (Reporting by Karen Brettell and Herbert Lash; Editing by David\nGregorio)\n  "}