{"text": " (Recasts, adds three-year note auction results, analyst\ncomments, byline)\n    By Karen Brettell and Karen Pierog\n    April 12 U.S. Treasury yields remained slightly\nhigher on Monday following a good three-year note auction and\nahead of a 10-year note offering later in the day as $120\nbillion in coupon supply hits the market this week, testing\ninvestor appetite for debt. \n    The $58 billion of three-year notes were sold at a high\nyield of 0.376% and with a bid-to-cover ratio, a gauge of\ndemand, of 2.32 times. Analysts said the results\nwere solid given the size and timing of the auction.\n    The three-year yield was last 2.2 basis points\nhigher at 0.3576%. The benchmark 10-year yield was\nlast up less than a basis point at 1.6728%, holding below a\n14-month high of 1.776% reached on March 30.\n    Yields have dipped from one-year highs reached last month on\nimproving demand for the debt, though they remain elevated with\ninvestors concerned that faster economic growth and rising price\npressures will continue to push yields higher.\n    Increasing supply as the government finances higher fiscal\nspending and widening deficits is adding to the yield increases.\n    Coming up on Monday is a $38 billion auction of 10-year\nnotes, followed on Tuesday by a $24 billion offering of 30-year\nbonds. \n    \"I dont think that this is a month where we have\nparticularly high risk for the long-duration auctions, said Tom\nSimons, a money market economist at Jefferies in New York.\n    Aside from the auctions, the market is also focused on key\ndata this week, including U.S. consumer price data for March due\nout on Tuesday. Investors are betting that price pressures will\nincrease due to increased fiscal and monetary stimulus and as\nbusinesses reopen from COVID-19 related closures. \n    Comparisons with last year are also likely to be strong, due\nto a drop in inflation a year ago when businesses closed due to\nCOVID-19.\n    This is the first month were going to see the big base\neffect pump up the year-over-year comparisons, said Simons.\n    Market participants are aware of the effect, however, and\nthe Federal Reserve has indicated it will look through any\ntemporary inflation, making it unlikely that a strong number\nwill create a hawkish response from the U.S. central bank.\n    I dont think there is a real risk that the hiking timeline\nis pulled forward or anything like that, Simons said.\n    Data on Friday showed that U.S. producer prices notched\ntheir largest annual gain in 9-1/2 years last month.\n\n    Meanwhile, Federal Reserve Chair Jerome Powell, in a\ntelevision interview on Sunday, said the U.S. economy is at an\n\"inflection point\" with expectations that growth and hiring will\npick up speed in the months ahead, but also with risks if a\nhasty reopening leads to a continued increase in coronavirus\ncases.\n    \"I view that as a non-event because it's the same message\nthat has been promoted by the Fed for so long now,\" said Bill\nMerz, head of fixed income research at U.S. Bank Wealth\nManagement in Minneapolis. \"They've really been singing the same\ntune since March and April last year.\"\n    The two-year Treasury yield, which typically\nmoves in step with interest rate expectations, was last up 1.4\nbasis points at 0.1708%. \n    A closely watched part of the yield curve, which measures\nthe gap between yields on two- and 10-year Treasury notes\n, was less than a basis point steeper at 150.56\nbasis points.\n    \nApril 12 Monday 12:20AM New York / 1620 GMT\n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.015        0.0152    0.002\n Six-month bills               0.035        0.0355    -0.002\n Two-year note                 99-233/256   0.1708    0.014\n Three-year note               99-176/256   0.3576    0.022\n Five-year note                99-84/256    0.8886    0.021\n Seven-year note               99-100/256   1.3419    0.012\n 10-year note                  95-12/256    1.6728    0.007\n 20-year bond                  94-72/256    2.2333    0.010\n 30-year bond                  90           2.3426    0.004\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap        11.50        -0.75    \n spread                                               \n U.S. 3-year dollar swap        14.25        -0.75    \n spread                                               \n U.S. 5-year dollar swap        10.75        -0.50    \n spread                                               \n U.S. 10-year dollar swap        2.25        -0.25    \n spread                                               \n U.S. 30-year dollar swap      -22.25        -0.25    \n spread (Reporting by Karen Brettell in New York and Karen Pierog in\nChicago; editing by Jonathan Oatis)\n  "}