{"text": "NEW YORK, Jan 12 The benchmark U.S. 10-year Treasury yield dipped on Wednesday after a reading on inflation was largely in line with expectations and kept investor views on the path of Federal Reserve policy intact.The consumer price index increased 0.5% last month, just above the 0.4% expectation, after advancing 0.8% in November, the Labor Department said on Wednesday. In the 12 months through December, the CPI surged 7.0%, the biggest year-on-year increase since June 1982 and followed a 6.8% rise in November, but in line with the forecast of economists polled by Reuters.It was priced in, said Jay Hatfield, founder and chief executive of Infrastructure Capital Management in New York.I was actually thinking this CPI report would be a positive for the market because expectations were extremely high for inflation and this is not now new news. Everybody has capitulated on inflation, so it would have taken quite a negative surprise to dislocate the market.After initially moving higher immediately after the CPI data, the yield on 10-year Treasury notes reversed course and was down 1.6 basis points to 1.730%.The yield on the 10-year reached 1.808% on Monday, its highest since Jan. 21, 2020.On Tuesday, U.S. Federal Reserve Chair Jerome Powell said during a congressional hearing that the economy should be able to handle the current surge in COVID-19 cases with only short-lived impacts and was strong enough to handle the start of tighter monetary policy with the central bank poised to raise interest rates and unwind its balance sheet.U.S. interest rate futures implied at least three rate hikes from the central bank in 2022 following the CPI data. The market currently sees about an 80% chance of a rate hike of at least 25 basis points at its March meeting, according to the CME FedWatch Tool.Benchmark 10-year yields dipped as more aggressive rate hikes are also seen as likely to dent growth and inflation longer-term. The yield had reached 1.808% on Monday, its highest since Jan. 21, 2020.The yield on the 30-year Treasury bond was up 0.3 basis point to 2.075%.Treasury will sell $36 billion in 10-year notes later on Wednesday and $22 billion in 30-year bonds on Thursday.Analysts at Wells Fargo expect solid demand at the 10-year auction, as foreign investors have shown interest around the 1.80% level.A closely watched part of the U.S. Treasury yield curve measuring the gap between yields on two- and 10-year Treasury notes, seen as an indicator of economic expectations, was at 83.0 basis points after flattening to 81.4, the smallest gap since Jan. 3.The two-year U.S. Treasury yield, which typically moves in step with interest rate expectations, was unchanged at 0.899%.The breakeven rate on five-year U.S. Treasury Inflation-Protected Securities (TIPS) was last at 2.885%, after closing at 2.92% on Tuesday.The 10-year TIPS breakeven rate was last at 2.55%, indicating the market sees inflation averaging 2.5% a year for the next decade.The U.S. dollar 5 years forward inflation-linked swap , seen by some as a better gauge of inflation expectations due to possible distortions caused by the Feds quantitative easing, was last at 2.451%. (Reporting by Chuck Mikolajczak; editing by Jonathan Oatis)"}