{"text": " (Recasts with auction results, adds data, quotes, updates\nprices)\n    By Karen Brettell\n    NEW YORK, July 12 U.S. Treasury yields edged\nlower on Monday after the Treasury Department saw solid demand\nfor sales of new three-year and 10-year notes, and before a\nhighly anticipated inflation release on Tuesday.\n    The Treasury sold $38 billion in 10-year notes at a high\nyield of 1.371%, slightly below where the debt had traded before\nthe auction. Yields had backed up ahead of the sale, which\nlikely helped demand.\n    The U.S. government also saw solid demand for a $58 billion\nsale of three-year notes, with the notes selling at a high yield\nof 0.426%, less than a basis point above where they had traded\nbefore the auction.\n    Overall trading was uneventful, following a blistering rally\nlast week that sent long-dated yields to their lowest levels in\nfive months.\n    Investors are focused on consumer price inflation data on\nTuesday for any indications that price pressures may be\nembedding in the economy. The Federal Reserve has said that\nrecent inflation increases are likely to be temporary.\n    There is a lack of commitment before CPI tomorrow, Jim\nVogel, an interest rate strategist at FHN Financial, said in a\nreport. Only retail sales on Friday is likely to be a bigger\nnumber.\n    Benchmark 10-year note yields were at 1.344%,\nafter falling as low as 1.25% on Thursday, the lowest since Feb.\n16. Thirty-year bond yields were 1.967%, after\nreaching 1.856% on Thursday, the lowest since Feb. 2.\n    Economists polled by Reuters expect the consumer price data\nto show that core inflation increased by 0.4% in June, with a\nyear-on-year increase of 4%.\n    U.S. consumers expect the economy to continue its rapid\nresurgence from the COVID-19 pandemic over the next year, with\nforecasts for inflation, earnings, income growth and spending\nall increasing in June, according to a monthly survey released\non Monday by the New York Fed.\n    Treasury yields dropped quickly last week as investors\nworried that job growth will be slow and that the spread of new\nvariants of COVID-19 could result in new business shutdowns.\n    Analysts say that much of the move was likely technical,\nhowever, with investors covering short trades and investors\npouring cash into Treasury exchange-traded funds (ETFs).\n    Many investors were caught offsides said Tom di Galoma, a\nmanaging director at Seaport Global Holdings in New York. Now,\nyouve got some profit-taking thats taking place, he said.\n    The 10-year yields have dropped from 1.544% on June 25 and\n30-year yields are down from 2.177% over the same time frame. \nThe Treasury will also sell $24 billion in 30-year bonds on\nTuesday.\n    Demand to make overnight loans to the Fed in exchange for\nTreasuries remained strong on Monday, with the Fed seeing $776\nbillion in demand in its reverse repurchase agreement operation.\n\n    \n      July 12 Monday 9:33AM New York / 1333 GMT\n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.0525       0.0532    0.000\n Six-month bills               0.05         0.0507    -0.005\n Two-year note                 99-212/256   0.2127    -0.004\n Three-year note               99-152/256   0.3899    -0.008\n Five-year note                100-120/256  0.7785    -0.008\n Seven-year note               101          1.1004    -0.012\n 10-year note                  102-148/256  1.3443    -0.012\n 20-year bond                  105-236/256  1.8906    -0.012\n 30-year bond                  109-44/256   1.9671    -0.015\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap         8.00         0.00    \n spread                                               \n U.S. 3-year dollar swap        11.75        -0.25    \n spread                                               \n U.S. 5-year dollar swap         8.25        -0.25    \n spread                                               \n U.S. 10-year dollar swap       -1.00        -0.75    \n spread                                               \n U.S. 30-year dollar swap      -28.00         0.00    \n spread (Editing by Sonya Hepinstall)\n  "}