{"text": " (Updates yields, adds analyst comment)\n    By Karen Pierog\n    CHICAGO, June 12 U.S. Treasury yields rose on\nFriday as stocks clawed back some ground from Thursday's biggest\none-day drop in about three months. \n    The benchmark 10-year yield was last up 3.9\nbasis points at 0.6919%. \n    \"It's a seesaw between optimism in the equity market and\npessimism in the bond market and that switches some times,\" said\nGary Pollack, managing director, fixed income at Deutsche Bank\nPrivate Wealth Management in New York. \"So Treasuries have been\non a seesaw ride, but I'd call it a rather narrow seesaw ride.\"\n    There is potential for the 10-year yield to jump over the\nlonger term as fears over the coronavirus subside and bigger\nswaths of the U.S. economy restart, according to Stan Shipley,\nresearch analyst for Evercore ISI.\n    While the yield could hit a range around 1.25% by the end of\nthe year under current conditions and with no change in Federal\nReserve policy or guidance, Shipley said, the Fed would likely\nstep in to keep rates low to \"really heal the economy.\"\n    The two-year U.S. Treasury yield, which typically\nmoves in step with interest rate expectations, was last up 1\nbasis point at 0.189%.\n   A closely watched part of the U.S. Treasury yield curve\nmeasuring the gap between yields on two- and 10-year Treasury\nnotes, which is viewed as an indicator of\neconomic expectations, was at 50.10 basis points, about 3 basis\npoints higher than at Thursday's close. It reached 72 basis\npoints a week ago, the steepest since March, after data showed\nthe U.S. economy unexpectedly added jobs in May. \n   Bids submitted in a Friday morning overnight repurchase\nagreement operation totaled $49.2 billion, according to the New\nYork Federal Reserve, which said it accepted all the bids.\n    On Thursday, the Fed announced it was slightly raising the\nprice of the operations after seeing \"substantial improvements\"\nin market conditions.\n   June 12 Friday 1:34PM New York / 1834 GMT\n                               Price Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.165        0.1678    0.003\n Six-month bills               0.1825       0.1852    0.005\n Two-year note                 99-224/256   0.189     0.010\n Three-year note               100-24/256   0.2186    0.008\n Five-year note                99-166/256   0.3215    0.020\n Seven-year note               99-208/256   0.5275    0.032\n 10-year note                  99-92/256    0.6919    0.039\n 20-year bond                  98-64/256    1.2243    0.044\n 30-year bond                  95-100/256   1.4402    0.037\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap         7.25        -0.50    \n spread                                               \n U.S. 3-year dollar swap         5.00         0.00    \n spread                                               \n U.S. 5-year dollar swap         4.50        -0.50    \n spread                                               \n U.S. 10-year dollar swap       -1.25        -0.25    \n spread                                               \n U.S. 30-year dollar swap      -48.25        -0.25    \n spread (Reporting by Karen Pierog; Editing by Leslie Adler)\n  "}