{"text": " (Adds quotes, details on position squaring; updates prices)\n    By Karen Brettell\n    NEW YORK, Feb 12 Benchmark U.S. Treasury yields\nrose to their highest levels since March on Friday as investors\nclosed positions ahead of a long U.S. weekend, while inflation\nexpectations edged up to a six-year high.\n    Benchmark 10-year yields rose to 1.203%, just\npipping an 11-month high of 1.20% that was set on Monday.\nThirty-year yields rose to 2.007%, also inching\nabove Monday's one-year high of 2.006%.\n    With no new fundamental news to drive market direction, Ben\nJeffery, a strategist at BMO Capital Markets in New York, said\nthe moves were likely position squaring and maybe some profit\ntaking ahead of the long weekend ... there hasnt really been\nany new fundamental information.\n    The bond market will be closed on Monday for Presidents Day.\n    Yields have largely held in a range as investors wait on a\nnew catalyst to send yields substantially higher, with U.S.\nfiscal spending seen as the next major focus.\n    Our base case view is for a $1 trillion package, but I\nthink market expectations are gravitating towards something much\nlarger, said Zachary Griffiths, a macro strategist at Wells\nFargo in Charlotte.\n    U.S. President Joe Biden will meet with a bipartisan group\nof mayors and governors on Friday as he continues to push for\napproval of a $1.9 trillion coronavirus relief plan to bolster\neconomic growth and help millions of unemployed workers.\n\n    Data on Friday showed that U.S. consumer sentiment\nunexpectedly fell in early February amid growing pessimism about\nthe economy among households with annual incomes below $75,000.\n\n    Investors are expecting that new spending and faster growth\nas businesses reopen after COVID-19 related shutdowns will also\nboost inflation.\n    Inflation expectations rose as high as 2.23% on Friday, the\nhighest since 2014. That means that investors are now pricing in\naverage annual inflation of 2.23% for the next 10 years.\n.\n    The rates had dipped after data on Wednesday showed weaker\nthan expected inflation in January.\n    Demand for inflation-linked and long-dated debt will be\ntested next week when the Treasury Department sells $27 billion\nin 20-year bonds on Wednesday and $9 billion in 30-year Treasury\nInflation-Protected Securities (TIPS) on Thursday.\n    The closely watched yield curve between two-year and 10-year\nnotes steepened as short-term rates remained contained by\nexpectations that the Federal Reserve will keep rates near zero\nfor years to come.\n    The curve steepened to 109.10 basis points,\nmatching the level reached on Monday, which was widest yield gap\nsince April 2017.\n    Investors are also watching Treasury bills after the\nTreasury Department earlier this month said it will cut bill\nissuance to reduce its cash balance.\n    Analysts expect the Federal Reserve to hike the interest it\npays on excess reserves (IOER) if Treasury bill rates fall below\nzero. The one-month and three-month bills currently yield three\nto four basis points.\n    \n    February 12 Friday 3:01PM New York / 2001 GMT\n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.04         0.0406    0.000\n Six-month bills               0.055        0.0558    0.000\n Two-year note                 100-7/256    0.111     0.000\n Three-year note               99-202/256   0.1956    0.008\n Five-year note                99-116/256   0.4868    0.026\n Seven-year note               99-96/256    0.8427    0.038\n 10-year note                  99-68/256    1.2032    0.045\n 20-year bond                  92-136/256   1.8273    0.064\n 30-year bond                  97-16/256    2.0058    0.061\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap         9.25         0.50    \n spread                                               \n U.S. 3-year dollar swap         9.75         0.25    \n spread                                               \n U.S. 5-year dollar swap        12.25         0.25    \n spread                                               \n U.S. 10-year dollar swap        7.25         0.75    \n spread                                               \n U.S. 30-year dollar swap      -20.50         0.00    \n spread (Editing by Sonya Hepinstall)\n  "}