{"text": " (Updates prices, adds details 10-year auction)\n    By Chuck Mikolajczak\n    NEW YORK, May 12 U.S. Treasury yields climbed on\nWednesday, with the 10-year note hitting its highest level in a\nmonth, following a much stronger than expected reading on\nconsumer prices that heightened worries the economy may be\nheading towards a sustained period of higher inflation. \n    The Labor Department said the consumer price index surged\n0.8% in April, its largest rise since June 2009, after rising\n0.6% in the prior month. The \"core\" reading, which excludes the\nmore volatile food and energy portions, jumped 0.9%.\nExpectations called for overall CPI to rise 0.2% and the core\nreading to climb 0.3%.\n    The yield on 10-year Treasury notes was up 7.1\nbasis points to 1.695%. The yield climbed as high as 1.697%, its\nhighest since April 13 and on pace for its biggest one-day basis\npoint increase since March 18. \n    The U.S. Federal Reserve has repeatedly stated that it views\nany inflation to be transitory in nature. On Wednesday, Fed Vice\nChair Richard Clarida said it will be \"some time\" before the\nU.S. economy is healed enough for the Federal Reserve to\nconsider pulling back its crisis levels of support and he\nexpects the rise in prices to be temporary.\n    \"The market is getting ahead of itself in terms of pricing\nin a higher chance of inflation and rates rising while the Fed\nis being very clear and very cautious in setting expectations,\ntelling people you have to be patient, you may see a lot of\ndownside risk,\" said Kelly Ye, director of research at IndexIQ\nin New York.\n    \"So it is going to be a continued push-and-pull in terms of\nthe Fed telling people you guys are getting ahead of yourself\nwhile investors are scared and thinking about what they are\ngoing to do if inflation really starts to rise.\" \n    Analysts have noted there is likely to be higher reading in\neconomic data in the coming months, as year-over-year\ncomparisons are extreme due to the severe economic shutdown that\nbegan in March 2020.\n    The yield on the 30-year Treasury bond was up\n6.3 basis points to 2.415%. \n    \n    The breakeven rate on five-year U.S. Treasury\nInflation-Protected Securities (TIPS) was last at\n2.734%, after closing at 2.697% on Tuesday, near its highest\nclose in just over a decade.\n    The 10-year TIPS breakeven rate was last at\n2.566%, indicating the market sees inflation averaging 2.5% a\nyear for the next decade.\n    A Treasury auction of $41 billion in 10-year notes was\nstrong, with some analysts noting the rise in yields may have\nattracted buyers. A $27 billion sale of 30-year bonds on\nThursday will bring even more supply to the market.\n    \n      May 12 Wednesday 2:59PM New York / 1859 GMT\n                               Price                  \n US T BONDS JUN1               155-18/32    -1-12/32  \n 10YR TNotes JUN1              131-232/256  -0-140/2  \n                                            56        \n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.015        0.0152    0.000\n Six-month bills               0.0325       0.033     -0.002\n Two-year note                 99-235/256   0.1668    0.006\n Three-year note               99-174/256   0.3576    0.028\n Five-year note                99-114/256   0.8644    0.063\n Seven-year note               99-98/256    1.3431    0.070\n 10-year note                  94-228/256   1.6952    0.071\n 30-year bond                  88-148/256   2.4153    0.063\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap        10.25         0.75    \n spread                                               \n U.S. 3-year dollar swap        11.25        -1.25    \n spread                                               \n U.S. 5-year dollar swap         8.25         0.25    \n spread                                               \n U.S. 10-year dollar swap       -3.00         0.00    \n spread                                               \n U.S. 30-year dollar swap      -30.75        -0.75    \n spread                                               \n \n\n    \n\n    \n (Reporting by Chuck Mikolajczak; \nEditing by Chizu Nomiyama and Andrea Ricci)\n  "}