{"text": " (Recasts, adds 10-year note auction results, analyst comments)\n    By Karen Brettell and Karen Pierog\n    April 12 Smooth note auctions on Monday kept a\nmove higher in U.S. Treasury yields in check as the market\nlooked ahead to this week's 30-year bond offering and key data\nreleases, including consumer price inflation. \n    An auction of $38 billion of 10-year notes resulted in a\nhigh yield of 1.680% and a bid-to-cover ratio, a gauge of\ndemand, of 2.36 times.\n    Earlier on Monday, $58 billion of three-year notes were sold\nat a high yield of 0.376% and with a bid-to-cover ratio of 2.32\ntimes..\n    \"Having two in a day on a Monday and just having them go so\nfar pretty darn well, you couldn't ask for more,\" said Jim\nVogel, senior rates strategist at FHN Financial in Memphis,\nTennessee.\n    The benchmark 10-year yield was last up 1 basis\npoint at 1.6764%, holding below a 14-month high of 1.776%\nreached on March 30. The three-year yield was last\n2.2 basis points higher at 0.3576%. \n    Vogel said yields barely budged following the auctions.\n    \"It shows that we've got fairly stable yields not because no\none's paying attention, but because for the most part we're\ncomfortable at least until we get some big new developments,\" he\nsaid.\n    Combined with a $24 billion auction of 30-year bonds on\nTuesday, $120 billion in coupon supply hits the market this\nweek, testing investor appetite for debt.\n    Yields have dipped from one-year highs reached last month on\nimproving demand for the debt, though they remain elevated with\ninvestors concerned that faster economic growth and rising price\npressures will continue to push yields higher.\n    Increasing supply as the government finances higher fiscal\nspending and widening deficits is adding to the yield increases.\n     Aside from the auctions, the market is also focused on key\ndata this week, including U.S. consumer price data for March due\nout on Tuesday. Investors are betting that price pressures will\nincrease due to increased fiscal and monetary stimulus and as\nbusinesses reopen from COVID-19 related closures. \n    \"We've built so much in terms of inflation expectations into\nthe market right now that you almost have to have a high CPI\nreport maybe for the next three or four months or people are \ngoing to have to maybe reassess how much concern that they've\nalready built in about inflation,\" Vogel said.\n    Comparisons with last year are also likely to be strong, due\nto a drop in inflation a year ago when businesses closed due to\nCOVID-19.\n    This is the first month were going to see the big base\neffect pump up the year-over-year comparisons, said Tom Simons,\na money market economist at Jefferies in New York.\n    Market participants are aware of the effect, however, and\nthe Federal Reserve has indicated it will look through any\ntemporary inflation, making it unlikely that a strong number\nwill create a hawkish response from the U.S. central bank.\n    I dont think there is a real risk that the hiking timeline\nis pulled forward or anything like that, Simons said.\n    Data on Friday showed that U.S. producer prices notched\ntheir largest annual gain in 9-1/2 years last month.\n\n    The two-year Treasury yield, which typically\nmoves in step with interest rate expectations, was last up 1.6\nbasis points at 0.1728%. \n    A closely watched part of the yield curve, which measures\nthe gap between yields on two- and 10-year Treasury notes\n, was less than a basis point steeper at 150.36\nbasis points.\n    \n   April 12 Monday 13:57PM New York / 1757 GMT\n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.0175       0.0177    0.005\n Six-month bills               0.0375       0.038     0.000\n Two-year note                 99-232/256   0.1728    0.016\n Three-year note               99-176/256   0.3576    0.022\n Five-year note                99-82/256    0.8903    0.022\n Seven-year note               99-96/256    1.3443    0.014\n 10-year note                  95-4/256     1.6764    0.010\n 20-year bond                  94-48/256    2.2394    0.016\n 30-year bond                  89-232/256   2.3473    0.008\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap        11.50        -0.75    \n spread                                               \n U.S. 3-year dollar swap        14.50        -0.50    \n spread                                               \n U.S. 5-year dollar swap        10.50        -0.75    \n spread                                               \n U.S. 10-year dollar swap        1.75        -0.75    \n spread                                               \n U.S. 30-year dollar swap      -22.75        -0.75    \n spread (Reporting by Karen Brettell in New York and Karen Pierog in\nChicago; editing by Jonathan Oatis)\n  "}