{"text": " (Recasts, updates yields)\n    By Karen Pierog\n    CHICAGO, Aug 12 U.S. Treasury yields on the\nlonger end of the curve hovered near the unchanged mark on\nThursday after struggling to maintain higher levels reached in\nthe wake of a 30-year bond auction, while cash flowing into to\nan overnight Federal Reserve facility set a new record.\n    The 30-year yield, which hit a session high of\n2.035% following the early-afternoon auction, was last at\n2.0048%. \n    The benchmark 10-year yield rose as high as\n1.379% after the auction and was last at 1.3607%.\n    The $27 billion of 30-year bonds were sold at a high yield\nof 2.040% and with a bid-to-cover ratio, a gauge of demand, of \n2.21.\n    \"You had a really pretty normal result relative to average\nso I think the market looked through the auction results and\njust kind of kept on doing what it was doing,\" said Tom Simons,\na money market economist at Jefferies in New York. He added that\na really weak or really strong auction would have had the\npotential to move rates more.\n    Yields, meanwhile, continued to inch higher ahead of an\nexpected announcement by the Fed on tapering its asset purchases\nand with the latest inflation readings, Simons said. \n    U.S. producer prices increased more than expected in July,\nsuggesting inflation could remain high as strong demand fueled\nby the economic recovery from the coronavirus pandemic continues\nto press supply chains.\n    The producer price report on Thursday from the Labor\nDepartment followed data on Wednesday that showed U.S. consumer\nprice increases slowed in July even as they remained at a\n13-year high on a yearly basis amid tentative signs inflation\nhas peaked as supply-chain disruptions caused by the pandemic\nwork their way through the economy.\n    Inflation expectations have risen this week, with the\nbreakeven inflation rate on five-year U.S. Treasury\nInflation-Protected Securities (TIPS) climbing as\nhigh as  2.616% on Thursday. It was 2.552% on Monday.\n    The Labor Department also reported on Thursday that initial\nclaims for state unemployment benefits fell 12,000 to a\nseasonally adjusted 375,000 for the week ended Aug. 7.\n\n    \"It's the third decline in a row, so that's giving people\nmore optimism that the next jobs figures will be reasonably\nstrong,\" said Kathy Jones, chief fixed income strategist at the\nSchwab Center for Financial Research in New York.\n    The U.S. Treasury also announced auctions for $27 billion of\n20-year bonds next Wednesday and $8 billion of 30-year TIPS on\nAug. 19.\n    Auctions earlier this week were solid, with Wednesday's\n10-year note auction the strongest since 2012, possibly as a\nresult of foreign demand, Citi analysts said in a research\nreport.\n    The amount of cash pouring into the Fed's overnight reverse\nrepurchase agreement facility set a record high of $1.087\ntrillion on Thursday, topping the previous record of $1.039\ntrillion set on July 30.\n     A closely watched part of the yield curve that measures the\ngap between yields on two- and 10-year Treasury notes\n was last 2.29 basis points steeper at 113.60 basis\npoints.\n   August 12 Thursday 3:42PM New York / 1942 GMT\n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.05         0.0507    0.000\n Six-month bills               0.05         0.0507    -0.002\n Two-year note                 99-207/256   0.2227    0.002\n Three-year note               99-194/256   0.4565    0.005\n Five-year note                99-8/256     0.8245    0.013\n Seven-year note               99-32/256    1.131     0.012\n 10-year note                  98-248/256   1.3607    0.002\n 20-year bond                  105-136/256  1.9124    0.004\n 30-year bond                  108-68/256   2.0048    0.001\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap         9.00         0.50    \n spread                                               \n U.S. 3-year dollar swap         9.75         0.75    \n spread                                               \n U.S. 5-year dollar swap         8.50         0.00    \n spread                                               \n U.S. 10-year dollar swap        0.25        -0.75    \n spread                                               \n U.S. 30-year dollar swap      -29.25         0.50    \n spread (Reporting by Karen Pierog; editing by Jonathan Oatis and Chizu\nNomiyama)\n  "}