{"text": " (New throughout, updates prices, market activity and comments;\nadds auction)\n    By Karen Brettell\n    NEW YORK, Aug 12 U.S. Treasury yields dipped\nfrom one-month highs on Wednesday after the Treasury saw good\ndemand for a record $38 billion auction of 10-year notes, but\nthey remained higher on the day ahead of a 30-year bond auction\non Thursday.\n    The 10-year notes sold with a high yield of 0.677%, less\nthan a basis point lower than where they had traded before the\nsale. Indirect bidders, which includes fund managers and other\ninvestors, bought 65% of the notes, a larger share than average.\n\n    The auction went off without a hitch, said Justin Lederer,\nan interest rate strategist at Cantor Fitzgerald in New York.\n    The Treasury last week increased auction sizes across the\ncurve and said that it plans to continue to keep shifting more\nfunding to longer-dated debt as it finances measures to offset\nthe impact of the coronavirus epidemic.\n    \"This whole week we're dealing with supply coming into the\nmarket,\" said Tom Simons, a money market economist at Jefferies\nin New York.\n    Benchmark 10-year note yields were last up one\nbasis point at 0.670%, after getting as high as 0.691% before\nthe auction, the highest since July 7.\n    Analysts said Treasuries remain attractive as they pay\nhigher yields than comparable overseas debt, and as concerns\nover renewed economic weakness fuels strong demand for\nsafe-haven debt.\n    The Federal Reserve has also committed to years of\nrock-bottom rates and is holding yields down through bond\npurchases.\n    If you look at us, (to) international buyers were 'cheap'\non a relative basis, and every backup has been met by demand,\nLederer said. I dont think the market is ready to really\njustify significantly higher rates.\n    The Treasury will sell $26 billion in 30-year bonds on\nThursday, which is a record large size for that tenor.\n    A record $48 billion sale of three-year notes on Tuesday\nalso drew solid demand.\n    Yields rose earlier on Wednesday after data showed that U.S.\nconsumer prices rose more than expected in July, with a measure\nof underlying inflation increasing by the most in 29-1/2 years.\n\n    \"This is a pretty surprising report,\" Simons said. However,\n\"year-over-year, you still see pretty weak readings. You have to\nlook at the overall economy and how much slack there is,\" Simons\nadded.\n    Treasuries have also weakened this week as risk appetite\nimproved. The S&P 500 jumped on Wednesday, putting it just\npoints away from its record closing high.\n    \n      August 12 Wednesday 3:00PM New York / 1900 GMT\n                               Price                  \n US T BONDS SEP0               178-26/32    -0-10/32  \n 10YR TNotes SEP0              139-48/256   -0-16/25  \n                                            6         \n                               Price        Current   Net\n                                            Yield %   Change\n                                                      (bps)\n Three-month bills             0.105        0.1065    -0.006\n Six-month bills               0.12         0.1217    -0.002\n Two-year note                 99-239/256   0.1589    -0.002\n Three-year note               99-208/256   0.1878    -0.001\n Five-year note                99-198/256   0.296     0.006\n Seven-year note               99-48/256    0.4938    0.007\n 10-year note                  99-148/256   0.6697    0.012\n 20-year bond                  99-204/256   1.1365    0.018\n 30-year bond                  97-52/256    1.3647    0.018\n                                                      \n   DOLLAR SWAP SPREADS                                \n                               Last (bps)   Net       \n                                            Change    \n                                            (bps)     \n U.S. 2-year dollar swap         7.50        -0.25    \n spread                                               \n U.S. 3-year dollar swap         6.25        -0.25    \n spread                                               \n U.S. 5-year dollar swap         4.50        -1.00    \n spread                                               \n U.S. 10-year dollar swap       -0.75        -0.75    \n spread                                               \n U.S. 30-year dollar swap      -40.50        -0.75    \n spread (Reporting by Karen Brettell; Editing by Will Dunham and David\nGregorio)\n  "}