{"text": "WASHINGTON President Donald Trump and Vice President Mike Pence had a good conversation at the White House on Monday evening, a senior administration official said, marking the end of a silent period in their relationship after the riot at the Capitol last week.The conversation was their first since the Republican president lambasted Pence on Wednesday for not seeking to block the certification in Congress of Democratic President-elect Joe Bidens Electoral College win.A source familiar with the situation said Trump had not reached out to Pence to check on his safety on Wednesday when he was evacuated after a mob of Trump supporters stormed the Capitol in the middle of the certification process.The official said Trump and Pence discussed the riot in their Oval Office meeting on Monday.They reiterated that those who broke the law and stormed the Capitol last week do not represent the America first movement backed by 75 million Americans, and pledged to continue the work on behalf of the country for the remainder of their term, the official said in a statement.The two had a good conversation, discussing the week ahead and reflecting on the last four years of the administrations work and accomplishments, the official added. Biden takes office on Jan. 20.Last week, Trump, who has sought unsuccessfully to overturn his Nov. 3 election loss, urged Pence to intervene in the certification process and encouraged his supporters to march to the Capitol. A melee ensued in which five people died, including a Capitol Police officer. Some of Trumps supporters in the assault discussed assassinating Pence for being a traitor.The vice president has resisted pressure from Democrats to help remove Trump from office by invoking the 25th Amendment of the U.S. Constitution. Pences advisers say he is opposed to such a move.Democrats in the U.S. House of Representatives plan to impeach Trump on Wednesday unless he steps down or is removed before then, after drawing up charges accusing him of inciting insurrection before last weeks siege of the Capitol.Pence has been a loyal lieutenant to Trump for the four years of his often chaotic presidency, standing by him through multiple crises. Many current and former White House officials said they were deeply disappointed by the way Trump treated Pence over the past week."}