{"text": "JOINT BASE ANDREWS, Md./WASHINGTON U.S. President Donald Trump, facing impeachment on a charge of incitement of insurrection on Tuesday denied responsibility for his supporters violent invasion of the U.S. Capitol last week and said his remarks before the siege were appropriate.The Republican president told reporters that his speech before Wednesdays assault - in which he urged supporters to march on the Capitol and fight - had been analyzed by unnamed others, who he said believed it was totally appropriate.If you read my speech ... what I said was totally appropriate, he told reporters at Joint Base Andrews when asked about any personal responsibility he had regarding the Jan. 6 attack when his supporters stormed the Capitol with members of Congress and his own Vice President Mike Pence inside.Theyve analyzed my speech and my words and my final paragraph, my final sentence and everybody ... thought it was totally appropriate, he said before heading to Alamo, Texas to visit and sign his signature wall on the border with Mexico.Democrats in the U.S. House of Representatives plan to impeach Trump on Wednesday unless he steps down or is removed before then, which would make him the only U.S. president ever to be impeached twice.Trumps remarks on Tuesday were his first in public since Wednesday, although he released a video on Thursday in which he condemned the violence but did not concede the election.Democrats said Trumps defense of his words and actions underscored the urgency of removing him from office.Trumps lack of contrition today makes clear that the 25th Am must be invoked to remove him, Daniel Goldman, majority counsel in the first House impeachment inquiry, tweeted. Impeachment should proceed apace and every MOC must think hard about whether s/he supports Trumps efforts to overturn the election and incite an insurrection on the Capitol.Trump did not answer a shouted question before leaving the White House about whether he was responsible for the violence at the Capitol, which led to the deaths of six people.Instead, he blasted Democratic leaders for moving forward on impeachment, warning it posed a tremendous danger to the country.Conservative former presidential candidate Evan McMullin said those remarks amounted to threats of further violence.Trumps threats of more violence by warning of tremendous anger and tremendous danger in response to potential impeachment, a vital mechanism of our democracy, are further evidence of its justice and necessity, he said on Twitter."}