{"text": "MINDEN, Nev. Republican President Donald Trump rallied his backers in Nevada on Saturday in a bid to drum up support in a state where polls show his Democratic rival Joe Biden is ahead.Going through a list of grievances about Democrats, the media, and mail-in voting, Trump spoke to a crowd of thousands at an airport outside of Reno where people stood close to one another and, in many cases, did not wear masks despite the coronavirus pandemic.The president mused about staying in office 12 years, despite constitutional limits that prohibit U.S. presidents from serving more than two, four-year terms.We are going to win four more years in the White House and then after that well negotiate, right, because were probably, based on the way we were treated, were probably entitled to another four after that, he said.Trump again accused Democrats of trying to rig the Nov. 3 election and he knocked Biden over an ad that criticized Trump for allegedly making derogatory comments about U.S. war dead. Trump has denied making the remarks.Now I can be really vicious, in return, the president said, expressing his disgust over the ad and calling Biden pathetic.Trump is trailing the former vice president in national polls and in Nevada, which the former real estate developer and reality television star lost narrowly to Democratic presidential nominee Hillary Clinton in 2016.Biden has hammered Trump for failing to lay out a national strategy to combat the pandemic, which has killed more than 193,000 people in the United States.The president, who credits his decision to restrict travel from China at the beginning of the year with saving lives, publicly played down the virus in the early months of 2020 and has pushed for a rapid re-opening of the economy after a lockdown in the spring.Nevadans dont need more bluster from the president, and dont need his reckless rallies that ignore the realities of COVID-19 and endanger public health, Biden said in a statement on Saturday.Nevada families need solutions  from containing the pandemic to building the economy back better to making quality health care more accessible to millions of Americans.The president has increased his number of campaign rallies in recent weeks, holding them in airplane hangars or outdoors because of the risk of coronavirus spread. Thousands of supporters have been showing up, many of them without maintaining social distance or wearing face coverings.Trump has campaign events scheduled in Nevada and Arizona during a three-day Western swing that will also include a stop in California on Monday for a briefing about the devastating fires that are ravaging the West Coast.The president is ramping up fundraising, too, amid concerns that his campaign is dealing with a cash shortage, leading it to pull back television advertising in crucial states.A Republican official said some $18 million would be raised over the weekend through events in Washington and Nevada."}