{"text": "FRANKFURT Deutsche Bank will not do business in the future with U.S. President Donald Trump or his companies in the wake of his supporters assault on the U.S. Capitol, the New York Times reported.Deutsche Bank is Trumps biggest lender, with about $340 million in loans outstanding to the Trump Organization, the presidents umbrella group that is currently overseen by his two sons, according to Trumps disclosures with the U.S. Office of Government Ethics dated July 31 last year, plus banking sources.The move, reported by the NYT and citing a person familiar with the banks thinking, comes as Signature Bank - where Trumps ethics disclosures show he has checking and money-market accounts - called for him to step down.The resignation of the president ... is in the best interests of our nation and the American people, Signature Bank said on its website.A spokesman for Deutsche Bank declined to comment on Tuesday on the NYT report.The Trump Organization did not immediately respond to an email seeking comment outside normal business hours, and the White House press office did not answer the phone.Christiana Riley, the head of Deutsche Banks U.S. operations, condemned the Jan. 6 violence in Washington in a post on LinkedIn last week.We are proud of our Constitution and stand by those who seek to uphold it to ensure that the will of the people is upheld and a peaceful transition of power takes place, she wrote.Reuters reported in November that Deutsche Bank was looking for ways to end its relationship with Trump after the U.S. elections, as it tires of the negative publicity stemming from the ties.Trumps loans with Deutsche are for a golf course in Miami and hotels in Washington and Chicago.The president was handed a rebuke by the world of professional golf this week, with the PGA of America and the R&A both announcing they would shun two courses owned by the President in the wake of the Capitol storming.Twitter and Facebook have shut down Trumps social-media feeds."}