{"text": "WASHINGTON Donald Trumps lawyers said on Friday Democrats had provided no evidence the former president incited last months deadly U.S. Capitol riot and had used his second impeachment trial to settle political scores.Trump is on trial in the U.S. Senate on a charge of inciting the Jan. 6 insurrection by supporters who stormed the seat of Congress in Washington to stop lawmakers from certifying Democratic President Joe Bidens election victory, resulting in the deaths of five people, including a police officer.Trumps lawyers argued that his remarks, including a fiery speech that day urging supporters to fight like hell to stop the certification, were protected by the First Amendment of the U.S. Constitution, which ensures the right to free speech.To claim that the president in any way wished, desired or encouraged lawless or violent behavior is a preposterous and monstrous lie, said Michael van der Veen, one of Trumps lawyers.The Senate wrapped up its session at 6:29 p.m. A final up-or-down vote to convict could come as soon as Saturday.In arguments this week, Democratic members of the House of Representatives showed videos and shared tweets they said made clear Trump had set the stage for the violence by falsely claiming the election results were fraudulent and egging on his supporters with his rhetoric long before Jan. 6.They said he summoned the mob to Washington, gave the crowd its marching orders and did nothing to stop the violence as it played out on television. His one request to act peacefully did not absolve him, they said.You rob the bank, and on the way out the door you yell, Respect private property! Thats not a defense to robbing the bank, said Democratic Representative Jamie Raskin.The Democrats are unlikely to gain a conviction, as few Republican senators have come out against Trump, who remains popular among Republican voters.Trumps team played a roughly 10-minute video showing prominent Democrats using the word fight in political speeches.You didnt do anything wrong, Trump lawyer David Schoen said, addressing Democrats. Its a word people use, but please stop the hypocrisy.Trumps defense team also portrayed the impeachment trial as little more than the result of a political witch hunt by Democrats who had been trying to get Trump for four years.Senators sought to confirm whether Trump knew Vice President Mike Pence, who was presiding over the certification, was endangered by the Capitol attack when he sent a Twitter message criticizing him.Republican Senator Tommy Tuberville said he had told Trump over the phone that Pence had already been evacuated from the Senate for his safety.Trumps lawyers gave conflicting answers.Im sure Trump was concerned, van der Veen said.The defense case followed two days of video presentations by the nine House Democrats serving as prosecutors.They showed videos of the Republican former president cheering violence at his rallies, repeating his election fraud claims and urging his supporters to gather in Washington on Jan. 6 for a rally he said would be wild.CONVICTION UNLIKELYThe Democratic-controlled House impeached Trump on Jan. 13. Conviction in the 100-member Senate requires a two-thirds majority, which means at least 17 Republicans would have to defy the former president.Im anxious to see what my Republican friends do, Biden told reporters at the White House on Friday.Van der Veen said there was a double standard at the heart of the prosecutions case, arguing that some Democrats had encouraged and endorsed violence that erupted at some anti-racism protests across the United States last summer without facing any legal consequences.They have clearly demonstrated that their opposition to mobs and their view of using the National Guard depends upon their political views, said van der Veen, a last-minute addition to the defense team who sued Trump in August in a separate case about mail voting.On Tuesday, the Senate voted largely along party lines that the impeachment trial was constitutional even though Trumps term ended on Jan. 20. Six Republican senators sided with Democrats.If Trump is acquitted, the Senate could decide to censure him or even vote to bar him from holding public office again. Asked on Thursday about pursuing the latter option, Senate Majority Leader Chuck Schumer said that decision would have to wait until the end of the trial.Senator John Thune, the No. 2 Republican in the chamber, indicated that a censure motion could be in the cards.Ive seen a couple of resolutions at least that I think could attract some support, Thune told reporters. He added that he did not think an effort to bar Trump from holding office again under the 14th Amendment would go anywhere.Neither side has so far announced an intention to call witnesses, leaving senators on track for final arguments and a vote as soon as Saturday.Trump is the first U.S. president to be impeached twice and the first to face trial after leaving office. His first impeachment trial, which stemmed from his efforts to pressure Ukraine to investigate Biden, ended in an acquittal a year ago in what was then a Republican-controlled Senate."}