{"text": "WASHINGTON President Donald Trump has bowed to pressure over an election rally scheduled to take place in Tulsa, Oklahoma, on the Juneteenth anniversary that commemorates the end of U.S. slavery, and said he was pushing the event back by a day.Trumps decision to hold his first campaign rally in months on June 19 in a city notorious for a 1921 massacre of its black citizens had prompted fierce criticism, especially in the face of nationwide protests against racial inequality and police brutality against African Americans.Many of my African American friends and supporters have reached out to suggest that we consider changing the date out of respect for this Holiday, Trump wrote on Twitter late on Friday. I have therefore decided to move our rally to Saturday, June 20th, in order to honor their requests.June 19th, known by African Americans as Freedom Day, commemorates the date in 1865 when Texas was forced to comply with President Abraham Lincolns Emancipation Proclamation declaring all people held as slaves free - the last of the pro-slavery Confederate states to do so.African American leaders had blasted Trumps decision to resume his campaigning after the coronavirus lockdown in Tulsa, which in 1921 saw one of the countrys worst outbreaks of racial violence when white mobs went on the rampage, massacring black residents and destroying their homes and businesses.This isnt just a wink to white supremacists - hes throwing them a welcome home party, Senator Kamala Harris, a top contender to be Democratic presidential candidate Joe Bidens running mate, wrote on Twitter on Thursday.U.S. Representative Al Green, a Congressional Black Caucus member, denounced the move as overt racism from the highest office in the land.Katrina Pierson, senior adviser to the Trump campaign, said at the time that Republicans, as the party of Lincoln, were proud of the history of Juneteenth, and that Trump had built a record of success for African Americans.Trump, seeking re-election on Nov. 3, won Oklahoma by more than 36 points in 2016.Referring to his rally, Trump told Fox News in an interview recorded on Thursday and screened earlier on Friday: Think about it as a celebration.Trump, who suspended his political rallies in March due to the pandemic, had earlier denied that scheduling the event on Juneteenth was deliberate.The rally will take place amid protests around the United States sparked by the death of George Floyd, a black man who died in police custody in Minneapolis on May 25 after a white officer knelt on his neck for nearly nine minutes. The officer was fired and has been charged with second-degree murder.Fox News interviewer Harris Faulkner, who is black, later said she was not sure whether Trump was aware of the painful history of Tulsa for African Americans because her questions in the interview focused on the Juneteenth date of the rally.Trump, who this week rejected calls to rename U.S. military bases named for Confederate military figures, said in the interview that what Lincoln had done was questionable, but was cut off before he could elaborate.I think Ive done more for the black community than any other president. And lets take a pass on Abraham Lincoln cause he did good, although its always questionable. You know, in other words the end result, Trump said without explanation.Faulkner then spoke over him saying: But we are free, Mr. President. He did pretty well.We are free. You understand what I mean. Im going to take a pass on Abe - Honest Abe as we call him, Trump responded.The president said during the Floyd protests in which looting occurred in some cities that when the looting starts, the shooting starts. Trump told Fox News he was not aware that this phrase originated with a white segregationist who was Miami mayor in the 1960s.Democrats and other critics have accused Trump of stoking racial divisions."}