{"text": "The Trump campaign is surveying supporters over a perceived attack by Rupert Murdochs Fox News, as the president continues to retaliate against a network he once saw as a defender.The campaign surveys, which were emailed to supporters and available on its website this week, includes questions such as Do you agree Fox News should recall their Arizona projection for Joe Biden? and Do you agree media outlets, such as Fox News, should be held accountable for misleading the public?Trump has complained about being treated unfairly by the news division of the network for months, even as Foxs opinion hosts support the presidents demand to investigate potential voter fraud.He has urged supporters to watch smaller rival right-leaning networks Newsmax and One America News Network. He stepped up his criticism after Fox News, owned by Fox Corp, was the first network to project that Biden would win Arizona in the U.S. presidential election.Fox Corp shares were down 6% Thursday.The Arizona projection, defended on multiple occasions on-air by Fox News and backed up by the Associated Press about three hours later, shifted the vote count and tenor of the election in favor of Biden.Trumps allies have argued that Trump, who has refused to concede the election to Biden, still has a shot of winning it.The Trump campaign did not respond to a request for comment. Fox News declined to comment.The surveys come amid a new report from Axios that Trump is considering starting a digital media company designed to undermine Fox News, citing unnamed sources.On Thursday Trump continued his attack on the network, tweeting @FoxNews daytime ratings have completely collapsed. Weekend daytime even WORSE. Very sad to watch this happen, but they forgot what made them successful, what got them there. They forgot the Golden Goose. The biggest difference between the 2016 Election, and 2020, was @FoxNews!Fox News has had record ratings throughout the year. Its election coverage led all networks with 14.1 million prime-time viewers, according to Nielsen.Some Fox News anchors and reporters have pushed back on Trump administration charges of voter fraud. On Nov. 9 anchor Neil Cavuto cut out of the White House press briefing following claims by White House Press Secretary Kayleigh McEnany that Democrats were welcoming fraud and welcoming illegal voting.On Nov 6, Fox News anchor and senior correspondent Eric Shawn said of claims that Republican poll watchers had been barred from observing the process in Philadelphia: Thats not true. Its not true. Its just not true."}