{"text": "WASHINGTON The Trump administration agreed on Tuesday to an auto industry request to delay the start of dramatically higher penalties for companies that fail to meet fuel efficiency requirements, a move that could save the industry hundreds of millions of dollars or more.The decision - announced eight days before President-elect Joe Biden takes office - follows a U.S. appeals court ruling in August that overturned the Trump administrations 2019 decision to suspend a regulation that more than doubled penalties for automakers failing to meet fuel efficiency requirements.Congress in 2015 ordered federal agencies to adjust civil penalties to account for inflation. In response, the National Highway Traffic Safety Administration (NHTSA) issued rules to raise fines to $14 from $5.50 for every 0.1 mile per gallon new cars and trucks consume in excess of required standards.Automakers protested that 2016 hike, saying it could increase industry compliance costs by $1 billion annually.The auto industry trade group that sought relief praised the NHTSAs decision, noting vehicles that would have faced higher penalties have already been sold or will soon be manufactured.Fiat Chrysler Automobiles (FCA) paid a $79 million civil penalty for failing to meet 2017 fuel economy requirements after paying $77.3 million for 2016 requirements.In November, FCA warned it could need to set aside 500 million euros ($608 million) as a result of the appeals court decision.The NHTSA cited FCAs disclosure and noted increasing the rate is likely to lead to an increase in the price ofcredits. The agency added that to disregard the industrys serious reliance interests would be unfair and improper.Environmental groups urged the administration to retain the increase, noting U.S. fuel economy fines lost nearly 75% of their original value because fines had been increased only once - from $5 to $5.50 in 1997 - since 1975.Dave Cooke, vehicles analyst at the Union of Concerned Scientists, said NHTSAs decision amounted to regulators doing some last-minute favors for the auto industry."}