{"text": "WASHINGTON President Donald Trump has privately discussed with advisers the possibility of replacing Defense Secretary Mark Esper after the November election following a growing number of differences between them, a source familiar with the internal debate said on Wednesday.The source, speaking on condition of anonymity, said the two men were not in a good place but that Trump did not intend to move on Esper until voters have rendered their judgment on a second Trump term on Nov. 3.Esper, a former Army secretary, is respected by Republicans and Democrats as a steady hand at the Pentagon during a turbulent administration that has seen Trump repeatedly draw the military into hot-button domestic political issues, including the border wall with Mexico.But Trump was troubled by Espers opposition to invoking the Insurrection Act to deploy active-duty forces to quell civil unrest that broke out in June after the death of George Floyd, a Black man who was in police custody in Minneapolis.Esper also appeared to publicly split with Trump last month by issuing a de facto ban on the Confederate flag at military installations, at a time when Trump was citing free speech rights in his defense of Americans who fly the Confederate flag.The source acknowledged the Confederate flag issue was another source of tension.The Confederate flag was flown by breakaway Southern states that advocated for the continuation of slavery and lost the 1861-65 U.S. Civil War. Flying the flag can be offensive to many Americans, who see it as a reminder of the enslavement of Black Americans and as a symbol of white supremacy.Supporters say the flag represents the Souths heritage and culture and serves as a memorial to Confederate casualties in the Civil War.We have no personnel announcements at this time nor would it be appropriate to speculate about changes after the election or in a second term, said White House spokesman Judd Deere.The Pentagon did not immediately respond to a request for comment. One U.S. official, speaking on condition of anonymity, noted, however, that turnover in top positions is common at the end of a presidential term.Trumps private discussions about Esper could further stoke anxiety among Democrats in Congress about leadership at the Department of Defense.Earlier this month, the White House installed a senior policy official at the Pentagon who falsely called Trumps predecessor, Barack Obama, a Muslim and a terrorist.Anthony Tata, a retired Army brigadier general who had been a staunch defender of Trump on Fox News, had failed to secure a Senate confirmation for a more senior post amid controversy over his comments and qualifications.The White House then opted to put Tata into a less senior role in a more provisional capacity, a move strongly criticized by the Senate Armed Services Committees top Democrat."}