{"text": "WASHINGTON President Donald Trump accused congressional Democrats on Wednesday of not wanting to negotiate over a U.S. coronavirus aid package because he was refusing to go along with ridiculous spending requests unrelated to the pandemic.Trumps comments came after top Republican and Democratic negotiators traded blame for a five-day lapse in talks over relief legislation.Treasury Secretary Steven Mnuchin, Trumps chief negotiator, disputed a statement from the two top Democrats in Congress that Republicans had sought more talks but refused any movement on their initial $1 trillion offer, which is less than a third of what the Democratic-controlled House of Representatives passed in a measure in May.An overture was made by Secretary Mnuchin to meet and he made clear that ... the White House is not budging from their position concerning the size and scope of a legislative package, House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer said in a joint statement.We have again made clear to the administration that we are willing to resume negotiations once they start to take this process seriously, they said in the statement.Mnuchin in response claimed Pelosi was unwilling to meet to continue negotiations unless we agreed in advance to her proposal, costing at least $2 trillion.Speaking to reporters at the White House, Trump zeroed in on Democratic requests to support mail-in voting for the November elections and the U.S. Postal Service. Trump has frequently said mail-in voting would lead to widespread fraud, a notion not supported by data.Chuck Schumer and Nancy Pelosi are holding the American people hostage over money for their radical left-wing agenda that the country doesnt want and wont accept, he said.The bills not going to happen because they dont even want to talk about it, because we cant give them the kind of ridiculous things that they want that have nothing to do with the China virus, Trump said.Schumer last week said Democrats had suggested the White House negotiators meet halfway. The $1 trillion proposal by Senate Majority Leader Mitch McConnell met immediate opposition both from Democrats and some of his fellow Republicans, who are opposed to additional spending.The pandemic has taken a particularly heavy toll on the United States, where it has killed more than 164,000 people, more than any other country. Millions of U.S. workers have lost jobs, and the expiration last month of $600 in weekly supplemental federal unemployment benefits is expected to take a further toll.Talks on a new package broke down last Friday. Sticking points include the size of an extended unemployment benefit, aid to state and local governments, and money for schools to reopen.A Reuters/Ipsos poll released on Wednesday found that Americans divide blame pretty evenly between Democrats and Republicans.(This story has been refiled to fix typo in headline)"}