{"text": "WASHINGTON Standing amid a throng of flag-waving supporters of President Donald Trump in front of the U.S. Capitol last Wednesday, Rick Saccone decided to capture the historic moment.The former Pennsylvania state lawmaker handed his cell phone to his wife to record his message. We are trying to run out all the evil people and RINOs that have betrayed our president, said Saccone, using a term to disparage moderate Republicans as Republicans In Name Only.We are going to run them out of their offices, he said and posted the video to his Facebook page without giving it a second thought. The next day, he was forced to quit his job.Saccone, 63, resigned as a political science adjunct professor at Saint Vincent College in Pennsylvania where he taught for 21 years, after the video was widely condemned.In an interview with Reuters, he said he regretted making the video, but said his message was taken too seriously.We were just playing, having fun, said Saccone, who has removed the video from his social media account. Ive been making Facebook Live videos for years. Theyre meant to be lighthearted.Saccone, a Republican who unsuccessfully ran for Congress in 2018, said he was exercising his constitutional First Amendment right to free speech and did not go inside the Capitol nor participate in any violence. He said he received hundreds of death threats after the video went viral.Saccone joins a growing number of Trump supporters facing unexpected consequences after photos and images surfaced online of their presence during the siege of the U.S. Capitol.Five people died, including a U.S. Capitol Police officer, when supporters of the president stormed the legislative complex as lawmakers began certifying Democrat Joe Bidens victory over the Republican Trump in the November election.Trump has claimed, without evidence, that he won the election.Many participants documented their involvement in the days events on social media. Some went without wearing masks to prevent the spread of the coronavirus infection, making them easy for armchair detectives to identify.Some have lost their jobs. Some face criminal charges. The Pentagon has opened 25 investigations into domestic terrorism related to the riot. The FBI has asked the public for tips on those involved in the assault.Many of Trumps followers are living in a fantasy world, said Eric Foner, an American historian and author of the book Reconstruction: Americas Unfinished Revolution, 1863-1877. They dont appear to have given any thought to the consequences of their actions.PRIVATE PLANE TO A RIOTThe mob that stormed the Capitol included a disparate collection of anti-government extremists, including boogaloo boys and white nationalists. It also included some apparently well-to-do Americans, who openly cheered on the violence.Jenna Ryan, a Texas real estate broker, chronicled her visit to the U.S. capital after arriving on a private plane. Her Facebook page shows she checked into The Westin Washington the night before the rampage.The following day, while thousands of people fired up by Trump marched towards the U.S. Capitol in an avowed bid to Save America, Ryan videotaped herself outside the Capitol saying, Were going to be breaking those windows.She later tweeted, We just stormed the Capital. It was one of the best days of my life.The Trump supporter also posted a photo of herself smiling and flashing a peace sign while standing next to a broken Capitol window. Included in the tweet was a threat against the media. And if the news doesnt stop lying about us, were going to come after their studios nextDays later, amid complaints to the Texas Real Estate Commission demanding it revoke her license, Ryan issued a statement saying she was truly heartbroken over the lives lost during the assault.Unfortunately, what I believed to be a peaceful political march turned into a violent protest, she stated on Twitter.Attempts to reach Ryan were unsuccessful.The commission, in a statement on Twitter said that while it did not condone what it called this type of behavior, actions of a license holder that occur outside of a real estate transaction are beyond its jurisdiction.Jenny Cudd, a Texas florist, is a former mayoral candidate who videotaped herself saying, We did break down Nancy Pelosis office door and someone stole her gavel.Now her business, Beckys Flowers, is under fire as well.We do not condone the acts of violence and destruction that occurred at the Capitol, The Knot, a wedding planning app, said in a statement on Twitter. The app has removed the Beckys Flowers business listing from our vendor marketplace pending further review.Attempts to reach Cudd were unsuccessful."}