{"text": "ANKARA Turkey has resumed diplomatic contacts with Egypt and wants further cooperation, Turkish leaders said on Friday, after years of tension since the Egyptian army toppled a Muslim Brotherhood president close to Ankara.Any thaw in ties between the two regional powerhouses could have repercussions around the Middle East, where Cairo and Ankara have sought to influence events in various hotspots and stand on opposing sides in a Mediterranean maritime dispute.Two Egyptian intelligence sources said Turkey had proposed a meeting to discuss cooperation, but they suggested that the contacts were still only preliminary - a view later backed up by a report on Egypts state-run MENA news agency.President Tayyip Erdogan said the contacts were not at the highest level, but right below the highest level. We hope that we can continue this process with Egypt much more strongly.Foreign Minister Mevlut Cavusoglu was quoted as saying by state-owned Anadolu news agency: We have contacts with Egypt both on the intelligence level and the foreign ministry level ... Contacts at the diplomatic level have started.Relations with Cairo have been frosty since Egypts army ousted Mohammed Mursi, Egypts first democratically elected president and an ally of Erdogan, after protests in 2013.An Egyptian security official received a phone call from a Turkish intelligence official on Thursday, setting out Turkeys desire for a meeting in Cairo to discuss economic, political and diplomatic cooperation, the Egyptian intelligence sources said.The Egyptian official welcomed the call and promised to respond as soon as possible, the Egyptian sources said.The call followed unofficial contacts between Egyptian and Turkish security officials in which communications between the two sides were discussed. The issue of maritime borders, a source of tension between Turkey and other east Mediterranean countries, was not raised, according to the sources.Egypts state-run MENA news agency reported that there is nothing that could be described as resuming diplomatic communications between the two countries, citing an official source.It added that Egypt expects any country it has normal relations with to abide by the principles of international law and good neighbourliness.Rebuilding trust will be hard. As well as the tensions over the ousting of Mursi and Mediterranean disputes, Egypts Foreign Minister Sameh Shoukry said last week the Arab League expressed its categorical rejection of Turkish military interventions in Syria, Iraq and Libya.GULF STATESCavusoglus comments come as Turkey seeks to repair strained relations with several regional powers. He said on Friday Ankara would reciprocate if Saudi Arabia and the United Arab Emirates take positive steps to overcome recent tensions.Ties with Riyadh have been strained over the killing of journalist Jamal Khashoggi in the Saudi consulate in Istanbul in 2018 and a row between Turkeys ally Qatar and other Gulf Arab states. Trade has collapsed under an informal boycott by Saudi businesses.Turkey has also been at odds with the United Arab Emirates over the conflict in Libya, and both countries have accused each other of disrupting regional stability.There is no reason for our ties with Saudi Arabia not to be fixed. If they take positive steps, we will take positive steps. The same goes for the UAE. We dont want to fight with anyone, Cavusoglu said.Khashoggi was killed and dismembered by Saudi operatives in 2018 and a U.S. intelligence report found Saudi Crown Prince Mohammed bin Salman approved the operation.We never blamed the Saudi Arabian leadership, Cavusoglu said. At the time, Erdogan said the operation was ordered at the highest levels of the Saudi government. Erdogan spoke to King Salman in November and they agreed to resolve differences through dialogue, Turkeys presidency said."}