{"text": "For Tusse, Sweden's 2021 Eurovision Song Contest contender, it felt like entering a new world coming to the Nordic country at the age of eight from a Ugandan refugee camp.The 19-year-old Tusse, short for Tousin Chiza, will represent Sweden in the Eurovision Song Contest in the Netherlands in May with the song \"Voices\".Born in the Democratic Republic of Congo and separated from his parents at the age of five during an attempted escape from the civil war-torn African country, he spent three years in a refugee camp with an aunt before being granted asylum in Sweden.\"It was a whole different world,\" Tusse told Reuters.\"It's a life that I don't wish for anybody because it's messy and every day you worry a lot. It's all you do, you just worry. Will I get food tonight? Will we find water, will we be alive tomorrow?,\" he said.\"It's that kind of worrying that here in Sweden we don't have which is great.\"Having sung throughout his childhood in Africa, mainly in church choirs where he wished he was the minister so he could perform solos to the congregation, Tusse kept singing in Sweden - in choirs and eventually in talent contests such as Swedish Idol which he won in 2019.\"I was like 'I'm tired of just responding, I want to be in the front' so when I came to Sweden I kept singing in school and in church,\" he said.PARENTS ALIVETusse found out a few years ago that his biological parents were still alive, although his mother has since died.\"I grew up thinking my parents were gone and ultimately thinking that they were dead, so to actually find out that they were alive and well and they got in touch with me for the first time, it was huge. So much joy and just happiness because there was something always missing in my heart.\"Tusse said his father had been cheering him on during the Swedish Eurovision qualifier contests.\"He would call and be like \"My son. Can I vote from Congo?\" and I'm like 'No, you can't, it' doesn't work like that' and he's like 'well, fix it. I can get everybody in Congo to vote',\" Tusse said.Plans to travel to meet his father have been delayed by the coronavirus pandemic.This year's Eurovision Song Contest, one of the world's biggest annual television events, will take place in Rotterdam from May 18-22 following the Netherlands' victory in 2019 with the song \"Arcade\". The event will have a limited live audience after the 2020 edition was cancelled due to the COVID-19 pandemic. L8N2LU0YT"}