{"text": "HONG KONG Twenty-one Hong Kong activists will remain in custody after a court on Friday rejected requests by some for bail and others withdrew their applications in a widely monitored case where they are charged with conspiracy to subvert the government.The charges against a total of 47 opposition figures represent the most sweeping use yet of Hong Kongs new security law, which punishes what it broadly defines as secession, subversion, terrorism and collusion with foreign forces with up to life in prison.The case offers an insight into how the mainland-style justice drafted by Beijing into the security law clashes with the global financial hubs common-law traditions, and is being closely watched by foreign diplomats and rights groups.In contrast with past practice, the new security law puts the onus on defendants to prove they will not pose a security threat if released on bail.Since the group of 47 were charged around two weeks ago, the court has heard a series of requests for bail. While most requests were rejected, the court approved some applications, prompting immediate appeals from prosecutors to overturn some of those approvals. Just five of the group are currently out on bail.Of the 21 defendants in court on Friday, Judge Victor So rejected 11 applications while the rest were withdrawn by the defendants. The rejected defendants have the right to file for another review in eight days, although most indicated they did not intend to do so.The 47 activists are accused of organising and participating in an unofficial, non-binding primary poll in July 2020 that authorities said was part of a vicious plot to overthrow the government.The vote was aimed at selecting the strongest opposition candidates for a legislative council election that the government later postponed, citing the coronavirus.The detentions have been fiercely criticised by governments in the West, including Britain and the United States.Hong Kongs Department of Justice has said no one should interfere with independent prosecutorial decisions.Supporters of the new law say it has restored stability after months of pro-democracy protests in 2019.Hong Kong laws restrict media coverage of the content of bail hearings. The next hearing in the case is on May 31."}