{"text": "Twitter Inc said on Thursday it will next week add labels to identify more state-affiliated accounts, including world leaders personal accounts, to give users more context for geopolitical conversations on the platform.The move comes as Twitters approach to prominent figures and government is under scrutiny after the high-profile ban of former U.S. President Donald Trumps account and as political firestorms have raged in Myanmar and India.In August, Twitter said it would start labeling the accounts of state-affiliated media outlets such as Russias Sputnik and Chinas Xinhua News and of some key government officials for the five permanent members of the United Nations Security Council: China, France, Russia, the United Kingdom and the United States.Twitter said in a blog post that it was expanding its labels to key government officials and institutions that were the voice of the nation state abroad from G7 countries and a majority of countries where Twitter has identified what it deems state-linked information operations.Mock-ups of the labels shared by Twitter said US Government organization or US Government official.Asked how Twitter would determine government labels in situations such as Myanmar where the military recently seized power in a coup, Twitters global public policy director, Nick Pickles, said the company was not labeling countries where government was in dispute.We will take into account the international discussion about legitimacy of the government when we are considering if its appropriate to apply these labels, Pickles said in an interview.The labels will only be added to verified accounts, Pickles said. For example, in Iran that would mean that Supreme Leader Ayatollah Ali Khamenei would not currently get a label because he is not verified, though the foreign minister would.The new countries where senior officials and institutions will be labeled are: Canada, Cuba, Ecuador, Egypt, Germany, Honduras, Indonesia, Iran, Italy, Japan, Saudi Arabia, Serbia, Spain, Thailand, Turkey, and the United Arab Emirates.Twitter will also label the personal accounts of heads of state from these countries and the U.N. Security Council permanent members, citing the use of these accounts for diplomacy.The company has faced international scrutiny over its approach to world leaders accounts. In January it banned Trump after the Capitol riot for tweets - sent from his personal @realDonaldTrump account - that it said risked inciting violence.Twitter has generally exempted world leaders rule-breaking content from removal because it deems their posts in the public interest, instead adding warning notices and reducing the contents reach. Pickles said the way Twitter enforced its rules on accounts would not be based on these labels."}