{"text": "KYIV Belarusian authorities have brought new charges against two prominent opponents of President Alexander Lukashenko who were jailed during mass protests, accusing them of extremism and trying to seize power, their lawyer said on Friday.The charges against Maria Kolesnikova and Maxim Znak could see them jailed for 12 years. Kolesnikova was one of three women who joined forces in an election against Lukashenko last year that prompted a crackdown against months of unrest.The charges coincided with Lukashenko staging a two-day Peoples Assembly which he says is intended to promote political reform but which the opposition has dismissed as a sham to help the veteran leader cling to power.More than 33,000 people have been detained during the protests. The crackdown has prompted new Western sanctions but Lukashenko has refused to resign, backed by diplomatic and financial support from Russia.Lawyer Dmitriy Laevski said Znak was being punished for not being afraid. For not giving up. There are no legal grounds for any of the charges, he added.Lukashenko, who has ruled Belarus since 1994, had on Thursday promised to hold a referendum on constitutional reform early next year.But reformist pledges were laced with triumphant language about Lukashenko saving the country from mutiny.In a second speech on Friday, Lukashenko suggested Belarusians should ditch their smartphones, saying these were being monitored by the United States. One of the delegates proposed awarding Lukashenko the title Hero of Belarus.Referring to himself as an authoritarian leader, Lukashenko turned his attention to Viktor Babariko, another electoral opponent, who was jailed last year on corruption charges Babariko says were fabricated.Everyone is worried about Babariko: ah, the presidents rival was imprisoned. Yes, I dont care about such competitors, Lukashenko told the assembly.Exiled opposition figure Sviatlana Tsikhanouskaya called the assembly a facade. Fake elections, fake inauguration, fake democracy. The regime holds Belarusians hostage, she wrote on Twitter.The U.S. embassy called the assembly neither genuine nor inclusive of Belarusian views and therefore does not address the countrys ongoing political crisis."}