{"text": "NEW YORK/DUBAI The United Nations World Food Programme is hoping to get a share of hundreds of millions of dollars from a private foundation set up to help Yemen by U.S. private equity investor Tim Collins, U.N. food chief David Beasley said on Friday.More than six years of war in Yemen - widely seen as a proxy conflict between Saudi Arabia and Iran - have sent the impoverished country spiraling into what the United Nations describes as the worlds largest humanitarian crisis.In a document shared with aid groups and seen by Reuters, the 2021 Famine Prevention Foundation aims to avert a widespread famine by getting immediate assistance to the maximum number of people experiencing famine or on the brink of famine.Beasley said that he has spoken with Collins several times about the foundation, which has yet to be publicly announced.Tims working hard on a private foundation of funds, Beasley told reporters. He expressed his concerns about the governments around the world being stretched because of the crisis that were now facing because of COVID.Collins, founder of U.S. private equity firm Ripplewood Holdings LLC, declined to comment.Most funding for U.N. aid appeals comes from governments, so the creation of the Famine Prevention Foundation is novel.Contributors to the fund are thought to include entities in Gulf countries, an aid source told Reuters. Aid agency Action Contre la Faim told The New Humanitarian media outlet, which first reported on the new fund this month, that the money was thought to have come from private Gulf entities.The aim of the fund is to demonstrate that the U.N. can promptly scale up responses when given the means to do so ... it is a way to reassure donors, in particular Gulf donors, the aid source said.The foundation is being run by John Ging, former director of U.N. aid operations, and Neal Keny-Guyer, the former chief executive of Mercy Corps aid organization, said two sources familiar with the situation.Earlier this month countries only pledged $1.7 billion for humanitarian aid in Yemen - less than half the $3.85 billion the United Nations was seeking for 2021 to avert a large-scale famine.DUE DILIGENCEBeasley estimated the foundation would have sums in the hundreds of millions of dollars.Norwegian Refugee Council (NRC) Yemen director Mohammed Abdi said the group had applied for money from the foundation.These funds, if received, will be a much-needed addition to our work, he said. Far more money is still needed, along with concerted international action to bring about an immediate ceasefire in Yemen and stop pushing millions more into starvation and misery.While its not clear where the money for the foundation has come from, both Beasley and Abdi said accountability and due diligence had been carried out.Abdi said it had received assurances from the foundation that if the Norwegian Refugee Council receives a grant it will be free to provide assistance based only on the needs of the most vulnerable.Some 80% of Yemenis need help, with 400,000 children under the age of 5 severely malnourished and more than half the population of the Arabian Peninsula country - 16 million people - are going hungry, according to U.N. data.A Saudi Arabia-led military coalition intervened in Yemen in 2015 after the Iran-aligned Houthi group ousted the countrys government from Sanaa. The Houthis say they are fighting a corrupt system. The peoples suffering has been worsened by an economic and currency collapse, and by the COVID-19 pandemic."}