{"text": "A swift resurgence of U.S. leadership under President-elect Joe Biden and wealthy nations fulfilling a promise of cash for poorer countries could galvanise action on climate change this year, the United Nations climate chief said on Tuesday.In November in Glasgow, Scotland, the U.N. will stage its most important climate summit since the 2015 event that yielded the Paris Agreement, when nearly 200 countries committed to halt rising global temperatures quickly enough to avoid catastrophic change.The November summit, which was delayed by a year because of the COVID-19 pandemic, serves as a deadline for countries to commit to make deeper emissions cuts to deliver the Paris treatys aim.The U.S. played a very important role in getting the Paris Agreement together. So we certainly are hoping that we will see this kind of leadership coming back, Patricia Espinosa, executive secretary of the U.N. Framework Convention on Climate Change, told the Reuters Next conference.With only 10 months until the summit, President-elect Joe Biden must reboot that leadership very fast, Espinosa said.While President Donald Trump doubts mainstream climate science and pulled the United States out of the Paris Agreement, Biden has pledged to re-join the accord on his first day in office and spend $2 trillion on clean energy.The U.N. will also be watching for a U.S. pledge to cut emissions faster this decade - a move major economies including China and Japan have yet to make.Espinosa also called on wealthy countries to fulfil their promise, made in 2009, to deliver $100 billion each year by 2020 to help developing countries tackle climate change. They missed the goal by $21 billion in 2018, according to the latest tally.Were not there, said Espinosa. After the year where we had this COVID pandemic that prompted the richer economies to mobilise, in a matter of months, $12 trillion for COVID recovery. It just doesnt make sense.Breaking that promise would give developing countries an excuse not to make climate pledges of their own, she said. That could spell trouble in a year when major emitters, including India, will face pressure to step up action.I see this as one of the most important elements in order to rebuild trust, she said.For more coverage from the Reuters Next conference please click here or www.reuters.com/business/reuters-nextTo watch Reuters Next live, visit here"}