{"text": "GENEVA The United Nations human rights investigator for Myanmar urged the U.N. Security Council on Friday to consider imposing sanctions and arms embargoes as a U.N. rights body adopted a resolution calling for Aung San Suu Kyis release.The United States, which imposed its own sanctions targeting Myanmars military junta on Thursday, took the floor at the Human Rights Council to urge other U.N. member states to follow suit.Special Rapporteur Thomas Andrews cited growing reports and photographic evidence that Myanmar security forces had used live ammunition against protesters since seizing power almost two weeks ago.Security Council resolutions dealing with similar situations have mandated sanctions, arms embargoes, and travel bans, and calling for judicial action at the International Criminal Court or ad hoc tribunals, Andrews told the Council. All of these options should be on the table.The 47-member forum met at the request of Britain and the European Union to consider a resolution calling for the release of ousted Myanmar leader Suu Kyi, and for U.N. monitors to be allowed to visit. It was adopted unanimously, although Myanmar, Russia and China envoys said they disassociated themselves from the resolution.With this resolution we would like to send a strong signal to the people of Myanmar: the protection of their human rights matters to us, said Austrian Ambassador Elisabeth Tichy-Fisslberger on behalf of the EU.However, the resolutions language had been watered down somewhat in an apparent bid to get detractors on board.In a letter read out to the Council earlier on Friday, some 300 elected parliamentarians called for U.N. investigations into the gross human rights violations that they said the military had committed since its coup, including arrests.The military also shot people protesting, invaded the ruling partys offices, confiscated documents, records, and property, said the letter, read out by British Ambassador Julian Braithwaite.It said a telecommunications bill being prepared by the junta was intended to restrict access to the Internet and mobile services.U.S. Charg dAffaires Mark Cassayre said: We ask all Council members to join the United States and others...in promoting accountability for those responsible for the coup, including through targeted sanctions.China and Russia - which have close ties to Myanmars military - said they opposed holding the session at all.What happened in Myanmar is essentially Myanmars internal affairs, said Chen Xu, Chinas ambassador.Russian Ambassador Gennady Gatilov said: Attempts to whip up hype around the situation in Myanmar need to cease.Supporters of Suu Kyi clashed with police on Friday as hundreds of thousands joined nationwide pro-democracy demonstrations in defiance of the juntas call to halt mass gatherings.More than 350 officials, activists, journalists, monks and students have been detained, according to Nada al-Nashif, deputy U.N. High Commissioner for Human Rights.Myanmar Ambassador Myint Thu said Myanmar would continue to cooperate with the United Nations and uphold international human rights treaties, adding: We do not want to stall the nascent democratic transition in the country."}