{"text": "Top postal officials are scheduled to testify before a U.S. congressional panel on Feb. 24, as lawmakers consider how to repair U.S. Postal Service finances.The hearing \"will examine legislative proposals to place the Postal Service on a more sustainable financial footing,\" said Representative Carolyn Maloney, the Deocrat who chairs the committee, and top Republican Representative James Comer. U.S. Postmaster General Louis DeJoy, a supporter of former President Donald Trump who was named postmaster last year by the USPS board, has agreed to testify before the House Oversight and Reform Committee, his spokesman said.Ron Bloom, a former Obama administration official elected on Tuesday as new chairman of the U.S. Postal Board of Governors, confirmed Friday that he will also testify.DeJoy came under heavy criticism for making service changes that delayed deliveries, so he suspended them ahead of the 2020 presidential election. Still, complaints of slow deliveries have continued. \"We must acknowledge that during this peak season, we fell far short of meeting our service targets. Too many Americans were left waiting weeks for important deliveries of mail and packages,\" DeJoy said Tuesday, apologizing to customers.   American Postal Workers Union President Mark Dimondstein, also set to testify, said USPS will \"soon introduce a 10-year plan that has had to this date little or no input from postal workers or customers.\"USPS reported $318 million of income for the quarter ending Dec. 31, delivering a record 1.1 billion holiday season packages, while first-class mail revenue decreased by $177 million.USPS has reported net losses totaling $86.7 billion from 2007 through 2020. One reason for the red ink is that Congress in 2006 passed legislation requiring USPS to pre-fund more than $120 billion in retiree health care and pension liabilities. Labor unions have called this requirement an unfair burden that other businesses do not share.DeJoy warned Tuesday USPS faces massive projected losses as it faces declining mail volumes. He warned that unless \"service, reliability, and costs do not improve\" USPS's ability to deliver to all 161 million U.S. households \"will be threatened, and our relevancy diminished.\""}