{"text": "The U.S. Centers for Disease Control and Prevention said on Wednesday it had found more cases of potentially life-threatening blood clotting among people who received the Johnson & Johnson (JNJ.N) COVID-19 vaccine and sees a \"plausible causal association.\"The CDC said in a presentation the agency has now identified 28 cases of thrombosis with thrombocytopenia syndrome (TTS) among the more than 8.7 million people who had received the J&J vaccine. TTS involves blood clots accompanied by a low level of platelets - the cells in the blood that help it to clot.So far, three of the 28 have died. Previously, as of April 25, the CDC had reported 17 cases of clotting among nearly 8 million people given vaccines.The benefits of the vaccine still outweigh the risk and no updates to vaccine policy are needed at this time, CDC official Dr. Sara Oliver said.She was speaking at a meeting of the Advisory Committee on Immunization Practices or ACIP, which advises the U.S. CDC.ACIP recommended on April 23 that the U.S. lift a 10-day pause on the J&J vaccinations imposed to review safety data on the clotting issue.  read more The CDC said on Wednesday the events appear similar to what is being observed following administration of the AstraZeneca (AZN.L) COVID-19 vaccine in Europe.Both vaccines are based on a new technology using adenoviruses, which cause the common cold, that have been modified to essentially render them harmless. The viruses are used to carry instructions into the body to make specific coronavirus proteins, priming the immune system to make antibodies that fight off the actual virus.Scientists are working to find the potential mechanism that would explain the blood clots. A leading hypothesis appears to be that the vaccines are triggering a rare immune response that could be related to these viral vectors.The syndrome does not appear to be associated with either of the COVID-19 vaccines produce by Pfizer Inc (PFE.N) and BioNTech SA  or Moderna Inc (MRNA.O).Most of the cases were among women aged 18 to 49, the CDC said, with rates among women aged 30-39 at 12.4 cases per million and those aged 40-49 at 9.4 cases per million.Only six of the clotting events identified were in men.Symptoms typically occur several days after vaccination to up to 2 weeks.ACIP member Dr. Sarah Long, professor of pediatrics at Drexel University College of Medicine said she was very concerned about the CDC's decision to not add any additional restrictions on the J&J vaccine. Dr. Long said she believed that younger women should be informed of the risks and give consent before receiving their shot."}