{"text": "European and U.S. buyers are warming up to the idea of purchasing a battery-powered vehicle, but continue to have concerns over the price of the technology, a survey showed, underscoring the need for government subsidies to reach EV sales and environmental goals.The share of consumers eyeing the purchase of a fully electric vehicle has grown significantly, according to an annual survey by OC&C Strategy Consultants, released on Monday exclusively to Reuters. http://bit.ly/BatteryLateThanNeverIt surveyed more than 7,500 global consumers between December and January. OC&C did not receive external funding for the study, its lead author Felicity Latcham said.The shift in attitudes comes at a crucial time for the auto industry, which is releasing a growing number of electric models in a race to comply with stricter CO2 emission targets and catch up with Tesla Inc (TSLA.O), which has captured the EV market.In the UK, France and Italy, more than half of consumers said they would consider a battery-powered vehicle as their next purchase, while in Germany and the U.S. nearly half of respondents said so, the survey showed. That represents a marked increase from last year, particularly in the UK and the U.S., where willingness to buy electric increased 81 and 61 percent, respectively.But consumers remain wary about the price of battery-powered cars, which are generally more expensive than their combustion engine counterparts.While concerns over EV range and charging infrastructure have decreased compared to last year, the overall cost of EVs represents the largest barrier to consumers considering a battery-powered car, according to the survey.Of the consumers likely to buy an EV, 69% said they would not pay more than a $500 premium compared to a gasoline-powered car - an unlikely scenario without government subsidies.Countries with purchase incentives have seen a faster uptick in EV sales and European countries have introduced several generous incentives.Boosting EV ownership is also at the heart of the U.S. administration's infrastructure plan, which would provide $100 billion in additional EV rebates and $15 billion to build 500,000 new charging stations.  read more "}