{"text": "The U.S. Centers for Disease Control and Prevention on Friday issued new guidance for U.S. schools to reopen, recommending universal mask-wearing and physical distancing as key COVID-19 mitigation strategies to get children back in the classroom quickly.The guidelines here, which also emphasize the need for facility-cleaning, personal hygiene and contact tracing, are intended to give school districts a road map to bring the nation's 55 million public school students back to classrooms without sparking COVID-19 outbreaks.We believe with the strategies we have put forward that there will be limited to no transmission in schools if followed, CDC Director Rochelle Walensky told reporters, noting that the CDC was not mandating that schools reopen.The agency also said school reopenings should not be conditional on teachers access to COVID-19 vaccines, but strongly recommended U.S. states prioritize teachers and school staff for vaccination.President Joe Biden promised to reopen most K-8 schools within 100 days of taking office on Jan. 20. He praised the CDCs guidance on Friday and emphasized the problems arising from the continued closure of schools, including childrens mental health struggles and the exodus of parents from the workforce.We have sacrificed so much in the last year. But science tells us that if we support our children, educators, and communities with the resources they need, we can get kids back to school safely in more parts of the country sooner, Biden said in a statement.Just 44% of U.S. school districts were offering fully in-person learning as of December and 31% were operating all remotely, according to the Center for Reinventing Public Education, which surveyed 477 of the nations nearly 13,000 school districts. Other districts have employed a hybrid learning model, where students attend some school days in-person and some virtually.School reopenings have caused labor disputes between teachers unions, who fear for their members safety, and school districts in major U.S. cities. In Chicago this week, the teachers union and district reached agreement on a safety plan after months of negotiations that included threats of a strike.On Friday, the American Federation of Teachers, which has about 1.7 million members, commended the CDCs guidance for relying on facts and evidence.We urge the CDC to remain flexible as more data comes to light. The guidance is instructive for this moment in time, but this disease is not static, AFT President Randi Weingarten said in a statement.FLEXIBLE APPROACHThe CDCs phased mitigation strategy is adaptable depending on the level of COVID-19 transmission in a schools community.In areas where the COVID-19 positive test rate is below 5% and there were fewer than nine new cases per 100,000 in the last seven days, schools can fully reopen and safely relax social distancing measures as long as masks are worn, Walensky said. In areas of higher transmission, the agency is urging 6 feet (1.83 m) of separation in classrooms and weekly testing of students, teachers and staff.Elementary school students should learn in-person at least part-time even in areas of high transmission, the guidance says.Recent studies have shown that in-person learning has not been associated with increased community transmission, especially in elementary schools.House Republican Leader Kevin McCarthy criticized the reopening guidelines on Friday as not bold enough to ensure that students return to classrooms promptly.Families and students deserve better. They need iron-clad assurances that their children will be able to get back into the classroom environment that offers the best education model, McCarthy said in a statement.U.S. House Speaker Nancy Pelosi, a Democrat, said on Friday that House committees were working to pass Bidens $1.9 trillion American Rescue Plan legislation, which includes a $130 billion investment that could help schools follow the CDC protocols, to help schools enforce the CDCs guidelines.Without strong assistance from Congress, our schools cannot afford to enact the science-based safety precautions required, Pelosi said in a statement."}