{"text": "NEW YORK U.S. consumer prices increased more than expected in April as booming demand amid a reopening economy pushed against supply constraints, which could fuel financial market fears of a lengthy period of higher inflation.The consumer price index jumped 0.8% last month after rising 0.6% in March, the Labor Department said on Wednesday. Excluding the volatile food and energy components, the CPI soared 0.9%. The so-called core CPI rose 0.3% in March.Economists polled by Reuters had forecast the overall CPI climbing 0.2% and the core CPI rising 0.3%.MARKET REACTION:STOCKS: S&P 500 down 1.73%BONDS: Yields on benchmark 10-year notes rose to 1.6880%. Two-year Treasury yields rose to 0.1668%FOREX: The dollar index was up 0.61%COMMENTS:JAI MALHI, GLOBAL MARKET STRATEGIST, J.P. MORGAN ASSET MANAGEMENT, LONDONCentral banks have faced an uphill battle in their quest to generate inflation. Todays dramatic rise in inflation is less a sign of central banks having achieved their target, but more a reflection of how far prices fell last year, with a strong rebound always likely.The recovery in energy prices is doing some of the heavy lifting but the stimulus checks handed out over the last two months are stoking demand as well. Investors will be most watchful of how persistent this level of inflation is likely to be. Difficulty hiring as a result of the top up to unemployment benefits appears to be the driving force behind rising wages for now. If that continues then large inflation numbers may be harder for the Fed to dismiss as transitory.For now, the Fed is likely to believe this is just a temporary spike given the more generous unemployment benefits are set to end in early September. If true, then markets need not be overly worried about inflation. However, if the Fed has misjudged its position then fears of a quicker pace of tightening are likely to drive volatility in bond markets higher.SAM STOVALL, CHIEF INVESTMENT STRATEGIST, CFRA RESEARCH, NEW YORKMy first thought was that we underestimated CPI almost as much as we overestimated employment last week. Wed such large year-over-year changes that we should not be surprised of such variation in forecasts.Im encouraged, however, that the Dow futures, that were down prior to the reading, has come back up. I think the market is saying were not really worried about it, we do think its transitory, and were looking to buy on the dips.If we hear the Fed saying that theyre not going to make any changes to their zero-rate policy, that they dig in their heels in terms of short-term rates, that would allow a steepening of the yield curve. And the four sectors that have historically done the best in that environment and have also done well now are energy, financials, industrials and materials. I can see the market continuing to rotate to that side of the ledger.FRANCES DONALD, GLOBAL CHIEF ECONOMIST, MANULIFE INVESTMENT MANAGEMENT, TORONTOThis inflationary pressure in April is not driven by broad based inflationary pressure. Its being heavily distorted by ongoing COVID-19 impacts, particularly in the used car space.The surge were seeing in used car prices is not one were going to see the Federal Reserve react to and its not one that has broad based market implications. It does however increase headline and core inflation.A line by line analysis of this inflation number suggests that inflation pressures are not broad based. Theyre still isolated in COVID-19 related disruption.I am not concerned about April and May CPI numbers that run above 4%. This was predictable and policy makers have been clear they will not be responding to it.The Fed can tighten monetary policy as much as it wants. Its not going to lower the cost of lumber. Its not going to lower the cost of used cars and its generally not going to be supportive of unwinding supply chain disruption.PATRICK LEARY, CHIEF MARKET STRATEGIST/SENIOR TRADER, INCAPITAL, MINNEAPOLISIf you look at the benchmark 10-year Treasury yield its off only a basis point or two. So, the bond market should be more concerned about it and its not. Thats because its still fits into the transitory narrative that the Fed is laying out.Some of these things are blips that are pulling the average up and can be explained away in that sense. That being said, the equity market seems to be taking this very seriously. It almost appears as though the equity markets are definitely thinking a little bit more this is a lot of inflation near term, and the bond market is saying, yeah, theres a lot of inflation near term. But long term it continues to be transitory.The five  to 10-year curve is actually flatter. The five-year note is actually up just as much as the 10-year note. Thats likely due to the fact that were pushing five-year real rates higher because of near-term inflation being higher. But more long term, with the 10-year note, the thinking is these price increases are still transitory.SEEMA SHAH, CHIEF STRATEGIST, PRINCIPAL GLOBAL INVESTORS, LONDONAnother big miss in US data, but this time to the upside. US CPI inflation has come in meaningfully higher than expected and will further stoke concerns that the Fed has misread the inflation story. Interestingly, equity markets have responded sharply, while bond markets are essentially unmoved.I would sit with the bond markets on this one. What have we really learned today that we didnt already know? Markets were already expecting a rise in inflation  the big question is how sticky that inflation is. That has not been answered today, nor will it be answered for several months. Nonetheless, risk markets will continue to be whipsawed by inflationary concerns over the coming months and investors would be wise to introduce some inflation protection into their portfolios.GREGORY DACO, CHIEF US ECONOMIST, OXFORD ECONOMICS, NEW YORKHotter than expected but not overheating. Were surprised I guess with some of the strength in the monthly change in prices. We were expecting somewhat less of an increase in core prices. If you look at the underlying details I would say part of that miss is attributable to used-car prices rising 10%, which is the strongest ever and one-third of the headline gains.We are seeing warmer inflation and thats just unavoidable in the current environment where demand rebounded very rapidly.The Fed is not going to change any policy on any one report so I wouldnt expect this to be a gamechanger. It will affect market pricing though so youre going see movements in markets reacting to this higher inflation environment.JOHN LEIPER, CHIEF INVESTMENT OFFICER, TAVISTOCK WEALTH, LONDON (email)The Feds whole approach to employment seems off. There are now 9.8 million unemployed people in the US but there are also 8.1 million job openings, the highest on record. Powell seems to think that the solution to this supply-demand imbalance is more quantitative easing and lower for longer interest rates. But these tools have contributed to growing inequality, not less, and will not cause people to take those jobs if they dont want them. Indeed, there is growing evidence that employers are struggling to lure prospective employees back to the jobs market due to wage competition from government transfer payments, as evidenced by last weeks average hourly earnings data which jumped 0.7% month-on-month. Alternative explanations for the supply-demand imbalance include skills mismatch and the additional burden placed on parents while schools remain close. These issues cannot be resolved by more-of-the-same monetary policy.SIMON HARVEY, SENIOR FX MARKET ANALYST, MONEX EUROPE, LONDONThere has been a lot of speculation over the last few weeks as to when concerns over inflation in the US, and globally, will spill into real rates and begin to pressure the Federal Reserves current stance that the uptick in inflation will be transitory. With headline CPI and core CPI printing huge numbers today, were finally seeing the reaction in real yields that many have been speculating on. While one data point wont be enough to force the Feds hand, todays CPI data just adds fuel to the speculation frenzy about the speed of the US economic recovery and when the Fed will have to start touching the monetary brakes. The rise in real rates has prompted a bounceback in the US dollar, with the US Treasury curve steepening coming back into the frame.PETER TUZ, PRESIDENT, CHASE INVESTMENT COUNSEL, CHARLOTTESVILLE, VIRGINIAObviously, the data was worse than the world was expecting, and the market is reacting as one might expect it to react.The argument is whether this bout of inflation is transitory or here to stay. And time will tell. I think its here to stay until you see labor costs and commodity costs mitigate some.Every employer in Charlottesville has a help wanted sign out. Thats a sign of a labor shortage. I dont see whats transitory there yet.I expected (the stock market) to be a little down. It accelerated after the numbers came out. This obviously brings the thought that maybe the Fed will have change its easy policy sooner than expected.STUART COLE, HEAD MACRO ECONOMIST, EQUITI CAPITAL, LONDONThe situation is not much better on a core basis, where y/y CPI rose to 3.0%. But with the FOMC remaining fixated on the employment market as the key metric for determining its monetary policy stance, and continuing to view inflationary pressures as transitory, the normal correlation of higher inflation and higher interest rates remains broken. It will therefore be left again to the bond market to provide any financial tightening that the market deems required.Going forward, the big question is just how long can the Fed maintain its dovish stance in opposition to the markets, particularly if companies begin raising wages to encourage unemployed labor back into the workforce, in turn driving a large hole in the Feds transitory inflation argument. Bizarrely, it may actually require a stronger labor market that allows worries over rising wages costs to subside before the market becomes more comfortable with the Feds stance."}