{"text": "WASHINGTON U.S. Chamber of Commerce CEO Thomas Donohue on Tuesday condemned President Donald Trump for encouraging a mob of supporters that attacked the Capitol last week, saying his actions were absolutely unacceptable and completely inexcusable.Donohue told a news conference that Trump undermined our democratic institutions and ideals and it was up to Vice President Mike Pence, the Cabinet and Congress to decide whether to try to oust Trump early through the Constitutions 25th Amendment or impeachment proceedings.We trust them to use those tools judiciously, if needed, to ensure our nations well-being and security, Donohue said, calling on elected officials across the country to encourage a peaceful transition of power and promote calm.A White House spokesman did not immediately respond to a request for comment on the Chambers statement.The statement was unusually strong for the biggest and most influential U.S. business lobby group, which has traditionally supported Republicans and backed a number of Trumps policy initiatives over the past four years, including tax cuts passed in 2017, reduced regulations, energy initiatives and unprecedented coronavirus relief to businesses.Trump, facing impeachment on a charge of incitement of insurrection, on Tuesday denied responsibility for his supporters assault on the Capitol said his remarks before the siege were appropriate.The Chamber also threatened to withdraw support from some members of Congress who objected last week to certifying President-elect Joe Bidens victory -- a step the violent mob was trying to prevent at the Capitol.There are some members who, by their actions will have forfeited the support of the US Chamber of Commerce. Period. Full stop, said Neil Bradley, the business lobby groups chief policy officer.Republican senators Josh Hawley of Missouri and Ted Cruz of Texas were among the most vocal opponents to certifying the results. When asked if those two lawmakers would lose Chamber support, Bradley declined to name specific people.He said that the group will take into account lawmakers actions last week and watch the totality of their efforts on supporting government in coming days.Asked whether he considered last weeks assault on the Capitol by a pro-Trump mob seeking to stop the election of Biden as an attempted coup, Donohue said: I would say there were some efforts to achieve other objectives, Im not sure it was a full coup attempt. But we didnt like the mobs actions, he added.SUPPORT, BUT NO TAX HIKESThe Chamber also on Tuesday called on the Biden administration and Congress to provide needed support to businesses and industries hit hard by the COVID-19 pandemic, including needed funding for wide distribution of vaccines.Donohue called for a major new investment in U.S. infrastructure, which he said could still be achieved with an evenly split Congress.If Congress sufficiently supports the economy with the relief it needs, we could see growth rebound by the third quarter of this year, Donohue said.But he cautioned against returning to higher anti-competitive tax rates and excessive regulation. But in a nod to Bidens progressive agenda, he said lawmakers should fund rapid training programs to connect the unemployed with jobs in new sectors of the economy.Donohue also said the Chamber will push for a new bill to boost legal immigration to help businesses deal with a shortage of workers."}