{"text": "The state-backed bank is finalising a voluntary redundancy round targeting cutting 550 full-time equivalent roles across its branches and premier banking premium service, union Unite told Reuters. A NatWest spokesman confirmed the redundancy process.We have taken the decision to invite applications for voluntary redundancy and will support those colleagues who apply with a comprehensive support package. There will be no compulsory redundancy as a result of this announcement, the spokesman said.Around 800 staff are expected to leave once part-time workers are included, Unite national officer Rob MacGregor said, adding he understood the round was oversubscribed.NatWest is also separately closing its Regents House office in London, which was home to one of the banks biggest tech hubs and had space for 2,500 workers.We have been reviewing our London property strategy to better reflect how we will work in the future, a NatWest spokeswoman said. As a result, we will exit Regents House, and will reconfigure our London remaining properties at 250 Bishopsgate and 440 Strand.The bank has told the bulk of its staff they can work from home until next year.Banks across the industry are looking to cut costs as their finances are dented by the pandemic, with official data on Wednesday showing the UK economy entered a deep recession in the first half of the year.Unlike some rivals, NatWest pressed on with job cuts through the pandemic, including cutting more than 130 staff from minnow investment bank NatWest Markets despite improved trading in volatile markets.NatWest chief executive Alison Rose reaffirmed the banks target of cutting 250 million pounds from costs this year in July after the bank tumbled to a half-year loss.Unites MacGregor said he understood the pandemic meant more people were banking online but urged lenders not to cut too deeply.Tens of thousands of people working for banks have risen to the challenge that the pandemic created. The banks response should not be a repeat of the austerity measures that we saw after the financial crisis.Reuters reported on Monday that TSB was phasing out more than 900 branch roles including dedicated cashiers, with staff affected asked to retrain for more complex jobs or take voluntary redundancy."}