{"text": "Britain's coronavirus-ravaged economy suffered its biggest crash in output in more than 300 years in 2020 when it slumped by 9.9%, but it avoided heading back towards recession at the end of the year and looks on course for a recovery in 2021.Official figures showed gross domestic product (GDP) grew 1.0% from October through December, the top of a range of economists' forecasts in a Reuters poll.This makes it likely that Britain will escape two straight quarters of contraction - the standard definition of recession in Europe - even though the economy is set to shrink in early 2021 due to the effects of a third COVID lockdown.\"As and when restrictions are eased, we continue to expect a vigorous rebound in the economy,\" said Dean Turner, an economist at UBS Global Wealth Management.Britain's economy grew 1.2% in December alone, after a 2.3% fall in output in November when there was a partial lockdown, pointing to greater resilience to COVID restrictions than at the start of the pandemic.Thatleft output 6.3% lower than in February before the start of the pandemic, the Office for National Statistics said.However, the Bank of England forecasts the economy will shrink by 4% in the first three months of 2021 because of the new lockdown and Brexit disruption.It thinks it will take until early 2022 before GDP regains its pre-COVID size, assuming vaccination continues at the current rapid pace, which outstrips the rest of Europe's. Many economists think recovery will take longer. \"Today's figures show that the economy has experienced a serious shock as a result of the pandemic, which has been felt by countries around the world,\" finance minister Rishi Sunak said.Sunak, facing the heaviest borrowing since World War Two, said he would continue to focus on protecting jobs when he sets out a new annual budget on March 3.Unemployment has risen much less than feared at the start of the crisis, largely due to subsidies to keep people in work, though sectors such as hospitality and high-street retail remain hard hit.HARDER HIT THAN MOST Last year's fall in output was the biggest since modern official records began after World War Two. Longer-running historical data hosted by the Bank of England suggest it was the biggest drop since 1709, when Britain suffered a \"Great Frost\".Britain has reported Europe's highest death toll from COVID-19 and is among the world's highest in terms of deaths per head. The GDP fall is steeper than almost any other big economy's, though Spain - also hard-hit by the virus - suffered an 11% decline. Some of the damage reflects how Britain's economy relies more on face-to-face consumer services than other countries, as well as disruption to schooling and routine healthcare, which few other countries factored in to GDP.Sunak, in an interview with Sky News, said Britain's economic performance could be seen as being marginally above that of some of its peers last year.GDP is almost always compared on a \"real\" or inflation-adjusted basis, which shows Britain was the worst performer in the Group of Seven large advanced economies. But Sunak said Britain did better on a \"nominal\" basis, which ignores inflation.Taking this approach, Britain's economy is closer to its pre-crisis size than Germany, France or Italy's, according to figures provided by the ONS, which said it \"may be useful\" to look at nominal as well as real measures of GDP.But most international differences on inflation adjustment centre on government spending, and looking at household spending alone, Britain remains a laggard. Household spending in the fourth quarter was 8.4% below pre-crisis levels, compared with a 2.6% shortfall in the United States and 6.8% in France.\"The UK's underperformance can't simply be attributed to the different way the ONS measures government expenditure to most other countries,\" said Samuel Tombs of Pantheon Macroeconomics."}