{"text": "Britain's government has opened an independent investigation into failed finance company Greensill Capital after lobbying by former Prime Minister David Cameron raised questions over its access to ministers.Australian banker Lex Greensill was brought in as an adviser to the government while Cameron was British prime minister from 2010 to 2016. After leaving office, Cameron in turn became an adviser to Greensill's now-insolvent company.The Financial Times and Sunday Times newspapers have reported that Cameron contacted ministers directly to lobby on behalf of Greensill Capital, including sending text messages to finance minister Rishi Sunak and arranging a private drink between Greensill and Health Secretary Matt Hancock.Cameron, in his first comments on his actions on Sunday, said he had not broken any rules, but that he accepted his communication with government should be completely formal.Britain's Treasury has said Cameron contacted Sunak and two other ministers in the department to ask if Greensill could have access to the government's COVID-19 loan schemes at the start of the pandemic.Prime Minister Boris Johnson's spokesman said Johnson understood the \"significant interest\" in the matter and wanted to start the review to \"ensure government is completely transparent about such activities\".The review will be led by Nigel Boardman, a partner at law firm Slaughter and May, and will report to Johnson by the end of May. Boardman will step aside from his role as a non-executive director at Britain's business ministry during his investigation.\"The Prime Minister has asked Mr Boardman to conduct a review that will look into the decisions taken around the development and use of supply chain finance (and associated schemes) in government, especially the role of Lex Greensill and Greensill Capital,\" the government said.Johnson's spokesman added that the review \"will also look at how contracts were secured and business representatives engaged with government\".Cameron said that in his representations to government he did not break any codes of conduct or government rules.Ultimately the outcome of the discussions on Greensill's proposals on a loan were not taken up, he said, and therefore his interventions did not lead to a change in the government's approach.\"However, I have reflected on this at length,\" he said in a statement to the Press Association news agency.\"There are important lessons to be learnt. As a former prime minister, I accept that communications with government need to be done through only the most formal of channels, so there can be no room for misinterpretation.\""}