{"text": "The British public's expectations for inflation over the next 12 months held at their lowest level in more than four years, in sharp contrast to a recent rise in market expectations, Bank of England data showed on Friday.Average expectations for inflation over the next 12 months remained at 2.7% - the joint-lowest reading since August 2016 alongside November's figure, based on a survey conducted between Feb. 9 and Feb. 22.Asked about inflation for the following year, the public saw it at 2.2%, compared with 2.1% in November, while longer-term inflation expectations held steady at 2.9%, just above a five-year low recorded in August 2020.Expectations for a move in BoE interest rates over the coming year were little changed from November. Some 35% expected a rise - a low proportion by the standards of recent years - 16% expected a cut and 35% expected rates to stay the same.BoE policymakers use the survey as a guide to whether there is likely to be pressure for bigger wage rises, something which would put upward pressure on prices across the economy.The focus tends to be on the trend in expectations - rather than the absolute level - as few members of the public have an accurate idea of the official consumer price inflation rate which currently stands at 0.7%.The BoE expects CPI to reach just over 1.5% by the middle of this year - as prices will be compared against depressed levels at the start of the COVID pandemic - and to hover just over its 2% target until early 2024.Unlike the general public, financial markets have sharply revised up their expectations for medium-term inflation since the start of this year.The rate of inflation priced into five-year inflation-linked British government bonds  - which, unlike the BoE, uses the higher retail prices index measure - reached 3.34% on March 5, its highest since October 2019 and up from 2.8% at the start of 2021.Only BoE Chief Economist Andy Haldane has sounded the alarm about an inflation \"tiger\".Britain's inflation rate is expected to hit the BoE's 2% target in the coming months, but much of the rise will reflect last year's pandemic hit and one-off changes to energy prices.BoE Governor Andrew Bailey has sounded unfazed about the risk of an inflation overshoot, saying on Monday that the BoE's task was to get inflation back up to 2% and hold it there."}