{"text": "British Prime Minister Boris Johnson on Saturday expressed \"serious concern\" about rising infections of the Delta variant of coronavirus, reinforcing suggestions that he is set to delay lifting England's last remaining lockdown curbs.Johnson is due to announce on Monday whether the planned lifting of restrictions, which would see an end to limits on social contact, can go ahead on June 21 as set out under a planned 'roadmap'.The government had hoped that the success of one of the world's fastest rollouts of the vaccines would end the limits on indoor gatherings and the requirement of pubs and restaurants to  provide only table service.But the rapid spread of the Delta COVID-19 variant, first discovered in India, has thrown those plans into jeopardy, meaning the government will delay the lifting of the restrictions by a month, the Daily Telegraph reported.A four-week delay would push back the easing of restrictions to July 19.Although Johnson said officials would continue to study the data before making a final decision, he was less optimistic about the situation than he was at the end of May.\"It's clear that the Indian variant is more transmissible and its also true that the cases are going up, and that the levels of hospitalisation are going up,\" Johnson told Sky News.\"Now, we dont know exactly to what extent that is going to feed through into extra mortality, but clearly its a matter of serious, serious concern.\"RISING INFECTIONSAny delay to Johnsons unlocking roadmap risks triggering a row with some politicians in his party, who have opposed keeping  the restrictions in place.Karan Bilimoria, president of the Confederation of British Industry, said companies understood the need to tread cautiously in a health crisis but many firms in sectors such as hospitality were barely breaking even under the current rules.\"If there's a full delay for two to four weeks, then it's got to be irreversible: we cannot have stop-start and as long as that is clarified we will have to cope with this delay,\" he said.Johnson attempted to add some optimism by suggesting the government would not reimpose any restrictions, such as the ban on households mixing indoors or the closure hospitality venues.The government has always said decisions at each stage of unlocking depend on the data.Britain on Saturday reported 7,738 new COVID-19 cases, down slightly from a day earlier, when they were the highest since February.Asked if he was less optimistic about the easing of lockdown than at the end of May, he said: \"Yes, thats certainly fair.\"Any decision Johnson makes only applies to England because the devolved governments in Scotland, Wales and Northern Ireland make most public health decisions in their nations.Johnson has said that an increase in cases was always expected after the most recent stage of lockdown easing in May, but the key to whether all coronavirus restrictions can be scrapped will be the extent to which Britain's vaccine rollout has broken the link between cases and deaths.Britain's total COVID-19 death toll is over 127,000 but the number of daily deaths have fallen following a third national lockdown and a rapid vaccine rollout. More than three-quarters of adults have received at least one dose of COVID-19 vaccine."}