{"text": "LONDON Britain on Thursday said China had broken its main bilateral treaty on Hong Kong by imposing new rules to disqualify elected legislators in the former British colony, cautioning that it would consider sanctions as part of its response.The British flag was lowered over Hong Kong when the colony was handed back to China in 1997 after more than 150 years of British rule - imposed after Britain defeated China in the First Opium War.Hong Kongs autonomy was guaranteed under the one country, two systems agreement enshrined in the 1984 Sino-British Joint Declaration signed by then Chinese Premier Zhao Ziyang and British Prime Minister Margaret Thatcher.Beijings imposition of new rules to disqualify elected legislators in Hong Kong constitutes a clear breach of the legally binding Sino-British Joint Declaration, Foreign Secretary Dominic Raab said.China has once again broken its promises and undermined Hong Kongs high degree of autonomy.Britain summoned Chinas ambassador, Liu Xiaoming, to express its deep concerns and Raabs deputy, Nigel Adams, told parliament that it was considering possible sanctions on individuals over Chinas actions.We will continue to consider designations under our Magnitsky-style sanctions regime, said Adams, Britains minister for Asia, referring to sanctions similar to those imposed on those deemed responsible for human rights abuses under the U.S. Magnitski Act. He was asked by lawmakers if Britain would sanction Hong Kong Chief Executive Carrie Lam.Adams said it would not be helpful to speculate on names at this stage. Chinas embassy did not immediately respond to a request for comment.The European Union called on Beijing to immediately reverse the new rules, which it said undermined Hong Kongs autonomy.On Wednesday, the United States, which has already imposed sanctions on Lam and other Chinese officials over the crackdown, warned of further steps.The U.S. national security adviser, Robert OBrien, said China had flagrantly violated its international commitments and Washington would continue to identify and sanction those responsible for extinguishing Hong Kongs freedom.On Thursday, U.S. Secretary of State Mike Pompeo accused the Chinese Communist Party of using a twisted vision of patriotism ... to stifle freedom and the call for democracy.We will hold accountable the people responsible for these actions and policies, he said in a statement.Canada said on Thursday it would make it easier for Hong Kong youth to study and work in Canada in response to new security rules.MAKING A STANDHong Kongs pro-democracy opposition lawmakers said on Wednesday they would resign in protest against the dismissal of four of their colleagues from the city assembly after Beijing gave local authorities new powers to further curb dissent.The Chinese parliament earlier adopted a resolution allowing the citys executive to expel lawmakers deemed to be advocating Hong Kong independence, colluding with foreign forces or threatening national security, without having to go through the courts.Opposition members of the Hong Kong assembly say they have tried to make a stand against what many people in Hong Kong see as Beijings whittling away of freedoms and institutional checks and balances, despite a promise of a high degree of autonomy.China denies curbing rights and freedoms in the global financial hub, but authorities in Hong Kong and Beijing have moved swiftly to stifle dissent after anti-government protests flared in June last year and plunged the city into crisis.Britain now considers China has broken the Joint Declaration three times, including with the national security legislation for Hong Kong introduced this year.The UK will stand up for the people of Hong Kong, and call out violations of their rights and freedoms, Raab said.The national security law punishes what China broadly defines as subversion, secession, terrorism and collusion with foreign forces with up to life in prison.Critics of the law fear it will crush freedoms, including freedom to protest and an independent judiciary. Supporters say it will bring stability after last years sometimes violent anti-government and anti-China unrest."}