{"text": "    * Dalian plans to reduce standard iron ore grade to 61%\n    * Exchange to adjust premiums and discounts for iron ore\nproducts\n    * Moves aim to increase deliverable resources \n\n (Adds details, background and chart)\n    By Min Zhang and Tom Daly\n    May 12 China's Dalian Commodity Exchange (DCE)\nproposed to lower standard iron content requirements in ore\ndelivered against its flagship futures to 61%, seeking to\nbroaden supply sources to include lower grades amid a\nrecord-setting rally of the steelmaking ingredient. \n    Under proposed revisions to the contract's trading rules,\nwhich are open to public feedback until Saturday, the Dalian\nbourse plans to reduce iron content in ore from 62% while also\namending quality requirements for silica and aluminum oxide,\nit said late on Tuesday. \n    The price spread between different types of iron ore has\nbeen changeable and fluctuated in recently years due to the\npandemic, changes in supply and demand as well as monetary\npolicies, the exchange said in a separate statement on its\nwebsite. \n    The most-traded iron ore futures had surged over\n50% so far this year and repeatedly struck all-time highs on\nthe exchange amid strong demand in top consumer China and\nconcerns over supply as Beijing's relations with key producer\nAustralia continue to deteriorate.\n    Meanwhile, the appetite for high quality ore has also\nincreased fuelled by decent profits at Chinese mills. The\nprice difference between high-grade 65% iron ore and 58% ore\nsurged to a record $90.5 per tonne, while between benchmark\n62% ore and low-grade the spread stood at $57.5. \n  \n    \"Market experts believe that the proposal... is in line\nwith the grade of mainstream products in the current market\nand actual demand of domestic mills,\" the DCE said in a\nseparate statement on its website.     \n    \n    The exchange also plans to regularly change allowances for\nquality difference of substitute products, weakening premiums\nand discounts for deliverable iron ore brands to help stay in\nsync with the spot market amid big price fluctuations. \n    It had proposed making \"dynamic\" adjustments to premiums\nand discounts in December.\n    \"The adjustment (on premium and discounts) can help\nfacilitate delivery of domestic iron ore...to serve the\ndevelopment of domestic products while helping to curb rapid\nrises,\" according to the statement.    \n    The bourse currently allows 17 iron ore brands - including\nthose from Australia, Brazil and China - to be delivered.\nAround 620 million tonnes of material consumed in China each\nyear meets delivery conditions, it said.\n    The table below shows suggested changes to brand premiums\nand discounts of iron ore in yuan per tonne:    \n Brand Name                            Premiums and discounts \n 1      Ansteel Mining Concentrates    0\n 2      HBIS Mining Concentrates       0\n 3       Benxi Steel Mining            0\n        Concentrates                   \n 4      Karara Standard Magnetite      0\n        Concentrate                    \n 5      AGGLOMERATE IRON ORE           0\n        CONCENTRATE                    \n 6      Carajas Iron Ore               15\n 7      Brazilian Blend Fines          15\n 8      PILBARA BLEND FINES            15\n 9      NEWMAN HIGH GRADE FINE ORE     0\n 10     MAC FINE ORE                   0\n 11     JIMBLEBAR BLEND FINE ORE       0\n 12     ROY-F                          0\n 13     IRON ORE FINES-IOC6            0\n 14     KUMBA STANDARD FINE ORE        0\n 15     FORTESCUE BLEND FINES          0\n 16     SUPER SPECIAL FINE             0\n 17     YANDI FINE ORE                 0\n    \n\n($1 = 6.4260 Chinese yuan)\n\n   \n\n (Reporting by Min Zhang and Tom Daly; Editing by Lisa\nShumaker and Jacqueline Wong)\n  "}