{"text": "(New throughout, adds share price, analyst comment, details from call)TORONTO, Nov 12 Manulife Financial doubled its market share in the third quarter in an exceedingly resilient Hong Kong from a year earlier, despite challenging conditions, executives said on Thursday after the companys earnings beat analyst estimates.Canadas biggest life insurer is focusing on acquisition opportunities in Asia and its wealth and asset management business, which helped drive its better-than-expected performance during the quarter, Chief Executive Roy Gori told Reuters on Wednesday following its results release.Manulife has about C$32 billion ($24 billion) of excess capital it can deploy, he said.We clearly see Asia as a jewel in the Manulife crown, Gori said in an interview. The company has strong capability in Asia and in wealth and asset management, and sees potential for growth by adding to these areas, he added.In Asia, Manulife would consider acquisitions that would complement its operations in countries where it has a larger presence, as well as those that would help it build scale in smaller markets, he said.Manulife already doubled its market share in Hong Kong in the first half of 2020 from a year earlier, and the business posted third-quarter core earnings growth of 15%, executives said on the call.Manulife shares fell 2% to C$21.00 in morning trading in Toronto, compared with a 0.1% decline in the Toronto Stock Exchange 300 Composite index. They had climbed nearly 19% this month as of Wednesdays close, versus the benchmarks 7.3% gain.The shares are modestly underperforming today following a sharp rise in the shares recently, Edward Jones analyst James Shanahan said.Despite the earnings beat, Manulifes core earnings fell 6% from a year ago. And while core earnings per share have dropped 10% this year, executives maintained Manulifes medium-term growth rate target of 10% to 12% for 2021 and beyond. ($1 = 1.3134 Canadian dollars) (Reporting By Nichola Saminather; Editing by David Gregorio)"}