{"text": "(Adds PKN Orlen CEO comment)WARSAW, April 12 A Polish court ruled on Monday that antitrust approval for state-owned refiner PKN Orlens takeover of newspaper publisher Polska Press should be suspended, said the office of the Polish human rights ombudsman, which brought the appeal.The planned takeover has been criticised by opposition political parties, which have said it was part of a wider effort by the ruling Law and Justice (PiS) party to take more control over the media. PKN Orlen has said the deal is purely a business transaction.Ombudsman Adam Bodnar, a vocal critic of PiS, had appealed to the Court of Competition and Consumer Protection in February over the approval of the deal by antitrust regulator UOKiK.The Ombudsman for Human Rights filed a motion - directly to the court - to suspend the execution of the decision ... It was this application that was accepted by the court, Bodnars office said in a statement.PKN Orlen chief executive Daniel Obajtek said the company had not received any information from the court about the decision.I am amazed that it was Adam Bodnar who announced the alleged court order ... We would be surprised if the court decided to make such a decision without having all the documents, he wrote on Twitter.When approving the deal, UOKiK had said that it would not affect competition in the press publishing market in Poland.It said that while it had received expressions of concern about the potential impact on freedom of speech, it could only base its decisions on competition.PKN announced its plans to buy Polska Press, owned by Germanys Verlagsgruppe Passau, in December. The media group publishes 20 regional dailies, about 100 local weeklies, several magazines and Naszemiasto.pl, a free city newspaper, according to its website.PiS has long argued that foreign media companies have too much influence in Poland, distorting public debate.A PiS spokeswoman did not immediately respond to requests for comment. Polska Press declined to comment. (Reporting by Alan Charlish, Joanna Plucinska, Anna Wlodarczak-Semczuk; Editing by Nick Zieminski and Grant McCool)"}