{"text": "(Adds deputy speakers comments on pandemic, details on tax reform)BRASILIA, March 12 Brazils far-right president, Jair Bolsonaro, will likely try to raise spending to shore up his popularity now that leftist Luiz Inacio Lula da Silva is back in the political fray, but Congress will rein him in, its deputy speaker said on Friday.Congressman Marcelo Ramos is a government ally, but one who believes Congress has become responsible and will not allow any fiscal adventure in the run-up to next years election, he told Reuters.The chamber has been very aware of Brazils fiscal problem and it has checks and balances that are effective in containing a spending spree by government, Ramos said in an interview.Former president Lula had corruption charges annulled this week and right away attacked Bolsonaro for mishandling the pandemic and the economy in the opening shot of the 2022 election race.Ramos faulted Bolsonaros health ministry for not securing timely supplies of vaccines for Brazil and said the priority now is to make sure shots are made available so that the economy can recover from its worst recession since 1990.We need to vaccinate people. Its the only way to get the economy started again, improve the business climate and put food back on the table for many people, he said.With the emergency pandemic aid to poorer families now passed by Congress, the next priority will be reform of public bureaucracy, he said, but an overdue tax reform will take longer because it is complex and involves the states.Ramos was critical of Bolsonaros handling of the pandemic. He is from Manaus in Amazonas state, which ran out of oxygen for COVID-19 patients in a surge of a new variant of the virus.But he said a congressional inquiry into negligence alleged by Bolsonaros opponents is not on the cards.An inquiry is not the medicine we need now. Maybe after everyone has been vaccinated, Ramos said. (Reporting by Anthony Boadle and Maria Carolina Marcello in Brasilia Editing by Matthew Lewis)"}