{"text": "* Graphic: World FX rates in 2020 tmsnrt.rs/2egbfVh* Graphic: Trade-weighted sterling since Brexit vote tmsnrt.rs/2hwV9Hv (Updates prices, adds analyst comment)LONDON, Jan 12 Sterling jumped against the euro and the dollar on Tuesday as comments from the Bank of Englands governor on the viability of negative interest rates dampened some expectations of sub-zero rates in Britain.Governor Andrew Bailey said on Tuesday there were lots of issues with cutting interest rates below zero and such a move could hurt banks.Sterling, already benefiting from improved risk appetite, rose above $1.36 on the back of Baileys comments. By afternoon trade in London, it was up 0.8% on the day at $1.3628.Against the euro, the pound rose 0.7% to 89.25 pence, its highest level against the single currency since Dec. 27.Market pricing shows investors expect negative rates from Britains central bank as early as May. Those expectations were pushed slightly further out after Baileys comments.There were some expectations in the market that the BoE could soon move in this direction (of negative rates), said Neil Jones, head of FX sales at Mizuho Bank.These headline comments have a put a dampener on negative rate expectations and participants are buying sterling back.LAST RESORTJane Foley, head of FX strategy at Rabobank told the Reuters Global Markets Forum that the difficulties involved with implementing negative rates are obvious to the market and that it would be a last resort for the central bank.The BoE has been quite successful in making the money market fear negative rates without having to implement them, she said.In a daily note to clients, strategists at ING Bank said they remained reluctant to forecast negative rates by the BoE.With Brexit largely in the pounds rear-view mirror, investors are focusing more intently on Britains economy, which looks likely to tip back into recession. It shrank in the final quarter of 2020 and is expected to contract again in the first quarter of 2021 - following a record fall of over 20% in output in the first two months of lockdown last year.Finance minister Rishi Sunak warned on Monday that Britains economy would get worse before it got better, with the country now in its third national lockdown and struggling to contain the spread of the coronavirus.British consumer spending fell in December at the fastest rate in six months, with pubs and restaurants especially hard hit by a resurgence of coronavirus cases, a survey by payment card provider Barclaycard showed."}