{"text": "* BSP keeps key rate at 2.0% for sixth meeting* BSP vows to maintain accommodative policy stance* BSP raises inflation forecasts for 2021-2023 (Adds economist comment, hyperlinks to previous stories)MANILA, Aug 12 The Philippine central bank kept its benchmark interest rate steady at a record low on Thursday and said it would continue to provide monetary support for as long as necessary, as COVID-19 restrictions clouded the economic outlook.The Bangko Sentral ng Pilipinas (BSP) kept the rate on the overnight reverse repurchase facility at 2.0% for a sixth straight policy meeting, as expected by all 11 economists polled by Reuters.The rates on the overnight deposit and lending facilities were also held steady at 1.5% and 2.5%, respectively.The Monetary Board ... observed that the reimposition of quarantine measures to arrest the recent wave of COVID-19 infections could pose a risk to the ongoing economic recovery, Governor Benjamin Diokno told a news briefing.The central bank was keen to sustain monetary policy support and stood ready to adjust policy settings as needed, he said, adding that the risks to inflation looked balanced.While the economy grew at its fastest annual pace here in over three decades in the April-June period from a COVID-induced slump a year ago, it contracted on a quarterly basis. And, curbs reimposed here in parts of the country from Aug. 6 are clouding the outlook.While some economists say the central bank has limited scope for further easing, given the high level of inflation, others are not ruling out a rate cut this year.With inflation falling and the economic outlook becoming increasingly dire, we think that further easing is imminent, said economist Alex Holmes of Capital Economics, projecting a cut at the BSPs next meeting in September.Inflation came within the central banks official target for the first time this year in July, but remained at the top end of the 2%-4% band.The BSP raised its average inflation forecast for 2021 to 4.1% from 4.0% previously. It projected average inflation of 3.1% for 2022 and 2023, up from the previous forecast of 3.0% for both years.Diokno said fiscal support and an accelerated vaccination programme will be crucial in safeguarding public health and preventing a deeper economic downturn. Just over 10% of the countrys 110 million people have been fully vaccinated so far.The Philippines reported 12,439 more new COVID-19 infections on Thursday - the highest in four months - with cases staying above the 12,000 mark for a second consecutive day. (Writing by Enrico Dela Cruz; Editing by Ana Nicolaci da Costa and Kim Coghill)"}