{"text": "(For a live blog on European stocks, type LIVE/ in an Eikon news window)* Johnson imposes new coronavirus restrictions* Carnival falls after scrapping all November cruises* All eyes on EU summit later in the week* FTSE 100 dips 0.3%, FTSE 250 adds 0.5% (Updates to close)Oct 12 Londons FTSE 100 fell on Monday in a choppy trading session as a dip in oil prices hit energy stocks and as Prime Minister Boris Johnson laid out fresh restrictions to contain the growing coronavirus crisis.After rising 0.3% in morning trading, the blue-chip FTSE 100 ended 0.3% lower, dragged down by oil majors BP Plc and Royal Dutch Shell Plc, with a rise in the pound also pressuring exporters.The mid-cap FTSE 250, on the other hand, closed 0.5% higher, led by a jump in shares of corporate services firm Sanne Group Plc after RBC upgraded its rating on the stock to outperform.All eyes this week will be on a European Union summit for clues on Brexit negotiations. Johnson had set a deadline of Oct. 15 for agreeing a trade deal and Britains chief negotiator David Frost is in Brussels for intensified talks with the EU.Its a big week for the UK as trade talks with the EU enter a crucial stage, said Russ Mould, investment director at AJ Bell.Hopes of further U.S. stimulus boosted UK stock markets over the past two weeks, but analysts have warned trading could get more volatile as new business restrictions threaten a nascent domestic recovery.In an address to Parliament on Monday, Johnson set out a three-tiered system of local lockdown measures in England, which included shutting of pubs and bars in some areas placed into the very high alert level.Pub and restaurant owners Marstons Plc and Restaurant Group Plc fell 5.3% and 9.3%, respectively.The FTSE banking index dipped 0.4% as Bank of England policymaker Jonathan Haskel said the central bank had an absolutely open mind on negative interest rates.London-listed shares of Carnival Plc fell 4.9% after the cruise line operator cancelled all but the PortMiami and Port Canaveral cruises for rest of the year. (Reporting by Devik Jain in Bengaluru; Editing by Saumyadeb Chakrabarty and Anil DSilva)"}