{"text": " (Tweaks headline, lede, updates with floor price)\n    By Hallie Gu and Dominique Patton\n    BEIJING, April 12 China raised the floor price\nfor wheat auctioned from state reserves on Monday, a government\nnotice said, in an effort to dampen demand for the food grain.\n    The floor price for most of the wheat put out for weekly\nsale from state reserves was raised to 2,350 yuan ($358.99) a\ntonne, up from 2,290 yuan set in 2019, a notice on the website\nof the National Grain Trade Center said.\n    Chinese traders and feed producers have been scooping up\nwheat from state reserves to substitute for corn in animal feed\nbecause of soaring corn prices. \n    The buying spree has pushed up prices of staple food grain\nwheat. W-EXWDZH-GEN\n    Li Hongchao, a senior grains analyst with trade website\nMyagric.com, said it was a further move by the government to\nbalance the market, between corn, wheat, and rice.\n    \"It is ok for the cheap wheat to go into the feed market,\nbut maybe not the good grade ones,\" Li said. \n    China sold 515,209 tonnes of wheat, or only 12.81% of the\ntotal on offer, at an auction of state reserves last week, the\nNational Grain Trade Center said in a statement Monday.\n    The volume sold, at an average price of 2,349 yuan per\ntonne, declined from more than 1.5 million tonnes sold in the\nprior week, after the government restricted trade.\n    The government had permitted the participation of only flour\nprocessors, feed and livestock firms in the auction last\nWednesday, essentially banning traders from the sale.  \n    The buyers were required to make a commitment that the wheat\npurchased would be for actual consumption and not for trading,\nthe trade centre's notice on its website had said in early\nApril. \n    \"The restriction on traders' participation in the auction\nhas cooled down the sale, but it does not mean that the feed\ndemand (for wheat) is weak,\" said Meng Jinhui, senior analyst\nwith Shengda Futures. \n    The fall in wheat sales also comes after China's corn prices\n declined from their record high levels hit early in the\nyear, while a round of African swine fever outbreaks has reduced\nthe pig herd in northern China, and curbed demand for feed.\n\n    A purchasing manager for a flour processor said: \"Demand for\nwheat from the feed sector is still quite strong.\"\n    But he also said that the government intervention had pushed\ndown the sale during last week's auction, while African swine\nfever outbreaks dented the demand a little. \n    \"Many feed producers have built their stocks till May ... We\nwill need watch what happens in May,\" the manager, who declined\nto be named as he was not authorised to talk to the media, said.\n    The table below shows the volume of wheat sold at weekly\nauctions from China's state reserves in 2021.\n Auction date  Total up for  Total sold  Percenta  Average\n               sale          (tonnes)    ge sold   price (yuan\n               (tonnes)                            per tonne)\n   TOTAL TO      48,215,509  26,048,709                        \n     DATE                                          \n        7-Apr     4,021,715     515,209    12.81%         2,349\n  30-31-March     4,022,417   1,588,397    39.48%         2,363\n  23-24-March     4,001,540   1,030,397    25.75%         2,354\n  16-17-March     4,020,039   1,632,721    40.61%         2,356\n   9-10-March     4,033,082   2,263,416    56.12%         2,376\n    2-3-March     4,029,705   2,049,011    50.84%         2,372\n    23-24-Feb     4,033,758   1,681,496    41.68%         2,374\n      8-9-Feb     4,022,411   1,831,859    45.54%         2,373\n      2-3-Feb     4,023,477   1,718,708    42.71%         2,359\n    26-27-Jan     4,024,677   2,187,297    54.34%         2,373\n    19-20-Jan     4,030,694   4,026,476    99.89%         2,455\n       13-Jan     3,949,934   3,939,732    99.74%         2,504\n     6-Jan-21     4,023,775   2,099,199    52.16%          2365\n \n($1 = 6.5461 Chinese yuan renminbi)\n\n (Reporting by Hallie Gu, Beijing Newsroom, and Dominique\nPatton; Editing by Jacqueline Wong, Shailesh Kuber and Jane\nMerriman)\n  "}