{"text": "* Spot LNG prices in Asia rise to $28/mmBtu - Platts* Temperatures expected to become milder soon* Supply uptick seen in Qatar, Russia and U.S.* Dutch TTF gas prices near three-year highs (Adds additional details on LNG demand, recasts throughout)SINGAPORE, Jan 12 Freezing temperatures across Asia and Europe are driving liquefied natural gas (LNG) prices to record highs and pushing up the cost of shipping the fuel globally as buyers grapple with tight inventories and a shortage of tankers.Demand for super-cooled natural gas has surged in recent years as buyers, particularly China and India, move away from dirtier coal-polluting power plants. Prices had remained relatively low until late 2019, when unexpected cold weather and bottlenecked shipments caused prices to surge.This bottleneck for shipping has an immediate impact on the demand for gas. Storage supplies are low and therefore, demand is high, said Toby Dunipace, with shipbroker SSY in a report this week. He said Panama Canal congestion had led to waiting times of seven to 10 days or more for LNG vessels.The effects are being felt in U.S. markets as well, where U.S. natural gas prices hit a six-week high on Tuesday.Global LNG trade has set record highs each year since 2015. Global LNG demand jumped about 10% a year from 2017-2019 mostly due to strong growth in China and India.Analysts at Goldman Sachs said there were 10 U.S. cargo loading cancellations for February. Limited LNG tanker availability may keep spot LNG prices elevated in coming months, traders said.Average daily tanker rates on the U.S. Gulf to Japan route rose to $253,270 on Tuesday, highest since earnings were first published in 2019, Baltic Exchange data showed.S&P Global Platts Japan-Korea-Marker (JKM), a reference point for Asian spot LNG prices, rose to $28.221 per million British thermal units (mmBtu) on Monday for a cargo to be delivered in February. At least one Japanese utility paid over $30 per mmBtu for a cargo for late January delivery, traders said.On Tuesday, commodity trader Trafigura bought a 3.2 trillion British thermal unit (TBtu) cargo for delivery in mid-February from Total Gas and Power Asia at $39.30 per mmBtu, data from Platts showed.This is worth nearly $130 million, about 11% more than a cargo for 2 million barrels of oil, based on current prices, Reuters calculations show.High Asian LNG prices have dragged the whole natural gas complex higher. Dutch gas prices traded at the TTF hub, the European benchmark, rose to near three-year highs on Tuesday as LNG cargoes were re-routed to Asia and as speculative buying increased.On Tuesday, the month-ahead TTF price hit 28.55 euros per megawatt hour, or about $7.8/mmBtu, highest since the fourth quarter of 2018.Supply is super tight in the prompt months and inventory levels are quite low in many places, a Singapore-based LNG trader said. As the weather gets mild and supply gradually returns, the situation might improve.If the cold weather abates, prices may be near a peak as demand for heating fuel diminishes, traders and analysts said. Temperatures are expected to rise to above-average in Tokyo, Beijing, Seoul and Shanghai over the next few weeks, weather data from Refinitiv Eikon showed.Supply also appears to be increasing with Shell resuming cargo loadings from its Prelude floating facility in Australia after it was offline for nearly a year, and with increased loadings from Qatar, Russia and the United States, shiptracking data from Eikon showed.Still, supply issues will cause the LNG market to remain vulnerable to cold snaps through the first quarter, Goldman Sachs said."}