{"text": "* ECB to change forward guidance, Lagarde says* Too early to dial back stimulus - ECB chief* Euro area bond yields near recent lows in broad rally* EU hires banks for 20-year recovery fund bond - leads (Updates prices)July 12 Euro zone bond yields dipped towards recent lows on Monday as risk aversion boosted demand for safe-haven bonds, while investors watched for clues from central bankers ahead of Tuesdays U.S. inflation print.Last weeks bond rally - driven by hedge funds unwinding bets against U.S. Treasuries as economic growth assumptions came under doubt - resumed after Fridays pause.Bond yields fell as stock markets dipped on worries of new COVID-19 variants stalling economic recovery and European Central Bank policymakers signalled continuing support.The ECB will change its guidance on policy steps at its next meeting to reflect its new strategy and show it is serious about reviving inflation, ECB President Christine Lagarde said.It is not the right time to talk about dialling back stimulus and the ECBs pandemic emergency bond purchases (PEPP) could transition into a new format, she added. Board member Luis de Guindos made similar comments.The ECB bought a net 24.047 billion euros of assets last week as part of its quantitative easing programme, above the 13.718 billion euros it purchased a week earlier.Some analysts already expect the ECB will increase the size of its conventional bond purchases and possibly make their rules more flexible to compensate for the end of PEPP.Germanys 10-year yield, the euro area benchmark, was down 1 basis point (bp) to -0.30% by 1520 GMT, not far from last weeks three-month low at -0.34%.Italian bonds, which, given relatively higher volatility, tend to outperform such broad bond rallies, saw 10-year yields drop 3 bps to 0.73%.That pushed the closely-watched gap with 10-year German yields to 103 bps, below last weeks peak at over 110 bps. .Traders are also preparing for Tuesdays June U.S. inflation print, which is expected to rise 4.9% year-on-year, down from 5% in May, ahead of Fed chairman Jerome Powells testimony from Wednesday.Analysts at Danske Bank said U.S. Treasury repricing spilling over to euro zone government bonds was one key risk facing European government bonds.At these (bond) levels, Im ... thinking that overall this year people who have underestimated deflation are underestimating inflation, Nils Kostense, head of government bond trading at ABN AMRO, referring to the recent yield drop.Kostense expects the market to trade sideways in the near term given support from ECB buying.Supply is also in focus, with euro zone public sector borrowers set to raise around 20 billion euros of net debt this week, the highest in July, according to Commerzbank.The European Union hired banks to sell a 20-year bond that will raise 10 billion euros backing its COVID-19 recovery fund, and a 10-year bond to raise 5.25 billion euros for other programmes, according to two lead managers.The deal is expected in the near future, their memos said, a phrase debt offices usually use a day before a sale. (Reporting by Yoruk Bahceli Editing by Mark Potter)"}