{"text": "(Adds details, quotes, background)MOSCOW, Jan 12 The Yamal-Europe pipeline, which usually sends Russian gas west into Europe, instead flowed east from Germany to Poland for the 23rd day on Wednesday, data from German network operator Gascade showed.Since Dec. 21, the link between Poland and Germany had been operating in reverse mode, carrying gas from west to east and putting upward pressure on European gas prices.The pipeline accounts for about one-sixth of Russias normal annual gas exports to Europe and Turkey.Industry sources and analysts said last month that traders were preferring to take gas from stockpiles to supply European buyers and avoid paying near record-high prices. As Russian gas company Gazprom has not seen bids for westbound exports, the pipeline has switched flows.Eastbound volumes rose to 8.7 million kilowatt hours an hour (kWh/h), up from 7 million kWh/h seen earlier this week, data from the Mallnow metering point on the German-Polish border showed, indicating that gas buyers are increasing their reliance on storage after record-high front-month hub prices in December.The Dutch TTF front-month contract gas contract , a European benchmark, touched an all-time high of 184.95 euros per megawatt hour (MWh) on Dec. 21 when the Yamal system reversed flows.It started last year at 19.15 euros per MWh and was trading at 83.70 euros per MWh on Wednesday, up by nearly 4%.It seems that they (European buyers) are taking gas out of storage and hoping the price goes down in the spring to let them refill storage more cheaply later in the year, said Ronald Smith, senior oil and gas analyst with Russias BCS brokerage.The preliminary Gascade data showed that Yamal flows were expected to stay in reverse at increased volumes of 8.7 million kWh/h until the early hours of Thursday.It is not clear when the pipeline will change the flows back towards Germany, though a source close to Gazprom said the company is expected to switch flows back at some point this month as Gazprom has paid for westbound volumes.Capacity nominations for Russian gas flows from Ukraine to Slovakia via the Velke Kapusany border point, another major route for Russian gas to Europe, 287,362 megawatt-hours (MWh) per day.That level was steady compared to nominations seen over the past week but remained below levels of more than 900,000 MWh recorded in early December, data from Slovak pipeline operator Eustream showed."}