{"text": "(Adds lawmaker quote)BRUSSELS, Jan 12 European Union countries should be able to temporarily remove households from the blocs planned carbon market for buildings and road transport, according to an early draft of the European Parliaments negotiating position on the policy.The European Commission last summer announced plans to introduce an EU-wide carbon price on home heating and transport fuels from 2026 to meet Europes goals to cut planet-warming emissions.A draft of the European Parliaments amendments to that proposal, seen by Reuters, would impose the scheme in 2025 but allow countries to omit private buildings and transport from it until 2027. Commercial operators could not opt out.Countries that use the opt-out must prove they can still meet their emissions-cutting targets, the draft said.The plan, by German lawmaker Peter Liese, aims to overcome opposition from some EU countries and lawmakers worried about the social impact if the CO2 price hiked households bills. The amendments also support the Commissions proposal for an EU fund to help compensate low-income citizens.I have to create a majority, Liese told Reuters, adding that the proposal had received quite positive reaction from other lawmakers.Liese also suggested changes to a planned revamp of the EUs existing carbon market. Industrial firms with the best performance on emissions would be rewarded with extra free CO2 permits - which they could sell for profit. Firms that lack convincing emissions-cutting plans could lose free permits faster, the draft said.Meanwhile, steel, cement and other industries that will be covered by the EUs planned carbon border tariff would lose the free CO2 permits they currently receive. That aligns with the Commission proposal.However, Liese suggests putting those permits in a reserve, rather than cancelling them. If there are problems launching the carbon border levy - a policy that has stoked tensions with countries including China - the permits could be handed back to EU industry, the draft amendments said.Lieses draft also supports adding shipping to the EUs existing carbon market from 2025, rather than 2026 as proposed by the Commission.Parliament aims to finish its amendments by summer, before negotiating the final rules with EU countries. (Reporting by Kate Abnett; Editing by Angus MacSwan and Alex Richardson)"}