{"text": "(Adds analyst comments, details, background)MOSCOW, March 12 The Belarusian central bank unexpectedly said on Friday it was scrapping its rate-setting schedule for the rest of the year after keeping its main interest rate at 7.75% despite rising inflation.The central bank gave no reasons for leaving the rate unchanged, but analysts suggested it was aimed at supporting state-owned companies who are struggling with debt - even at the expense of keeping inflation in check.Giant state-owned firms are the backbone of the economy under President Alexander Lukashenko, who has faced over half a year of protests and strikes in the biggest challenge yet to his 27-year-rule.Annual inflation climbed to 8.7% as of March 1, compared to 7.7% a month earlier. The central bank had originally scheduled its rate setting meeting for February but postponed it to analyse what factors lay behind the price rises.The central bank said it would now hold policy meetings as and when needed, adding that it was extending existing money market restrictions.The key goal is to ease the pressure on state-owned enterprises and improve their condition. Almost all loan agreements are linked to the (central banks main) rate, said Dzmitry Kruk, a researcher at the Belarusian Economic Research and Outreach Center (BEROC).Otherwise, payments on all issued loans would have to be increased, he said.Debts from the largest state companies amount to about 14% of Belarusian gross domestic product (GDP), according to a central bank estimate from the beginning of the year.The government has previously urged the central bank to ease policy and reduce the cost of loans to support the economy.This means the final loss of independence by the National Bank. In the face of growing inflation, raising the rate was the only reasonable decision, said Vadim Iossub, senior analyst at Alpari Eurasia.Such decisions mean that the authorities do not give a damn about long-term financial stability, he added. (Reporting by Anastasia Teterevleva and Gleb Stolyarov; Writing by Alexander Marrow and Matthias Williams; Editing by Maria Kiselyova and Hugh Lawson)"}