{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Updates with post-data moves, fresh comment)May 12 Eurozone bond yields reversed early falls and rose on Wednesday after stronger than expected U.S. inflation data.U.S. consumer prices increased in April as booming demand amid a reopening economy pushed against supply constraints, which could fuel financial market fears of a lengthy period of higher inflation.We expect higher yields on the longer maturities, with the 10-year Treasury testing the 1.8% area in a short time and the 10-year Bund rising towards a 0% yield, Massimiliano Maxia, senior fixed income specialist at Allianz Global Investors said.Todays figures need confirmation in the next two months to establish that inflation is structurally higher, Maxia added.The consumer price index jumped 0.8%; excluding the volatile food and energy components, the CPI soared 0.9%.Economists polled by Reuters had forecast the overall CPI climbing 0.2% and the core CPI rising 0.3%.Our strategists expect GDP to be very strong in the second-quarter, but this comes with a cost, and that cost is inflation, Anna Guglielmetti, head of institutional portfolio management Italy at Credit Suisse said.On Wednesday, Germanys 10-year yield, the benchmark for the region, was up 2.5 basis point to -0.142%, its highest since May 2019, by 1330 GMT.Thirty-year yields rose to their highest since May 2019 at 0.44%, after coming under specific pressure from a 30-year syndicated green bond sale on Tuesday.Italian bond yields were up 2.5 bp to 0.97%, their highest since September 2020.Expectations of long-term euro zone inflation hit a new high since 2018 at 1.61%.Global financial markets have had a turbulent week. Equities have slumped and bond yields, particularly in the euro area, have risen sharply as investors grew nervous about growing inflationary pressure and stretched market valuations.Fed officials grappled on Tuesday with surprisingly weak April employment growth, acknowledging the jobs recovery may prove choppier than anticipated, while European Central Bank policymakers have also sounded dovish this week.According to ING analysts, there is a strong tendency for bond sell-offs to be self-perpetuating.This is particularly true as there seems to be a strong consensus in favour of higher rates. Our 0% target in 10Y Bund yields looks more within reach than ever, possibly this quarter, they said in a research note. (Reporting by Yoruk Bahceli and Stefano Rebaudo; Editing by Toby Chopra)"}