{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Recasts lede, updates prices)LONDON, April 12 Euro zone government bond yields recovered from an early fall and were flat to slightly higher on Monday, tracking moves in U.S. Treasuries in a busy week for U.S. debt markets.U.S. Treasury yields, which have stabilised in the past two weeks after a sharp rise, could get a fresh steer from auctions and inflation data.On Monday alone the U.S. Treasury will auction $96 billion of three- and 10-year bonds in the latest gauge of investor appetite for U.S. bonds amid strong growth and high debt levels.That will likely set the tone for European bond markets, where yields have risen this year on U.S.-led reflation expectations.The large U.S. Treasury supply and the string of likely upbeat U.S. activity and inflation data this week leave U.S. Treasuries still vulnerable with spillover risks to Bunds, said Commerzbank rates strategist Rainer Guntermann.Euro zone bond yields were broadly lower, with Germanys benchmark 10-year Bund yield was up 0.5 basis points on the day at -0.29% -- about 10 bps below almost one-year highs hit in February.Dovish weekend comments from European Central Bank board member Fabio Panetta may have leant bond markets some support.The ECB should accept no further delay in lifting inflation back to its target as the current outlook is unsatisfactory and persistent misses risk damaging the economy, he said.The U.S. economy is at an inflection point with expectations that growth and hiring will pick up speed in the months ahead, but also risks if a hasty reopening leads to an increase in coronavirus cases, Federal Reserve Chair Jerome Powell meanwhile said in an interview aired Sunday.Italian bond yields pulled back from Fridays one-month high on growing concern about possible delays in the EU recovery fund to aid the post-coronavirus recovery.Italys 10-year bond yield was flat at 0.74%, below Fridays high around 0.76%.Weekly ECB bond buying data, covering trades settled by April 9, will be released later in the day.Analysts at UniCredit said the data, the first indication of purchases in the second quarter, will be closely watched. ECB President Christine Lagarde has suggested the ECB expects emergency bond purchases in the second quarter to be held at a significantly higher pace than during the first quarter.UniCredit also noted that the reporting week contains two holidays, so may reflect a relatively low buying amount.Elsewhere, Austria hired banks to sell four-year and 50-year bonds, according to a lead manager note seen by Reuters. Spain also hired banks for a new 15-year bond sale."}