{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Changes headline, updates with U.S. yields at 1 year high)AMSTERDAM, March 12 Benchmark German government bonds gave up gains made a day earlier when the European Central Bank said it would accelerate the pace of its bond buying, with yields tracking U.S. Treasuries higher on Friday.Investors were watching the market for any sign of additional ECB support after ECB President Christine Lagarde said the increase in the pace of bond buying under the banks Pandemic Emergency Purchase Programme (PEPP) would be implemented as of Thursday.The purchases will see the ECB buy a monthly amount above 60 billion euros ($71.6 billion) but below 100 billion euros, with a small tolerance band around it, sources told Reuters after the decision on Thursday.But the optimism around the purchases, intended to combat a recent rise in global bond yields spurred by growth and inflation bets in the United States, faded on Friday.Ten-year U.S. Treasury yields rose to over 1.63%, their highest level since February 2020 and their German equivalents, the benchmark for the region, rose as high as -0.293%.That was well above Thursdays peak of -0.308%, before the ECB announced its decision to increase the pace of its bond buying during the next quarter.U.S. and German bond yields closely track one another, and this has become a cause of concern as the euro area faces a weaker economic outlook. Germanys 10-year yield was last up 3.6 basis points to -0.295% at 1232 GMT.Italian 10-year yields, which outperformed the market on Thursday as the country is among the top beneficiaries of ECB bond buying, were up 5 basis points at 0.63%.After falling as much as 10 bps following the decision, that puts them just a few basis points lower than Thursday before the ECB meeting.The limited market reaction underscores analysts view that the increased buying pace will have a limited impact in holding down the blocs bond yields.Without an increase to the PEPP envelope -- the total purchases permitted under the programme -- it will just mean the programme will have to end earlier.While the ECB is buying some time, the measures will probably not be enough to fully offset the expected further pressure on the term premium from the U.S. long end, said Michael Leister, head of interest rate strategy at Commerzbank, referring to the additional yield on longer-dated debt relative to shorter-dated debt.Euro zone bonds were largely unaffected by headlines that Germany is at the start of a third wave of the coronavirus or that Italy would tighten coronavirus restrictions in some regions from next week.The risk premium on Italys 10-year bonds was little changed. ($1 = 0.8381 euros) (Reporting by Yoruk Bahceli and Julien Ponthus; editing by Simon Cameron-Moore, Larry King and Jonathan Oatis)"}