{"text": "* Oil lifting 660,000 barrels per day in 2021* Figure below target and down from 707,000 in 2020* Minister says Indonesia needs to tap new oil sources* Pledges new exploration and to squeeze more from existing fields* Says Indonesia must be more flexible to attract investors* (Adds ministers quotes in paragraphs 5 and 9, context throughout)JAKARTA, Jan 12 Indonesias oil lifting, or ready-to-sell production, narrowly missed its target and fell for a fifth straight year in 2021, after a failure to tap new sources and as older fields matured, energy minister Arifin Tasrif said on Wednesday.The Southeast Asian countrys oil lifting came in at 660,000 barrels per day (bpd) in 2021, Tasrif told a conference, falling just short of an earlier target of 668,000 bpd.Oil lifting fell 6.6% from 707,000 bpd in 2020. Meanwhile, Indonesia aims to increase oil lifting to 703,000 bpd this year.Meanwhile, gas lifting came at 982,000 bpd equivalent, slightly lower than the 983,000 bpd equivalent last year.If you look at the downward trend, it is indeed declining because we dont have new sources, Tasrif said. Our wells are old. There is limited output.Indonesias crude oil output peaked at around 1.7 million bpd in the mid-1990s. But with few significant oil discoveries in recent years, production has steadily fallen as older fields have run dry.Indonesia has set a target for oil production to reach one million bpd by 2030, despite seeing declining output for at least five years.Oil and gas lifting is expected to improve this year thanks to higher demand and newly discovered oil reserves, Tasrif said.We have a roadmap to optimise existing fields, (increase) oil and gas recovery with Enhanced Oil Recovery, and massive new exploration, he said.Indonesia in November put up for bids eight new oil and gas blocks with a total capacity of at least 500 million barrels of oil and 22 trillion cubic feet of gas.Tasrif said these new blocks must be supported by a new government policy to attract large investors.He did not specify what the policy would be, but conceded Indonesia must be more flexible and give contractors the opportunity to optimise existing sources before managing new sources. (Reporting by Bernadette Christina Munthe; Writing by Fathin Ungku; Editing by Martin Petty and Ed Davies)"}