{"text": "* Italy 30-year yields drop to record low of 1.60%* Spain, Portugal 10-year yields drop below 0.20%* Bund-Treasury spread widens as U.S. powers ahead* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Updates prices)LONDON, Oct 12 Southern European government bond yields were near record lows as investors anticipated a new round of European Central Bank stimulus to aid recovery from the depths of the COVID-19 crisis.Italian 30-year government bond yields and Greek 10-year yields fell to record lows, while Spanish and Portuguese borrowing costs were around one-year lows, with their 10-year yields heading back towards zero on Monday.This reflects a slower-than-expected economic recovery in Europe and remarks from policymakers suggesting the need for further monetary and fiscal stimulus, analysts said.The main reason is the ever rising probability of ECB support, especially an extension of quantitative easing, said ING rates strategist Antoine Bouvet.The long end of Italian and Spanish bond curves have been particular performers, with Italian 30-year yields dropping seven basis points on Friday alone to 1.60% and a further seven bps on Monday to a record low of 1.53%.Italian five-year credit default swaps -- the cost of insuring against a debt default -- also fell to a record low of 114 basis points, Markit data shows.Analysts are not ruling out a first-time dip into negative territory for benchmark 10-year yields in Spain and Portugal, which are at 0.14% and 0.16% respectively.Meanwhile, the economic divergence between Europe and the United States continues, and bond markets are reflecting this.The spread between German Bund yields and their U.S. Treasury counterparts is at its widest since March at 132 basis points.The U.S. has been doing a lot better economically in this recession than Europe, but there is a lot of hard data this week that should give us a better picture, INGs Bouvet said.It will take a while for the effects of the upcoming presidential election and mooted fiscal package to make themselves clear, he added.Later this week, Italy, the Netherlands, Germany, Portugal, France and Spain hold bond auctions."}