{"text": "(Adds details, graphic, comment)BRASILIA, Aug 12 Brazilian retail sales ended the first half of the year on a strong footing, official figures showed on Wednesday, surging back to pre-crisis levels as the easing of lockdown measures to combat the coronavirus pandemic continued across the country.Retail sales rose more than forecast and Mays record rise was revised higher still, adding weight to the view among government and central bank officials that the economy is recovering quicker than expected from the crisis.Retail sales excluding cars and building materials jumped 8% in June, statistics agency IBGE said, more than the median forecast of a 5.4% rise in a Reuters poll of economists.Seven of the eight sectors covered by IBGE showed a rise in sales. Fabric, clothing and footwear rose 53.2% on the month, furniture and home appliances rose 31% and other personal and domestic goods rose 22.7%, IBGE said.The month-on-month figure for May was revised up to a new record 14.4% increase from 13.9%.As the chart below shows, that brought the seasonally-adjusted retail sales volumes index up to 96.1, the highest this year and showing a sharp V-shaped rebound to recover all the ground lost earlier in the year.The positive results were expected because we came from a very low base. Growth was widespread, across almost all activities. Since the beginning of the pandemic, we have broken many records, both negative and positive, so the numbers are very volatile, IBGE research manager Cristiano Santos said.On an annual basis, sales rose 0.5% in June compared with the same month last year, IBGE said. Economists in the Reuters poll had expected a fall of 3.45%.Sales were down 3.1% in the first half of the year, IBGE said, the worst January-June performance since 2016 when Brazil was last in recession.Brazils economy is expected to post its biggest ever annual decline this year. But central bank chief Roberto Campos Neto has said the banks own forecast of a drop of 6.4% is too pessimistic, and on Tuesday he said that Brazils will be one of the fastest rebounds in emerging economies."}