{"text": "(Adds comment)NEW YORK, May 12 U.S. crude oil stockpiles dropped last week and exports fell to their lowest since 2018, while gasoline inventories rose unexpectedly and distillate hit their lowest levels in more than a year, the Energy Information Administration said on Wednesday.Crude inventories <USOILC=E I> fell by 427,000 barrels in the week to May 7 to 484.7 million barrels, compared with analysts expectations in a Reuters poll for a 2.8 million-barrel drop. East Coast stockpiles fell to the lowest on record, according to the data.Crude stocks at the Cushing, Oklahoma, delivery hub fell by 421,000 barrels last week, the EIA said.Net U.S. crude imports rose by 2.4 million barrels per day, as exports alone dropped to 1.8 million bpd, their lowest since October 2018, the EIA said.The drawdown combined with the lack of exports is good sign, said Tony Headrick, energy market analyst at CHS hedging.Crude futures held gains after the report with U.S. crude trading $1 higher at $66.28 per barrel by 10:50 a.m. ET (1450 GMT).U.S. gasoline stocks rose nearly 400,000 barrels in the week to 236.19 million barrels, the EIA said, compared with analysts forecasts for a 600,000-barrel drop.At this time of year we should be burning through a lot of gasoline and thats not what this report is showing, said Bob Yawger, director of energy futures at Mizuho in New York.He said the report should pre-date the outage on Colonial Pipeline, the main products conduit from Gulf Coast refiners to the East Coast.Distillate stockpiles, which include diesel and heating oil, fell by 1.7 million barrels, slightly more than expectations for a 1.1 million-barrel drop, the EIA data showed. At 134.42 million barrels, distillate inventories were at their lowest since April, 2020.Refinery crude runs fell by 223,000 bpd as utilization rates fell by 0.4 percentage point, the EIA said.The drawdown in crude inventories, along with the decline in exports and refinery processing indicate that the market may expect an adjustment to stocks next week, said Phil Flynn, senior analyst at Price Futures Group in Chicago, noting that the EIA can revise the figures.The EIA has made record adjustments to inventories in the past month, so its important to look at four-week averages to see real trends, he said. (Reporting By Jessica Resnick-Ault Editing by Marguerita Choy)"}