{"text": "(Recasts with detail on other defaults, trading halts, comment)SHANGHAI, Nov 12 Chinas bond market regulator launched an investigation on Thursday into a default by a mining firm, the latest in a series of setbacks for state-backed companies as the government winds down support for an economy hit hard by the COVID-19 pandemic.The National Association of Financial Market Institutional Investors (NAFMII) said it was launching a self-disciplinary investigation into Yongcheng Coal & Electricity Holding Group Co Ltd, which defaulted less than a month after issuing a new bond.Trading in bonds issued by state-backed integrated circuit maker Tsinghua Unigroup Ltd was also halted on the Shanghai Stock Exchange on Thursday after they plunged following a debt warning by one of Chinas leading rating agencies.The setbacks for Unigroup and Yongcheng came after the high-profile default on a bond payment at the end of October by Huachen Automotive Group Co Ltd, the state-backed parent of BMWs main Chinese joint venture partner.Ivan Chung, associate managing director, corporate finance, at Moodys in Hong Kong, said the defaults reflected tightening financial conditions as China pares back economic stimulus measures introduced during lockdowns.Yongcheng missed a 1.03 billion yuan ($156 million) combined principal and interest payment on Nov. 10 for a maturing commercial debt instrument, just three weeks after issuing a three-year, 1 billion yuan medium-term note.NAFMII said its investigation would look into whether Yongcheng and intermediary companies had properly disclosed risks, and could impose sanctions or refer the companies to relevant departments if they are found to have violated rules.REFINANCING DIFFICULTIESUnigroups bonds plunged after China Chengxin International Credit Rating Co Ltd (CCXI) said on Nov. 5 that it may downgrade the circuit makers AAA rating after it said it would not exercise its option to redeem a perpetual bond.Tsinghua Unigroup is part of a wholly-owned division of the prestigious Tsinghua University in Beijing, which counts President Xi Jinping among its alumni.Perpetual bonds have no maturity date but issuers have the right to buy them back from bondholders. Unigroups decision triggered a clause in the bonds prospectus that raises its coupon for the next five years.In its report, CCXI said the move would have a negative impact on Unigroups finances, raise its financing costs, and weaken its refinancing abilities.The yield on benchmark five-year AAA rated Chinese corporate debt stood at 3.9924% on Wednesday, up more than 100 basis points from late-April lows. The expectation that Chinas central bank could roll back stimulus measures has also elevated interbank market interest rates this week.The economy has rebounded but not every company is recovering strongly ... and that is why some of the weaker companies see some refinancing difficulties, Moodys Chung said, adding that defaults were still below the global average.I believe that in default cases that can lead to systemic risk, the government will step in, Chung said. But if this is isolated defaults, I think that they will continue their approach to have market-oriented debt restructuring. ($1 = 6.6187 Chinese yuan) (Reporting by Andrew Galbraith; Editing by Kim Coghill and David Clarke)"}