{"text": "(Adds background)OTTAWA, July 12 The Bank of Canada on Monday named a specialist in financial regulation as its new senior deputy governor, filling the vacant No. 2 spot and adding some much needed diversity to the central banks six-member policy setting council.Carolyn Rogers, currently the secretary general of the International Basel Committee on Banking Supervision and previously an assistant superintendent with Canadas financial regulator, is set to begin her seven-year term on Dec. 15.The Bank of Canada has faced criticism for the lack of diversity on its governing council, which oversees monetary policy. It has been made up of five white men since former Senior Deputy Carolyn Wilkins left in December.Earlier this year, the central bank launched a push to increase the number of women and visible minorities in its ranks.Governor Tiff Macklem said that Rogers global and domestic experience would bring a diverse view to the central bank.She is also a strong senior leader and strategic thinker -invaluable skills as the Bank charts an ambitious path to best serve Canadians, Macklem said in a statement.In a separate statement, Canadas Finance Minister Chrystia Freeland said Rogers will bring a fresh perspective to the Bank of Canada.Rogers will also join the central banks board of directors and will oversee strategic planning and operations, the Bank of Canada said. In addition to her other previous jobs, she led the financial sector regulator in the Western Canadian province of British Columbia.Her appointment is not expected to alter the overall trajectory of Canadas monetary policy. Analysts said she looked like a good fit.Rogers expertise with regards to the Canadian and global financial systems will complement Governor Macklems macroeconomic and monetary policy background, Royce Mendes, senior economist at CIBC Capital Markets, said in a note.The decision was made by the independent members of the Bank of Canadas board of directors and approved by Prime Minister Justin Trudeaus Cabinet. (Reporting by Julie Gordon in Ottawa; Editing by Franklin Paul, Jonathan Oatis and Paul Simao)"}