{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Adds U.S. inflation data, updates prices)LONDON, Aug 12 Euro zone government bonds sold off on Wednesday and the German 30-year bond yield turned briefly positive ahead of the largest-ever 10-year U.S. Treasury auction and as signs emerged of inflation in the worlds largest economy.The Treasury will sell a record $38 billion in 10-year notes on Wednesday and $26 billion in 30-year bonds on Thursday.U.S. consumer prices, meanwhile, rose more than expected in July and a measure of underlying inflation increased by the most in more than 29 years.,Core euro zone bonds sold off, with most yields up 2 to 3 basis points. Southern European bonds also saw yields edge higher.The 10-year U.S. Treasury yield rose the most in two months on Tuesday and extended those gains on Wednesday to reach a five-week high of 0.686%.It started off as a technical move because of the issuance that we have from the U.S. later, said Antoine Bouvet, rates strategist at ING.But the real reason is that stocks are strong and theres momentum in the market. We are cautious because we are quite bearish about the global economy and the U.S. in particular.The benchmark 10-year Bund had its biggest daily spike in a month on Tuesday as Wall Street rebounded towards pre-pandemic highs.Germanys 10-year Bund yield rose 3 bps to a 23-day high of -0.430%, before settling at around -0.45% at the close . Frances 10-year yield rose as high as -0.152%, its highest in 16 days, before closing at -0.17%.Spains 10-year yield was up 2 bps at 0.305% while Italys was at 1.027%, up a basis point on the day .Belgian, Dutch, Finnish and Irish bond yields also jumped.Risk-on in recent days is taking its toll, but also the U.S. supply avalanche were seeing this week requires some concessions, said Christoph Rieger, head of rates and credit research at Commerzbank.Commerzbank wrote in a note to clients that the sell-off was premature.Fundamentally nothing has changed, Rieger said. The coronavirus situation has not improved, the macro situation has not changed, if anything the political risk from U.S.-China has increased.Russian President Vladimir Putin said on Tuesday that Russia had become the first country to grant regulatory approval to a COVID-19 vaccine. The announcement was met with scepticism and had limited market impact.Eurozone industrial production data showed that, although output increased in June, the rebound from March and Aprils record lows was below expectations for a second month in a row, and slower than May."}