{"text": "(Updates with a statement from junior partner in the government, Accord)WARSAW, Feb 12 A proposed tax on media advertising in Poland is unacceptable in its current form, a junior partner in the government said on Friday, raising doubt over whether parliament could pass a bill critics say threatens media independence.The objections of Accord, a centrist partner in the conservative United Right coalition, are the latest sign of tension in a government that has become increasingly fractious in recent months, with conflicts breaking out over issues ranging from animal rights to the European Union budget.For me, it is unacceptable in this form, and most of the lawmakers I have talked to are of that opinion, Accord spokeswoman Magdalena Sroka told private broadcaster Radio Zet on Friday morning.Accord ... does not see the possibility of supporting the bill in its proposed form, the party said in a statement published on Twitter in the evening, adding that the proposed tax can negatively impact Polish business, media and citizens.Several private TV and radio stations and web portals in Poland took themselves off the air on Wednesday in an unprecedented protest against a law they say would weaken independent media that are critical of the government.Critics say Poland is following the example of central European ally Hungary in trying to increase government control over the media. That issue came into sharp focus in December when state-controlled oil refiner PKN Orlen said it was buying German-owned newspaper publisher Polska Press.The government says the tax will help raise funds for healthcare and culture, both hit by the coronavirus pandemic. It has long argued that foreign media groups have too much influence in Poland.Finance Minister Tadeusz Koscinski said it was important to get feedback on the bill. There is not the slightest intention to knock anybody out with tax, he said.The Polish prime ministers top aide, Michal Dworczyk, said the bill was still in a consultation phase and denied it was intended to limit media freedom.We are dealing with a serious manipulation, or a lie, he told public broadcaster Polskie Radio Program III. An attempt to tax big companies is presented as an attempt to limit the freedom of the media. (Reporting by Alan Charlish, Pawel Florkiewicz, Anna Wlodarczak-Semczuk, Agnieszka Barteczko and Alicja Ptak; editing by Larry King, William Maclean)"}