{"text": "(Recasts, adds minister quote, adds details)BERLIN, Feb 12 Germany is set to introduce fines for companies procuring parts or materials abroad from suppliers who fail to meet minimum human rights and environmental standards, after the governing coalition reached agreement on a draft law.The bill has, however, been substantially watered down under pressure from Chancellor Angela Merkels Christian Democrats, who blocked a Social Democrat proposal to create a legal pathway for affected parties to sue the German firms for compensation.While the details of fines have not yet been settled, Heil said he could envisage penalties of up to 10% of turnover, meaning they could easily run into the millions in some cases.Business groups have warned that the law could harm the competitiveness of the companies that make up Europes largest economy; the car maker Volkswagen alone has more than 40,000 different suppliers worldwide.The legislation will be introduced in stages; to apply to companies with more than 3,000 employees from 2023, and smaller companies, with more than 1,000 staff, the year after, according to a document seen by Reuters.This is the strongest law in Europe so far against worker exploitation, SPD Labour Minister Hubertus Heil told a news conference on Friday. Its the end of companies weighing human rights against their economic interests.Companies with fewer than 1,000 employees will be exempt. The Economy Ministry, led by Merkel ally Peter Altmaier, had argued that the impact on them would be disproportionate.He said the legislation had been designed to minimise bureaucracy, and was a sensible compromise.The law, similar law to one introduced by France in 2017, obliges companies to check their supply chains for themselves.The German constitution says the dignity of all human beings must be inviolate, Heil said, not just the dignity of Germans. This is a good day for human rights. (Reporting by Christian Kraemer, Holger Hansen, writing by Thomas Escritt Editing by Riham Alkousaa)"}