{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Adds details and chart, updates prices)MILAN, Jan 12 Italian bond yields jumped on Tuesday with 10-year yields set for their biggest daily rise since November and five-year yields returning to positive territory on fears of political uncertainty.Italian Prime Minister Giuseppe Conte will not try to forge a new government with the Italia Viva coalition party if it follows through on a threat to quit the cabinet, a source in Contes office said on Tuesday.Italia Viva could bring down Contes government and unleash political chaos as Italy struggles to contain the COVID-19 pandemic.Italys 10-year benchmark yield rose as much as 11 basis points to 0.65%, the highest since Dec. 2.Last up 10 bps on the day, it was on track for its biggest daily rise since Nov. 9, when Pfizer announced its COVID-19 vaccine was highly effective, causing a big sell-off in safe-haven bonds.Five-year yields rose to positive territory for the first time since mid-November and saw their biggest daily rise since early May.The clash between Prime Minister Giuseppe Conte and the head of the Italia Viva party, Matteo Renzi, is reaching its peak, Erjon Satko strategist at BofA said.Some headlines are weighing heavily on Italian government bond prices. The market is worried about any development that could lead to a eurosceptic policy in Italy, he added.Snap elections are still unlikely, but risk has increased, Citi analysts said in a research note.Bond yields elsewhere in the euro area also rose, but less than in Italy, supported by the European Central Bank backstop as coronavirus restrictions continue to weigh on the economic outlook, while reflation trade is pushing U.S. Treasury yields higher.ECB board member Isabel Schnabel reaffirmed the central banks dovish stance, saying that a short-term rise in inflation will not affect monetary policy decisions, which are geared towards the medium term.Germanys benchmark 10-year Bund yield was up 3 basis points at -0.47% after hitting a two-month high on Monday.The gap between U.S. and German 10-year yields rose to 165 basis points.Concerns about a more pronounced sell-off in U.S. Treasuries keep dominating, Commerzbank analysts said in a client note.Bunds and European government bonds seem no longer immune to these dynamics, they said, adding that the steady pace of ECB purchases is being met by rising net supply.Analysts expected the central bank to buy an amount of bonds broadly in line with the January net supply, which was estimated at around 150 billion euros ($182.2 billion).Markets were also expected to be focusing on focusing on a U.S. 10-year auction as well as on the comments of Fed speakers. ($1 = 0.8235 euros)"}