{"text": "* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Recasts lead, adds fund manager quotes, background)MILAN, Feb 12 More signs of rising inflation in the U.S. triggered a late rise in euro zone borrowing costs, with the Italian-German yield spread hovering around its tightest since 2015 as Mario Draghi looked set to take office as Italian prime minister.U.S. Treasury yields rose and inflation expectations jumped to their highest levels since 2014 on Friday, a day after the U.S. Treasury Department cited weak demand for a sale of new 30-year bonds.Having secured the endorsement of almost all Italys political parties, former European Central Bank chief Draghi is likely to present his list of ministers to President Sergio Mattarella on Friday and unveil his policy programme next week in parliament.U.S. inflation expectations triggered todays late rise in Italian and German borrowing costs. I think Bund yields are on the upper bound of their range, along with U.S. 10-year Treasuries yields which are just below 1.2%, said Anna Guglielmetti, head of institutional portfolio management Italy at Credit Suisse.Germanys 10-year bond yield was up 3 bps at -0.428%, setting its biggest daily rise since late January.Italys 10-year bond yield rose 2 basis points at 0.482%. The closely watched spread between German and Italian yields was at around 90 bps, after hitting its lowest level since early 2015.Guglielmetti confirmed her target for the Italian-German 10-year bond yield spread at 80 bps as Draghi looked set to become prime minister, adding we just need some more time to get to that level.European Commission Vice President Valdis Dombrovskis said he was confident a Draghi-led government would successfully complete the remaining steps for funds from the Recovery Fund to be released quickly.We see the 30-year spread between Italian and German bond yields diving below 120 bps in the next couple of weeks, said Saxo Bank fixed income strategist Althea Spinozzi.The sharp fall in borrowing costs also fuelled market speculation that Italy could take advantage of the favourable backdrop to issue ultra-long debt.Given the prevalent optimism surrounding Italy, in particular long end (euro area) rates could see continued steepening pressure as Italy could seize the opportunity to launch a new (ultra) long bond this month, ING strategists wrote in a report.Reflecting reduced risks of holding Italian debt, Rome also saw its spread with Spain narrowing to around 30 bps, its lowest level since December 2017."}