{"text": "* 2020 GDP may show between 1% growth and 2% contraction -Albayrak* Lira has tumbled as much as 19% against dollar this year* Albayrak sees limited lira impact on inflation (Adds details, background)ISTANBUL, Aug 12 The competitiveness of Turkeys lira is more important than the exchange rate level, Finance Minister Berat Albayrak said on Wednesday, shrugging off a slide in the currency to record lows last week.In an interview with broadcaster CNN Turk, Albayrak also said Turkeys gross domestic product this year will show between 1% growth and 2% contraction, after the coronavirus pandemic hit the economy. Analysts expect the economy to contract.The exchange rate goes down, it goes up. What is important is that Turkey manages all this volatility in a controlled way, Albayrak said. What is important is not the exchange rate, but whether it is competitive.The lira hit a record low of 7.3650 against the dollar last week, a slide of 19% from the end of 2019, making it among the worst performers in emerging markets. The lira stood at 7.2840 at 1930 GMT, unchanged from the level before the interview.Following the slide in the liras value, the central bank halted cheaper funding which had allowed primary dealers to borrow well below its policy rate in an effort to squeeze credit via backdoor channels and stabilize the currency.Albayrak, who is President Tayyip Erdogans son-in-law, said Turkey will miss its budget deficit target this year and the deficit will likely be around 5-6% of gross domestic product.Economists expect Turkeys economy to shrink this year because of the coronavirus pandemic, while further lira depreciation could drive up inflation and the current account deficit and worsen the contraction.However, Albayrak said the lira will not have as negative an effect on inflation as expected, but said the pandemic may have a 1-2 percentage point impact on inflation.Annual inflation fell to 11.76% year-on-year in July. The government forecast for end-2020 inflation is 8.5%, while the latest central bank survey placed it at 10.22%.Expectations have grown that the central bank will formally raise its 8.25% policy rate to boost confidence amid concerns over depleted reserves, costly state FX interventions and a trend of Turks buying foreign currencies.Overnight swap rates in the London market soared above 1,000% last week as liquidity dried up, in a sign of what analysts said were renewed state curbs. Referring to the surge in rates, Albayrak said Turkey would not supply lira to people who speculate to increase the value of the dollar.Am I to give you a weapon so you can shoot at me? he said. (Reporting by Ali Kucukgocmen Writing by Daren Butler Editing by Dominic Evans and Leslie Adler)"}