{"text": "(Adds Scholz comments)BERLIN, Nov 12 Germany plans to take on additional new debt also next year to finance further coronavirus measures, Finance Minister Olaf Scholz said on Thursday, as tax estimates showed the pandemic is hitting public finances a bit less than initially feared.The coronavirus pandemic is far from over. We must continue to watch the development. And if necessary, we will act quickly and decisively, Scholz said when presenting the governments updated tax estimates.The government expects its tax revenues for 2020 to 2024 to come in 6.7 billion euros ($7.90 billion) higher than previously projected. For all state levels, revenues are seen 15.8 billion euros higher than projected in September.The government also revised its estimate for gross domestic product this year upwards in October. It now expects Europes largest economy to shrink by 5.5%, or 5.9% in calendar-adjusted terms.Germany has since March unleashed an unprecedented array of rescue and stimulus measures, financed with record new borrowing of up to 218 billion euros for which parliament suspended strict borrowing limits in the constitution.Scholz made clear that he was working on a budget for next year which would see Berlin again taking on new debt by an substantial amount. This will require parliament to suspend debt limits for the second time in two years.The finance minister said Berlin was determined to continue its financial support for firms, employees and the self-employed. Of course, all of this costs money, but doing nothing would be even more expensive, Scholz added.A government source told Reuters last month that Scholz was planning to take on an additional 120 billion euros of new debt next year to finance further aid measures and help companies survive the second wave of the pandemic.Scholz said a partial lockdown in November would cost growth in the fourth quarter but the governments latest aid package should cushion the impact. The new programme would probably cost more than the initially planned 10 billion euros, he added. ($1 = 0.8477 euros) (Reporting by Michael Nienaber; Editing by Maria Sheahan and Alison Williams)"}