{"text": "(Updates prices, adds Eurobonds)MOSCOW, Feb 12 The growing prospect of new European Union sanctions against Russia knocked the rouble back to 90 per euro for the first time in a week on Friday as the central bank kept interest rates unchanged and hinted at a tighter policy on the horizon.By 1521 GMT, the rouble was 0.1% weaker against the euro at 89.44, having earlier eased past the 90 mark for the first time since Feb. 5.Versus the dollar, the rouble dropped 0.5% to 73.97 , away from the three-week high of 73.5225 it touched on Thursday.The rouble did not react to the central bank holding its key rate at a record low of 4.25%, as forecast in a Reuters poll this week. The bank also dropped a reference to possible cuts in the future.Policy in Russia is hawkish because of sanctions risks - they see more sanctions coming, risks to the rouble, hence the hawkish comments today, said Timothy Ash at BlueBay Asset Management.The Kremlin on Friday said Russia should be ready for the possibility of harsh sanctions from the EU, which is trying to persuade Moscow to free jailed Kremlin critic Alexei Navalny.Foreign Minister Sergei Lavrov said Moscow was ready to sever ties with the European Union in return.Central Bank Governor Elvira Nabiullina said pro-inflationary factors meant the potential for easing had been exhausted, while analysts pointed to a weak rouble as one of the key risks for the central bank.Any new escalation in (the) sanctions area might trigger new capital outflows from Russia and increase pressures on the rouble rate, said Vladimir Tikhomirov, chief economist at BCS brokerage.Some Russian sovereign dollar bonds edged lower. The April 2042 and June 2047 Eurobond issues both shed more than 1 cent, their biggest daily falls in more than a week, with the former falling to a three-month low price of 131.75 cents in the dollar, data from Refinitiv and Tradeweb showed.Brent crude oil, a global benchmark for Russias main export, was up 0.6% at $61.52 a barrel, near its highest levels since early 2020.Russian stock indexes were falling.The dollar-denominated RTS index fell 0.6% to 1,453.3 points. The rouble-based MOEX Russian index slid 0.1% to 3,412.6 points. (Additional reporting by Tom Arnold in London; Editing by Mark Potter and Philippa Fletcher)"}