{"text": "(Adds detail, quote, comment)BRASILIA, Feb 12 Brazil moved a step closer on Friday to reviving pandemic emergency aid to the poor, as Senate President Rodrigo Pacheco said the chamber will prioritize approving the payments, which he expects to be granted over four months from March through June.Speaking alongside Economy Minister Paulo Guedes and lower house leader Arthur Lira, Pacheco said emergency aid and COVID-19 vaccines are the absolute priority, and will remain so until the pandemic is over.We expect there will be emergency aid in March, April, May and eventually a fourth month of June, Pacheco said, insisting that the package meet the governments fiscal rules.For that to happen, the aid must be part of a calamity clause in the so-called federative pact constitutional amendment bill, essentially mirroring last years War Budget that bypassed the conventional budget rules and meant the governments spending cap was not broken.Lira said Congress will get to work upon returning from next weeks Carnival holidays.Last years emergency measures to cushion the impact of the COVID-19 pandemic cost the government around 8% of gross domestic product. More than half of that, some 322 billion reais ($60 billion), consisted of direct transfers to the poor.That expired on Dec. 31. The severing of the cash lifeline to millions of people, a second wave of the virus and a slowing economy have forced the government to revive it.No figures were given on Friday, but Guedes said on Thursday the monthly payments may be around 250 reais ($46). That would mark a reduction from the initial 600 reais a month in July-September last year and then 300 reais in October-December.Guedes has insisted that extension of the payments must be met with cost-cutting measures elsewhere in the budget to signal that the government is serious about reducing the record deficit and debt it amassed last year.There is no room for adventures here, only a rational discussion that combines the short-term emergency with the long-term consolidation adjustment, analysts at ASA Investimentos said on Friday."}