{"text": "* Graphic: World FX rates in 2020 tmsnrt.rs/2egbfVh* Graphic: Trade-weighted sterling since Brexit vote tmsnrt.rs/2hwV9Hv (Updates prices)LONDON, Feb 12 The pound rose above $1.38 and was set to end the week up against the dollar and euro, as currency traders focused on data showing that the UK economy grew in the final quarter of 2020, even though its annual slump was the biggest in 300 years.Britains economy shrank 9.9% in 2020, which is the biggest annual decline in output in more than 300 years. But it avoided heading back towards a recession in the final quarter and looks set to recover in 2021.The pound has been strengthened since the start of the year by the UKs relative success in providing COVID-19 vaccinations, as well as relief that a last-minute Brexit deal was reached at the end of 2020.It gained to a three-year high of $1.3865 on Wednesday.On Friday, it initially fell but recovered during the session, and was up 0.2% at $1.3847 at 1604 GMT, on track for its fifth consecutive week of gains. Versus the euro it was up around 0.3% at 87.515 pence per euro.While the markets still making fresh highs, we expect the retracements to be bought into, said Joe Tuckey, FX analyst at Argentex. We saw a lot of tailwinds for sterling.Tuckey said that he expects cable to test the $1.40 level by the end of the first quarter, citing the vaccination progress as a key driver that could speed up the UKs exit from its current strict lockdown, which would boost the economy.Were racing ahead, so I think thatll really help - thatll trickle through in the data if were ahead of the game, perhaps going into Q2, he said.Some 13.5 million people in the UK had received their first dose of a vaccine as of Wednesday, the government said. Prime Minister Boris Johnson has said that he will announce details about the schedule for easing lockdown restrictions in the UK on Feb. 22.Elsewhere, Britain and the European Union reiterated on Thursday their commitment to resolving post-Brexit trade problems over the Northern Irish border.Britains exit from the EUs trading orbit in January has led to significant disruption to trade between Northern Ireland and the rest of the United Kingdom, straining relations as London and Brussels hold each other responsible for the problem.At present, there has been limited financial market reaction to the worsening relations but there are clear risks that it could escalate and become a financial markets issue  certainly an issue that could thwart the recent upward momentum for the pound, MUFG head of research Derek Halpenny wrote in a note to clients.We maintain our positive GBP view for now but will monitor closely how this consultation period proceeds over the coming days, he said."}