{"text": "(Adds details from conference call, CEO comments)Jan 12 Albertsons Cos Inc on Tuesday raised its annual projections for earnings and comparable sales, betting that consumers will cook more meals at home due to the COVID-19 pandemic and extended work-from-home orders.Shares of the U.S. grocer, which also beat Wall Street estimates for the third quarter, rose nearly 9% to touch a record of $18.25.A resurgence in coronavirus cases in the United States has led shoppers to stock their pantries and avoid dining out or ordering in.We see evidence that consumers will not revert to pre-COVID-19 food consumption patterns anytime soon, Chief Executive Officer Vivek Sankaran told analysts.Extended work-from-home policies and the possibility of flexible work weeks will continue to drive more breakfast and lunches at home, Sankaran said.Sales of breakfast items such as cereal, eggs and bacon, and fresh seafood and meat rose as people spending more time at home try new recipes. These shoppers stock up on shelf-stable products in one trip and come back frequently for fresh products, Sankaran said.We anticipate the consumption patterns were seeing now will continue well into 2021 and should continue to favor us.The company has invested heavily in technology to make shopping easier and minimize contact, by delivering groceries using robots when consumers shop online and collect in stores.Those investments helped Albertsons, which also owns Vons and Safeway supermarkets, report more than a three-fold rise in online sales and add over 6 million new households during the third quarter.The company forecast fiscal 2020 earnings to be between $3.05 and $3.15 per share, compared with its prior projection of $2.75 to $2.85. It also raised its comparable sales forecast to 16.5% from 15.5%.In the quarter ended Dec. 5, the company earned 66 cents per share on an adjusted basis, 24 cents above expectations, according to IBES data from Refinitiv. (Reporting by Nivedita Balu in Bengaluru; Editing by Maju Samuel)"}