{"text": "(Adds detail)VIENNA, March 12 COVID-19 vaccine doses are not being distributed evenly within the European Union according to member states populations, as was agreed by the bloc, Austrian Chancellor Sebastian Kurz said on Friday, calling for transparency and a solution.Kurz said he and other European leaders had shared their delivery figures this week to get a clearer picture and found that there were growing differences between member states.Deliveries are not happening in line with population. There are apparently also plans for this process to be exacerbated in the coming months and for the differences between member states to become ever greater, Kurz told a news conference that was called at an hours notice.Malta is on course to have three times more vaccine doses relative to its population by the end of June than Bulgaria, Kurz said, adding that some countries would have vaccinated their populations by May while others would need until late summer or autumn. Austria is roughly in the middle, he added.While EU leaders had agreed to the principle of even distribution per capita, Kurz alleged there were indications of deals being made with drug companies within the EUs vaccination steering board that undermined that.This bodys contracts are secret and I have not seen them. There are, however, indications that a so-called bazaar took place there where extra agreements between member states and pharma companies were reached, he said.EU officials, including Austrians, have used the term bazaar informally for months to describe the mechanism by which member states share excess doses among themselves. The deputy head of the steering board is also Austrian.Asked about Kurzs comments, a spokesman for the European Commission said: Member states may decide to ask less or more of a given vaccine and this is discussed between member states.He added: It is possible in this context, following the outcome of the discussions between member states, that a new distribution key is agreed upon with the company following agreement and discussions with all the member states.He noted that EU governments can opt out from contracts with specific companies. (Reporting by Francois Murphy, additional reporting by Francesco Guarascio in Brussels; Editing by Alison Williams and Emelia Sithole-Matarise)"}