{"text": "The S&P 500 was barely higher in Tuesday's volatile session as investors waited for earnings season and monitored developments in Washington after supporters of outgoing U.S. President Donald Trump stormed the Capitol.As Democrats moved to impeach Trump for inciting the deadly rampage last week, Trump on Tuesday denied wrongdoing saying that his public comments on the day of the attack were \"totally appropriate.\"  read more Also, the Washington Post reported that an FBI office in Virginia issued an internal warning the day before the Capitol invasion that extremists were planning to come to Washington and were talking of \"war.\"  read more Trump's denial and the FBI story, which contradicts suggestions that the administration did not expect an attack,  \"highlight the fact that there's still a lot of issues in this country and we have a lot of progress to make before we can really go forward,\" said Michael ORourke, chief market strategist at JonesTrading in Stamford, Connecticut.\"It just gives investors some pause,\" said O'Rourke.By 2:24 p.m. ET (1924 GMT), the Dow Jones Industrial Average (.DJI) rose 65.96 points, or 0.21%, to 31,074.65, the S&P 500 (.SPX) gained 2.25 points, or 0.06%, to 3,801.86 and the Nasdaq Composite (.IXIC) added 27.94 points, or 0.21%, to 13,064.37.The communications services sector (.SPLRCL) was the biggest percentage decliner of the S&P 500's 11 major industry indexes as investors were worried that big social media companies such as Twitter Inc  and Facebook Inc (FB.O) could come under increased regulatory scrutiny.\"A lot of what we've seen today and we've seen this week is big tech under pressure because of the obvious sizable influence and power they have,\" said O'Rourke as Facebook and Twitter banned Trump from their platforms after the Capitol attacks.\"It's expected the members of Congress will take it seriously now,\" he said.Five of the 11 major S&P sectors were trading higher with energy stocks (.SPNY) leading the gains with a 3% advance, as crude prices rose. The consumer discretionary sector (.SPLRCD) was the next biggest sector gainer with some of its biggest single stock boosts coming from carmakers.     Shares in U.S. automaker General Motors Co (GM.N) rose 6% to hit their highest in a decade after Chief Executive Officer Mary Barra outlined plans for its first electric commercial vans to be delivered to FedEx Corp  by year-end.  read more Also shares of Tesla Inc (TSLA.O) were up more than 5% as a regulatory filing showed the electric-car maker moved a step closer to its launch in India later this year by registering a company in the country.  read more The S&P financial sector (.SPSY) traded above its February peak for the first time, boosted by rate-sensitive banks (.SPXBK) where were up 1.7% as benchmark U.S. Treasury yields reached their highest levels since March. The small-cap Russell 2000 index (.RUT) gained about 1.4%.Hopes of a big boost to public spending and speedy roll-out of vaccines under a Democratic-led U.S. Congress have pushed Wall Street to record highs, with economically-sensitive small caps, financial, industrial and energy sectors benefiting.Investors were also waiting for the fourth-quarter earnings season to start Friday, with results from JPMorgan (JPM.N), Citigroup (C.N) and other big banks.Earnings for S&P 500 companies are now expected to show a decline of 9.5% year-over-year in the final quarter of 2020, marking a slight improvement from the  previous expectation for a 9.8% decline according to IBES data from Refinitiv.However earnings are expected to rebound in 2021, with a gain of 16.4% projected for the first quarter. Advancing issues outnumbered declining ones on the NYSE by a 1.65-to-1 ratio; on Nasdaq, a 1.89-to-1 ratio favored advancers.The S&P 500 posted 85 new 52-week highs and no new lows; the Nasdaq Composite recorded 283 new highs and four new lows.  "}