{"text": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)* Futures up: Dow 0.01%, S&P 0.37%, Nasdaq 1.18%Oct 12 Futures tracking the S&P 500 and Nasdaq 100 rose on Monday as investors remained hopeful about a deal in Washington over more fiscal stimulus, while Dow futures were subdued ahead of the start of the quarterly corporate earnings season.The Trump administration on Sunday called on Congress to pass a stripped-down coronavirus relief bill as negotiations on a broader package ran into resistance.Headline havoc will continue to drive volatility, but investors are all but certain that whoever wins the election, a new bold fiscal package is on the way, said Hussein Sayed, chief market strategist at FXTM.Bets of fresh federal aid propped up U.S. stocks last week even as economic data pointed to a slowing domestic recovery. Growing expectations of a Democratic victory in next months presidential election also helped Wall Streets main indexes end Friday at one-month highs.A recent Reuters/Ipsos poll showed Americans were steadily losing confidence in President Donald Trumps handling of the COVID-19 pandemic, with his net approval on the issue hitting a record low.With the Oct. 15 presidential debate officially canceled, Trump plans to travel to key battleground states this week as his doctor declared he was no longer a transmission risk for the novel coronavirus.Focus this week will also be on the third-quarter earnings scorecard for corporate America, with JPMorgan & Co and Citigroup slated to post results on Tuesday.Overall, analysts expect third-quarter earnings for S&P 500 companies to have fallen 21% from a year earlier, smaller than a 30.6% slump in the second quarter.At 6:53 a.m. ET, Dow e-minis were up 3 points, or 0.01%, and S&P 500 e-minis were up 12.75 points, or 0.37%.Nasdaq 100 e-minis surged up 138.5 points, or 1.18%, with heavyweight tech-focused stocks including Apple Inc , Netflix Inc and Amazon.com Inc up between 1.4% and 2.9%. (Reporting by Medha Singh in Bengaluru; Editing by Shounak Dasgupta)"}