{"text": "(For a Reuters live blog on U.S., UK and European stock markets, click LIVE/ or type LIVE/ in a news window.)* Banks up ahead of earnings report this week* Didi slips on China apps removal confirmation* Virgin Galactic falls on $500 mln share sale plan* Indexes: Dow +0.30%, S&P 500 +0.20%, Nasdaq -0.02% (Updates with afternoon trading)July 12 The S&P 500 hit a record high on Monday, lifted by Tesla and bank stocks as investors awaited the start of the second-quarter earnings season and a batch of economic data.The Nasdaq also hit an all-time high before receding into negative territory.Seven of the 11 major S&P sector indexes advanced; financials and real estate led the way.Tesla jumped 3.6%. Tesla CEO Elon Musk insisted in court on Monday he does not control Tesla, and said he did not enjoy being the electric vehicle companys chief executive as he took the stand to defend the companys 2016 acquisition of SolarCity.JPMorgan Chase added almost 2%, and the two shares contributed more to the S&P 500s gains than any other stocks.The S&P 500 banks index added 1.5% ahead of quarterly earnings reports this week from major banks, including Goldman Sachs Group and JPMorgan on Tuesday. Investors will closely watch quarterly reports for early clues on the how long the U.S. economic recovery may last, with June-quarter earnings per share for S&P 500 companies expected to rise 66%, according to IBES data from Refinitiv.The benchmark index has rallied 16% so far this year, with some investors questioning how long the rally may last and concerned about a potential downturn.Earnings season is going to be warmly greeted as an opportunity for existing biases to be confirmed, warned Mike Zigmont, head of trading and research at Harvest Volatility Management in New York. Even if forecasts are not as rosy as what the most bullish had hoped, its all going to get rationalized away.Focus this week will also be on a series of economic reports, including headline U.S. inflation data and retail sales. As well, Federal Reserve Chair Jerome Powell is due to appear before Congress on Wednesday and Thursday for views on inflation.Investors have been concerned about higher inflation and the spread of the Delta coronavirus variant in the past few sessions, with traders seesawing between economy linked-value stocks and tech-heavy growth names.The S&P 500 growth index on Monday rose 0.15%, lagging behind the S&P 500 value indexs 0.39% rise.In afternoon trade, the Dow Jones Industrial Average was up 0.3% at 34,974.06 points, while the S&P 500 gained 0.20% to 4,378.23.The Nasdaq Composite dropped -0.02% to 14,699.04.Didi Global Inc dropped 6% after it confirmed Chinas cyberspace administration notified app stores to remove the ride-hailing companys 25 apps and said the move could impact its revenue in the region.Virgin Galactic Holdings tumbled 15% as the space tourism company said it may sell up to $500 million worth of shares, a day after the company completed its first fully crewed test flight into space with billionaire founder Richard Branson on board.Advancing issues outnumbered declining ones on the NYSE by a 1.24-to-1 ratio; on Nasdaq, a 1.17-to-1 ratio favored decliners.The S&P 500 posted 63 new 52-week highs and no new lows; the Nasdaq Composite recorded 71 new highs and 31 new lows. (Additional reporting by Devik Jain and Shreyashi Sanyal in Bengaluru; Editing by Maju Samuel and Cynthia Osterman)"}