{"text": "The benchmark S&P 500 closed barely higher on Tuesday while shares in smaller companies soared as investors favored more economically sensitive market segments as they bet on a recovery in 2021.U.S. Treasury yields climbed and the small cap Russell 2000 (.RUT) outperformed throughout the session as did so-called cyclical sectors such as financials and energy, which are heavily dependent on a strong economy for growth.Traders were betting that incoming U.S. President Joe Biden, a Democrat, would usher in heftier fiscal stimulus and that a ramp up in distribution of coronavirus vaccines would boost the economy, according Michael James, managing director of equity trading at Wedbush Securities in Los Angeles. \"The financials and cyclicals have been the stars to start the year,\" said James.\"With the Biden's victory comes stimulus expectations\" Some investors said they were cautious ahead of earnings season while others monitored developments in Washington after supporters of outgoing U.S. President Donald Trump stormed the Capitol last week.As Democrats moved to impeach Trump for inciting the deadly rampage last week, Trump on Tuesday denied wrongdoing saying that his public comments on the day of the attack were \"totally appropriate.\"  read more Also, the Washington Post reported that an FBI office in Virginia issued an internal warning the day before the Capitol invasion that extremists were planning to come to Washington and were talking of \"war.\"  read more Trump's denial and the FBI story, which contradicts suggestions that the administration did not expect an attack,  \"highlight the fact that there's still a lot of issues in this country and we have a lot of progress to make before we can really go forward,\" said Michael ORourke, chief market strategist at JonesTrading in Stamford, Connecticut.Unofficially, the Dow Jones Industrial Average (.DJI) rose 60 points, or 0.19%, to 31,068.69, the S&P 500 (.SPX) gained 1.58 points, or 0.04%, to 3,801.19 and the Nasdaq Composite (.IXIC) added 36.00 points, or 0.28%, to 13,072.43.     Throughout the day the communications services sector (.SPLRCL) was the biggest percentage decliner among the S&P 500's 11 major industry indexes. O'Rourke said investors worried that big social media companies such as Twitter Inc  and Facebook Inc (FB.O) could come under increased regulatory scrutiny in Congress as the Capitol attacks highlighted their influence after they had to ban Trump from their platforms.But James at Wedbush argued that sectors that investors were rotating out of technology stocks to fund other purchases.\"The stars of 2020, the tech stocks have been languishing, as people have been using the tech stocks mostly as a source of funds and rotating into cyclicals, healthcare and financials,\" James said.  Of the major sectors, energy stocks (.SPNY) were leading gains throughout the session as crude prices rose. The consumer discretionary sector (.SPLRCD) saw some of its biggest single stock boosts coming from carmakers.     Shares in U.S. automaker General Motors Co (GM.N) hit their highest in a decade after Chief Executive Officer Mary Barra outlined plans for its first electric commercial vans to be delivered to FedEx Corp  by year-end.  read more Also shares of Tesla Inc (TSLA.O) jumped as investors bet on a big expansion for the electric-car maker after a regulatory filing showed it registered a company in India.  read more The S&P financial sector (.SPSY) traded above its February peak for the first time on Tuesday, boosted by rate-sensitive banks (.SPXBK) as benchmark U.S. Treasury yields reached their highest levels since March. Investors were also waiting for the fourth-quarter earnings season to start Friday, with results from JPMorgan (JPM.N), Citigroup (C.N) and other big banks."}