{"text": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)* Tesla up after announcing stock split* Moderna jumps after $1.5-bln U.S. contract* Benchmark S&P 500 about 0.9% below record high* Indexes up: Dow 0.83%, S&P 0.91%, Nasdaq 1.07% (Updates to open)Aug 12 Wall Streets main indexes jumped on Wednesday, with the S&P 500 crawling towards a record high in a broad rally led by tech stocks, although some investors were cautious following a stalemate over the new coronavirus relief bill.U.S. Treasury Secretary Steven Mnuchin said the White House and top Democrats in Congress may not be able to reach a deal on coronavirus aid, marking a fifth day without talks, as the stalemate blocked relief to tens of millions of Americans.The S&P 500 is about 0.9% below its intraday record high of 3,393.52. The benchmark index snapped seven days of gains on Tuesday after coming within 0.4% of its peak, powered by historic fiscal and monetary stimulus and signs of a nascent economic recovery.The S&P 500 got very close (to a record high), and there might be some technical resistance at that level, Randy Frederick, vice president of trading and derivatives for Charles Schwab in Austin, said about Tuesdays move.But it does look like this morning, theres enough upside momentum that markets could very well be past that when they open.The Nasdaq was the first of the three major indexes to bounce back to an all-time high in June. The Dow is about 6% below its February peak.With a better-than-feared second-quarter earnings season largely over, investors are preparing for the risk of a contested U.S. presidential election in the fall.Democratic candidate Joe Biden on Tuesday picked Senator Kamala Harris as his choice for vice president.At 9:43 a.m. ET, the Dow Jones Industrial Average was up 230.21 points, or 0.83%, at 27,917.12, the S&P 500 was up 30.25 points, or 0.91%, at 3,363.94. The Nasdaq Composite was up 115.54 points, or 1.07%, at 10,898.37.All major S&P sectors climbed, with financials, energy and communication services leading the charge.Latest data showed U.S. consumer prices increased more-than-expected in July, but high unemployment is likely to keep inflation under control, allowing the Federal Reserve to continue pumping money into the economy.Tesla Inc rose 5% as it announced a five-for-one stock split in an attempt to make its shares more accessible to employees and investors.Drugmaker Moderna Inc gained about 3.7% after entering a deal with the United States to produce 100 million doses of its potential COVID-19 vaccine for around $1.5 billion.Advancing issues outnumbered decliners by a 4.27-to-1 ratio on the NYSE and by a 3.00-to-1 ratio on the Nasdaq.The S&P index recorded eight new 52-week highs and no new low, while the Nasdaq recorded 32 new highs and nine new low."}