{"text": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)* Tesla up after announcing stock split* Moderna jumps after $1.5-bln U.S. contract* Benchmark S&P 500 about 0.5% below record high* Indexes up: Dow 0.99%, S&P 1.32%, Nasdaq 1.86% (Adds quote, details; updates prices)Aug 12 Wall Streets main indexes jumped on Wednesday, with the S&P 500 crawling towards a record high in a broad rally led by tech stocks, although some investors were cautious following a stalemate over the new coronavirus relief bill.Heavyweights Microsoft Corp, Amazon.com Inc and Apple Inc were some of the top boosts to the S&P 500.All major S&P sectors climbed, with technology, communication services and health leading percentage gains.The S&P 500 is about 0.5% below its intraday record high of 3,393.52. The benchmark index slipped after seven straight days of gains on Tuesday after coming within 0.4% of its peak, powered by historic fiscal and monetary stimulus and signs of a nascent economic recovery.Were seeing buyers show up very quickly, any chance they get when the market declines. To me, thats a very bullish sign, said Adam Sarhan, chief executive of 50 Park Investments in New York.The Nasdaq was the first of the three major indexes to bounce back to an all-time high in June. The Dow is about 6% below its February peak.With a better-than-feared second-quarter earnings season largely over, investors are preparing for the risk of a contested U.S. presidential election in the fall.Democratic candidate Joe Biden on Tuesday picked Senator Kamala Harris as his choice for vice president.Meanwhile, U.S. Treasury Secretary Steven Mnuchin said the White House and top Democrats in Congress may not be able to reach a deal on coronavirus aid, marking a fifth day without talks, as the stalemate blocked relief to tens of millions of Americans.We know a (stimulus) deal is going to get done. The question is what does that deal look like. Once we start getting certainty over that, thats when these stocks take off, Sarhan added.At 10:55 a.m. ET, the Dow Jones Industrial Average was up 273.31 points, or 0.99%, at 27,960.22, the S&P 500 was up 44.11 points, or 1.32%, at 3,377.80. The Nasdaq Composite was up 200.03 points, or 1.86%, at 10,982.86.Tesla Inc jumped 8.4%, providing the biggest lift to Nasdaq, as it announced a five-for-one stock split in an attempt to make its shares more accessible to employees and investors.Latest data showed U.S. consumer prices increased more-than-expected in July, but high unemployment is likely to keep inflation under control, allowing the Federal Reserve to continue pumping money into the economy.Advancing issues outnumbered decliners by a 2.52-to-1 ratio on the NYSE and by a 1.79-to-1 ratio on the Nasdaq.The S&P index recorded 20 new 52-week highs and no new low, while the Nasdaq recorded 63 new highs and 14 new lows. (Reporting by Medha Singh and Ambar Warrick in Bengaluru; Editing by Arun Koyyur and Uttaresh.V)"}