{"text": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)* Tesla up after announcing stock split* Moderna jumps after $1.5 bln U.S. contract* Futures up: Dow 1.05%, S&P 0.8%, Nasdaq 0.8% (Adds quote, details; updates prices)Aug 12 Wall Street was headed for a higher open on Wednesday with the S&P 500 crawling toward a record high as a sharp fall in U.S. oil stockpiles drove up prices, while investors remained on edge due to a stalemate over a new coronavirus relief bill.Republicans and Democrats have been unable to arrive at a fifth aid bill with differences centering around issues such as unemployment benefits and aid to state and local governments.The S&P 500 and Dow snapped seven days of gains on Tuesday after the benchmark index came within 0.15% of its closing record high, powered by historic fiscal and monetary stimulus and signs of a nascent economic recovery.The S&P 500 got very close (to a record high), and there might be some technical resistance at that level, said Randy Frederick, vice president of trading and derivatives for Charles Schwab in Austin, about Tuesdays move.But it does look like this morning, theres enough upside momentum that markets could very well be past that when they open.The benchmark index is set to open about 1% below its record high of 3,393.52 points. The Nasdaq was the first of the three major indexes to bounce back to an all-time high in June. The Dow is about 6% below its February peak.With a better-than-feared second-quarter earnings season largely over, investors are preparing for the risk of a contested U.S. presidential election in the fall.Democratic candidate Joe Biden on Tuesday picked Senator Kamala Harris as his choice for vice president.At 8:38 a.m. ET, S&P 500 e-minis were up 26.75 points, or 0.8%, to 3,356.75, below the record high of 3,379 notched on Tuesday.Dow e-minis were up 291 points, or 1.05%, and Nasdaq 100 e-minis were up 87.75 points, or 0.81%.Latest data showed U.S. Labor Departments Consumer Price Index rose 0.6% in July, similar to the prior months gain and better than expectations of 0.3% rise.Energy stocks Exxon Mobil Corp gained 1.6% and Occidental Petroleum Corp added 3% premarket.Tesla Inc rose 6.8% as it announced a five-for-one stock split in an attempt to make its shares more accessible to employees and investors.Drugmaker Moderna Inc surged about 11.2% after entering a deal with the United States to produce 100 million doses of its potential COVID-19 vaccine for around $1.5 billion. (Reporting by Medha Singh and Ambar Warrick in Bengaluru; Editing by Arun Koyyur)"}