{"text": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)* Apple jumps ahead of Tuesday event* Twitter rises after DB upgrades to buy* White House calls for limited COVID-19 relief bill* Indexes up: Dow 0.64%, S&P 1.03%, Nasdaq 1.57% (Adds comment, details; Updates prices)Oct 12 Wall Streets main indexes rose for a fourth straight session on Monday, helped by a tech boost and on optimism that Washington would reach a deal over more fiscal support, with investors also gearing up for the third-quarter corporate earnings season.Apple Inc was a major support for the three main stock indexes with a 3.6% gain ahead of a special event on Tuesday, which most analysts believe will be used to unveil the new iPhone with 5G capabilities.Amazon.com Inc climbed 3.5% ahead of its annual Prime Day shopping event on Oct. 13 and 14.The Trump administration on Sunday called on Congress to pass a stripped-down coronavirus relief bill as negotiations on a broader package ran into resistance.The widening lead for the Democrats lessens the likelihood of a disputed election result and increases the odds of a bigger stimulus package and infrastructure spending in 2021, said Marc Chaikin, founder of Philadelphia-based investment research firm Chaikin Analytics.A recent Reuters/Ipsos poll showed Americans were steadily losing confidence in President Donald Trumps handling of the COVID-19 pandemic, with his net approval on the issue hitting a record low.Growing expectations of a Democratic win in next months presidential election have also helped Wall Streets main indexes climb to one-month highs as a victory for Democratic nominee Joe Biden could ease the trade war with China and resulting tariff pressures on the U.S. economy.With the Oct. 15 presidential debate officially canceled, Trump plans to travel to key battleground states this week as his doctor declared he was no longer a transmission risk for the novel coronavirus.Results from big U.S. banks will be in focus this week, with JPMorgan & Co and Citigroup set to report on Tuesday. Bank shares gained 0.7%.Overall, analysts expect third-quarter earnings for S&P 500 companies to have fallen 20.7% from a year earlier, smaller than a 30.6% slump in the second quarter.At 10:49 a.m. ET, the Dow Jones Industrial Average was up 181.99 points, or 0.64%, at 28,768.89, the S&P 500 was up 35.66 points, or 1.03%, at 3,512.79, and the Nasdaq Composite was up 181.30 points, or 1.57%, at 11,761.24.Technology and consumer discretionary stocks climbed the most among major S&P sectors. The energy index was the weak spot, as oil prices dropped on easing supply worries.Twitter Inc gained 5.2% after Deutsche Bank upgraded the social media firms shares to buy on expectations of continued growth in 2021.Ford Motor Co jumped 7.8% following brokerage Benchmarks upgrade.Advancing issues outnumbered decliners for a 1.44-to-1 ratio on the NYSE and a 1.53-to-1 ratio on the Nasdaq.The S&P index recorded 61 new 52-week highs and no new low, while the Nasdaq recorded 138 new highs and seven new lows. (Reporting by Medha Singh and Shivani Kumaresan in Bengaluru; Editing by Saumyadeb Chakrabarty and Shounak Dasgupta)"}