{"text": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)* Apple jumps ahead of special event on Tuesday* Twitter rises after DB upgrades to buy* White house calls for limited COVID-19 relief bill* Futures up: Dow 0.25%, S&P 0.72%, Nasdaq 1.86% (Adds comment, details; updates prices)Oct 12 The tech-heavy Nasdaq was set to lead Wall Streets main indexes higher on Monday as optimism about a deal in Washington over more fiscal stimulus lifted sentiment ahead of the start of quarterly corporate earnings.Apple Inc gained 3.3% in premarket trading ahead of a special event on Tuesday, which most analysts believe will be used to unveil the new iPhone with 5G capabilities.The Trump administration on Sunday called on Congress to pass a stripped-down coronavirus relief bill as negotiations on a broader package ran into resistance.(President Donald) Trump is falling behind in opinion polls and seems desperate for a deal, so either some agreement will be hammered out soon or the Democrats could win a decisive victory at the ballot box and ultimately deliver an even greater stimulus package, said Marios Hadjikyriacos, investment analyst at online broker XM in Cyprus.A recent Reuters/Ipsos poll showed Americans were steadily losing confidence in Trumps handling of the COVID-19 pandemic, with his net approval on the issue hitting a record low.Growing expectations of a Democratic victory in next months presidential election as well as bets of fresh federal aid have sent Wall Streets main indexes to one-month highs.With the Oct. 15 presidential debate officially canceled, Trump plans to travel to key battleground states this week as his doctor declared he was no longer a transmission risk for the novel coronavirus.Results from big U.S. banks will be in focus this week, with JPMorgan & Co and Citigroup set to post results on Tuesday. Bank shares were flat to slightly higher in premarket trading.Goldman Sachs Group Inc, which reports results on Wednesday, is considering whether to scale back financial targets set earlier this year due the coronavirus pandemics impact, analysts and sources inside the bank said.The banks management is not expected to move the goalposts on Wednesday, but may change targets in January, a year after they were set, sources said.Overall, analysts expect third-quarter earnings for S&P 500 companies to have fallen 21% from a year earlier, smaller than a 30.6% slump in the second quarter.At 8:48 a.m. ET, Dow e-minis were up 71 points, or 0.25%, S&P 500 e-minis were up 25 points, or 0.72% and Nasdaq 100 e-minis were up 218.5 points, or 1.86%.Twitter Inc gained 4.2% after Deutsche Bank upgraded the social media firms shares to buy on expectations of continued growth in 2021.Other tech companies such as Netflix Inc, Amazon.com Inc and Microsoft Corp rose between 1.7% and 2%. (Reporting by Medha Singh and Shivani Kumaresan in Bengaluru; Editing by Shounak Dasgupta and Saumyadeb Chakrabarty)"}