{"text": "The S&P 500 and Nasdaq set record closing highs on Friday as investors bought energy, financial and materials shares and sold big tech stocks in anticipation of new fiscal aid from Washington to help the U.S. economy recover. The major indices traded in a tight range during the week in which investors rotated out of growth-oriented stocks that have dominated an almost year-long rally and bought cyclical and under-priced value stocks.The S&P energy (.SPNY), financials (.SPSY) and materials (.SPLRCM) sectors rose on expectations they will benefit from a reopened economy, while heavyweights Apple Inc (AAPL.O), Tesla Inc (TSLA.O) and Microsoft Corp (MSFT.O) were lower most of the session. All three closed higher in a late market surge.Value and cyclicals outperform in a rising interest rate, higher-growth environment, which the U.S. economy is on the cusp of entering, said Thomas Hayes, chairman and managing member of hedge fund Great Hill Capital LLC in New York.\"We're under-estimating the lag effect of all the money in the system as more and more vaccinations are delivered and as more of the country reopens\" from business shutdowns, he said.\"We are continuing this rotation that would be consistent with the new business cycle, and as (bond) yields go up, value and cyclicals will lead,\" Hayes said. The Cboe Volatility Index (.VIX), Wall Street's so-called fear gauge, closed below 20 for first time since February 2020.A sharp drop in new COVID-19 cases and hospitalizations in recent weeks have helped drive markets to new highs, though a near-term pullback could occur from the new coronavirus variants and potential snags in vaccine distributions.The latest data showed U.S. consumer sentiment unexpectedly fell in early February as households were still worried about the economy despite expectations for additional stimulus.  read more A Reuters poll showed the U.S. economy is expected to reach pre-COVID-19 levels within a year as the proposed $1.9 trillion fiscal bill helps boost economic activity, but employment will likely take more than a year to fully recover.  read more U.S. President Joe Biden turned to a bipartisan group of local officials for support on his $1.9 trillion coronavirus relief plan to help millions of unemployed workers and for schools to reopen.  read more The Lipper data late on Thursday showed U.S.-based stock funds attracted $22.9 billion in the week to Wednesday, the largest weekly inflow since March 2008.  read more U.S. stock markets will be closed on Monday for the Presidents Day holiday.The S&P 500 set hit an all-time peak on Friday, while the Nasdaq and Dow did earlier in the weekThe Dow Jones Industrial Average (.DJI) rose 27.7 points, or 0.09%, to 31,458.4, the S&P 500 (.SPX) gained 18.45 points, or 0.47%, to 3,934.83 and the Nasdaq Composite (.IXIC) added 69.70 points, or 0.5%, to 14,095.47.Volume on U.S. exchanges was 13.27 billion shares. The small-cap index (.RUT) rose for the fifth week out of six full weeks this year. PayPal Holdings Inc (PYPL.O) rose 4.7% after several brokerages raised their price targets following the payments company's investor day call a day earlier.Walt Disney Co (DIS.N) reported a surprise quarterly profit. However, its shares fell 1.7% from a record high after a more than 13% run up to its results over the last two weeks.  read more Dating app operator Bumble Inc (BMBL.O) jumped 7.3%, a day after a stellar debut sent its shares up more than 75%. Chief Executive Officer Whitney Wolfe Herd's stake in the women-centric dating app operator was worth nearly $2 billion.Advancing issues outnumbered declining ones on the NYSE by a 1.35-to-1 ratio; on Nasdaq, a 1.22-to-1 ratio favored advancers.The S&P 500 posted 52 new 52-week highs and no new lows; the Nasdaq Composite recorded 261 new highs and 17 new lows.  "}