{"text": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)* Tesla up after announcing stock split* Moderna jumps after $1.5-bln U.S. contract* Benchmark S&P 500 about 0.4% below record high* Indexes up: Dow 0.94%, S&P 1.41%, Nasdaq 2.16% (Updates to early afternoon)Aug 12 Wall Streets main indexes jumped on Wednesday, with the S&P 500 crawling towards a record high in a broad rally led by tech stocks, with investors shrugging off a stalemate over the new coronavirus relief bill.Heavyweights Microsoft Corp, Amazon.com Inc and Apple Inc were the top boosts to the S&P 500.Ten of the 11 major S&P sectors climbed, with technology , communication services and utilities leading percentage gains.The S&P 500 is about 0.4% below its intraday record high of 3,393.52. The benchmark index slipped after seven straight days of gains on Tuesday.Were seeing buyers show up very quickly, any chance they get when the market declines. To me, thats a very bullish sign, said Adam Sarhan, chief executive of 50 Park Investments in New York.The Nasdaq was the first of the three major indexes to bounce back to an all-time high in June, powered by historic fiscal and monetary stimulus and signs of a nascent economic recovery. The Dow is about 6% below its February peak.With a better-than-feared second-quarter earnings season largely over, investors are preparing for the risk of a contested U.S. presidential election in the fall.Democratic candidate Joe Biden on Tuesday picked Senator Kamala Harris as his choice for vice president.Meanwhile, a breakdown in bipartisan talks over the next federal aid bill to help tens of millions of Americans suffering because of the COVID-19 pandemic entered a fifth day, with neither side ready to resume negotiations.While the negotiations are probably going to continue back and forth, in an election year environment, its very likely that this package gets across the finish line, Matt Stucky, portfolio manager, equities, at Northwestern Mutual Wealth Management Co in Milwaukee, Wisconsin.At 12:47 p.m. ET, the Dow Jones Industrial Average was up 260.54 points, or 0.94%, at 27,947.45, the S&P 500 was up 46.84 points, or 1.41%, at 3,380.53. The Nasdaq Composite was up 232.79 points, or 2.16%, at 11,015.61.Tesla Inc jumped 10.2%, providing the biggest lift to Nasdaq, as it announced a five-for-one stock split in an attempt to make its shares more accessible to employees and investors.Latest data showed U.S. consumer prices increased more-than-expected in July, but high unemployment is likely to keep inflation under control, allowing the Federal Reserve to continue pumping money into the economy.Advancing issues outnumbered decliners by a 1.84-to-1 ratio on the NYSE and by a 1.36-to-1 ratio on the Nasdaq.The S&P index recorded 30 new 52-week highs and no new low, while the Nasdaq recorded 75 new highs and 18 new lows. (Reporting by Medha Singh and Ambar Warrick in Bengaluru; Editing by Arun Koyyur and Uttaresh.V)"}