{"text": "The benchmark S&P 500 closed barely higher on Tuesday while shares in smaller companies soared to record highs as investors favored more economically sensitive market segments as they bet on a recovery in 2021.    U.S. Treasury yields climbed and the small cap Russell 2000 (.RUT)finished up 1.8% at a record high, after outperforming throughout the session, along with the cyclical financial and energy sectors, which are heavily dependent on a strong economy for growth.Traders were betting that incoming U.S. President Joe Biden, a Democrat, would usher in heftier fiscal stimulus and that a ramp up in distribution of coronavirus vaccines would boost the economy, according Michael James, managing director of equity trading at Wedbush Securities in Los Angeles.     \"The financials and cyclicals have been the stars to start the year,\" said James. \"With the Biden's victory comes stimulus expectations.\"     But some investors said they were cautious ahead of earnings season and due to developments in Washington after supporters of outgoing U.S. President Donald Trump stormed the Capitol last week.As Democrats moved to impeach Trump for inciting the deadly rampage last week, Trump on Tuesday denied wrongdoing saying that his public comments on the day of the attack were \"totally appropriate.\"  read more Also, the Washington Post reported that an FBI office in Virginia issued an internal warning the day before the Capitol invasion that extremists were planning to come to Washington and were talking of \"war.\"  read more These reports \"highlight the fact that there's still a lot of issues in this country and we have a lot of progress to make before we can really go forward,\" said Michael ORourke, chief market strategist at JonesTrading in Stamford, Connecticut.The Dow Jones Industrial Average (.DJI) rose 60 points, or 0.19%, to 31,068.69, the S&P 500 (.SPX) gained 1.58 points, or 0.04%, to 3,801.19 and the Nasdaq Composite (.IXIC) added 36.00 points, or 0.28%, to 13,072.43.The day the communications services sector (.SPLRCL), ending down 1.5%, was the biggest percentage decliner among the S&P 500's 11 major industry indexes. Investors worried that social media companies such as Twitter Inc  and Facebook Inc (FB.O) could come under increased regulatory scrutiny, according to O'Rourke. The Capitol attacks highlighted their influence after they had to ban Trump from their platforms as a result, he said.But James at Wedbush said investors were simply rotating their investments.\"The stars of 2020, the tech stocks have been languishing, as people have been using the tech stocks mostly as a source of funds and rotating into cyclicals, healthcare and financials,\" James said.  The financials-heavy Russell 2000 which marked its third closing record in five sessions, has risen 7.7% so far this year compared with the S&P's 1.2% gain. Of the major sectors, energy stocks (.SPNY) lead gainers with a 3.5% advance as crude prices rose. The consumer discretionary sector (.SPLRCD), closing up 1.3%, showed some of its biggest boosts from carmakers.     Shares in U.S. automaker General Motors Co (GM.N) closed up 6% after hitting their highest level in a decade after outlining plans for electric commercial vans to be delivered to FedEx Corp  by year-end.  read more Also shares of Tesla Inc (TSLA.O) closed up 4.7% as investors bet on a big expansion for the electric-car maker after a it registered a company in India.  read more The S&P financial sector (.SPSY), closed up 1% and boasted a record closing high after trading above its February peak for the first time on Tuesday.It was boosted by rate-sensitive banks (.SPXBK) as benchmark U.S. Treasury yields reached their highest levels since March during the session. Investors were also waiting for the fourth-quarter earnings season to start Friday, with results from JPMorgan (JPM.N), Citigroup (C.N) and other big banks.Advancing issues outnumbered declining ones on the NYSE by a 2.06-to-1 ratio; on Nasdaq, a 2.26-to-1 ratio favored advancers.The S&P 500 posted 87 new 52-week highs and no new lows; the Nasdaq Composite recorded 307 new highs and four new lows. On U.S. exchanges, 15.2 billion shares changed hands compared with the 12.14 billion average for the last 20 sessions. "}