{"text": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)* Apple jumps ahead of Tuesday event* Twitter rises after Deutsche Bank upgrades to buy* White House calls for limited COVID-19 relief bill* Indexes: Dow +1.13%, S&P 500 +2.01%, Nasdaq +3.16 (Updates to afternoon trading)Oct 12 Wall Street surged on Monday, fueled by expectations of a coronavirus relief package and by a rally in Amazon, Apple and other technology stocks ahead quarterly earnings season.Apple Inc jumped nearly 7% ahead of an event on Tuesday, when it is expected to unveil its newest iPhones.Amazon rallied over 6% ahead of its annual Prime Day shopping event on Oct. 13 and 14. Microsoft climbed 3.5%, helping lift the S&P 500 information technology index by 3.3%.The S&P 500 was about 1% below its record closing high from Sept. 2, nearly recovering from most of a 9% pullback last month.Optimistic sentiment dominated after the Trump administration on Sunday called on Congress to pass a stripped-down coronavirus relief bill as negotiations on a broader package ran into resistance.It looks like the administration wants a deal done before the election, said Brian Battle, director of trading at Performance Trust Capital Partners in Chicago. Now its up to the Republican Senate to figure out how big the number is going to be.Many investors view Democratic candidate Joe Biden as more likely to raise taxes, and for months have seen a second term for Trump, who favors deregulation, as better for the overall stock market.However, with growing expectations of a Democratic win in next months presidential election, investors are increasingly pointing to potential benefits of a Biden presidency, such as greater infrastructure spending and less global trade uncertainty.Betting odds aggregated by RealClearPolitics suggest bettors see a 67% chance Biden will win and a 33% chance for Trump, the greatest gap so far between the two candidates.With the Oct. 15 presidential debate officially canceled, Trump plans to travel to key battleground states this week as his doctor declared he was no longer a transmission risk for the novel coronavirus.Results from big U.S. banks will be in focus this week, with JPMorgan & Co and Citigroup set to report on Tuesday. The S&P 500 banks index gained 0.9%.Overall, analysts expect third-quarter earnings for S&P 500 companies to fall 20.7% from a year earlier, smaller than a 30.6% slump in the second quarter.The Dow Jones Industrial Average was up 1.13% at 28,910.08 points, while the S&P 500 gained 2.01% to 3,546.95.The Nasdaq Composite added 3.16% at 11,945.77.The S&P 500 energy index fell 0.4% as oil prices dropped on easing supply worries.Twitter Inc jumped 5.7% after Deutsche Bank upgraded the social media companys shares to buy on expectations of continued growth in 2021.Advancing issues outnumbered declining ones on the NYSE by a 1.48-to-1 ratio; on Nasdaq, a 1.34-to-1 ratio favored advancers.The S&P 500 posted 70 new 52-week highs and no new lows; the Nasdaq Composite recorded 158 new highs and 11 new lows. (Additional reporting by Medha Singh and Shivani Kumaresan in Bengaluru Editing by Marguerita Choy)"}