{"text": "(For a Reuters live blog on U.S., UK and European stock markets, click LIVE/ or type LIVE/ in a news window)* Airlines, cruise line operators drop as virus cases spiral* Moderna climbs as it closes in on vaccine data release* Jobless claims drop to seven-month low (Updates with session close)Nov 12 Wall Street ended sharply lower on Thursday as U.S. coronavirus infections surged and investors weighed the timeline for the mass rollout of an effective vaccine.New York became the latest state to introduce stricter social distancing rules on Wednesday, as new infections in the country surged above 100,000 for an eighth consecutive day.The blue-chip Dow was pulled down by industrial and financial companies sensitive to economic growth, with Boeing Co and Goldman Sachs each down more than 2%.Airlines and cruise operators, among the hardest hit by the coronavirus pandemic, also fell.Even after Thursdays drop, the S&P 500 has gained almost 2% this week, buoyed by positive vaccine trial data that increased expectations of a quick economic recovery. Stocks have also benefited from expectations that a divided Congress will keep President-elect Joe Biden from enacting tax hikes that would hurt corporate profits.The reality is that we dont know what the new normal is going to look like, even when we do recover from the coronavirus, and that is still a ways away, said Tom Martin, senior portfolio manager at Globalt Investments in Atlanta.Its the classic between the market discounting something that is nine to 12 months out, and then undiscounting it because it has not happened yet.New data showed U.S. jobless claims fell to a seven-month low last week, but the pace of job recovery slowed as fiscal stimulus waned and further improvement could be limited by a raging pandemic.Unofficially, the Dow Jones Industrial Average fell 358.48 points, or 1.22%, to 29,039.15, the S&P 500 lost 38.94 points, or 1.09%, to 3,533.72 and the Nasdaq Composite dropped 84.98 points, or 0.72%, to 11,701.45.Among the biggest boosts to the Nasdaq was a surge in the U.S.-listed shares of Chinese e-commerce company Pinduoduo Inc after it reported strong quarterly revenue.Rival JD.com Incs shares also climbed.The S&P 500 energy index and financials both fell sharply.Moderna Inc rallied after the drugmaker said it had enough data for a first interim analysis of the late-stage trial of its experimental COVID-19 vaccine. It did not say when it plans to release the data.Walt Disney Co and network gear maker Cisco Systems Inc each slipped ahead of their quarterly results due after the close. (Additional reporting by Medha Singh in Bengaluru; Editing by Sriraj Kalluvila, Shounak Dasgupta and Tom Brown)"}