{"text": "(For a Reuters live blog on U.S., UK and European stock markets, click LIVE/ or type LIVE/ in a news window)* Airlines, cruise line operators slip as virus cases spiral* Moderna rises as it closes in on vaccine data release* Jobless claims drop to seven-month low* Dow down 0.6%, S&P falls 0.5%, Nasdaq up marginally (Updates to market open)Nov 12 The S&P 500 and the Dow fell on Thursday as U.S. coronavirus infections surged and investors weighed the timeline of the mass roll-out of an effective vaccine.New York became the latest state to introduce social distancing restrictions on Wednesday, as new infections in the United States surged above 100,000 for an eighth consecutive day.The blue-chip Dow dropped 0.6% as industrial and financial companies sensitive to economic growth fell, with Boeing Co and Goldman Sachs down about 2% each.Airlines and cruise operators, among the hardest hit by the outbreak, also fell. The S&P 1500 airlines index declined 1%, while Royal Caribbean Cruises Ltd fell 3.5% and Carnival Corp tumbled 5.7%.With several of the early November catalysts out of the way, the market does appear to be expressing concern with some of the near-term COVID trends, said Yousef Abbasi, global market strategist at StoneX Group Inc in New York.Wall Streets three main indexes have climbed between 8% and 11% in less than two weeks on prospects of measured industry regulation from a potentially divided Congress, as well as an encouraging update from a late-stage coronavirus vaccine trial.Meanwhile, a Labor Department report showed U.S. jobless claims fell to a seven-month low last week, but the pace of job recovery slowed as fiscal stimulus waned.At 09:48 a.m. ET, the Dow Jones Industrial Average fell 189.92 points, or 0.65% to 29,207.71, the S&P 500 lost 17.01 points or 0.48% to 3,555.65 and the Nasdaq Composite gained 2.96 points or 0.03% to 11,789.39.Amazon.com Inc, Netflix Inc and Microsoft Corp edged higher in early trading, adding to gains from the previous session.These companies, which have logged strong demand in the work-from-home shift, fell sharply earlier this week as investors rotated to value stocks on hopes of a faster economic rebound following positive COVID-19 vaccine data.Among the biggest boosts to the Nasdaq was a 20% surge in U.S.-listed shares of Chinese e-commerce company Pinduoduo Inc after it reported better-than-expected quarterly revenue.Rival JD.coms shares also climbed 5%.Financials and energy posted the sharpest percentage losses among major S&P sectors, while technology and communication services were the only two making gains.Moderna Inc added 5% after the drugmaker said it had enough data for a first interim analysis of the late-stage trial of its experimental COVID-19 vaccine. It did not say when it plans to release the data.Walt Disney Co and networking gear maker Cisco Systems Inc slipped ahead of their quarterly results due after markets close.Declining issues outnumbered advancers by a 2.6-to-1 ratio on the NYSE; on Nasdaq, a 0.6-to-1 ratio favored decliners.The S&P 500 posted one new 52-week high and no new low, while the Nasdaq Composite recorded 41 new highs and five new lows. (Reporting by Medha Singh in Bengaluru; Editing by Shounak Dasgupta and Sriraj Kalluvila)"}