{"text": "(For a Reuters live blog on U.S., UK and European stock markets, click LIVE/ or type LIVE/ in a news window.)* Tesla rises as Canaccord Genuity upgrades stock* Alibaba shrugs off $2.75 bln antitrust fine, shares jump* Big bank earnings to kick off from Wednesday (Adds closing prices, comment, details;)April 12 The S&P 500 and Dow Jones industrial average ended lower on Monday, with investors waiting for cues from the upcoming corporate earnings season and a key inflation report later this week.Stocks sold off after strong gains in recent days that were driven by a pullback in the benchmark 10-year bond yield from 14-month highs.With U.S. consumer price data for March due to be published Tuesday, this could drive Treasury yields higher. Big Wall Street names are due to kick off earnings season on Wednesday, giving new catalysts to buy or sell off stocks in a record-high market.Investors are now going to pay close attention to earnings season, because this is the time where they are expecting guidance from companies, where valuations start to matter again, said Ed Moya, senior market analyst at OANDA.Theres this nervousness that were going to see that we cant just buy everything, as that was the trade for the last few months.Federal Reserve Chair Jerome Powell said on Sunday the U.S. economy was at an inflection point with expectations that growth will pick up speed in the months ahead, but he warned that a hasty reopening could lead to a continued increase in coronavirus cases.S&P 500 earnings are expected to have jumped 25% in the quarter from a year ago, according to Refinitiv IBES data. That would be the biggest quarterly gain since 2018, when tax cuts under former President Donald Trump boosted profit growth.Banks are among the first to report earnings for the opening quarter of 2021, with Goldman Sachs, JPMorgan and Wells Fargo due on Wednesday.The financials index and consumer discretionary sector both hit record highs on Monday, reflecting confidence in both areas as the U.S. economy reopens.The optimism is improving now that these banks are going to return to normal, with buybacks and dividends, and because of the outlook for Treasury yields, they are going to have a better outlook going forward, said OANDAs Moya.Among the 11 major S&P 500 sector indexes, communication services and energy shares were the steepest decliners.Unofficially, the Dow Jones Industrial Average fell 0.16% to end at 33,745.86 points, while the S&P 500 lost 0.02% to 4,128.1. The Nasdaq Composite dropped 0.36% to 13,850.00.Tesla Inc rose after Canaccord Genuity upgraded the electric-car makers shares to buy, saying the company could become the brand in energy storage.U.S. shares of Alibaba Group Holding Ltd jumped after the ecommerce company said it expected no material impact from Chinas antitrust crackdown that pushes it to overhaul how it deals with merchants.Shares of Nuance Communications Inc surged after Microsoft Corp said it would buy the artificial intelligence and speech technology company in a $19.7 billion deal."}