{"text": "Wall Street's main indexes inched higher on Tuesday ahead of the start of corporate America's reporting season that could signal a rebound in earnings, while General Motors' shares jumped on launching an electric delivery vehicle business.The U.S. automaker's shares (GM.N) added 6.4% to hit highest in a decade after Chief Executive Officer Mary Barra outlined plans for its first BrightDrop electric commercial vans to be delivered to FedEx  by year-end.  read more High-flying shares of Tesla Inc (TSLA.O) also rose 6.4% as a regulatory filing showed the electric-car maker moved a step closer to its launch in India later this year by registering a company in the country.  read more Five of the 11 major S&P sectors were trading higher with energy stocks (.SPNY) gaining about 3%, tracking higher crude prices. Rate-sensitive banks (.SPXBK) climbed 2.2% as benchmark U.S. Treasury yields reached their highest levels since March. The small-cap Russell 2000 index (.RUT) gained about 1.4%.Hopes of a big boost to public spending and speedy roll-out of vaccines under a Democratic-led U.S. Congress have pushed Wall Street to record highs, with growth-linked financial, industrial and energy stocks lifting the market higher.\"On an average, markets look 3 to 6 months into the future about what environment we are likely to be dealing with, allowing it to push back on events in Washington last week and the surge in the COVID-19 cases,\" said Matt Stucky, portfolio manager, equities, at Northwestern Mutual Wealth Management Company in Milwaukee.\"There is a lot of bright news on the horizon on vaccine roll-outs and a likelihood of more fiscal stimulus in Washington.\"Focus will now shift to fourth-quarter earnings starting Friday, with results from JPMorgan (JPM.N), Citigroup (C.N) and other big banks launching the reporting season.Earnings for S&P 500 companies are expected to have dropped 9.8% year-over-year in the final quarter of 2020, according to IBES data from Refinitiv, but are expected to rebound in 2021, with a gain of 16.4% projected for the first quarter. At 11:26 a.m. ET the Dow Jones Industrial Average (.DJI) rose 44.54 points, or 0.14%, to 31,053.23, the S&P 500 (.SPX) gained 4.93 points, or 0.13%, to 3,804.54, and the Nasdaq Composite (.IXIC) gained 46.66 points, or 0.36%, to 13,083.09.Democrats will give President Donald Trump one last chance on Tuesday to leave office days before his term expires or face an unprecedented second impeachment over his supporters' storming of the U.S. Capitol on Jan. 6.  read more Ride-hailing company Uber Technologies Inc (UBER.N) jumped 7% to touch a record high after it expanded its electric vehicle and hybrid ride option to over 1,400 new cities in North America.  read more Advancing issues outnumbered decliners for a 1.8-to-1 ratio on the NYSE and a 2-to-1 ratio on the Nasdaq.The S&P 500 posted 81 new 52-week highs and no new low, while the Nasdaq recorded 353 new highs and 12 new lows."}