{"text": "(For a Reuters live blog on U.S., UK and European stock markets, click LIVE/ or type LIVE/ in a news window.)* Airlines, cruise line operators slip as virus cases spiral* Moderna rises as it closes in on vaccine data release* Jobless claims dip in latest week* Futures: Dow down 0.8%, S&P slip 0.4%, Nasdaq up 0.2% (Adds comment, details; updates prices)Nov 12 Futures tracking the S&P 500 and Dow fell on Thursday as U.S. coronavirus infections surged and investors weighed the timeline of the roll-out of an effective vaccine, while some heavyweight technology stocks headed higher for the second straight day.New York became the latest state to introduce social distancing restrictions on Wednesday, as new coronavirus cases in the United States surged above 100,000 for an eighth consecutive day.Futures for the blue-chip Dow slipped 0.8% as industrial and financial companies sensitive to economic growth fell, with Boeing Co and JPMorgan Chase & Co down about 2% each.American Airlines Group Inc, United Airlines Holdings Inc and Royal Caribbean Cruises Ltd, among the hardest hit by the outbreak, fell between 1.7% and 4.2%.With several of the early November catalysts out of the way, the market does appear to be expressing concern with some of the near-term COVID trends, said Yousef Abbasi, global market strategist at StoneX Group Inc in New York.Wall Streets three main indexes have climbed between 8% and 11% in less than two weeks on prospects of measured industry regulation from a potentially divided Congress, as well as an encouraging update from a late-stage coronavirus vaccine trial.Meanwhile, a Labor Department report showed U.S. jobless claims fell to a seven-month low last week, but the pace of job recovery slowed as fiscal stimulus waned.Amazon.com Inc, Netflix Inc and Microsoft Corp edged higher in premarket trading, set to add to gains from the previous session.These companies, which have logged strong demand in the work-from-home environment, fell sharply earlier this week as investors rotated to value stocks on hopes of a faster economic rebound following positive vaccine data.At 08:32 a.m. ET, Dow E-minis were down 0.84% and S&P 500 E-minis were down 0.43%. Nasdaq 100 E-minis were up 0.16%.Moderna Inc added 3.4% after the drugmaker said it had enough data for a first interim analysis of the late-stage trial of its experimental COVID-19 vaccine. It did not say when it plans to release the data.After markets close, Walt Disney Co and networking gear maker Cisco Systems Inc are slated to report results. (Reporting by Medha Singh in Bengaluru; Editing by Shounak Dasgupta)"}